{"Reviews": [{"Author": "Dani C.", "ReviewID": "pkUhRg8T5VJlurVB4sPW-A", "Overall": "5.0", "Content": "I was a little confused as to how a pizza place could get so many rave reviews, but after going, I, too, love DeSanos. The pizza is so delicious, the location and parking are great, and the owner and employees are very nice. Can't wait to go back!This pizza might be my favorite in LA, and my boyfriend and fellow pizza-lover from Boston agrees. The crust is perfectly fluffy and chewy, with great sauce and cheese and the best pepperoni I've ever had. We got 10 inch pizzas but will get the larger size next time we come. Pretty good value too considering how delicious the pizzas are! We also got gelato, which was pretty tasty as well.The interior is very cool--a big open room with benches, so plenty of space for larger groups of people. You order in the front by a more private smaller room, and then the pizza ovens are at the back of the big room. Also, there's a parking lot! A big one!The owner walked around and seemed genuinely interested in how everyone was enjoying their meals. The girl up front taking orders explained all the pizzas and gelatos to us nicely, and the pizzas came promptly after we ordered them.Once they get their liquor license, DeSanos will be the perfect place for parties and group gatherings with delicious pizza, ample seating and parking, and a friendly owner and staff with fast service. So great!", "Date": "2014-07-13", "Author_Location": "Los Angeles, CA"}, {"Author": "Jesse S.", "ReviewID": "gUyqBcvZA8vMClSccGa84w", "Overall": "5.0", "Content": "DeSano's is a gem. They serve authentic Naples style pizzas straight from their wood fire ovens to your table.  The exterior may have you wondering what the inside may be like, but once inside the ample communal space is a great place to gather with friends and family. My favorite is the Margharita pizza.", "Date": "2014-06-30", "Author_Location": "Los Angeles, CA"}, {"Author": "andrew c.", "ReviewID": "m7y8dtNTrXzo0XyFKQN5MQ", "Overall": "5.0", "Content": "a bit expensive IMHO, but for my money, one of the most satisfying pizzas in LA. maybe the most (except for mozza, which is another thing entirely). I can skip over any of the usual \"best-of-breed\" neapolitan places, which have in common the chewy, blistered thing that DeSano has, but also are so frequently over-wet. I'm so sick of that. If Neapolitan pizza is supposed to be that, then the VPN bureaucrats have to rethink. Yeah, this is not a crispy thing, and it shows just why it doesn't need to be. The spinach salad was pretty good, too, although there's a lot more nuance and elegance in the salads that 800 degrees makes. Can't wait to go back and eat some more.", "Date": "2014-06-28", "Author_Location": "Corona del Mar, CA"}, {"Author": "Josie J.", "ReviewID": "dSuHc4oz_P2nrwyhP9KD0Q", "Overall": "5.0", "Content": "This place is great!  The pizza is delicious, every ingredient is imported from Italy, including the flour, including the chef!  Love the veggie options.  Space is spacious so bring as many people as you want.  This place is still not crowded (but that will not last as word gets out about it, and when they get their alcohol license...) so I have never had to wait for a table, or the food.  Owners are friendly and service is great.  I have been here about 4-5 times and every time has been lovely.  Can't wait for the beer and wine to come, it will take this place over the top.", "Date": "2014-07-14", "Author_Location": "Los Angeles, CA"}, {"Author": "Karen M.", "ReviewID": "SS8wPHVtP7YO0vE9eXnfLA", "Overall": "3.0", "Content": "So let me start pointing out the good; the parking lot is spacious, the wear house style dining are is spacious, clean. You can see the cooks and the girl who took my order was friendly. It's very confusing when you enter they redirected me to the front where you have to go to order and pay first then you sit and wait for your order. The person who brought me our pizza was awkwardly too friendly, his looks and comments made me really uncomfortable.Food...the 10' pizza I ordered had barely any sauce and it was bland no flavor at all. My crust was burnt too. I had high hopes for this place but was disappointed", "Date": "2014-06-23", "Author_Location": "Los Angeles, CA"}, {"Author": "Gisla S.", "ReviewID": "b6P8jHqNHR8ddUyo5puEew", "Overall": "4.0", "Content": "I'm from Chicago so I tend to be a bit of a pizza snob but DeSano's is good!  All of the ingredients are fresh and the pizza is made on the spot. I've tried the pizza, gelato and antipasto boards and I loved all of them.I also love the ambiance!  Everything is out and in the open so you can see them create their pizza masterpieces! Old school, simple and authentic Italian.  The owner Marino is awesome and his entire staff is super friendly and helpful!  Go check it out, you won't be disappointed!", "Date": "2014-06-09", "Author_Location": "Los Angeles, CA"}, {"Author": "A. C.", "ReviewID": "frt0PlVSz4DswFYBN0wZeA", "Overall": "5.0", "Content": "I swear, that when I took the first bite, the clouds parted to reveal a glorious light, and I could hear cherubs singing to harp music. I think I saw a dove fly away. DeSano is that good. Both classy and humble, refined yet rustic, this gem of a spot possesses all the components to quickly becoming a local favorite. In a renovated warehouse on Santa Monica Blvd., the interior is both modern and nostalgic with plenty of seats for both large and small groups. The music alternates between opera and Italian crooners to Dean Martin, setting the tone for a truly classy experience. The huge lot outside guarantees that you'll find parking. Now for the pizza. We ordered their namesake DeSano pizza (sausage and pepperoni). Amazing. Maybe the best I've ever had. Really. It's like they took the best sausage, the best pepperoni, and the best cheese they could find on the planet and put it on the best dough that they could possibly create. The dough was perfect...a thin Neapolitan base that faded out into a cushiony, chewy crust. Now if they served beers, that would just be too much for me too handle. In love.", "Date": "2014-05-26", "Author_Location": "Los Angeles, CA"}, {"Author": "Larry O.", "ReviewID": "K3Lnqgzi_FOIRY5sH29T0Q", "Overall": "5.0", "Content": "This pizza is good! I've never been a fan of Neapolitan Pizza but thiis place changed that. We had a large group so that allowed us to order a variety of pizzas. All of them were good! The dough, sauce, cheese and toppings were all top notch and tasty. The ingredients blend together perfectly. Six slices in and I still wanted more. Broke my \"no carb\" diet but it was well worth it. They have gelato which wasn't too shabby and they're supposed to be getting a liquor license soon. Good thing because these pies would go perfect with some beer or wine.Definitely recommend it. Look forward to my next visit!", "Date": "2014-06-01", "Author_Location": "Los Angeles, CA"}, {"Author": "Andrew H.", "ReviewID": "tJFio99ZkgUbnlKuPqupmg", "Overall": "4.0", "Content": "One of the best pizzas I've had in LA.We ordered three pizzas for our party of six. We went to the large back room, furnished with long wood tables. Big stacks of firewood sit under large open pizza ovens.  The food came to our table within five minutes.The pizzas were served on paper towels. Every ingredient was excellent and tasted fresh: basil, tomatoes, garlic, cheese, sausages.  The pizzas were hot and bubbly and not very large.There is no liquor license yet. One of the owners came by to chat. He was extremely friendly and seemed to care about our opinions. Another good feature of this place is a large parking lot next door. An advantage in this tightly packed and overpopulated neighborhood.Though the owners are both from Italy, their original restaurant is in Tennessee.Good for families, for first dates, for large groups, DeSano is clean, well-lighted, friendly and serves quality food with top notch ingredients.", "Date": "2014-05-17", "Author_Location": "Van Nuys, CA"}, {"Author": "Katie B.", "ReviewID": "wLgLMIUXelx9nymYd-xjzQ", "Overall": "4.0", "Content": "I like my pizza like I like my milkshakes. Thick. So I was a little wary of this \"Pizza Napoletana\" style joint since I associate that region of Italy with thin crust, but boy was I wrong.I was passing by this large pizza warehouse (love this style of spacious communal tables and an open \"kitchen\" area where you can see your pizzas being made in the large ovens that flank the back wall - they even have a private room if you want to arrange a special exclusive shindig with friends/family), and just couldn't resist the urge to pop in for a slice or two. Sadly, no slices here, you have to choose between two different sizes of whole pizzas. The menu is fairly easy to deconstruct: signature pies, calzones, salads, and desserts. I went with the Diavalo because it has everything I enjoy (spicy salame, pepperoni, peppers, and Buffalo mozzarella) and it was a home run. The 10\", $15 disc of pure awesomeness made my night complete. The toppings were perfect, the cheese hot and boiling, and that crust! That crust won me over. It's got just the right amount of chewy texture and crispness, with zero flimsiness. Zero, I tell you.Bonus points for a dedicated (free) parking lot and gelato!", "Date": "2014-05-07", "Author_Location": "Los Angeles, CA"}, {"Author": "Lara L.", "ReviewID": "IA3iD0JKir4QVyEL7N5FEA", "Overall": "5.0", "Content": "Flavors and ingredients are super good so I give it 5 stars. Although the crispy crust is so difficult In LA, I still give it 5. I can't justify 4 becuz it's pretty darn good. Gave joe's pizza  in Santa Monica a 5 too cuz of the crispy crust but has simple ingredients but great sauce. Anyways, de sano uses great fresh ingredients and mozzarella is fresh and dough is chewy and really good. The more ingredients u have, the less crispy the pizza will be. But stillGood. Just eat w fork and knife! Canolis r delish too. Great for families and large parties cuz it's like a huge wherehouse space...", "Date": "2014-06-05", "Author_Location": "Los Angeles, CA"}, {"Author": "C. A.", "ReviewID": "U0-Q7E8Xl5foaPv4QRtEnw", "Overall": "5.0", "Content": "Word is starting to get around town about this place ... and rightfully so. I have no need to eat pizza anywhere else outside of Italy. The ingrediants are amazing and oh so fresh. The atmosphere is no frills all about the food which is the way it should be. wood fire ovens exposed ... check  Pleasant attentive staff ... check.. amazingly delightful food ... check   WOW !!  So we had the Bianca pizza , spinach salad   and a canolli .  All equally yummy !  The only thing I thought strange was this place wasnt packed but as word spreads that will change. parking lot is huuuuge  ... a big plus in this town", "Date": "2014-06-24", "Author_Location": "Los Angeles, CA"}, {"Author": "jim k.", "ReviewID": "x7-U6eDW2jJvK_DXS2zTHQ", "Overall": "5.0", "Content": "my review is based on the space and the staff/owner, haven't had a chance yet to try to amazing looking/smelling food!!  i forgot the owner's name but he is a gem of a man.  i admit, i'm a pizza snob (vitto's!) but this place is on my radar with their huge space both inside and out.  i suggested he have a bbq over a weekend in the parking lot w DJ (Italian of course)ciao", "Date": "2014-06-25", "Author_Location": "Park La Brea, CA"}, {"Author": "Yelpito R.", "ReviewID": "UmPr46t6jZwgJOtcsuOpWg", "Overall": "5.0", "Content": "Well I'll start by saying that this place rocks in all concepts regarding taste.  We ordered 4 different pizzas, so we got a taste of a good variety of em pizzas and all of them were great from first bite to the last.    I can't tell you which one was which they were so good we were just eating all of them as if there were no tomorrow. Even my pizza affiliate friend had to agree that this was some fantastic fabulous pie. My other comrade only eats generic Costco pizza, pizza Hut, etc crap, and he was blown away to a different dimension, and couldn't stop thanking me for this fenomenal encounter that he never knew existed.     Would I recommend this place? Hell yeah the ingredients are all A+.", "Date": "2014-05-31", "Author_Location": "Mammoth Lakes, CA"}, {"Author": "Erin W.", "ReviewID": "3-7bgH7XqKbt1_nSZCV8bw", "Overall": "5.0", "Content": "I've tried the pizza and the gelato and they are both great! 5 stars because the restaurant is huge so there is always a table, AND there's also a huge parking lot so there is always parking! Definitely one of the best places to eat in the area.", "Date": "2014-06-18", "Author_Location": "Koreatown, Los Angeles, CA"}, {"Author": "Phil T.", "ReviewID": "eEAjeUPn_CoqwT4oyqzrBA", "Overall": "3.0", "Content": "I found out about this place from a write up I saw in the LA Times. I'm a sucker for good pizza joints so I made a point to go out of my way to come here, as East Hollywoods not exactly around the corner from my house. In all honesty it wasnt worth the trip. Sure, the pizza was fine but I've had better from other places that also claim to have authentic neapolitan style pizza. I ordered a small Margherita and it had 1 basil leaf smack dab in the middle of the pie. It was more of a basic cheese pizza then a margherita. Wasnt impressive. Coming in it was really confusing. they have a large warehouse style door that opens into the dining area. It took us about 5 mins to figure out where to go to place our order.  I really wanted to like this place but it didnt meet my expectations, which were set pretty high by the LA Times.", "Date": "2014-04-13", "Author_Location": "Orange, CA"}, {"Author": "Warda R.", "ReviewID": "glV4VLU2n5EwkelTdzYCyA", "Overall": "5.0", "Content": "This is my favorite pizza joint... Just like Napoli !!!! proprio come napoli!!!!! la capriccio pizza molto yummmmmmm  taste the cannoli is the best!!! gustare i cannoli è il migliore! grazie grazie grazie!!!!!!!!!! grazie", "Date": "2014-06-23", "Author_Location": "Los Angeles, CA"}, {"Author": "Desiree Y.", "ReviewID": "NRATBHAs19WIBlPOuftVTg", "Overall": "4.0", "Content": "Second time here with a friend and the service and quality proved to be the same; that is, excellent. My friend made a good observation that there was no coffee available to purchase. Sometimes an espresso goes well with a cannoli, ya know?", "Date": "2014-06-12", "Author_Location": "San Clemente, CA"}, {"Author": "Deborah C.", "ReviewID": "W6v0CkBab9cvp2MHOQV5dQ", "Overall": "5.0", "Content": "The best ever pizza. I have eaten pizza in Italy and this is as good. The cheese they use is imported from Italy. All ingredients are fresh and the dough is made daily. The Cannoli is outstanding.", "Date": "2014-06-22", "Author_Location": "Diamond Bar, CA"}, {"Author": "Kim T.", "ReviewID": "1uNRP1gq0iYTb_dIld5jkQ", "Overall": "5.0", "Content": "This place is awesome, huge parking lot with hassle free parking. Large sitting area, great for big parties. Two big TV's to watch the local sport teams. Oven and pizza prep area in the open for all to see. Delicious pizza, it's fresh and made to order. Spinach salad was okay tasting, fresh ingredients but lacking some flavor. Condiments is self-serve with paper towel rolls and utensils at the table. Gelato is available, did not try any this visit. Not busy at all but it is Cinco de Mayo. Highly recommend it to all looking for a casual pizza spot. My new go to pizza spot in LA!!", "Date": "2014-05-05", "Author_Location": "Buena Park, CA"}, {"Author": "Daniela A.", "ReviewID": "duZtSneuLm3iQMj-1nQMIQ", "Overall": "4.0", "Content": "Love the simplicity of the pizza. I think that many people try to give angelinos good pizza but that's relative since LA doesn't have a pizza culture and all attempts to make good pizza in LA are rips on NY, Chicago, or Italian pizza. Desano is pretty damn good because of the simplicity and the flavors it pulls from their ingredients. Simple sweet tomato sauce, mozzarella di bufala, basil, good quality meats. Every bite allows you to taste the individual ingredients. The crust in Desano pies is good it's a bit soft on the inside and crispy on the outside. The salads are simple, fresh, and well dressed. Service is friendly and the person who greeted us upon entry was very helpful. Parking situation is awesome since there is tonnes of it.", "Date": "2014-04-24", "Author_Location": "Los Angeles, CA"}, {"Author": "Amanda R.", "ReviewID": "Wl0t2FcI8AiVZ7iq4Utesg", "Overall": "5.0", "Content": "I have to add another 5 star rating to this wonderful addition to the area. We stopped in here for lunch last week after wanting to try it for a while and WOW we were so glad we did! First off, the parking lot is huge and convenient. We we're HANGRY at this point in the day and hoping to get food to our faces stat. The nice girl took our order of a large \"Desano\" pizza and a spinach salad, and we made our way to the back seating area.  Long wood tables, a breeze blowing through an open door, large pizza ovens cooking up wonders before our eyes.  Both the BF and I thought it looked like a fun place to take a team after a game, what with the long tables/benches and 2 flat screen TVs up top with sports running (were totally NOT intrusive though), combined with the general casual family atmosphere.We sipped on our sodas and in a short time a delicious pizza was being brought to our table on a large pizza pan.  We grabbed a few of the paper towels off the roll on the table and some plastic cutlery and dug in.  Both the pizza and the salad were phenomenal, and once we discovered the toppings bar complete with parmesan, red pepper flakes, chopped garlic, oil and balsamic vinegar it just brought our meal to a whole new level.Bottom line: everyone here was SUPER nice, the place has a really relaxed vibe (read: not tightly spaced, pretentious or overly hipstery), and the food was excellent.  We will be back!!", "Date": "2014-04-24", "Author_Location": "Los Angeles, CA"}, {"Author": "Francesca L.", "ReviewID": "AqohZb7J-AFlsbh5fgZmGA", "Overall": "3.0", "Content": "Pizza isn't something I crave very often, but when I heard about a new place in the neighborhood, I wanted to try it out. It's a huge industrial looking building with lots of brick and an open kitchen. All of the staff were friendly, not in a \"we love pizza\" way, but more in a \"so thankful I have a job\" way. Husband and I shared the lasagne pizza which are several small meatballs, dollops of ricotta, mozzarella, and a few pieces of fresh basil. It was ok, but not super flavorful. Something was off about the crust for me too. Although I was stuffed, I decided to get a cannoli anyway because I hadn't had one since I went to Boston in 2008. First bite was so so, then I couldn't finish and we had to walk a mile+ home. Kinda picked at it the next day, but of course these things cannot be saved since the shell gets soggy. Overall it seems nice enough, I could go again if someone suggested it.", "Date": "2014-04-02", "Author_Location": "Los Angeles, CA"}, {"Author": "David D.", "ReviewID": "YXkTMESp43U-Rdp-d0FNBg", "Overall": "3.0", "Content": "Me thinks there is a bit of irrational exuberance for this Pizza place by other Yelpers.I will remind my fellow Yelpers that 5 stars on Yelp means, \"As Good As it Gets.\"The PIzza was \"okay\" tasting, it's not one that I would shy away away from if I found myself back at DeSano, but it's not one that leaves me craving or wanting to return soon.   The Spinach salad is excellent and we highly recommend it.  The menu is highly structured and we tried to vary it when ordering, and were turned away.  Example:  We wanted meatballs on our Margarita PIzza and were told \"no.\"  You can only order the extra items that are approved for each pizza and their computer ordering system will not allow an entry of Meatballs on a Margarita PIzza.  Much more options and flexibility on toppings is needed.  Some tasty chicken would help too.  You stand up to order here, pay,  and sit down and they yell out your number and deliver the food to your indoor picnic type table.  Romance quotient is near 0--don't even think of trying it.  Great place for children--the ones next to us were racing their matchbox cars across the long tables and through a slice of pizza and onto the floor.   One kid was trying to \"off road\" his car across the end crust until mom revoked his license.  This place could easily win the Guinness World Book of Records for the largest pizza place in the world--its gigantic with 4 independent ovens baking at one time. I am sure a pizza baking reality or game show will be filmed here in the future.    It may also be the restaurant with the largest parking lot in Los Angeles.  You could park a fleet of RV's in it.  BUT the absolute best part of this restaurant I had to photograph--it's the rolls of paper towels on each table like you see in a western barbecue joint. Much better idea than napkins.   If I could just get every restaurant to adopt paper towels on each table--the world would be one step closer to a perfect place.  Even better would be a table paper towel roll holder, so that you are not handling the entire roll just passed to you by the previous patron.The Bill:  Small Pizza, Salad & Bottle of Water:  $22.00---*DeSano contacted me after I wrote this review to let me know that in response, they changed their policy and will now allow customers to add Meatballs to their Margarita Pizza.", "Date": "2014-03-30", "Author_Location": "Los Angeles, CA"}, {"Author": "J M.", "ReviewID": "7mrTtyaVWTQtmWFkSayyrA", "Overall": "2.0", "Content": "First time trying this place out. Overall the place is spacious, plenty of tables. As for the food, it was okay. I know my pizzas I wasn't too happy... First off I don't like when grease drips off my pizza it's kind of gross.... I don't pay for food just to end up with a stomach ache after. The desserts looked yummy. Ended up getting a scoop of salted caramel gelato which I must way was pretty good. Drink selection is very limited basically u get coke from Mexico, diet coke, bottled water and lemonade all which come in a bottle of course. Even more they have tiny little plastic cups that you get for cocktail parties minus the ice... Had high hopes for this place.", "Date": "2014-06-11", "Author_Location": "Los Angeles, CA"}, {"Author": "Steph C.", "ReviewID": "TlMoWjVe8y-SDWCs1ndAmw", "Overall": "5.0", "Content": "DeSano Pizza Bakery is a Neapolitan pizza joint in a repurposed warehouse in East Hollywood. You order at a register, then seat yourself in a giant room with picnic-style wooden tables, with TVs mounted on one end, and a diligent crew of pizza chefs at the other, slinging dough and firing up pies in cute brick-colored ovens. The ingredients are fresh and flavorful, and the pizzas are charred up to order. Prices are great (between $10 and $15 for a 10-in. pie, $15 and $22 for an 18-in.), and if you'll believe it, there is a free parking lot that is never full. If DeSano were in Silver Lake, it would be mobbed every night, and people would pay the $5 for valet. As it is now, the crowd is more neighborhood families than hipsters and yuppies.  I've gone twice in the last month, and I expect to make DeSano a regular stop for casual meals. The place is comfortable, cute, and spacious enough that it doesn't seem to get crowded. The service is notably friendly for this kind of restaurant, and on our first visit, a very Italian man who must be some kind of manager or owner went around the tables chatting with customers.The food is serious, on par with the offerings at much fancier wood-fired pizza restaurants around L.A. The menu consists mostly of pizzas, with some calzones if you prefer your goodies on the inside. The pizza is fantastic, with a thin, charred crust that's  alternately chewy and crispy, the kind of crust you don't want to leave on your plate. There are red and white pies, and so far, I've stuck to red. The base red pie uses a hearty San Marzano tomato sauce, some lovely buffalo mozzarella, and a touch of garlic. The Margherita D.O.P. is a must for purists, a quality pie that uses great, simple ingredients. The Capricciosa is another classic pizza, topped with mushroom, artichoke, and prosciutto. The artichokes are particularly nice. The titular DeSano is a good one for meat lover's, with nothing but sausage and pepperoni on the red pie base. I'd also recommend the Lasagna pizza. It is not, (un?)forunately, layers and layers of pizza. It is, though, an interesting pie topped with meatball, pecorino romano, and soft splotches of ricotta in addition to the mozzarella. My favorite pizza at DeSano, though, is the San Gennaro. It's topped with caramelized onions, zesty Italian sausage, and chunks of peppadew, these hot, flavorful marinated pickled peppers that get juicy and blistered in the oven.If you want more than just pizza and calzones, DeSano offers a couple salads and, sometimes, an antipasto platter. (This is a complete accounting of the menu, by the way--DeSano is really all about the pizza.) Both salads are great, and they cost $6.50 and $7 for sizable portions. The spinach comes with mozzarella, onions, cranberries, mushroom, and artichoke, and it's very good except for the raw mushroom. The caprese is delicious, with spinach, mozzarella, cherry tomato, and basil. There is probably less mozz than there should be, not for the price, maybe, but for the leaf-to-cheese ratio. Still, tasty. Both salads come with balsamic vinegar. For dessert, you can get cannoli, biscotti, or gelato, of which I have only tried the gelato. It's really good. I'm not sure where it comes from or why it's so great, but it is top notch stuff, flavorful with an ideal creamy texture. I like the classic pistachio and hazelnut, but if you want a light coda to a big pizza meal, the tart, refreshing lemon sorbet might be more your speed.DeSano is working on their liquor license, so unfortunately, you can't have beef of wine with your pizza just yet. When that changes, it sounds like there might be no corkage, in which case this place will be a perfect restaurant for those leisurely, affordable, loosely planned dinners with friends.", "Date": "2014-05-22", "Author_Location": "Los Angeles, CA"}, {"Author": "Chuck H.", "ReviewID": "pnAwztVVc4S6x3f7rPz8Sg", "Overall": "4.0", "Content": "All the right ingrediants for greatness, literally, you can see where the food comes from in boxes, cans and sacks from Napoli. The atmosphere is great, they really try -- the best Italian music -- and I applaud them for even having Italian music. Traditional musica di Napoli would be even better. Plus there is Italian cable TV!The buffalo cheese is the best I've had in this country. So what's lacking, why not all the stars? In short, the personnel. They try hard, but are not artists like the chef/owner of Mother Dough, down the street.  The owner/manager here arrived after we did, so in fairness, I would bet the pizza improved later this Monday evening.I read the other reviews before writing this one, and they're all accurate -- but I especially identified with one who said, \"Why do they dump these beautiful pizzas on a cold aluminum tray?\" They do not arrive piping hot.  The CENTRAL question though:  Is this a Pizza vera di Napoli? No, it isn't. Why?  First the ovens weren't hot enough, no rip roaring fires, so the pizzas get a bit hard and dry before coming out. One oven was nearly okay, the other not, so two pizza margharitas came out to our party very different one bubbly and fairly moist, the other card board-liike. Both too stiff.  The Marinara pizza was very good and moist, but lacking oil.This is almost pizza di Napoli...but balances on the danger of losing its identity through chefs who aren't trained enough and tend to make what they grew up with...American pizza (but with better ingredients). The only way to assure good pizza makers is for the owner/manager to make all the pizzas, or somehow really.train the cooks, send them to Naples, so they know how its supposed to taste.Many great pizzerias have ultimately failed here, such as Anitica Pizzeria, a million dollar restaurant out of Naples, started great...the workers though, aside from a handful, reverted to making dry tasty, but plain pizzas. In short, all the money, ingredients and fine ovens can't make a great pizza...only men and women trained well and extensively in the ART of pizza making. I wish I could like this place more. I've lived for 30 years practically next door. I will try again and report back. Fire up the ovens hotter, and train the cooks to make a sizzling, burnt yet boiling wet with smoking blisters!!Meanwhile, Mother Dough is the best Naples-influenced pizza around, this is second best, and much better atmosphere and music. I really want them to train their cooks! Please!!", "Date": "2014-04-08", "Author_Location": "Los Angeles, CA"}, {"Author": "Carissa K.", "ReviewID": "Ay_f841lkETBFHfBtYXYpA", "Overall": "5.0", "Content": "They imported their ovens from Italy, as well as most of their ingredients. And they are originally form Texas. What???? Oh, they also have a huge free parking lot. In LA that is very rare. I have been here twice. My boyfriend took his sister once. All I can say is DELICIOUS! Their pizzas and salads are great. And their cannoli are quite good. I have left each feeling completely satisfied and almost wishing I could eat more. The 2 times I have been here were actually back-to-back days.I wish I still lived in Hollywood so I could come here more often. I have heard that they are going to add more salads and sandwiches eventually. Yum! Try it, you'll like it!", "Date": "2014-03-19", "Author_Location": "Los Angeles, CA"}, {"Author": "Lisa T.", "ReviewID": "4mF5wt-1yFR8rrQ-1FcXlg", "Overall": "5.0", "Content": "I am one of those people who think that New Haven pizza is the best the United States has to offer. If you have been searching for real pizza on the east side - Woohoo!  Desano's has it. The dough perfect and the red sauce on the Margharita pizza - complex and sublime. Add to the mix antipasti that has  bressola included, calzone, canoli and dare I say - GELATO, and you have the perfect pizza joint.  Parking included.", "Date": "2014-07-05", "Author_Location": "Los Angeles, CA"}, {"Author": "David K.", "ReviewID": "kO0qJPs68WVJPXNwA1rvuA", "Overall": "5.0", "Content": "Wife and I just returned from Italy, where we fell in love with the excellent pizzas. The wood fired ovens, which are common there, turn out a much better, very different kind of pie compared to what we usually get in the States, and the fresh ingredients really make a difference too. So we set out to find comparable pizzas in the L.A. area.DeSano does an excellent job, and of the 3 places we've tried in L.A. since coming home, I think their pizzas are about as close as you get get to a quality, \"real\" Italian pizza. The crust is full of interesting variations in texture and done-ness, and the toppings are high quality. Service is friendly and helpful, prices are quite reasonable.As others have mentioned, the concept of this restaurant is fairly unusual. I'm not quite sure what demographic they're shooting for, or why the place is so huge, but I like it. You enter a small room at the front, place your order and pay, then take a seat in the cavernous back room, gazing at the 4 massive pizza ovens blazing away in the back of the room. After a few minutes your pizzas arrive, piping hot.It's a fun place with great staff, easy and convenient and classy in it's way, but not at all fancy. Will definitely be back. I saw a notice that they are applying for a beer & wine license.", "Date": "2014-06-15", "Author_Location": "Burbank, CA"}, {"Author": "Tim P.", "ReviewID": "AzvfZ3CFoUixUx0_dGnglA", "Overall": "5.0", "Content": "Outstanding pizza and friendly service.  Plenty of parking.  Wish they had fountain soda instead of bottles but that's not a deal breaker.Easily top 3 pizza places in the area.", "Date": "2014-05-04", "Author_Location": "Los Angeles, CA"}, {"Author": "Mary O.", "ReviewID": "Pyy3ASyF7drZCGSVihB5Jg", "Overall": "3.0", "Content": "Simple margarita pizza was excellent flavor-wise, especially topped with extra crushed garlic and a pinch of Italian sea salt. Wish their crust had a little more bite to it. Was a little too soggy for my liking, and that was after I had asked for it well done. =/Will give it another shot to determine true worthiness.", "Date": "2014-03-01", "Author_Location": "Los Angeles, CA"}, {"Author": "David D.", "ReviewID": "wu9yMx0k5WSpabfdYItDzg", "Overall": "5.0", "Content": "As pleased as I was after leaving Pizzeria Mozza, and a fraction of the wait.", "Date": "2014-05-16", "Author_Location": "Los Angeles, CA"}, {"Author": "Allison S.", "ReviewID": "MSxb5SjmOEXwhaQCEqFK_w", "Overall": "5.0", "Content": "I am from Chicago and have been living in California for over 20 years. I have been to the top rated pizza joints numerous times. Until Desanos opened, I would have graded the pizza in LA as a B-B+ for taste and a F for parking and/or ambience. This pizza place is a definite must go. Worth driving from out of the area. You can even watch them prepare your pizza. Not dirt cheap but worth every penny!Taste-A+Parking-A+Friendliness - A-Wait for food after ordering- A+Ambience-B (cool industrial decor) with over sized family style dining picnic tablesMenu variety- C-C+, but the ones they have are delicious.", "Date": "2014-05-23", "Author_Location": "Los Angeles, CA"}, {"Author": "Thelma W.", "ReviewID": "-Wo81S4JrFfbKZmDVIQjoA", "Overall": "5.0", "Content": "On the outside, you would never guess the pizza is so good. There was plenty of parking (we all know that frustration!) and the staff was very nice and patient with giving suggestions. I had the artichoke and prosciutto pizza, and stole a slice of the broccoli and sausage pizza from my pal, both DELISH. The pizza was good, not greasy, well priced. The place was clean, very important to me. And they had not one, but 2 of my fave gelato in the house: pistachio and hazelnut. If I lived closer, this would be my go to pizza joint.", "Date": "2014-04-17", "Author_Location": "Los Angeles, CA"}, {"Author": "Enrique R.", "ReviewID": "qippU6cxuqbPMyLNu2_wxA", "Overall": "5.0", "Content": "I enjoyed this place AMAZING STAFF and the food is the best!!!!", "Date": "2014-06-14", "Author_Location": "Baldwin Park, CA"}, {"Author": "Lawrence L.", "ReviewID": "4iR8btbh50wgkNn0AyXHHg", "Overall": "5.0", "Content": "There's a new VPN Neapolitan pizza maker in LA, an expansion courtesy of Nashville, TN of all places.  It rests in an enormous 7000 square foot brick and concrete warehouse right at the T-intersection of Santa Monica and Alexandria.  This place is probably big enough to fit an entire AYSO league age bracket among its 8 large community tables and has it's own parking lot to boot,  which is no small thing for E. Hollyweird...The 900 degree wood burning ovens are named after saints, all 40000 pounds of them.  There are sacks of San Telice flour and large cans of San Marzano tomatoes stacked high in front of the food preparation area which is part of the dining area as there is a transparency to how they prepare the pizzas.  They bring them out on parchment lined jelly roll pans so never mind asking where are the plates.  Pizzas come in either a 12\" personal size or a larger 18\" pie meant for sharing.  They don't do half-and-half pizzas, we asked...You order and pay up front and then go around the corner and squat one of the communal tables.  There are two tv's to pass the time which isn't too much at all considering the layout.  In addition to pizzas, they also have calzones and salads, and I hear that they even have sandwiches.   BYOB;  they don't currently have any corkage fee...I had to order the standard DOP Margherita, the mozzarella di bufala Campana just melts and spreads evenly across a thin layer over the crust of exacting proportions and rise to be called a true Neapolitan.  They use crushed cherry tomatoes from San Marzano, the pomodori, and carefully lay out fresh leaves of basil to form a cross in the middle, an artistic touch of the pizzaioli.  The crust is slightly blistered from its 50 second exposure in the 900 degree oven just as it should be.  The dope is that it's a thin crusted but chewy pizza where you can taste and realize the texture of each component, the colors of which represent the Italian flag...The Capricciosa is a mushroom, artichoke, prosciutto pizza again with the artisan buffalo mozzarella.  The ingredients are fresh and laid out evenly and deliberately with the right balance, you can really taste the artichoke hearts as they are not washed out or overwhelmed by the meat, the same could be said of the mushrooms...We decided to try the in-house cannoli and gelato offerings.  Cocco Cioccolati is a chocolate on chocolate cannoli sprinkled with chocolate chips and confectioners sugar.  I wasn't sure how to approach the first bite and the tube shaped shell cracked length-wise as I awkwardly picked it up to my mouth.  There was a ton of filling, more than I am used to seeing which made it even harder to handle and the taste of the chocolate was a little strange for a ricotta, not what I was expecting.  I was more amiable to the lemon flavored Gelato which was tart, and tangy, and refreshing...On a side note, we ran into a nice couple that we met during DineLA and renewed our acquaintance;  they had already been here 5 times by then and everyone at DeSano's treated them with the same familiarity and celebrity like Cheer's.  But that's also the way the service seems to be here:  cheerful and friendly -- plus the employees love to ham it up and photobomb anytime they have a chance... =) After such a disappointing outing recently at Bollini's, we were very happy to have found out about this place to satisfy our pizza craving.  I would put these guys right up there with Settebello's and Fuoco's when comparing Neapolitan pizzas.  I know we'll be back again...", "Date": "2014-02-21", "Author_Location": "Covina, CA"}, {"Author": "Richard R.", "ReviewID": "NL3pXYVwbRFRUvNTOMuUVw", "Overall": "4.0", "Content": "Wow! Did another yelper really write that \"something was off about the crust\" at DeSano Pizza Bakery? I had to go back and re-read that review after eating dinner there tonight. Must have been an alternate universe experience or some other type of anomaly. We ordered a Margherita and a DeSano and they were both exceptional pies. Plenty of cheese and meat. A tasty sauce (that could be a tad more tangy for me). And we also ordered the Caprese salad. It was very good but made with spinach (hey, it worked for me!).DeSano is a cavernous space. I was curious what it would be like when it's full of people. But it seemed like the acoustics might be ok. I would love to see it full one of these days. I'm sure it will help when they get their beer and wine license.As good as the pizza was (BTW the crust was chewy perfection) the dessert was the star. They make the Cannoli to your order. They're not made ahead of time and just sitting around. But if you want an incredible treat get the lemon sorbet. Amazing!Don't worry about the crust though. There's really nothing wrong with it.", "Date": "2014-04-09", "Author_Location": "Culver City, CA"}, {"Author": "Bryan G.", "ReviewID": "949TUQIAJULjSGKKmXywyw", "Overall": "5.0", "Content": "Great place! Pizza, calzone, salad. All amazing. Authentic Italian ingredients, fresh mozzarella and basil. Pizzas and calzones are cooked in one of four woodfire ovens.  The true testament was the empty baking sheets that out food was served on. My two youngest daughters are notoriously finicky eaters. They ate more food than I have seen in recent memory. Everyone was disappointed when we had finished. A return visit will be a forgone conclusion before you leave.", "Date": "2014-06-01", "Author_Location": "Placentia, CA"}, {"Author": "Jordan M.", "ReviewID": "nW7I6TzgRSvwmQmrM4tQ1A", "Overall": "5.0", "Content": "Modern atmosphere, very friendly and helpful staff, and a TOP NOTCH menu! A little pricey but WORTH IT. There is even a private parking lot! On top of the amazing pizza and calzones there is gelato and cannolis!", "Date": "2014-06-07", "Author_Location": "Los Angeles, CA"}, {"Author": "Richard L.", "ReviewID": "eDh_L_uS8v97iFmqcr_QbQ", "Overall": "5.0", "Content": "Just ate my first bite and it is excellent! DeSano's is all about quality and doing things right. Many of the ingredients are from Italy and you can tell that they are doing their best to keep it authentic. They also have a table of toppings, peppers, hot oil and amazing Parmesan cheese.  This place is really big so you can bring the whole group. We shared a large DeSano special.The prices are a bit high but the quality is worth it. We also tried one of their amazing Cocco Cioccolati Cannoli desserts. Try is because it is definitely excellent!", "Date": "2014-03-01", "Author_Location": "Los Angeles, CA"}, {"Author": "chelsea m.", "ReviewID": "EqwZDmKzobCCYSkizTfDuA", "Overall": "5.0", "Content": "This place is fantastic. You pay and order at the front then sit down in a large backroom with picnic style tables where you can watch the pizza makers make your pizza.  There's also a huge gated parking lot.The cashier was super friendly and informative and the servers were really nice as well. The owners even came around twice to ask how the food was.Pizzas were super delicious and only took 5 minutes to make.  We got the Diavola - a spicy pizza with salame and pepperoni and the Capricciosa topped with mushrooms artichoke and prosciutto.  If I had room I would have tried their gelatoa as well.Not the cheapest lunch but I will definitely be back!", "Date": "2014-02-10", "Author_Location": "New York, NY"}, {"Author": "Steven W.", "ReviewID": "schowfXvyHlzoChnMwyjfQ", "Overall": "4.0", "Content": "There is a lot of good food around East Hollywood. On this stretch of Santa Monica alone - from about Edgemont to Normandie - you'll find Marouch, Falafel Arax, Spicy BBQ and Sasoun Bakery (and EaHo star Square One is just a block north). DeSano, on the corner of Santa Monica and Alexandria, is a key addition.I think pizza costs more than it ought to. Maybe DeSano's is a dollar or two too much, but a big Grandma from Tomato Pie costs $20 (the lg. cheese is 15.75), the cheese pie from Original Joe's is also $20. DeSano's margherita is $18 so that's right in there. The margherita is OK, but the San Gennaro and DeSano pies (both $22) are much better. The mildly spicy peppadew peppers on the San Gennaro really make it. Extra peppers, cheese, salt and so forth are over by the big ovens. The staff is very friendly, the tables and atmosphere is comfortable and likely to become a scene once they're serving beer and wine. I'm going to add a fifth star myself when that happens, but I love this place already.Good gelato, too! and Coke in glass bottles, of course.", "Date": "2014-03-01", "Author_Location": "Los Angeles, CA"}, {"Author": "Lynn C.", "ReviewID": "2KKrQDH3tSgqtZ-cN4Y9sQ", "Overall": "5.0", "Content": "I honestly didn't know what to make of DeSano Pizza Bakery when I first heard about it. Neapolitan Pizza, popularized in Nashville/Charleston, in a 7000 square foot space across the street from Immaculate Heart of Mary Church on Santa Monica near Alexandria (and not much else).  Order at the counter, then have a seat at one of the communal tables. This reminded me of a beer garden meets warehouse meets kitchen. These wood-fired ovens are NO JOKE.  We tried two pies - one vegetarian, one with sausage.  The crust is wonderfully chewy and slightly charred.  Loved how unpretentious and warm this place felt.  The sweetest, most attentive staff ever, too.  With plenty of free parking, this is definitely going to be our go-to for large groups, casual date night, and quick takeout!", "Date": "2014-02-11", "Author_Location": "Los Angeles, CA"}, {"Author": "Flora H.", "ReviewID": "iD5xCJvctTwjApz31pucIg", "Overall": "4.0", "Content": "I went to DeSano's its fourth day open, hoping to find, as they self proclaimed to us, \"the best pizza that [I've] ever had\".  Make sure that you have the address and look up the cross streets, since from the outside you'd never guess that there's a huge \"pizza warehouse\" inside.  There's a large fenced parking lot adjacent to the restaurant (on the west side). When you walk into the door, there's a counter with the menu posted on the wall behind.  Judging from the room where you place your order, you'd never expect it to be as large as it is inside... turn the corner and you'll find a big warehouse-like room with large pizza ovens in the back in an open kitchen (very cool) and long communal style tables. It's a very ambitiously sized room and I hope that they are able to drum up enough buzz to keep this place full.The pizza only took about 5 - 10 minutes to make, and come out on large baking sheets which you eat directly off of.  You read that correctly.. no plates, which makes perfect sense because you really don't need them, but don't bring your date here if they are expecting something fancy.  There's a guy going around handing out paper towels and bringing cups of water.  He kept giving us more and more paper towels so we thought we must have food all over our faces or something, but I think he was just trying to be helpful.There's a family style vibe, with various people coming to our table to greet us and thank us for coming in.  I really wanted this to be the best pizza that I've ever had.. and unfortunately Mozza still takes that prize (unfortunate because Mozza continues, to this day, to be annoyingly difficult to get into). It's a matter of preference, as this is traditional Italian style pizza... the type that you would get in Italy.. and probably the best of *that* style pizza around.  This is where I would take friends from Italy if they asked for authentic pizza in LA.  But personally, it's not my favorite style of pizza. Don't get me wrong, it was very good, just not anywhere near the best that I've had.  They weren't greasy at all which is also true to traditional style pizza.We split 2 large pizzas among four people (about $21 a pie):CAPRICCIOSA (Funghi, carciofi, prosciutto cotto, mozzarella di bufala - Mushroom, artichoke, prosciutto, garlic, buffalo mozzarella) - I would have liked this pizza to have more mushrooms, and wasn't a huge fan of the artichokes.  I'm not sure that I would get this one again.LASAGNA (Polpette, ricotta, pecorino romano, mozzarella di bufala - Meatball, ricotta, garlic, pecorino romano, buffalo mozzarella) - I preferred this to the other pizza. The ricotta added a little something extra that I really enjoyed. I don't eat red meat so I picked off the meatball pieces.. not a problem since there wasn't a lot of them.Note: They do NOT have a liquor license and it is not BYO.... I brought a bottle of wine but they said that they aren't even allowed to have alcohol on the premises.For me, DeSano was just okay, but I'm giving them four stars for being the best (and perhaps only) traditional Italian pizza joint around.  The baking ovens are also quite impressive.", "Date": "2014-02-18", "Author_Location": "West Hollywood, CA"}, {"Author": "Ana F.", "ReviewID": "sDv_hWvcDdsi9awNL8x_QA", "Overall": "5.0", "Content": "Delicious! Everyone must try it! I had the lasagna pizza and a traditional cannoli and i loved it!!", "Date": "2014-04-21", "Author_Location": "Los Angeles, CA"}, {"Author": "Brendan C.", "ReviewID": "HYeZoD3qi5oOTBDJxj56NA", "Overall": "5.0", "Content": "Up until this week I was seriously considering moving to Atlanta so I could eat at Antico Pizza Napoletana on a daily basis. It's an incredible place, fresh ingredients and imports from Italy, some of the best damn pizza I've ever had.So imagine my surprise when driving down Santa Monica this week I see a new pizza place that seems to share the same style and vibes as Antico in ATL.Walking in, I get even more excited as I see a similar menu with my favorite special San Gennaro pizza (sweet and spicy peppers, caramelized onions, sausage fresh mozzarella).and The resemblence was just too uncanny and after a quick Google I found that the owner of DeSano basically licensed the concept from Antico to open pizza restaurants in Nashville, Charleston, and now LA!I love the casual open style of the restaurant, getting to watch the pizzaiolas at work is fun, and the pizza is delicious. Compared to Antico I think the crust is a bit thick, but overall you can't go wrong with Pizza DeSano. Especially if you love authentic Napoletana style pizza.This is their first week open so I really look forward to watching them grow and evolve.Best of all, no need to move to Atlanta anymore! (No offense ATLiens!)", "Date": "2014-02-15", "Author_Location": "San Francisco, CA"}, {"Author": "Sonia Z.", "ReviewID": "tqLJJNuypvxzOLmzDljtsw", "Overall": "5.0", "Content": "This is hands down one of the best pizza places in LA! It's casual but so fresh and delicious! Went there with a large party, so we got to try a little of everything. We had Meatballs, Margherita Pizza, Diavola Pizza, Spinach and Caprese salads, and an assortment of Gelato. Everything was fantastic! Favorites of the evening were the Pizza Diavola and Hazelnut Gelato. Only downfall is that they are stuck in a lengthy process getting their alcohol license. City of LA, please give them the right to either sell alcohol or allow customers to bring their own! It would greatly improve their business, encourage the community to dine locally, and support the economy of the neighborhood!", "Date": "2014-05-17", "Author_Location": "Los Angeles, CA"}, {"Author": "Mikey D.", "ReviewID": "ULtjtbEl_-uIKXByFBdG6Q", "Overall": "5.0", "Content": "This pizzeria boasts ample parking, large tables for big groups, wood-fired pizza and gelato. Let me say I was a little taken aback by the menu. I couldn't understand it for some reason but I think it's because I was so hungry I was just looking for cheese or pepperoni or something boring and conventional.This place is anything but that. I had the Desano. OMG. incredible. Talk about top quality ingredients. Buffalo mozzarella, finest meats, fresh grated Pecorino and red chili flakes. The crust was soft but crispy and chewy. It was fantastic dough. The meats were fresh and full of flavor. That pizza sauce is addictive. Now, I've had pizza all over the world. I have to admit, this place is now my favorite spot. I went around noon but, this is the place to be at night. Nothing better than addictive pizza under the stars with good music and lots of friends. There is no beer or wine, yet. That's in the works. You are allowed to bring your own bottle of wine to eat with your meal. No corkage fee......!I thoroughly enjoyed the condiments bar. Featuring fresh Pecorino cheese and chili flakes. Oils and peppers. It's so refreshing to see an old fashioned type pizzeria with very modern flair. The staff were solid with their Italian and it was truly relaxing to watch them bake in the back. The gelato is delicious. It's sinful to leave without an order after your dinner.  Also, I did have a salad. The caprese was not your typical caprese salad. Stacks of spinach with vinaigrette and buffalo mozzarella. It was fantastic. As I sit here, my mouth is watering. I can't wait for next weekend to make my next visit to this incredible pizza gem. Pack your bags and bring your wallets. This is the new best pizzeria in LA. The prices were what you expect for such a high-quality ingredient pizza house. Not expensive at all for the high-quality ingredients. About $15 for a smaller pizza and $22 for the larger pizza. We're talking bargain for the Ferrari of pizzas. Pizzas are available in two sizes and many different creations. There is no soda fountain but bottled drinks. If you love pizza, then jump in the car and get here now.", "Date": "2014-02-17", "Author_Location": "Beverly Hills, CA"}, {"Author": "David G.", "ReviewID": "dALEQGv9bUaQl5ofbEHiTw", "Overall": "5.0", "Content": "Great space. Huge parking lot.I tried the San Gennaro, the Margherita, and the chocolate gelato.. All fantastic! Some of the best pizza I've had in L.A.! I'll be back!", "Date": "2014-02-24", "Author_Location": "Los Angeles, CA"}, {"Author": "Jennifer G.", "ReviewID": "wm8u_GIZUQsE1SbiUMGwGw", "Overall": "5.0", "Content": "I've been meaning to go here since I first heard about them on Eater. I mistakenly ordered the Marinara pizza instead of the Margherita - damn. I really hated they had to make another pizza. They were so accommodating and nice when they realized MY mistake. And, what really sealed the deal for me, they let me have the Marinara pizza as well, gratis. Friendly staff, management and amazing food, that's how you build a loyalty among customers.", "Date": "2014-05-03", "Author_Location": "Los Angeles, CA"}, {"Author": "Lila H.", "ReviewID": "VLhewxMJ82fcZAvjkCcn3g", "Overall": "3.0", "Content": "Pretty good pizza and salads. The only problem was our pizza cooled down so fast bc the ac/wind was strong.", "Date": "2014-04-23", "Author_Location": "Los Angeles, CA"}, {"Author": "Frank G.", "ReviewID": "4LM5k73a9gsduVFeuATPrg", "Overall": "5.0", "Content": "Great pizzeria. Super ambitious with their huge space. It still has the feeling of a \"just opened\" establishment, but that doesn't matter: The pizza is fantastic and that's all they need, anything with those sweet peppers is fantastic.Additionally everyone who works there is super friendly and parking is an absolute breeze with their huge lot. Parking doesn't factor into my enjoyment of a restaurant in Los Angeles, it's a given it'll be difficult to park, but when it's available it definitely makes things easier.", "Date": "2014-02-16", "Author_Location": "Los Angeles, CA"}, {"Author": "Trace O.", "ReviewID": "aljYCoQcYjvvW6o9Tl6M_A", "Overall": "4.0", "Content": "As it stands now, I'm delighted to have this new addition to my neighborhood. The parking is, as they say, ample, the building is huge, and I can't help wondering if this will become more of a bar than a restaurant. I hope not. As long as it stays a restaurant with a touch of sophistication and class, I think it will be a positive impact on the area. The counter is wonderful, with super-attentive, knowledgeable and friendly staff. The seating area is pretty charmless, but perhaps it's a work in progress. The pizza is very good and the ten-inch pie is a solid meal for a single person. They seem to only do specialty pies, but there's a good selection and several traditional varieties, with fancier new names attached.I'm happy to have a place like this that's a two-minute walk from home. I just hope they don't feel the need to dumb it down, in order to cover the overhead on this massive venue.", "Date": "2014-02-25", "Author_Location": "Los Angeles, CA"}, {"Author": "Deb J.", "ReviewID": "d8GUZWwCQZwKQcgrYrR5Yw", "Overall": "5.0", "Content": "Great atmosphere--Causal community style. 4 wood fire ovens. Pizza worth great crust.Big parking lot too", "Date": "2014-03-01", "Author_Location": "Los Angeles, CA"}, {"Author": "Duffy C.", "ReviewID": "7gu4AgjnZUEiWGGR17RwWg", "Overall": "5.0", "Content": "Simply the best pizza I Los Angeles. Find this place. The pizza pizza is expertly cooked. Crisp crust with soft inside. Perfectly fresh toppings.", "Date": "2014-05-21", "Author_Location": "Los Angeles, CA"}, {"Author": "Joey G.", "ReviewID": "IcOpksmY9wfGAAc-CNtB1Q", "Overall": "5.0", "Content": "I discovered this gem due to my friend and all I can say is WOW! I am slowly making my way through the menu and so far each pizza is as good as the last. Think Pizzeria Moza but larger, less expensive and way better. I've tried all the pies in Los Angeles and hands down this place is the best. Good looking Italian guys making your pizza as they speak their native language, what more can you ask for. Dont just sit there, run to DeSano Pizza and get a pie.", "Date": "2014-04-14", "Author_Location": "Los Angeles, CA"}, {"Author": "Hamik G.", "ReviewID": "88hhmBUE_bkX0U0xaA6dgA", "Overall": "5.0", "Content": "Very nice place. Pizza is amazing. Wood fire. We always go here and enjoy. This is the best thing to this Neighborhood. Go guys and enjoy.", "Date": "2014-05-02", "Author_Location": "Hollywood, Los Angeles, CA"}, {"Author": "Cynthia L.", "ReviewID": "RxzWdpDKZZHOcFgbqAkqQw", "Overall": "3.0", "Content": "I went here last week with my boyfriend. We heard that this was supposed to be the best pizza restaurant in town and quite frankly I am not sure what the fuss is all about. I believe that the biggest problem this restaurant has is that the minute they take the pizza out of the oven, they put it on a cold aluminum tray. So by the time the pizza gets to the table it is cold. I do not understand why they don't have those special flames at the tables that keep the pizza warm.", "Date": "2014-04-04", "Author_Location": "Los Angeles, CA"}, {"Author": "Melanie C.", "ReviewID": "SzbTRhTas4frqbv1OV6tBw", "Overall": "2.0", "Content": "I so wanted to be able to fall in love with this place, but alas! I was definitely sad that Palermo's was closed and I ended up here. The folks were friendly, the vibe was casual, laid-back cool, and the pizza was fast. Unfortunately, the ingredients were on the skimpy side and the flavors were only vibrant when punched up by the generous addition of spicy peppers, Parmesan and crushed garlic.  Goes to show that making a kick a*# pizza is easier said than done.", "Date": "2014-03-24", "Author_Location": "Los Angeles, CA"}, {"Author": "Daniel G.", "ReviewID": "4xcNiTHgacjmgEcrDjq-6w", "Overall": "5.0", "Content": "This is a gem in the rough. Easily the best pizza in Los Feliz and top two in Southern California. Delicious mouth watering and fresh fast fire oven pizza.", "Date": "2014-04-28", "Author_Location": "Los Angeles, CA"}, {"Author": "Nickie S.", "ReviewID": "G3P2D7zQdqyHl8QPKhHifA", "Overall": "5.0", "Content": "If you are a true pizza lover - you gotta eat here!  Fantastic pizza.   Loved the Capricosa pizza.  This place uses flour, tomatoes and cheese from Italy . . . the dough is made there by hand!!! . . . all of this artisanship and for very reasonable prices???  Wish this place was closer to Beverly Hills so I could frequent it more often . . . 800 degrees in Westwood doesn't compare to this place!  Oh and save room for the handmade gelato - lemon and hazelnut are fantastic.  Hope this place opens some other locations that are closer to west la; we NEED A PLACE with true Napolitano pizza like this!", "Date": "2014-04-15", "Author_Location": "Beverly Hills, CA"}, {"Author": "David A.", "ReviewID": "EvVXJkRiDmLrpIE5D1H8TA", "Overall": "5.0", "Content": "Really good Naples Pizza. A little bit off the beaten track, but definitely worth it. Need to get their liquor license though since that seems to be the only missing ingredient.", "Date": "2014-03-29", "Author_Location": "Los Angeles, CA"}, {"Author": "Cassie J.", "ReviewID": "YBVRlek0CLeQxI_S0DmTBQ", "Overall": "5.0", "Content": "This is hands down the most incredible pizza I've ever had! The parking lot is an instant win and without doctoring the pizza is amazing. Add some delights from the front condiments bar (Parmesan, crushed red pepper, sea salt, and garlic) and it soared to out of this world. We ordered it to go the first time and it was really good then too. We decided that this is definitely best dining in.", "Date": "2014-03-29", "Author_Location": "Chandler, AZ"}, {"Author": "jack f.", "ReviewID": "ghRH50gvx8T71OAzMfBIEg", "Overall": "5.0", "Content": "I do love pizza and with that in mind I felt I have to give this place a nice plug. The pizza I ordered was the DeSano, which has pepperoni, sausage and a bit of garlic. All the ingredients are fresh and you can really taste that they are. The dough stands up well, has great texture and a wonderful flavor that's just right. All the employees were very nice and the owner is also a nice guy whom I did have a nice chat with. I will visit this place as often as I can. Give it a try...", "Date": "2014-02-28", "Author_Location": "Culver City, CA"}, {"Author": "Jonathan S.", "ReviewID": "SwjJd3uS_EsaEbUuoiKJ_w", "Overall": "5.0", "Content": "Go. Go now. This place is an authentic Italian pizza restaurant. Their ovens were hand made in Napoli and shipped to the US. They were blessed by priests. Not kidding. And folks, the pizza is incredible. I had the Desano: pepperoni, sausage and garlic. The lasagna pizza was a huge hit. The beef on it was phenomenal. And the buffalo mozzarella is as good as it gets....and shipped out weekly from...you guessed it...ITALY.  The GM, Marino, couldn't have been more accommodating. Highly recommend.", "Date": "2014-02-27", "Author_Location": "Los Angeles, CA"}, {"Author": "Geoff S.", "ReviewID": "y_XYAmnWGBj2lCs388pnxg", "Overall": "5.0", "Content": "Just what this part of town needed.  Great crusts, great flavor combinations, and awesome wood burning ovens.  Highly recommended.", "Date": "2014-04-17", "Author_Location": "Santa Clarita, CA"}, {"Author": "Brian G.", "ReviewID": "cZ8zNDn5L0XU6UWOuj-ddA", "Overall": "3.0", "Content": "Having suffered from pizza withdrawal - that's any week that goes by without at least one pizza meal - I knew I had to hit up DeSano.  After hearing the words pizza, the words \"wood burning\" and \"ample parking\" were enough to drag my derriere over to this East Hollywood newcomer.  Most pizza places I have noticed err more on the side of cozy spaces.  DeSano thinks otherwise.  The parking lot is huge.  I could have done victory lane donuts in my car without hitting another vehicle.  The seating area inside is equally ginormous.  It really feels like they should be a commercial pizzeria.  The inside reminds me of a beer hall and in fact the setup reminds me of Wurstkuche, but instead of sausages, think pizza.  You place your order up front, then pick a spot at one of the many picnic tables lined up in the main dining room.  Plastic cutlery, rolls or paper towels, and plastic cups are at the table.  We had really friendly servers come by promptly to deliver our pizzas and clean our tables.  Between the exposed brick walls and barrel ceiling, DeSano provides an airy dining experience.  It's probably because they're short on customers, but if this turned into a Wurstkuche like beer hall experience, this place would probably be banging.  Surely, someone believed if they could build it, they will come.  And I hope they do.DeSano makes a fine pie.  The crust is a little thicker than I'd prefer for one that's put into a wood burning oven, but that's more preference than a fault.  The pies come in two sizes - about $14 for a small and $22 for a large.  The small will more than feed one person and could even be shared with another person with the addition of a salad to make up a light meal.  The price is about $2-$3 north of what I'd hope given the offering and ambiance, but it's not unreasonable.  I tried both the diavola and verdura pies.  The diavola was not really spicy, but easily resolved by adding red chili peppers and noshing on the hot peppers.  The verdura was a bit of a disappointment though.  The broccoli rabe was limp and tasteless.  The overall flavor of this pie was ho-hum.  There are finer pies out there IMHO, but DeSano is alright.  The biggest joke I think was the caprese salad.  It should really be called a spinach salad with occasional mozzarella cheese and tomato toppings.  There were about 4-5 chunks of mozzarella cheese on a generous bed of spinach and a laughable 3 tiny grape tomatoes that came in a separate, small plastic container.  Why are they even in a small container?  I mean why even include the tomatoes at that point?  Either leave them out or put a real handful of tomatoes in?  I wish I had taken a picture of the salad.  As it is, the salad is a misnomer and a disappointment.  I'd suggest skipping the caprese salad.DeSano looks primed to be a fun hangout place for groups of friends.  Once their liquor license kicks in, I could envision DeSano being a fun environment.  Come more for the experience than expecting the finest pies out there and you'll have a great time.", "Date": "2014-02-20", "Author_Location": "Los Angeles, CA"}, {"Author": "Carlo Alberto O.", "ReviewID": "NGMmLSYtYdtJ1s4zuMR0Hg", "Overall": "5.0", "Content": "I'm from Parma Italy, I've been looking for an awesome pizza here in US since i got here. I became a regular at 800 degrees in westwood, It was for sure my favorite.Until Tonight.I went to DeSano very curious and very skeptic (i'm obsessed with food) and here it is:THE BEST PIZZA I'VE EVER HAD.I kept it simple (margherita) to feel the basic ingredients. Every single pizza has Bufalo Mozzarella. (like the Special Margherita DOP at 800 degrees, not the normal margherita) so that's already a Plus.The tomatoes are from San Marzano in Italy, probably the best tomatos in Italy.Every bite is a pleasure. It's never soggy, even in the center, the crust maintains its texture all the way thru. It's a must try!I'd love for Mr. DeSano to add some burrata salads, and prosciutto from Parma on the menu!Other awesome thing: The Mexican Coke they have is the Medio Litro.", "Date": "2014-03-04", "Author_Location": "Los Angeles, CA"}, {"Author": "Aaron P.", "ReviewID": "eI2W7yuhFVhYcSFYm0YMKw", "Overall": "5.0", "Content": "Well, yes, I have made my final decision; this place is definitely better than Mother Dough.  Ordered the Desano and the Margherita w/ Prosciutto Cotto.  Quality Italian Pizza's $22 each. You get what you pay for. Awesome place to dine in. Don't even worry about parking because their lot is the size of a school yard. Don't worry about getting a table because the restaurant is the size of an airplane hangar. Quality ingredients imported from Italy, INCLUDING the ovens! What more could you ask for?", "Date": "2014-03-05", "Author_Location": "Santa Clarita, CA"}, {"Author": "Kate D.", "ReviewID": "E1ORP4Lij75Jc9eN-jpQOA", "Overall": "5.0", "Content": "I may be a bit biased since I've been here so many times, but I have to say the food & service is superb. I no longer have to fly to Manhattan to enjoy real authentic neopalitan pizza. The best thing is I can eat 3 to 4 slices of their pizza (Grande size) and not feel bloated or guilty! The crust is light, crispy, & chewy. The sauce is made with pomodoro tomatoes which means it's less acidic & sweeter than what you'll find at other pizzerias. And the toppings...by far, my fav is the San Gennaro with PEPPADEWS. I'm addicted to this stuff, and they sell it by the jar! I'm so happy Desano is here, and I hope it's here to stay! My hunee & I did run to our fellow Foodies whom we met at another restaurant during DineLA-It was really great to share such a great & positive food experience with them :)...BTW they will be selling alcohol here AND corkage is free.", "Date": "2014-03-10", "Author_Location": "Los Angeles, CA"}, {"Author": "Chris B.", "ReviewID": "-5u81UmzVJt4sg2JnPFDvw", "Overall": "5.0", "Content": "Before this location was purchased by Desano it was a massive dump. Now they have not only upped the neighborhood but provided tremendous food and environment. I brought my family and everyone loved it. The service was top notch and great for groups of people", "Date": "2014-02-22", "Author_Location": "Los Angeles, CA"}, {"Author": "Chris P.", "ReviewID": "k8OkbWeUgiaTYzYO8xVuGQ", "Overall": "4.0", "Content": "This is a great pizza place! When I lived in Atlanta I thought I'd miss my favorite pizza spot, Antico, but when I realized this affiliate opened up here, I was overjoyed. They do the whole Italian authentic warehouse thing where you feel like you're paying for an experience. You walk in and order your pizza and drinks (byob) and then go to the back where there are tables lined up like a school cafeteria. Then you can watch the guys make your pizza in amazing wood-fire ovens. The pizza is great and this place stands out from your typical pizza place although the location isn't the easiest to find.", "Date": "2014-03-12", "Author_Location": "Los Angeles, CA"}, {"Author": "Andy A.", "ReviewID": "uaYu0EuEwcLSGubBMW8RLQ", "Overall": "4.0", "Content": "So this place has opened up next to my parents house and I decided to give them a shot. As soon as walked in I noticed it was real Italian pizza. Few seconds later the owner greeted me who is Italian. I ordered the prosciutto fungi artichoke pizza, boy it was amazing! Authentic  ingredients from the dough, cheese and toppings. No harmful additives like your local pizza chains. Your next pizza craving give them a shot! My only issue to not give them 5 stars was the soft drinks selection and small bottle of water is almost 2 dollars. Im sure the owner will improve...since they just opened.", "Date": "2014-03-29", "Author_Location": "Glendale, CA"}, {"Author": "Amber S.", "ReviewID": "yUrHAw9NfR_dARrerfVkzw", "Overall": "5.0", "Content": "This pizza is outstanding!!!!! I'm so happy to have discovered this spot. The ambiance is casual and cool and you watch the pizzaiolos (pizza makers) in the back making your pizza, fresh! The ingredients are perfect and their table of condiments are a great compliment to the flavor. The pecorino cheese is light and nutty...I ate it with a fork.  I'll be back!", "Date": "2014-03-31", "Author_Location": "Los Angeles, CA"}, {"Author": "cindy c.", "ReviewID": "wydkYHQ2fZuspwhDu2mK7Q", "Overall": "5.0", "Content": "The Best pizza in L.A hands down! The best sausage and soooo good!!! I'm going back tomorrow! Well worth the price! Thin crust and the service is awesome! Thank you!!", "Date": "2014-03-19", "Author_Location": "Los Angeles, CA"}, {"Author": "Ford S.", "ReviewID": "oVXu6WWjPtHpuqcb-ZN1Cw", "Overall": "5.0", "Content": "Without a doubt the best pizza I have had in all of Los Angeles. The most authentic, welcoming experience. Marino is a phenomenal manager and owner, and he made sure we had everything we needed. The staff was the most talkative helpful staff I have ever come across in all of my years in LA. Not to mention the fact that they close at 10, and we showed up at 10:15 and Marino insisted that we order and eat! Will definitely be coming back. Everyone should take a page out of DeSano's hospitality book.", "Date": "2014-03-01", "Author_Location": "Westlake, Los Angeles, CA"}, {"Author": "Rachel D.", "ReviewID": "Q6xDvizpduLbNBP3eGU9rA", "Overall": "5.0", "Content": "Pizza is the best I've had in LA since I moved here and it's a great price. The staff is really friendly and there's a large free parking lot.", "Date": "2014-04-04", "Author_Location": "Westlake, Los Angeles, CA"}, {"Author": "Simon L.", "ReviewID": "nW_U13qGHcG0VciL4lQO1g", "Overall": "5.0", "Content": "We went here for the soft opening, and the pizza was perfect.  There was the right amount of chew to the dough, the perfect balance of flavor to the crust and just enough charring.  We will definitely be back!  And Marino, the host, was absolutely welcoming.", "Date": "2014-02-08", "Author_Location": "CA, CA"}, {"Author": "Kelly C.", "ReviewID": "hmby3gySR2jMS1TS_sdQLQ", "Overall": "5.0", "Content": "Best Pizza in LA , authentic,  fresh ingredients,  great service,  delicious food and you must try this place. I highly recommend this spot.", "Date": "2014-04-10", "Author_Location": "Los Angeles, CA"}, {"Author": "Rob C.", "ReviewID": "a2Y5zAXxIJmLbFiS74xptg", "Overall": "5.0", "Content": "If your searching for Napoli pizza look no further. They have a couple rules about what you can and can't substitute which I agree with, they make a great pie and want to keep it that way. The condiment bar has chili oil which helps along with the imported ingredients takes me back to Italy.  The cannoli is one of the best outside of Sicily and worth a try as well (but it's a four star).", "Date": "2014-04-09", "Author_Location": "Dana Point, CA"}, {"Author": "Daniel P.", "ReviewID": "1gdEqIk_NeCdJm2gqPR88Q", "Overall": "5.0", "Content": "Awesome! Finally an authentic Italian pizza joint in Hollywood. I've tried almost every pizza on the menu and all are amazing. If you're used to eating blah American pizzas then it may take you a few tries to acquire a taste for the real thing. Cool interior with a room for private parties. Real wood-burning ovens and plenty of parking. The owner is always there and personally makes or oversees all the pizzas. The only problem I see is that they don't allow substitutes or custom pizzas, kind of like the soup Nazi on Seinfeld :-) I guess that's what makes this place so good.", "Date": "2014-04-01", "Author_Location": "Los Angeles, CA"}, {"Author": "Alex D.", "ReviewID": "l824xyrBODv6o8WmzcDaKw", "Overall": "5.0", "Content": "Delicious pizza, love the atmosphere, including being able to see the pizza being made right in front of you.  Also, when the cashier accidentally put in the wrong order, the owner gave us that pie and got our proper order out right away.  Will definitely be coming back.", "Date": "2014-03-13", "Author_Location": "Los Angeles, CA"}, {"Author": "Vanesa C.", "ReviewID": "BY0s9GtNfykrDTPLfL6wxg", "Overall": "5.0", "Content": "Delicious. The pizza is thin crust Italian style and you could easily split the individual size - or eat it all, if you're me. The canoli wasn't amazing but was decent. Ambience is nice but I bet they'll do more business once they can sell wine and beer! I think this is the second best pizza in LA - first place always goes to Vito's.", "Date": "2014-04-05", "Author_Location": "Los Angeles, CA"}, {"Author": "Damon M.", "ReviewID": "NirN5zjsbb20-EAHmW7TKA", "Overall": "5.0", "Content": "One of the best pizza places in Los Angeles, and now one of my favorites! Top quality ingredients, ovens, etc. its like eating pizza in Italy! I enjoyed the ambiance - Community tables, concrete floors, and you can watch them cook your pizza. I'm a picky pizza eater, and you maybe too, but you won't be disappointed!", "Date": "2014-05-24", "Author_Location": "Los Angeles, CA"}, {"Author": "Tim L.", "ReviewID": "UnFb6Nx6mFNiHZOnt68QBw", "Overall": "5.0", "Content": "Excellent pizza. Just the right combination of topping, sauce and dough. Very flavorful. We played it safe and ordered the Margherita pizza with two toppings. The spinach salad was good as well. The only minor complaint I had was the cashier got the size wrong and put us down for a large instead of the smaller size we ordered. I also like that they have plenty of parking, the open seating with kitchen fully visible. The staff is super friendly, too. If you're in the area, be sure to check it out!", "Date": "2014-02-11", "Author_Location": "Santa Ana, CA"}, {"Author": "Joe M.", "ReviewID": "rKfUZhTn8DGfgQwLMP84SQ", "Overall": "5.0", "Content": "Best pizza in Los Angeles by far. All the ingredients are imported from Italy and you can sure taste it. Highly recommend you stop bye and try this place out.", "Date": "2014-02-11", "Author_Location": "Whittier, CA"}, {"Author": "Samantha M.", "ReviewID": "tTyZhD_HKsLsJW9rscxo5w", "Overall": "5.0", "Content": "Absolutely delicious pizza. We had the margherita - perfectly charred crust, fresh gooey mozzarella cheese, strewn with fresh torn basil. Once we sat down, we watched them make our pizza. Each component was carefully placed atop the fresh dough and then placed in the wood burning oven. Can't wait to eat the leftovers for breakfast!", "Date": "2014-05-22", "Author_Location": "Los Angeles, CA"}, {"Author": "No Need T.", "ReviewID": "VJQOV9Y5ZutQAfBkdG8R8w", "Overall": "5.0", "Content": "2nd time here. Best pizza in LA. Awesome staff as well. Once they get the beer flowing it'll be packed. If you're a pizza lover, you're missing out if you haven't tried this place", "Date": "2014-02-22", "Author_Location": "Mid Wilshire, Los Angeles, CA"}, {"Author": "Lakar K.", "ReviewID": "n9m_tD7N79Oc0IYxSlY_sg", "Overall": "5.0", "Content": "Loved the pizza. Tastes like Neapolitan we got in Naples and Amalfi. Great for a group to go and share a few pies. Fun experience. We had the calzone, the margherita the marinara and Bianca.  The margherita was fantastic. Crust amazing. The San Marzano tomatoes and Pecorino Romano cheese did the trick. Go check it out before the place becomes super popular and the wait times get long.", "Date": "2014-03-23", "Author_Location": "Beverly Hills, CA"}, {"Author": "Maxime G.", "ReviewID": "0Tcz-pxDrwx6AYS8LNtgwg", "Overall": "5.0", "Content": "Delicious pizza, excellent service. Place is a little big but definitely has enough room for a bar mitzvah", "Date": "2014-03-12", "Author_Location": "Long Beach, CA"}, {"Author": "Chris F.", "ReviewID": "zYZEwj3QJnh2M0bW8zQTiQ", "Overall": "5.0", "Content": "this was a really fantastic place to get some excellent pizza!! the owner even came by to say a quick hello & treated us to a complimentary scoop of ice cream. he's a very nice guy and the staff is very pleasant.", "Date": "2014-05-19", "Author_Location": "Los Angeles, CA"}, {"Author": "Buck R.", "ReviewID": "GoS32-ocHeOQcGR_SpwMYg", "Overall": "5.0", "Content": "My taste buds say - Dang that's a good pizza!! Super fresh, super fast ( like under 10 min fast), but overall just super tasty, awesome texture, love the cheese, etc. Good job & I hope this place catches on!I had a cannoli also. That did not survive the drive back to my apartment. Super tasty, super fresh. This place rocks.", "Date": "2014-02-17", "Author_Location": "Los Angeles, CA"}, {"Author": "Phillip B.", "ReviewID": "Ct51pT1d6u_3qGFUlb63Mw", "Overall": "4.0", "Content": "The pizza here is very good. I'm a New Yorker, so I am, if course, biased, but there is good pizza in Los Angeles and this place rates among the best. I did find that the crust on my San Gennaro pizza was excellent at the edges but soggy towards the middle of the pie. It tasted great, so the fact that I had to eat some of it with a fork didn't ruin it for me. The cannoli looked great, as well, but I didn't try. Maybe next time, as I will definitely be back.", "Date": "2014-03-29", "Author_Location": "Los Angeles, CA"}, {"Author": "Wirter M.", "ReviewID": "CjVNUBuJbjbWSQkmYIR8UA", "Overall": "5.0", "Content": "The food and service was simply amazing.  Will has become my go to pizza place, its a bit out of the way but worth the drive.", "Date": "2014-02-14", "Author_Location": "Los Angeles, CA"}, {"Author": "Greg B.", "ReviewID": "Db6ANcSjrpQNtpV7T3QDjg", "Overall": "5.0", "Content": "lasagna pizza was delicious. Margherita pizza was delicious. Service was unbelievable. friendly, attentive, quick, polite, helpful. can't wait to go back. haters are going to hate, bottom line is this place is worth checking out.", "Date": "2014-03-03", "Author_Location": "Los Angeles, CA"}, {"Author": "Jillian A.", "ReviewID": "elv8hqVYWZ-Xz-A0Acxohg", "Overall": "5.0", "Content": "The true measure of a good pizza is how it holds up the following morning, cold. The pizza is FANTASTIC. I'm from Chicago and this is the only authentic Italian pie on this side of the Mississippi I can get behind.", "Date": "2014-02-15", "Author_Location": "North Hollywood, CA"}, {"Author": "Harve A.", "ReviewID": "A52SxGMtYMlGkMn5odvInQ", "Overall": "4.0", "Content": "Excellent!  Great crust and tasty ingredients", "Date": "2014-03-22", "Author_Location": "Hollywood, Los Angeles, CA"}, {"Author": "Terry C.", "ReviewID": "_7gg1dyht1isZqvykkiVIg", "Overall": "5.0", "Content": "Exciting find 1 mile from my house and walking distance to Children's Hospital Los Angeles. These guys do it right. As I sit here enjoying every bite of my Pomodorini Napoli, I can't help but notice every ingredient displayed in the restaurant .  Everything from the flour to the sauces is authentic. The ovens are impressive wood fired behemoths of stone and steel that are capable of giving the crust just the right \"char\" for Napolitan style pizza.  The dining area is part of the action on busy pizza nights and the space is gargantuan.  I look forward to trying all their pizzas.", "Date": "2014-03-05", "Author_Location": "Los Angeles, CA"}, {"Author": "Julie H.", "ReviewID": "lbZnnZ0jV0CB7_hGQ4CZdA", "Overall": "3.0", "Content": "First off, I'm really excited to have this kind of restaurant in East Hollywood, a part of town sorely lacking in anything like it. The space is huge and fun, the staff is super friendly, the parking situation is fantastic (even more so when you consider it's LA). The pies are on the pricey side and I wouldn't say the taste really merits that, to be honest. I do think they need more selection - definitely better (non-alcoholic) drinks and salt, pepper and Parmesan on the tables. I'd also like a build your own pie option. Not sure if they're doing the \"purist\" thing, but these things would make for a better experience.", "Date": "2014-02-22", "Author_Location": "Los Angeles, CA"}, {"Author": "Marc K.", "ReviewID": "Wk5UhH4jca7A_6Wb6Df2xw", "Overall": "4.0", "Content": "Got a Marherita and a Lasagna pizza and each were fantastic.  Worried that the word is going to get out...", "Date": "2014-04-27", "Author_Location": "Los Angeles, CA"}, {"Author": "Marian C.", "ReviewID": "ebSGCSC_QsX95Se8fKn2xA", "Overall": "5.0", "Content": "Amazing service, a simple pizza margarita with so much flavor and really fresh ingredients you can feel it in every bite", "Date": "2014-03-13", "Author_Location": "Fairfax, Los Angeles, CA"}, {"Author": "Monica T.", "ReviewID": "Flp-zoVqGEYaL0hI0ZITtA", "Overall": "4.0", "Content": "These guys have a cool story in that they've got big fans of their Nashville and Charleston, SC outposts, so when friends from those cities gave me a heads up about this pizza my curiosity was peaked. Plus Marino was the GM of Cecconi's for years.  LA doesn't know yet what's hit them. This pizza is AMAZING!! Hands down the most flavorful, fresh, delicious pizza I've had in Los Angeles.  Everything is made right there from scratch and the quality of their ingredients comes through in the taste. Mindblowing how good it is!", "Date": "2014-05-14", "Author_Location": "West Hollywood, CA"}, {"Author": "B. Y.", "ReviewID": "LVKrkmFtuILjpDUbsnaUQg", "Overall": "4.0", "Content": "Great addition to the local pizza options - nice charred crust, good quality ingredients seasoned well.  The cannolis and gelato are AWESOME and worth the trip on their own - some of the best I've had in LA.  The enormous parking lot is a welcome convenience, as is the cavernous dining area.  It's a little more expensive than some other nearby pizza joints, but I thought it was worth it.  It's got a cafeteria/mess-hall vibe, but in a good way - lots of big tables, good for impromptu large groups.", "Date": "2014-04-29", "Author_Location": "Los Angeles, CA"}, {"Author": "Rima R.", "ReviewID": "xr6y8gMDWVggc6yT43SRAA", "Overall": "5.0", "Content": "I drove by one day and was shocked that there was a new pizza place and I did not know about it.  Finally, a pizza bakery worth going too! I've been there twice in one week, pepperoni on the Margherita pizza was outstanding. The second time around I got the DeSano Pizza and that was full of flavors I cannot even describe but say it was DELICIOUS! I do recommend trying this place. Staff is nice which is always a plus and there isn't a long wait time from when you place your order.", "Date": "2014-04-19", "Author_Location": "East Hollywood, Los Angeles, CA"}, {"Author": "Longlostpictures X.", "ReviewID": "pyeUkypeRlyUicFcprTLdQ", "Overall": "5.0", "Content": "Loved this pizza. Loved this place.  The open floor and open kitchen make it an awesome experience.  Plenty of parking! I will be back!", "Date": "2014-04-17", "Author_Location": "Pasadena, CA"}, {"Author": "Garri C.", "ReviewID": "dpR9MPopEBw2qlls-kyvkg", "Overall": "5.0", "Content": "back again...  enjoying the san genaro & the lasagna...", "Date": "2014-03-05", "Author_Location": "Los Angeles, CA"}, {"Author": "Peter A.", "ReviewID": "uyG7y2S7Eplr0Ny6BsiZOw", "Overall": "5.0", "Content": "A great pizza joint in a part of town that has longingly needed a casual restaurant that serves A+ quality food.  This pizza is to die for - it is the real deal.  I had spent some time in Italy and this pizza brings me back to Naples.  I heard that the owners moved their pizza maker out from Italy to make their pizza pies...and I really appreciate that effort.  They are not cutting corners. You can taste the authenticity in every bite...the dough, the cheese, the meat...perfection.  (They have great fresh cannolis as well! Tons of gated parking.)", "Date": "2014-02-26", "Author_Location": "Los Angeles, CA"}, {"Author": "Dr. A.", "ReviewID": "vz0SsJ3BzCLgd3Vj4Lxu8Q", "Overall": "5.0", "Content": "This place opened up walking distance from where I live, and after trying it for the first time last night, boy am I glad they did! Absolutely delicious pizza and a fun communal eating space. The pizza chefs allowed my six year old daughter behind the counter to make her own pizza and were incredibly friendly. The gelato was fantastic. This place is going to be a regular hangout for us now, and we're going to bring friends who visit our place to our own wonderful neighborhood pizza joint!", "Date": "2014-02-24", "Author_Location": "Los Angeles, CA"}, {"Author": "dom m.", "ReviewID": "m4PhLS4ZlNiyVGjAStVhSg", "Overall": "5.0", "Content": "The pizza is really very good and the ingredients are top notch. Once you  have their pizza, you will never be able to eat  Papa Johns again.  It is easily the best pizza joint in the neighborhood and worth a drive.  I capped off dinner with a cannoli, I felt like I was back in New York. I've seen some comments that the pizza is pricey. I disagree.  For the quality of the ingredients, seemingly most from Italy,  it is very reasonable. A small easily feeds two.", "Date": "2014-03-30", "Author_Location": "Beverly Hills, CA"}, {"Author": "Claudia M.", "ReviewID": "4-ZWKuqgpDwbPP89uM38cA", "Overall": "4.0", "Content": "I just happened to come across this pizzeria yesterday and I must admit its pretty darn good. The service was friendly and courteous. The pizza was really good. Almost New York style good.", "Date": "2014-03-18", "Author_Location": "NORTH HOLLYWOOD, CA"}, {"Author": "Jeff G.", "ReviewID": "OBAq11Bu7cXcMCUYWTmYrA", "Overall": "2.0", "Content": "The pizza is ok, nothing special. I don't care how fancy the toppings are or how specialty the pies are supposed to be they are not that tasty. The pizza is a touch overpriced especially for the average taste of it. The place is perennially empty and the hard ass wooden seats make for zero comfort. Yea you can watch your pizza get made but it's usually barren in there that half the staff watches you watch the pizza and then they watch you eat it. You can't make substitutions with orders probably not to confuse the staff but you can take off a topping. A suggestions was made that you should be able to enter the shop off of Santa Monica instead of entering the intrusive and county like chain-link fence that barricades the place, giving it a closed off vibe. The dining area is huge but it looks like an empty warehouse with wooden tables and ovens. Significant changes would have to be made for me to come back.", "Date": "2014-04-01", "Author_Location": "Los Angeles, CA"}, {"Author": "Ken B.", "ReviewID": "Xa4dWj2uyC95DEQEvAT99A", "Overall": "2.0", "Content": "Not sure if people are getting paid for review this spot, or they are comparing this to Domino's, which would make sense. I really wanted this place to work. I'm a self proclaimed pizza aficionado born and raised on proper NY pies, and have a pretty strong handle on the LA pizza scene after living here for 16 years. The space is huge. Could be fantastic, but seems cheaply done. Much like the food, the potential is there, however, the execution just doesn't meet any expectations. Pizza coming from a wood fire oven should be crisp, charred and hot. Flavors should burst from the cheese and sauce like a marriage of two perfect ideas. Instead, what we found was completely flavorless sauce, tasteless cheese and an undercooked crust that didn't have any bite. You want fancy pants pizza, skip this and make your way to Mozza. It's the real deal. This felt like it was made by a less particular. You want serious NY style pizza, try Garage, Vito's, Village, or Bravissimo in Santa Monica.", "Date": "2014-03-02", "Author_Location": "Los Angeles, CA"}], "RestaurantInfo": {"RestaurantID": "5e24ZbiphOnLJYPMAS70lQ", "Name": "DeSano Pizza Bakery", "Price": "$$", "RestaurantURL": "/biz/desano-pizza-bakery-los-angeles", "Longitude": " -118.2977494999999", "Address": "4959 Santa Monica BlvdLos Angeles, CA 90029", "Latitude": " 34.090845600000002", "ImgURL": "//s3-media1.fl.yelpcdn.com/bphoto/2TWLKbs6pIXlabpkZP2oBA/90s.jpg"}}