{"Reviews": [{"Author": "Ashley H.", "ReviewID": "rPy7DQfk_pB1YnsQ5czeTw", "Overall": "5.0", "Content": "Who am I kidding? My husband and I are in here all the time. The bartenders recognize us. I need to update my review. Since we started coming here a couple of years ago, things have only gotten better. The quality of the food is very good. The wings are AMAZING: plump and juicy, fresh from the fryer, and coated thick in your favorite sauce or dry-rub. I'm a huge fan of the Dry Memphis Rub: smoky, sweet, and a touch of heat. The wings are always super-hot (temperature-side) when they are brought out to us. The burgers have gotten much better; they are cooked to order and the buns are nicely toasted. And they now have added the option of PRETZEL BUNS to the regular menu. Be still, my carbohydrate-loving heart! They have some great mainstays, like the Tennessee Burger, the Burger Republic, and the Shroomin' Burger. They also have specials a few times a month, so if you get burgers here often, there's always something new to try. The Benton's Bacon Mac & Cheese is phenomenal. We get one cup of it (or two) each time we come in. If you're a beer-lover, this is the place to be. The extra-cold beers on tap have me spoiled. And the bartenders are very friendly. If we ever move away from here, I'm truly gonna miss being a few steps from this place.", "Date": "2014-07-19", "Author_Location": "Nashville, TN"}, {"Author": "Valerie M.", "ReviewID": "47RC4iZsoFSb8tm7kVFztQ", "Overall": "3.0", "Content": "I'm a simple girl. Here in the South (and in the universe), I am in the minority of \"low maintenance Babes.\" The down side of this, there is very little room for error, barely a margin for the tiniest mistake. I believe in first impressions, not second chances.So, when I peruse and fully consider the dozen or so burgers you offer, including ones with fried eggs, grilled pineapple, and roasted mushrooms, don't look at me judgmentally and slightly bothered when I order \"a plain burger, well done/no pink, onions and pickles, and monterey jack cheese.\" Furthermore, after just uttering those exact words, I don't want you to (a) ask me how I want my burger cooked (I was in a good mood and refrained from using the word \"still\" when I said \"well done\") or (b) argue with me about my choice of cheese. \"We don't have monterey jack.\" \"Yes, you do.\" (Take it up with the themed burger on the menu which claims to use it.There were plenty of hipster doofi (is that the plural of doofus?) running around the joint, both as wait staff and customers. The good news is my husband's normally blinding, white calves had no competition as the rest of the male clientele's calves were neatly concealed within the confines of skinny jeans.We enjoyed the tater tot fondue appetizer. Would have enjoyed it more with napkins and silverware. I chose the house made potato chips as my side and they were nicely flavored and prepared.The shakes looked good but (a) I'll be hard pressed to justify a $6 milkshake...it's milk and ice cream, for crying out loud. And (b) a milkshake is dessert in my world, not just a beverage. I won't know if I want and have room for a shake until after my meal and I was stuffed after this meal.We'll give it another shot, but it won't be a sitter-worthy date night haunt.", "Date": "2014-06-29", "Author_Location": "Brentwood, TN"}, {"Author": "Toomie S.", "ReviewID": "Eup9acUV2YmAIe7LLE-vbA", "Overall": "4.0", "Content": "Buy the farm!!! So I've gotten into the habit of wanting, er...needing bacon & an egg on my burgers. This is the best spot for it! Egg is still a little runny & the applewood bacon is perfection. Ask for tater tots on the side & you're golden! And if you want to spoil yourself, get their shake. Alcohol or not, it's descendent & meant to be shared. Or be a little greedy & don't. Cause you're worth it!Oh, and sit outside! Where you can watch the ridiculously fit folks coming & going from the 24/7 fitness place next door. You're welcome!", "Date": "2014-05-21", "Author_Location": "Nashville, TN"}, {"Author": "Bryan L.", "ReviewID": "icMtKKhaqf8KvsMC8d5jGQ", "Overall": "4.0", "Content": "Stopped in to do some hard core burger sampling with my best friend whom runs a bad ass Burger joint in New Orleans. First impressions are great. The decor was pretty bad ass. Really dig the old bourbon barrels and ammo cans. Place is hopping!! Lots of people in there and everyone thinks they are cool. That always helps the vibe of any place, except a nursery. We order up some beer and some apps. Let's go with...  The Philly Egg rolls and Hot Wings.  Egg Rolls are awesome! Love the idea, and great execution. Wings are OK, it's a burger joint, not a wing joint....  But I would eat these wings anytime.BURGERS:1. Farm Burger,   Decent. Burger over cooked a bit. Bacon too soft to compliment the burger and egg. 2. 4 Cheese Garlic Burger, Over cooked again, but little less than the Farm Burger. TONS of garlic. They nicely layered the garlic into the burger. This is best if you're being stalked by a Vampire. 3. Shroomin Burger, This was my second favorite of the night. Cooked the best of the single patty burgers, and delicious flavor from the mushroom and onion topping. Good ratio of sauce too. Nicely done!4. Classic with Benton's Bacon, Again.... Over cooked. WTF? Turn the heat down or something. This burger showcases the meat. Both cow and pig. Needed a tad more cheese to go up against the extremely smokey Benton's Bacon.5. West Coast Burger, We both agree this is the best burger of the night. Cooked perfectly, everything was in the right proportion. By far the best of the night!!!Overall a good visit to this Burger Bar. Great decor, great service, good food, and local products. I'm a fan!", "Date": "2014-05-07", "Author_Location": "Mt Juliet, TN"}, {"Author": "Dee a.", "ReviewID": "qhQ9TAivbWALwSs31F1RdQ", "Overall": "2.0", "Content": "I read a review of this place a long while back that stated it best. This is a shake place with a burger problem. I got the veggie burger and was not impressed. It tasted like straight mashed black beans, no seasoning or other flavors. I tried a friends beef patty burger and it was meh. But the shakes. Dear man, the shakes! If ever I come back it's straight shake and fries for me and I'll be a happy camper.", "Date": "2014-05-18", "Author_Location": "Nashville, TN"}, {"Author": "Robert B.", "ReviewID": "qyv7cWWQyJd7iA6KCSa69g", "Overall": "5.0", "Content": "I used to eat a lot of red meat, but in the past decade I have kind of fallen out of love with burgers. It sounds completely unAmerican, I know. I'm not sure whether burger standards have gone down, or if the quality of meat has gone way down, or perhaps it's a little from column A and a little from column B. Whatever the reason, I have had a pretty blasé attitude toward beef. Burger Republic has changed all of that. I have been to BR twice, and both times I have not been disappointed. I have had both the Chili Chili Bang Bang and the Black N' Bleu. The latter was probably the best burger I have had in at least 10 years. This may, in fact, be the perfect burger. If cows knew how good this burger tastes, they would immediately stop chewing grass and resort to cannibalism. I'm sure that BR has other food besides burgers, but honestly...why bother? In addition to having near perfect burgers, they also have a very decent beer selection. Anyone that has Green Flash and Lagunitas is ok in my book. Bottom Line: If you like red meat, then you need to find a seat. 4.75 stars.", "Date": "2014-05-01", "Author_Location": "Nashville, TN"}, {"Author": "Noelle T.", "ReviewID": "4Dp7aj6T-tIAjbsOkKa2NA", "Overall": "4.0", "Content": "I've eaten here twice.  Once when it first opened and once this past weekend.  It's nice to have a place in South Nash that has more of a downtown vibe.  BR has an outdoor patio area with plenty of seats.  They also carry craft beers and spiked milk shakes.  We sat outside but they did have roll-up windows to bring the outside in if you prefer more shade.The food.  The last time I visited I ordered a traditional burger and thought it was just okay but really heavy.  This time my husband ordered the same and it was still just okay.  The meat tasted bland and sort of like it had been frozen.  However, I ordered the West Coast Burger and loved it.  It has two thin, salty patties with a thousand island sauce and cheese.  It actually had too much cheese but I prefer too much flavor as opposed to the bland burger my husband had to eat.  He agreed that the West Coast Burger was way better than the BR burger.  (Tip: the hash browns are way better than the fries.  The fries look good but they aren't.  They are boring.)  My husband tried a spiked shake and said it was awesome.  Overall this is a good place to go on a sunny day for beer with friends.  It has a great laid back vibe and a cool crowd.  I do recommend the West Coast Burger with hash browns but you have to be in the mood for some salt.", "Date": "2014-05-08", "Author_Location": "Nolensville, TN"}, {"Author": "P. Taylor A.", "ReviewID": "YqzX8cnPrUkq3D21wFJOKg", "Overall": "4.0", "Content": "Best milkshakes! The burgers were good, but not as great as I expected. Over seasoned.", "Date": "2014-06-29", "Author_Location": "Nashville, TN"}, {"Author": "Mario G.", "ReviewID": "kCXjjq0M9EWruIp0Uv1G8Q", "Overall": "5.0", "Content": "Best. Burgers. Ever. The service wasn't the best, but the food was great. The shakes were amazing too.", "Date": "2014-05-27", "Author_Location": "Nashville, TN"}, {"Author": "Jacobia D.", "ReviewID": "OebOE8Jvpb7_l768EKkemw", "Overall": "4.0", "Content": "Finally visited Burger Republic! I loved it already because its located in Southeast Nashville and there's smoke parking. Great atmosphere and a nice outdoor dining space. The menu has lots of tasty options with burgers prepared many ways. I had the much raved about Tennessee Burger. It was pretty good. The beef was prepared as requested and it was very flavorful. The service was excellent! While this place is known for the burgers, the milkshakes are the real treat. Flavors such as S'mores, Assassination by Chocolate, Elvis,  Nutella and Salted Carmel are worthy if a try. In addition, you can have your shake spiked! Great place, locally owned and definitely worthy of a visit!", "Date": "2014-06-25", "Author_Location": "Antioch, TN"}, {"Author": "Mistye A.", "ReviewID": "pjLEmyGkfx0EmHE8ru5sAA", "Overall": "5.0", "Content": "The best burger ever. Service is great. Ingredients fresh. I like the vibe too. They have outdoor seating which I appreciate. Martinis are marginal, buys it's really about the beers, which I don't drink. They serve spiked milkshakes & ice heard their great. (Can't do dairy). Would live to see a froyo or almond/coconut shake in the menu, but that doesn't stop me from going at least 2x a month.", "Date": "2014-06-15", "Author_Location": "Nashville, TN"}, {"Author": "Matt B.", "ReviewID": "BCa0ZjAEvPoRz31jYsVRrw", "Overall": "5.0", "Content": "The \"Buy the Farm\" burger is awesome! The red pepper jelly on it takes it over the edge.", "Date": "2014-06-18", "Author_Location": "Broomfield, CO"}, {"Author": "Dylan F.", "ReviewID": "lZRBMGRuX2B2iulDvT_qOA", "Overall": "4.0", "Content": "Just my kinda place! Went with my gf and my buddy kinda late- around 9:30. Felt bad because they were about to close, but we got in and out real quick. Our server Andrew was real friendly and accommodating with great recommendations, and didn't seem the least bit put off by our late arrival(which I was worried about). They have a great craft beer selection, even featuring one of my favorite beers which you are typically hard pressed to find, so thst a plus for us.For food I got the taco truck with the daily vegetable(brussel sprouts) which was pretty good. The sprouts were interesting because they were more or less shredded, which struck me as sorta odd, but tasted great nonetheless! The gf got the farm burger with the ham, egg, pepper relish, onion, tom, etc and it was def the highlight......other friend got the chili burger, which I didn't try, but he was perfectly content with. Overall I'm not going to say this is my fave burger in Nash, as that allegiance lies out east, but I'll certainly be coming here more often when I don't feel like waiting and want better service. Cheers!", "Date": "2014-03-31", "Author_Location": "Franklin, TN"}, {"Author": "Stephen L.", "ReviewID": "kuvEuuoKTQ3bXGwefKCbnA", "Overall": "5.0", "Content": "The jalapeño popper burger is great! The Philly egg roll appetizers and tater tot fondue are a must ! This place is managed great and had prompt service. The best server is definitely Andrew! They also have their own Texas hot sauce you should try if you like spicy.", "Date": "2014-05-28", "Author_Location": "Franklin, TN"}, {"Author": "Jennifer P.", "ReviewID": "sWl8p5AsWeYylC9-9mYyHw", "Overall": "4.0", "Content": "When I heard they had boozy milkshakes the lush inside of me was instantly sold. However, they don't just offer delicious alcohol laced confections, they also have some damn good burgers. Don't eat red meat or meat at all? That's ok! Burger Republic also offers all of their signature burgers in turkey and veggie burger options too. I've tried the one in Nippers Corner and the Gulch and both were delicious, well staffed, no wait for a table and had a great atmosphere. Most definitely a keeper.", "Date": "2014-03-13", "Author_Location": "Nashville, TN"}, {"Author": "Sid N.", "ReviewID": "-hS_e24duS46THPJ47oiVQ", "Overall": "5.0", "Content": "Pharmacy vs. Burger Republic is a tough one. The meat is better at Burger Republic but the buns at The Pharmacy can't be beat. I really enjoyed my meal here. The West Coast Burger and the Jalapeño Popper Burger were awesome. The fries were also amazing. The Nutella milkshake was just mind-blowing!On second thoughts this might be a better joint based on the fries and shake ......", "Date": "2014-02-09", "Author_Location": "Nashville, TN"}, {"Author": "Desmond M.", "ReviewID": "G_Xw36Kjxwh6d12RWwVmQA", "Overall": "3.0", "Content": "I liked this place. I really did but my only issue being from Louisiana is that the size of the burger didn't match the price of the meal. I'm a big burger fan and their burger flavor/dressing ideas where pretty rare and good. I had the garlic burger don't remember the name of it but as good as it was I was so disappointed when it got to the table that it was so small. If I had a friend visiting or any other situation where the price isn't part of the thought process I'm definitely going back, otherwise I'll go to Wendy's and at least be full.", "Date": "2014-05-31", "Author_Location": "Lafayette, LA"}, {"Author": "Debbie S.", "ReviewID": "lG2fca2ciuuY0B90iirQfQ", "Overall": "3.0", "Content": "I've always loved this place. .been going for about a year and 1/2. Food is great if you eat there but don't ever take out! Burgers to go are soggy and gross. Wish I had traveled the further two miles and gotten McDonald's. They just don't.care as much if you get it to go. I picked up my order before they said it would be ready and even then the bread was soggy. And it didn't have all the ingredients described on the menu.  If you eat there I recommend the black n blue burger or the Tennessee. Best burger around but only if you eat it there.", "Date": "2014-05-17", "Author_Location": "Leeds, AL"}, {"Author": "Dana T.", "ReviewID": "grvGVCQdmOdDr3jJKzdddA", "Overall": "5.0", "Content": "Everywhere I go, I order a burger and fries. When I came here I ordered the Buy The Farm and truffle fries... By far the best burger I've ever had!!! Have been twice this week, the second time I ordered the west coast burger, and it was equally great. I'm a burger FANATIC, and I say you should definitely go here and eat. Get a spiked shake while your at it.The Texas wings are very good also, just be careful if you can't handle hot!MUCH BETTER THAN THE PHARMACY.", "Date": "2014-03-07", "Author_Location": "Mount Juliet, TN"}, {"Author": "Rich R.", "ReviewID": "yj7te2663cWKXDnHgHOGYw", "Overall": "4.0", "Content": "Really great beer list.... Nice variety of craft beer and great food as well. Service is on top too- bonus. Chicken wings are the bomb here, crispy outside and juicy inside. Pair them with the beer of your choosing.", "Date": "2014-05-01", "Author_Location": "Brooklyn, NY"}, {"Author": "Rachel S.", "ReviewID": "UYZrU0WjDOvwYHBurXB0TQ", "Overall": "5.0", "Content": "Burger Republic is now one of my favorite burger places in Nashville!  I have been a Burger Up devotee for years, but this place definitely has something special!  Everything from the quality of the beef, to the topics (I had the garlic burger, amazing!) was fabulous!  Next time I visit I will definitely be trying a milk shake, I figured for lunch on a Tuesday would probably put me to sleep at my desk, but I can definitely say Burger Republic will now be in heavy rotation for me!", "Date": "2014-05-13", "Author_Location": "Nashville, TN"}, {"Author": "Bill W.", "ReviewID": "VtZ6vwUCVul1uIbLxtLYPg", "Overall": "5.0", "Content": "the burgers are amazing but the shakes might be better!", "Date": "2014-06-20", "Author_Location": "Nashville, TN"}, {"Author": "Keithon S.", "ReviewID": "eQMEKcWTGXtu85UVzSRAKw", "Overall": "5.0", "Content": "I freakin LOVE this place!! If you're in the east Brentwood/south Nashville, Lenox Village area and you want a fantastic selection of burgers, go to this place. I've searched all over the city for a great tasting burger, none of them hit the mark that I was looking for accept this one. I was going to get a simple bacon cheddar cheeseburger until I over heard the waitress tell someone about a burger called, \"the west coast burger\". She said a lot of people that come in say it taste like a double double animal style burger from In-n-Out; so I freaked out and ordered it. When I got it, my heart melted. It was better than described. If you like in-n-out, GET THIS BURGER!!!With that, the incredible service, the perfect vibe and a wonderful bourbon beer (also recommended by the waitress) my night could not get any better... And then I saw the shake menu!!!! HOLY COW!!!! I'm not going to recommend just one of them because they all taste like what I assume heaven will be like. Needless to say; this place is perfect.", "Date": "2014-02-01", "Author_Location": "Brentwood, TN"}, {"Author": "Jack B.", "ReviewID": "sbagHaZSbIdZoQSe7vM7tw", "Overall": "4.0", "Content": "Burger Republic is only a mile from where I live. My pregnant wife loves the milkshakes and I love the craft beer selection. The burgers are really good and they have so many to choose from. I usually get \"The Farm\" with turkey meat and my wife really likes the \"Burger Republic.\" The burgers come with tater tots, which makes me so happy. It is a little expensive for a burger and a beer, but the quality is high.", "Date": "2014-02-24", "Author_Location": "Nashville, TN"}, {"Author": "Ben C.", "ReviewID": "AU1mRgyM2CxKBWqBB-svCQ", "Overall": "4.0", "Content": "BR is a solid burger joint and perfect for this neighborhood. Menu choices are unique while also providing standards to suffice the pickiest one in the party. The beer list provides one of the better selections of craft brews in the area while also serving adult milkshakes known as \"bushwackers\" to many locals. A good patio and plenty of TVs round this place out. A final must try...truffle tots! Yes lawd!", "Date": "2014-04-14", "Author_Location": "Nashville, TN"}, {"Author": "Beth B.", "ReviewID": "IC7rc1pgkwt0BVImsJD3Yw", "Overall": "4.0", "Content": "We ordered carry out from Burger Republic while visiting friends that live in Nashville, so I can only review the food itself.We ordered Nacho Republic & Tater Tot Fondue for appetizer, and I'm sorry to say that we didn't find them to be especially good.  The Nachos would have been better on traditional tortilla chips - they were too greasy with the potato chips.  The Fondue wasn't great either - the cheese was a disappointing processed cheese substance, like Velvetta.However, the burgers were awesome.  My Ahi Tuna Burger was just terrific.  It was really a burger, per se, but rather a tuna steak on a bun.  Cooked a perfect medium rare, and really flavorful and somewhat light - I'd absolutely order it again.  My husband's Jalapeno Popper burger was totally good as well.  We had truffled tater tots as a side and they were ok.  A little strong, but I've never really met a bad tot & these were no exception.All in all, they make a really good burger here.  I'd definitely come back if I lived in Nashville.  I'd love to try one of their Spiked Milkshakes!!", "Date": "2013-10-13", "Author_Location": "Saint Louis, MO"}, {"Author": "Nicholas S.", "ReviewID": "kpz9rI5RVaCzY67E7epb5Q", "Overall": "4.0", "Content": "When did Lennox Village become \"all grows up?\" Burger Republic is a great addition to the growing neighborhood. The burgers are solid-- I rec the jalapeño with bacon. They offer 20 better than most beers on tap, and are constantly rotating. The bacon Mac 'n cheese was ok. I think the cheese is quite bland (but I am a cheesehead). However, the tots are crispy golden nuggets of joy. This is a great place to watch college or NFL football with plenty o' hidef big screens. Pop in after work if you live nearby, or fly from Texas to reunite the old gang for a start to your night out.", "Date": "2013-10-04", "Author_Location": "Houston, TX"}, {"Author": "Justin S.", "ReviewID": "U4XMV583Cgi_WBvGBHewvg", "Overall": "5.0", "Content": "I've tried multiple burgers and they all rock!The Bang Bang burger is the best I've had there, and their tater tots rock!", "Date": "2014-02-12", "Author_Location": "Brentwood, TN"}, {"Author": "erin s.", "ReviewID": "fD9qve2TXuofuaUoYMGkgg", "Overall": "5.0", "Content": "We love BR- it's kind of our \"Cheers\"  The bartenders Kyle and Kevin and manager Nick are all super nice guys.  Their beer selection is GREAT and they have a decent happy hour ($1 off drafts)  My husband is a burger snob and he loves it- it's in his top 5 burgers in Nashville (and he's tried a lot)  I'm not a big burger person but I've got to admit, they're fabulous.  My favorite is the jalapeno popper burger.  The shakes are out of this world.  If you don't let out a little moan when you drink a BR shake, you need to loosen up a bit.   The nachos and tater tot fondue are $5 for happy hour and both delicious snacks.", "Date": "2014-02-25", "Author_Location": "Nashville, TN"}, {"Author": "Foodie Queen L.", "ReviewID": "j9qD4GwDnKVDdBh5go8I6w", "Overall": "4.0", "Content": "Tried to check in here but Yelp said I was too far away..Can't get much closer than being at the bar, right?Seven people, burgers, sliders, nachos, tater tots, bacon mac & cheese.. one booze shake..Five of the seven had never been there.. They said they would return.Lots of food, good service, kept our water glasses filled, kept dirty dishes off table, very pleasant, not intrusive......Good experience with friends.Would do it again....", "Date": "2013-10-12", "Author_Location": "Nashville, TN"}, {"Author": "Alycia B.", "ReviewID": "SVCk8iPaNKtklU6a67zv-Q", "Overall": "5.0", "Content": "Definitely one of the best all-around burger joints. The tator tot fondue is reallllly good! I had the Tennessee burger with fries. It came out so fresh, it was juicy and tender like a steak. Fries were good, nothing special. I also tried the bacon mac and cheese, it was just ok, a little bland but very rich in texture. The milkshakes were probably the best part of the entire meal. I had the salted caramel and my bf had the nutella (see photos). They were amazing but also fairly pricy at 6 bucks a pop. I'd love to visit this place again.", "Date": "2014-03-13", "Author_Location": "Charlotte, NC"}, {"Author": "J S.", "ReviewID": "ZeMwYX2j2n-NvC4JxNOJnQ", "Overall": "4.0", "Content": "Was craving a killer burger and I found one -- the mushroom burger. Obviously high quality meat, juicy and perfectly cooked, and the mushrooms and onions completed the taste. Fries were good, homemade chips were OK, the ABC milkshake was excellent. Service was pretty good. Be prepared to open your wallet: two burgers and sodas, one shake, and tax and tip totaled $38.", "Date": "2014-06-11", "Author_Location": "Nashville, TN"}, {"Author": "Gerald T.", "ReviewID": "OjBMVrGtymDnncuWUrl0PQ", "Overall": "4.0", "Content": "This little burger joint was recommended by a local and they were right on. Since I was in Nashville I had to order the Tennessee burger. Coated with this jack Daniels honey glaze, topped with American cheese and bacon and some fried onion straws to complete delicious selection...this burger \"was money baby.\"  I added some homemade chips done nacho style. The meal made it a little hard to go back to work but definitely worth it. The service was nice and timely.", "Date": "2014-02-28", "Author_Location": "Summerville, SC"}, {"Author": "Corey S.", "ReviewID": "vV411F5hx8s2sCs2mRTyOA", "Overall": "5.0", "Content": "Atmosphere: 8/10 - It's casual, but nice.Noise: ModerateFood: 8/10 - Great taste; small portions!Drinks: I just had water, but good selection.Originality: 7/10Service: 10/10Cleanliness: 9/10 - Flies outside, of course.Price-Quality Ratio: You pay more than you get.  It's good, but a bit over-priced.Overall: 9/10", "Date": "2013-09-03", "Author_Location": "Round Rock, TX"}, {"Author": "Britt T.", "ReviewID": "LUpTTi41xUj2tPvLZ5NXOA", "Overall": "5.0", "Content": "This is the only place I will get a burger in Nashville. Great service, amazing food, and a good selection of craft beers. We always have a wonderful experience when we go here.", "Date": "2014-03-30", "Author_Location": "Nashville, TN"}, {"Author": "Lacey F.", "ReviewID": "AZeEu0qPR-wib9CPWx5dTw", "Overall": "5.0", "Content": "I love meat but not a big fan of eating burgers when dining out. It's hard to find good ones. BUT, friends suggested an early dinner here for New Years recently. We got right in at a table in the bar area for the Tater Tot Drop!My husband and I have never ate here but being proper chunksters we checked the menu out online before going. We eat Gluten Free all the time so finding a place with GF buns was like heaven calling. Our waitress was Phoebe and she was GREAT! Super friendly and sweet. Draft specials were awesome and they even had Apple Cider on tap. Super great. Food came out fast and I am telling you I died and went to heaven with the Mac n Cheese. (I cheated on the GF diet a bit). Woops!We both got a \"Buy the Farm\" burger and they were excellent. Matt appreciated the fact that they can cook a burger perfectly (hard to find) and I liked the fact that it was deliciously amazing. It is hard to get me to love something but I am hooked on that burger. I might never venture outside of it. If we lived closer I would be in trouble. Milkshakes are great, I had a non-spiked and my husband went spiked. All said after apps, 2 meals, added sides, beers and shakes we walked out at $70 for the meal and $20 for the tip. $90 out the door. Great service and awesome food I will be back for sure. Probably won't eat so much but heavens, had to try a lot!", "Date": "2014-01-06", "Author_Location": "Nashville, TN"}, {"Author": "Boyd D.", "ReviewID": "TrBx25OxrnSR7T14AfV1NQ", "Overall": "4.0", "Content": "This place serves a delicious burger.  100% angus beef.   I've been here 3 times and had great service and a delicious burger each visit.", "Date": "2014-04-12", "Author_Location": "Brentwood, TN"}, {"Author": "Josh L.", "ReviewID": "AKueY1PRlNbxyadvIk1izw", "Overall": "4.0", "Content": "Been a couple of times and the food is great. Service is ok but not as impressive as the food. Had the Burger Republic and The Farm and they were both great. Truffle tots are good and something a little different. Will be back for sure.", "Date": "2014-05-31", "Author_Location": "Nashville, TN"}, {"Author": "Kristina L.", "ReviewID": "MoiBrYjzezv0zkkWpIWcyQ", "Overall": "4.0", "Content": "Upside:  Tasty burger cooked the way I want with plenty of topping options.  Alcoholic shakes.Downside:  We dined inside and there a lot of flies (both alive and dead).  I was seated next to the window and there were five dead flies right next to me - YUCK!!Other than that, you had me at jalapeno popper burger....  And you'll cook it the way I want it cooked...  Bless you, Burger Republic.  A tasty, juicy burger with a thick slab of cream cheese and then topped with tempura fried jalapenos was my choice.  I went with the side of tots and the salted caramel shake with house-infused espresso (Tito's!) vodka.  If I thought the slab of cream cheese was decadent, it had nothing on that shake!  It was a totally self-indulgent treat (albeit I did think the $8 price tag for it was a bit steep).Husband did the usual thing of ordering the Farm burger.  He too enjoyed his; however, his only caveat was that it was a bit runny.  No, not the egg; but the burger.  I honestly think it was the produce on the burger that was watery because the liquid on his plate was basically clear.  He had fries with his and his big complaint was that there were not enough of them.  Funny he said that BEFORE he started eating because he left some on his plate due to being stuffed.Yes, we both left in the hazy beginnings of a food coma.  Yes, we both went home and napped.  That, to me, is the sign of a happy, full belly.", "Date": "2013-10-02", "Author_Location": "Hermitage, TN"}, {"Author": "Larry S.", "ReviewID": "M5oJtYgEj8rU1lky2w-ruw", "Overall": "4.0", "Content": "As a vegetarian I will say that the veggie burger is legit. It's not just a morning star black bean burger. I got it with the \"black and blue\" cheese which was pretty strong but really good! Solid horseradish flavor with a good bite of blue cheese. Check it out even if you're not a vegetarian!", "Date": "2013-10-25", "Author_Location": "Green Hills, Nashville, TN"}, {"Author": "Jason W.", "ReviewID": "GROe6MqEQndB8iZvj9x_SA", "Overall": "5.0", "Content": "Even if I didn't live within walking distance, I'd be a frequent visitor.  Have never had a bad meal here and they have the best beer selection around.  The West Coast burger is the best I've ever had anywhere.  No joke.  The menu is pretty creative and they do a great job of changing it up every so often to keep thing interesting.  It is clearly a labor of love.  In my experience, the service has always been solid - both at the bar and the table service.  They are very accommodating with special requests and are always happy to let you sample a draft beer or two if you are unsure or on the fence about a selection.  The background music is always good, too.Finally, the ambiance is casual, laid-back, and family friendly.  The noise level is just right.  Quiet enough to have a conversation while still being able to hear the background music, yet still loud enough that you don't feel like everyone around you can overhear everything.This would be a great place to take a family for a quick bite, a group of friends to catch up or meet a buddy to watch a football game.", "Date": "2013-11-11", "Author_Location": "Nashville, TN"}, {"Author": "Tamela L.", "ReviewID": "3DMdtIWdwOybhaupUbT4tQ", "Overall": "5.0", "Content": "I don't even know where to start. This place blew my mind. My first time visiting this place was last night. I ordered their tator tot fondue. OMG it was so delicious. To eat I ordered the Tennessee burger with the evil s'more milkshake. Words can't describe how awesome my meal was. It wasn't overly crowed. I didn't feel like I was sitting on someone's lap, and my server (her name was Ashley or Amanda) was great. She was super attentive. When i ordered the tator tot fondue, my server was super surprised how fast I got them and so was I. So service is fast and great. I'm going to try to go here with my friend on Saturday for her bday.", "Date": "2014-03-14", "Author_Location": "Nashville, TN"}, {"Author": "Kirk P.", "ReviewID": "BUMtt2ajJG0WND1bhdA_Mg", "Overall": "4.0", "Content": "My wife and I went for lunch last Sunday. The food was flipping awesome. The service could have been better. We'll go back for the food and hopefully the experience will be even better with a waitress/waiter who cares. We both had the Black N' Bleu burger. She had the chips with it and I had fries. We didn't try a shake but plan to next time.", "Date": "2013-11-25", "Author_Location": "Nashville, TN"}, {"Author": "Cheryl G.", "ReviewID": "AOtYCGpC1ko8hjQMeAogOQ", "Overall": "5.0", "Content": "Great food, great shakes (both alcoholic and non) and great service. Fun atmosphere and great music. A bit pricey, so don't go there as often as I'd like with my family of four, but not willing to knock a star off for that.  The Tennessee Burger is heavenly, and I've had it each time I've gone. After reading some of the other Yelp reviews, I can't wait to go back and try the West Coast burger.", "Date": "2014-03-23", "Author_Location": "Brentwood, TN"}, {"Author": "Andrea R.", "ReviewID": "yELF6TecZcZzPJT8i5YLbg", "Overall": "4.0", "Content": "Upscale burger joint. Like Burger Up without the \"it's killing me to wait on you, why do you even exist\" attitude. And I like the burgers better, they're definitely a little bit bigger.  It's in Lenox Village, but good news, downtown snobs! They're putting another location in the Gulch soon, so you too can experience the joy of Tater Tot fondue. Seriously, I think the fondue is 40% butter, 60% cheese, topped with sour cream, into which you dip crisp Tater Tots. The Angus burgers are pretty dern tasty. I've had the Black n Bleu and the Taco Truck. Local beers on tap. The menu boasts milkshakes that have \"at least five scoops of ice cream\" and they will knock you out, with and without alcohol. Two words: food coma. Two more words: (small) outdoor patio. Free parking in the lots that surround the building.And now, the cons. It's a very small place. I wouldn't try to take a Meetup group here or anything. They don't do reservations on Friday or Saturday, because they can afford not to. However, they do take your number and text you when your table's ready, so theoretically you could go shop around the Village, or get a beer at The Other Place next door.", "Date": "2013-06-09", "Author_Location": "Nashville, TN"}, {"Author": "Randon A.", "ReviewID": "4eIqqtX7PtKhUoF_mP6kMA", "Overall": "4.0", "Content": "Cold War motif was not distracting. Kid and Family friendly. Wait staff was nice. They offer craft beers and \"spiked\" milk shakes. I had The Farm and Truffle Tots. The burger was cooked to order. I ordered a medium burger and I got a medium burger. The burger had fresh ingredients and the bread was a brioche that was light and did not take away from the burger. It also had a fried egg. Can't go wrong with that. The truffle tots were good. Could it be better if they used truffle oil? Not a complaint, just a question. Good place. Good burgers.", "Date": "2014-02-01", "Author_Location": "Seattle, WA"}, {"Author": "Chris C.", "ReviewID": "AHg3q-Xiru9FokuC-TjmWw", "Overall": "5.0", "Content": "I was in a burger club in NYC. This opening line should tell you a few things about the review to begin. I am fastidious, opinionated about my burgers, and have set out on a quest to satisfy my inner carnivorous cravings. My brother-in-law recommended that we try his favorite burger spot in his city. I had the chili chili bang bang with a milk stout and a PB&J slider with bacon jam, and we shared the tater tot fondu. I'm not sure if the stars aligned with great service, good beer, and being surrounded by family and friends but I was in a very happy place when the burger arrived. I took one look at the burger and inhaled a chili spicy meaty waft of first sent and I drooled on my self a little. (it was embarrassing) but I sunk my teeth into the juicy burger with just the right amount of bun and perfect match of toppings and jalapeño. It was one of the highlights of my trip to Nashville.Our server was awesome splitting the check 4 ways for our party of 10, getting us in promptly, and bringing all the food out together and in a timely manner. It was even the end of her shift, and she did a great job.", "Date": "2013-07-09", "Author_Location": "Kalamazoo, MI"}, {"Author": "Rebecca M.", "ReviewID": "bsbthC1Ez2WdqNHeqElx1w", "Overall": "5.0", "Content": "Dear Burger Republic, This is my love letter to you. I was taken to you on Saturday. I had no expectations. I made no comparisons. I just wanted to experience you. You took me into your burger buns with open arms. You graced me with your four cheese garlic burger, fries and a white imperial ale. You even provided tattooed hipsters to joke around and deliver my delicious meal with a smile and a lot of beard hair. I love you. Call me maybe?-R", "Date": "2013-06-11", "Author_Location": "Nashville, TN"}, {"Author": "Jessica C.", "ReviewID": "REHFUJt2CZoWapkJ3P61kQ", "Overall": "5.0", "Content": "This place is consistently awesome! The burgers are delicious and they have great home made gluten free buns that are super soft. All of there fries are not fried with anything else so are also gluten free. They almost always have a wait but it's worth it. Price is great too $11 for a hamburger and one side. They also make all there burgers with chicken or a soy patty if you wish.", "Date": "2014-01-28", "Author_Location": "Brentwood, TN"}, {"Author": "Ashley P.", "ReviewID": "GsDD8e2HHpfHqcxE2f9v-Q", "Overall": "4.0", "Content": "So good, the burger was juicy and my waiter was very helpful and friendly. There was a great beer selection and I will have to go back on a weekend to try them all. I was excited that they had multiple brews from Victory, which is a nice taste of home. I went to college right down the road from the Victory brewery. They actualy got medium done well, not too rare and not too well done. Its a little off my beaten bath but I will seek it out again.", "Date": "2013-08-20", "Author_Location": "Nashville, TN"}, {"Author": "Felicia W.", "ReviewID": "SYUIIRM2hEb-gbh3h0K3UA", "Overall": "5.0", "Content": "Burger Republic... how I love thee..... let me count the ways....1. Davey Jones. Hands down the nicest, coolest, sweetest manager on the planet. I busted in with my service dog Tank at my side, and he responded the TOTAL OPPOSITE of a certain burrito place that's in the same strip mall... he was kind, compassionate, and totally onboard with my pup being inside. Thumbs up! (even though it IS the law LOL)2. Tater Tot Fondue. Where have you been all my life? Bathing suit schmathing suit. I'm indulging.3. Tank chowed down on a plain old burger with american cheese and is now in doggie food coma. He WOOFS it very much!4. I'm not a burger girl... but DAMN IT you've got me hooked on the chicken caprese sandwich. YUMMMMO!!!I love you Burger Republic. Maybe a little too much..... 3 times in one week.... sigh....", "Date": "2013-07-15", "Author_Location": "Toms River, NJ"}, {"Author": "Katie I.", "ReviewID": "neR-ixeWVWaYIlBDynO5-A", "Overall": "4.0", "Content": "Overall I feel it deserves 3.5 stars, but I went with 4 based on the spiked milkshakes. They have a great variety of pretty inventive concoctions both non-alcoholic milkshakes and then spiked. I wanted to try the Reese's and the Irish, but they were out of both. Apparently they make their flavored infused vodka's in-house and they had run out. Oh well, the nutella one it was, and it was delicious! Couldn't really taste the alcohol, and it most definitely didn't give me any sort of buzz, so I wish they had kicked it up a notch in that dept. So thrilled by the milkshake, I was stoked for our entrees. However, the burger, to me, was good, not that great. I went with the Burger Republic burger which was smoked gouda, Benton's bacon (points for that), grilled onions, lettuce, tomato,. Excellent bun, juicy burger- a tad thick, but cooked nicely. It was almost too juicy (aka too much fat in meat) that it just saturated the brioche bun. Don't get me wrong it was very delicious, but I still think the Pharmacy has a superior burger. The truffle tots were a bit overpowering to me- the regular tots tasted better. The tots were nothing fancy, just regular old tater tots. My husband had the farm burger, which he enjoyed. We also tried the Benton's bacon mac & cheese. I am definitely a mac & cheese snob. This was one was a white mac & cheese, not very cheesy (needed more of a sharp cheddar) and it was very milky/runny. It would have been great had it been baked and congealed more. The topping was good, that is where the bacon and crumbly topping came in. Tasty, but not mind-blowing. My kids wouldn't touch it. I would rate this in the top 5 burgers in Nashville. I think Pharmacy and Fido come before this place. Definitely a good spot, family friendly. The prices were reasonable, and they also had a great beer selection. I don't think I'd drive this far out again to this location, but I will definitely go back to the Gulch location next time.", "Date": "2014-02-02", "Author_Location": "Nashville, TN"}, {"Author": "Cristy H.", "ReviewID": "E8ELUEerLu33RsIHuIbKdg", "Overall": "5.0", "Content": "This place is a great addition to Lenox Village.  The food is excellent!  The milk shakes are worth every penny - yummy!  Service is good and the staff is very friendly. I definitely recommend checking out this restaurant!", "Date": "2014-02-24", "Author_Location": "Nashville, TN"}, {"Author": "Tran T.", "ReviewID": "y_oaNtigqXfowt9yqkr2pg", "Overall": "4.0", "Content": "I saw many good reviews and couldn't wait to try this place out. They for sure did not disappoint me. I love their extensive craft beer selection. My waitress recommended me the Hap & Harry's TN Lager and it was excellent (very light) since it was too early for me to get drunk hah. I had a hard time to choose between the Hawaiian or the Taco Truck, which everyone raved about. At last I decided to go with the Hawaiian (medium well beef, pineapple, avocado, and grilled onion) and asparagus (veggie of the day). Hmmm the burger was sooo yummy and juicy!! Definitely the best burger I had so far (BETTER THAN IN-N-OUT!). However, the avocado slices were so big, every time I took a bite, they fell out. It'd be nice if they cut the slices thinner. The asparagus...well it's boiled asparagus lol don't expect much. My friend had the Tennessee and chips and he said they were good. There were plenty of chips and they were very crispy! The burgers here are pretty big, so if you want to try out the appetizers, order one burger and share. Service was excellent. My waitress was very attentive. I will come back to try out the Taco Truck and may be some of their milkshakes!2013/#25", "Date": "2013-05-01", "Author_Location": "Nashville, TN"}, {"Author": "Jess R.", "ReviewID": "V3CoEq0xYYbkNLFhTwwkZw", "Overall": "2.0", "Content": "We went on a Saturday afternoon and were very pleasantly greeted at the door (by the owner?) and then headed to the bar.  The location and parking are good and décor inside is nice but I detest barstools with no backs.  Luckily it wasn't too busy so I switched out my stool for one of the chairs in the lounge.For food we had the tater tot fondue and then split the Four Cheese Garlic Bacon burger.....not sure what all of the hype is about.  The burgers were flat, small and super greasy. There is nothing about this place that makes me want to go back.....service and food were mediocre and then the bar stool thing just kind of pushes it into the \"no\" category.", "Date": "2014-01-27", "Author_Location": "Nashville, TN"}, {"Author": "Jamie L.", "ReviewID": "NAsp12yUz8jffN1yoX7rag", "Overall": "5.0", "Content": "I absolutely loved this place and will be returning soon!!! The taco truck burger is amazing and the bacon mac n cheese is to die for!! :) great service as well.", "Date": "2014-03-03", "Author_Location": "Nashville, TN"}, {"Author": "Mark M.", "ReviewID": "ZVR62HarIxNq7f-cbKF6IA", "Overall": "4.0", "Content": "First let's put things in perspective.  I like Red Robin, but I went there on Friday, had a chili burger and an Iced Tea and the bill was $13.  So, I go to this Burger Republic place out in Lenox Village.  Not too far away.  We go early on a Wed eve to miss the Nolensville Rd cluster traffic.  Easy drive.  Nice place.  I get a burger and a Yazoo Ale.  The beer is awesome, the burger is very tasty with bacon that I can actually taste, cheese, caramelized onions that were wonderful, on a nice bun.  I decided to go old school with some tater tots.  Nice amount of very crispy nuggets of tater joy.  The bill comes to $13.  So, how does this compare to Red Robin (at the same price)?  Well, it really doesn't.  This burger was in another playing field.  It was very very tasty.  Did I mention I had a local beer with this (vs an Iced Tea at the RR)?  And tater tots were much better.  Same price.  Oh, and the service was great.  And the vibe was more chill.  I am going to try the Chili Chili Bang Bang next time.  And maybe more tots.  And another craft beer, or two.  Give it a shot if you are in the Brentwood, Franklin south Nashville area.  It's definitely a good time.", "Date": "2013-06-05", "Author_Location": "Brentwood, TN"}, {"Author": "Will M.", "ReviewID": "A_grzAdDAdPXoLbgIaot-Q", "Overall": "4.0", "Content": "I'd recommend Buy the Farm burger!  Tater Tots and the cheese sauce is really good.  Milk shakes are a treat.And you can call ahead for reservations.  Ordered Medium, got well done, still juicy and tender.  Really really good Burgers!", "Date": "2013-01-31", "Author_Location": "Nashville, TN"}, {"Author": "Robert U.", "ReviewID": "sYUxuwiAF-UCP0uWCh4NXw", "Overall": "3.0", "Content": "It's good.  I need to visit again.  Perhaps it could be a 4-star, but so far, it's 3.Front End:Their system of taking a mobile number and texting customers when their table is ready is great.  Their system sent me a text, then called me.  Worked great.My Food:My burger was pretty good.  The meat itself (the heart of any burger) was perfectly cooked to medium, as I ordered it.  It was uniformly pink inside, without any red, and was fairly hot when served.  The meat itself had a good flavor, and was just juicy enough, but not dripping with fat.However, the burger tasted fried, and was not grilled, so it lacked a little crusty texture and smoky flavor that I love so much.  The bun, while fresh, was room temperature, rather than being either lightly toasted (my preference) or at least warmed.My side of fries was good, with a nice, golden crunch on the outside, and tender, soft, fluffy potato inside.  However, I was served about one half of the Standard Burger Side quantity of fries.  Boo.Their milk-shakes are really good.  White chocolate/strawberry is great.  At $6, they aren't cheap.Our server was good, seemed to know his stuff, and was friendly, but just a touch aloof.  He also brought me the check before our shakes arrived.  Maybe he was just trying to keep things moving so we would not have to wait, but I found it odd.I want to try Burger Republic again.", "Date": "2013-06-18", "Author_Location": "Pittsburgh, PA"}, {"Author": "Gai P.", "ReviewID": "qgVBbb9lHd3ekeq4U0ms0A", "Overall": "4.0", "Content": "One of the top burgers joints in Nashville. Great craft beers selections on tap & uhmmm...yes, Burger Republic's alcoholic milkshakes brings everyone to the yard. The Truffle Tots were amazing!  Great place for families, there's a large bar with plenty of seating.  This place serves the Lennox Village community and is good so they stay pretty packed. Service is on par.", "Date": "2013-06-18", "Author_Location": "Nolensville, TN"}, {"Author": "Carlos T.", "ReviewID": "7KzSxFH2kU04BGH7VL0fUw", "Overall": "4.0", "Content": "Burgers were good service very friendly in the evening. The PB&J burger sliders took my rating up!", "Date": "2014-01-13", "Author_Location": "Nashville, TN"}, {"Author": "Sonya Smith W.", "ReviewID": "Z2DHA1OpYA9Y77G6WODQsQ", "Overall": "4.0", "Content": "Went here with our family and we enjoyed it very much! We've just recently moved to the area and wanted to try out something new. I had the TN Burger and it was so good!! No complaints about the food. Service was great too. My daughter and I split a milkshake called the \"ABC\" - Assassination by Chocolate... and it was AWESOME!  The only complaint I have it that there were a lot of flies/bugs flying around inside the restaurant, but with the outside patio and door opening and closing during a hot day, I guess that's to be expected.", "Date": "2013-09-04", "Author_Location": "Nashville, TN"}, {"Author": "Dan P.", "ReviewID": "xhzoqBZcWcLGWDhWPbqEKw", "Overall": "2.0", "Content": "My wife and I were disappointed with our Burger Republic experience after reading the great Yelp reviews. NOTE: we ordered take-out... maybe that was our mistake?  My burger (Oscar burger) was good, but I ordered fries as my side and only got 10 single fries.  WTH?  Is there a potato shortage?  The fries were okay - they're the thicker kind, whereas I prefer the thin crispy ones - but they were all right.  My wife got the Harvest Chicken salad, and it was more like chicken with a few pieces of lettuce on the side.  Seriously, it looked more like a half chicken breast on a skimpy bed of lettuce than a salad.  It was supposed to come with apples, but the apple slices were razor thin and there were only 3 of them... so maybe 1/16 of an apple?  She didn't like the dressing either; it was supposed to be a vinaigrette, but it was a very creamy greenish dressing (looked like a Green Goddess but not as good).  She's not usually very picky (the Southwest Chicken Salad at McDonald's is a frequent choice when we're traveling) so this was pretty bad.  So the food was a definite meh, other than my burger, which - while good - probably wasn't worth the $13 I paid for it.  $25 for a decent burger, a few fries and a poor excuse for a salad is a disappointing take-out experience.  It might have been better if we'd eaten there but based on this, we'll be in no hurry to go back.", "Date": "2013-03-30", "Author_Location": "Nashville, TN"}, {"Author": "Chris v.", "ReviewID": "Wpgox3_tgxKTbuaM7F0B9w", "Overall": "5.0", "Content": "Good burgers, filling. Nice beer selection and big shakes. You'll leave ready to take a nap, unfortunately I have to drive.", "Date": "2014-01-01", "Author_Location": "South Bend, IN"}, {"Author": "Joshua B.", "ReviewID": "OCy_XCO_DmdpfrTqrZ_xXQ", "Overall": "3.0", "Content": "The 'Tag Line' for the restaurant is 'Defend Quality'.  While I think the burgers are pretty good - I think the burgers have gotten smaller or something...?  I was there when they first opened and I'm almost positive they were bigger.  So, the quality is pretty good...but, bottom line - I've had better burgers - but, it has a great atmosphere, a solid burger, lots of beer choices, great milkshakes and tasty appetizers.That being said - the burger was still tasty.  I had the Tennessee Burger which has Maple Glazed Benton's Bacon, Jack Daniel's Honey BBQ Glaze, American Cheese, Memphis Spice Dusted Tobacco Onions and Smoked Tomato Ketchup.  I had them take off the Onions.  Wasn't sure what 'tobacco onions' is supposed to mean anyway.  Like I said - the Burger was pretty decent - but, it might have been too many good things on one burger.  Like, the Maple Glazed Benton's Bacon is good.  The Honey BBQ glaze is good.  The smoked Ketchup is good.  The meat itself was good.  I'm just not sure all these good things came together to make a 'great' burger.  I can't put my finger on what wasn't 'great'.  It wasn't the best burger I've ever had - but it was still solid.  As far as the other stuff goes:  The fries were average.  Seemed like kind of an afterthought.  The appetizer 'Tater Tot Fondue' was really good.  I didn't have a milkshake this time around - but I did have it on my first visit and it was excellent!  I had the salted caramel.  Yummy!  Salty and sweet, cold and creamy - damn - Now I am thinking about that milkshake and I want one now!If you go - you won't regret it.  Service was good.  Food was decent.  Lots of TV's to watch sports on.  Lots of unique burgers, beers, milkshakes and such.  So, go ahead - try it out.  I know I'll be back - and maybe my review will change.  Maybe I'll like one of the other burgers better than the one I had.", "Date": "2013-02-15", "Author_Location": "Nashville, TN"}, {"Author": "Jin H.", "ReviewID": "quuwYLta7DPbh5yVujq1OQ", "Overall": "4.0", "Content": "This is one of my two favorite burger joints in the Nashville area (the other is Gabby's).  The burgers are awesome and packed with flavor.  My only criticism is that the burgers seem a little small for the price they charge.  On occasion, I have ordered two burgers to curb my appetite.  However, Burger Republic has other redeeming qualities to off set this minor criticism. Their ice cream shakes (spiked and non-spiked) are outstanding and they have an excellent draft and bottle beer selection.", "Date": "2014-01-06", "Author_Location": "Brentwood, TN"}, {"Author": "Harold T.", "ReviewID": "Zjzh-yuH_u-FNBL7Ouy3Yg", "Overall": "5.0", "Content": "Burger Republic is the best!These guys know what they're doing. They specialize in artisan burgers, craft beer, and handspun milkshakes. The craft beer selection and prices are some of the best in Nashville. I had a pint of Flat 12 Half Cycle IPA for 3 bucks and the amazing Taco Truck Burger with a side of house chips for 12. I can't wait to go back!", "Date": "2013-07-22", "Author_Location": "Nashville, TN"}, {"Author": "Alyssa H.", "ReviewID": "spF7mWieEKV_-FSa6ZcoGg", "Overall": "5.0", "Content": "This is BY FAR the BEST burger you will have in Nashville, Tennessee.The proverbial icing on the cake is their incredible craft beer selection and their milkshakes, which can be ordered spiked or non-alcoholic. AND they have not one but TWO happy hours everyday, open-6 and 9-close. They have an amazing menu, with choices like Buy the Farm (egg, bacon & smoked gouda), The Angry Bird (buffalo chicken sandwich with bleu cheese on ciabatta), and a Chicken Harvest Salad (grilled chicken, apples, feta, shredded carrot, and candied pumpkin seeds with pumpkin seed vinaigrette). Their beef is Certified Angus beef, but I don't like to eat a LOT of red meat, so I've also tried their alternatives - chicken, turkey, AND veggie. Their veggie burger is the best one I've ever had. I would recommend trying it on their Hawaiian burger, which has grilled onions, pineapple, and avocado.Unlike the other burger restaurants in Nashville (you know the ones I'm talking about!), their service is unpretentious, friendly, and the staff is very knowledgeable about the menu.Life is too short to eat burgers anywhere else.", "Date": "2012-11-20", "Author_Location": "Nashville, TN"}, {"Author": "Daniel S.", "ReviewID": "gng7FQU6DD4duBYtuHzOhA", "Overall": "4.0", "Content": "Burger Republic has excellent burgers, but they also have some other good menu items like the Philly Egg Rolls. I think their fries are the best of the \"burger joints\" in town and the tater tots are great as well. Excellent beer selections as well.", "Date": "2014-04-08", "Author_Location": "Brentwood, TN"}, {"Author": "Kelly R.", "ReviewID": "G9VbxMDRzBeSSA3fwlp0GQ", "Overall": "4.0", "Content": "Excellent food, full bar and good atmosphere!", "Date": "2013-12-15", "Author_Location": "Nolensville, TN"}, {"Author": "Anna J.", "ReviewID": "nrZ0teF2LaVJ0hrwwr1MxQ", "Overall": "3.0", "Content": "The burgers here are not that great, but no bad either.  I've been here twice, the first visit was awful, my bacon was not cooked through at all, i had to send it back...but instead of getting a new burger, they just recooked that same piece of bacon and put it bk on my burger, lol, I don't really mind, as long as I get crispy bacon!I came here again yesterday for lunch, ordered the PB&J sliders since I wasn't really hungry and was intrigued.  This was actually really good.  The bacon jam was my favorite.  But it still lacked that wow factor, I just can't put my finger on it.The shakes here are very good, but they raised the price to 6.5!! It used to be under 5 when they first opened. Overall, just another burger place, not a knockout.", "Date": "2012-12-17", "Author_Location": "Nashville, TN"}, {"Author": "Jourden V.", "ReviewID": "lHat_t5OEGpGRycSFV7uvA", "Overall": "4.0", "Content": "What could be better? Craft beer, gourmet burgers, and milkshakes!Firstly, any restaurant that has a good selection of craft beer already has points in my book!Service was attentive, but not overly pushy. The atmosphere was inviting and bright.The food was great. My mom and I split the Republic burger with homemade potato chips. The burger was juicy and well-seasoned, and the chips were homemade and perfectly crispy. I wish I would have been hungry enough for a milkshake- I will definitely try one next time. I think this place is a must-stop if you're in the Lenox Village area!", "Date": "2013-04-30", "Author_Location": "La Vergne, TN"}, {"Author": "Sean R.", "ReviewID": "_XcYNP_4pbDbEbB0aG3V4A", "Overall": "4.0", "Content": "The only reason that BR isn't getting a full five star review from me, is due to their service. After 4 visits, it's just not getting any better and the excuse of \"It's a new restaurant and they're finding their groove\" is just NOT valid anymore. Let's talk about our beef with this place, both bad and very good!1. It's tough to find a good burger these days. Most often, when the server asks me how I want it cooked, I feel like it doesn't matter what I say because it'll get done how it gets done. At BR, Medium, truly means juicy! Lighter in the middle but you still get the good char on the outside. At BR, you get what you ask for.2. Variety. Simply put, the idea of a \"gourmet burger\" is always phenomenal. Seriously, it never DOESN'T sound good! With creations like the Holiday Burger (a turkey patty served up with a cranberry glaze and brie cheese), or their Taco Truck Burger (by far the best Mexican twist ever between two buns), all the way down to a good 'ol Shroom Burger with plump, mushrooms grilled to perfection, the menu continues to \"moo-ve\" in the right direction!3. Authenticity and Representation (aka: Vibe): Nashville isn't short on restaurants and certainly has it's fair share of establishments boasting burger elegance, best beef, food in a pharmacy, or the idea that 5 is somehow the magic number in the burger kingdom. I'm fine with any place having it's schtick but there's something inspiring about the fistful of burger and the authentic, nerdy, attention to detail BR puts forth with every creation. I enter the place thinking about the food, not the mood, which to some, factors in differently, but I say more power to 'em!4. It ain't just about finding the beef either. BR has an insane selection of hand crafted shakes and their drink selection is out of this world. On point again and proof that the nerds had it right to begin with!5. Lastly, the food doesn't just appear on the plate in front of you. Someone has to bring it out and unfortunately, BR doesn't come out on top with their service. I am no expert in the Food Service industry but I do know people, and I've even got a place reserved for me in the Awkward Hall of Fame. That's why I can spot someone who's out of their element a mile away. The servers at BR just seem...off. It's not that their not friendly per-say, rather just awkward. I know that reading people is hard but sheesh people! You work at BURGER REPUBLIC! You should be jacked about the chance to serve this stuff. Nothing, I repeat, nothing on your menu is lame. *End rant*In the Burger Republic, the people have spoken. It's no dictatorship here. That's why this burger joint is the best in Nashville. Period. In the burger republic,", "Date": "2012-11-04", "Author_Location": "Nashville, TN"}, {"Author": "Cass R.", "ReviewID": "pd-Be-SSvmXPJIXDN1605w", "Overall": "4.0", "Content": "The farmhouse burger is to die for. Draft beer selection is great. The Mac n chz portion is a lil smaller than I would like but very good tater tots and French fries. Service is a lil slow, but I can wait since the burger is worth waiting for. If u order medium rare make sure to stress medium rare bc it will prob come out medium.", "Date": "2014-01-01", "Author_Location": "Nashville, TN"}, {"Author": "Willie S.", "ReviewID": "Cl1gwvo6hP52RMRzpHpmnQ", "Overall": "5.0", "Content": "Ridiculously good burgers. I highly recomnend the Republic burger. Probably the best burger I have EVER had.", "Date": "2014-01-25", "Author_Location": "Brentwood, TN"}, {"Author": "Thomas J.", "ReviewID": "goWMXbr8-oXcGSY1-DzxVQ", "Overall": "2.0", "Content": "The thing about burger places peddling themselves as a burger place -- you expect a f*cking great burger.  This is a shake place with a burger problem. My partner and I went in on a Friday and were pleasantly surprised to be immediately seated.  The place was hopping at 6:30 and we expected to wait.  When the host summoned us to follow him, we were thrilled with our good fortune.Upon being seated, we were greeted by a relatively friendly server who asked if we'd been before.  Since this was our first trip, we listened as he told us his recommendations and appreciated his honesty when he said the tots are better than the chips.  They are.  He also asked if we'd like alcohol at least three times. I ordered the Fenway with tots, my partner the Classic, SANS onions with house made chips.  I opted for a Nutella Shake and my partner paired his meal with the Banana Foster shake. What came out?  A Fenway with fries and a Classic smothered with fried onions -- and also with fries.  We immediately alerted the server to the mistake to which he made no apologies and brought the burger back to our table with the onions hand picked off given the evidence of their impressions in the formerly melted cheese.  Thanks for that.  He did attempt to gain back his tip by bringing out a plate of tots and chips to make up for the fry snafu.  Because, you know -- that's what we ordered. The burgers themselves are all about the trimmings, and not about the burger .  The cheese and other toppings were all great - so was the bun - but this was a classic case of lipstick on a pig. (Or...errr...a cow?) The beef was fairly dry and packed little flavor.Burger Republic is another example of a burgeoning Nashville trend of restaurant mediocrity.  Vanilla food wrapped in a catchy name, a snappy logo and contemporary interior.   The packaging is pretty, but the gift doesn't keep giving.", "Date": "2012-08-27", "Author_Location": "Nashville, TN"}, {"Author": "Codey H.", "ReviewID": "Mca3ya3xQOyU25F8xUUmHg", "Overall": "5.0", "Content": "The \"Burger Republic\" is the closest i can get to that 'animal style' burger in Tennessee.  The shakes are phenomenal (and I've tried several).  Recommend the S'mores, the Mocha, and the Nutella.Staff is extremely friendly, the beer selection is impressive, and I just can't get enough.Oh, and Mac and Cheese with Benton's bacon.  awwww yeah.", "Date": "2012-10-21", "Author_Location": "Cane Ridge, TN"}, {"Author": "Jennifer C.", "ReviewID": "GUvLmF4l-A7FuW32gt5EWw", "Overall": "4.0", "Content": "The hubby and I are about to become parents, and last night, after having some maternity photos taken, we stopped by Burger Republic on our way home to try it out. I love that they offer some healthier alternatives than straight ground beef (i.e. ground turkey, chicken, veggie burgers, etc.). While the husband ordered a Hawaiian burger and fries, I opted for the Burger Republic made with ground turkey and a side salad.I'm not much of a burger gal, but I've gotta say I really liked the one I had here. The service was a little slow (they seemed to be slammed with not quite enough servers on duty), but the fries were hot and fresh. (Come on! I'm pregnant, and they smelled good.) My side salad was made with spinach, which was a bonus since I kinda hate iceberg lettuce. Obviously, I can't comment on the beers, but what I saw on the menu looked good.Overall, I'm glad this joint moved into our neck of the woods, and I'm sure we'll be back one night when we have a hankering for a solid burger.", "Date": "2012-09-11", "Author_Location": "Nashville, TN"}, {"Author": "Sandy C.", "ReviewID": "fzvM9urx0bDbuzoklqnNng", "Overall": "4.0", "Content": "I like this place a lot better than Burger Up. Staff is friendlier, food is better (truffle tots -- need I say more?), and the beer choice is wider (I think). Have been three times now, and have been consistently happy.", "Date": "2013-11-30", "Author_Location": "Brentwood, TN"}, {"Author": "Travis A.", "ReviewID": "bshfx6zzyx_p5AsZ0k-dew", "Overall": "2.0", "Content": "So this is what disappointment tastes like.  Either I walked in the door and was suddenly transported into a much different restaurant than the one people have positively reviewed, or some of your tastes in good food are absolutely terrible.The night there started off poorly.  My girlfriend and I walk in and stand there for several minutes before anyone even bothers to greet us.  No hostess, nothing.  Finally some guy walks up and seats us; no problem... I get that things like this happen.  We're seated in a booth in the bar area.I order the Chili Chili Bang Bang, and my girlfriend orders the Buy The Farm Burger.  We asked the waiter which was better... the fries or the tots.  He assures us that their tots are the best we'll ever eat.  Not being a fan of tots, I take the fries and my gf goes for the tots.  We also choose the Philly Egg Rolls for an app.  About 5 minutes goes by and someone comes out from the kitchen to tell us that they're out of Philly egg rolls.  Bummer... the picture on Yelp looked pretty good.  We sub out for the Crab Dip which is supposed to be like a spinach and crab dip.  It was very meh.Our food came out and it looked a little odd sitting on the small rectangular plates.  I guess they were trying to come across as somewhat sophisticated, but it just is terribly small and impractical for what they're serving.  I take a bite and BAM!  Nothing.  Bland as can be.  Really? For something that's supposed to have chili, chipotle aioli, fried onions and jalapenos complementing it, I really tasted just a bunch of garbage.  I actually had to add salt and pepper on it to get any flavor.  My girlfriend had a bite and concurred.  Had a taste of hers and it was average... nothing special.  I honestly think 5 Guys would have been a better choice.Oh wait... how could I forget the best tots in the world?  I wanted to smack our waiter for saying that.  Generic frozen tots and fries?!?  Seriously?!?  I don't think either of us ate more than 3 or 4 of them each.The only thing that saved this place from 1 star was their milkshakes.  We got a Nutella and a White Chocolate Strawberry to go.  They were good, but not almost $6 good.  I can hear Vincent Vega now.  \"That's milk and ice cream... they don't put bourbon or nothing in it?\"I wanted to like this place.  Turns out, it was a waste of $60.", "Date": "2012-07-31", "Author_Location": "Brentwood, TN"}, {"Author": "Scott F.", "ReviewID": "9cElmayYN85ZaIj1Y3Pfqw", "Overall": "4.0", "Content": "Forgive me, for I am experiencing a mild food coma as I write this review. I tried BR on a whim with a slight amount of trepidation, since there was always the chance that it could be just another hipster burger joint. While BR was indeed bountiful with hipsters that did not negate the quality of this establishment.Service was great. We were seated promptly and had our orders taken. Delivery of our burgers was quick. Absolutely nothing to complain about on the service side. Not a thing they should change.I ordered the Fenway burger and found it to be quite good. A friend that was there did say that his burger was just \"OK\" but I'm not really sure what you expect when you mask the flavors of the burger under extra cheese and catsup. Besides, I'm not entirely sure you can trust the opinion of someone who refuses to order from a counter just because it's Friday.Good service, good foo, good beer selection make Burger Republic a good choice.", "Date": "2013-06-07", "Author_Location": "Murfreesboro, TN"}, {"Author": "Miles M.", "ReviewID": "A_C2fED5NY0-QDwI8fskBg", "Overall": "3.0", "Content": "Great decor, attentive service, fantastic burgers, extensive beer selection, deeee-licious milkshakes, and TERRIBLE fries. Their motto is \"Defend Quality.\"  Well, this is me defending quality.  Stop serving crappy, frozen, Robert Orr Sysco fries!!!!! Buy potatoes.  Cut potatoes.  Fry potatoes.", "Date": "2012-05-25", "Author_Location": "Nashville, TN"}, {"Author": "Amanda C.", "ReviewID": "gCG6tUS7XNil86hpQvqjAg", "Overall": "5.0", "Content": "I am a big fan of Burger Republic in Lennox Village.  This is a great place to take a veg head or a fellow carnivore.  Both can eat happily in coexistence and leave very, very, very, full.First off, they hand pat their own burgers.  Their big seller is the Certified Angus Beef Burger.  It is very good quality.  My friend enjoyed her Republic Burger very much.  She noted the sauce was delicious on the burger.  The fries were very hot when they came out too, which was great.  I enjoyed the bean burger, farm style.  The bean burger is made in house and is very flavorful and has a good texture.  And when you go, you will see farm style comes with bacon and yes, I did get bacon on a veggie burger.  (I swear I could be a vegetarian if I did not like pork so much!)  We both chose the Brioche Bun for our bread.  Seriously, it is brioche...it makes everything better!  I had the republic chips with my meal and they were super crunchy and well seasoned.Now the best part about this place is they support CRAFT BEER!  There is a selection of Yazoo, Hap & Harrys, Gerst, Abita, Kentucky Bourbon Ale and some others.  I respect a place so much when they have fine beers like that on tap.  Word on the street is around 8 pm they pick a beer at random and it is put on special for about $3.  Now that is a good deal.If you really want to blow your caloric intake for the day or have a sweet tooth, GET A MILKSHAKE. (Luckily, I had both that day) Handmade on premise, they are so good.  I had the Mocha Supreme because I am a coffee freak:  It was so good.  My friend got the Peanut Butter Lover Shake.  The little Reese's on top were really cute.  However, the chocolate whipped cream on both of our shakes was a great surprise.  I cannot wait until next week when they start to offer spiked shakes!Also, the bathroom is clean....big props for that!  Great patio too!", "Date": "2012-06-20", "Author_Location": "Brentwood, TN"}, {"Author": "James H.", "ReviewID": "OE9XSaCzNZRaiHNFCo3CiA", "Overall": "4.0", "Content": "I'm a big fan of burgers, and didn't mind going out of my way for lunch recently to give Burger Republic a try. Glad I went and mostly good things to say. The shakes were something we had to try after reading so much about them and they didn't dissappoint. I got the white chocolate strawberry, making me feel like I was a kid again and going through an entire half gallon of Neapolitan ice cream after school before I found out that I was expected to share. The shake was just the right thickness and it tasted like a real shake, unlike those at lesser establishments.I got the Black N' Bleu burger and it was awesome. The whole wheat bun was most splendid and the flavor good. I will have to try a couple of other burgers there, but for now, I still rate Burger Up higher on the beef. The fries were good too. Another trip is in order for a better feel for the service. Based on the top notch burgers and shakes, I will definitely be back and bring friends. Next time will be in the evening so I can have a draft beer or 3. The choices look very inviting.", "Date": "2012-11-27", "Author_Location": "Nashville, TN"}, {"Author": "Jason W.", "ReviewID": "EpIhkS4ZgMwvJQzR33KuuA", "Overall": "4.0", "Content": "Love this place!  My husband and I frequent for their burgers but I also love their fried chicken salad!  You must also try the tater tot fondue!  Amazing!!!", "Date": "2013-12-15", "Author_Location": "Nashville, TN"}, {"Author": "Chris S.", "ReviewID": "lIYKjVlYdZEsu8YLOz6TTQ", "Overall": "4.0", "Content": "What can I say?  This is the best burger joint in and around town.  My personal favorite is the \"Fenway\".  It reminds me of a Philly cheese steak in the burger style.  Try it!", "Date": "2013-12-14", "Author_Location": "Antioch, TN"}, {"Author": "Cara S.", "ReviewID": "GcRxmSt-uo_GVwVGtTMgAA", "Overall": "5.0", "Content": "I have been wanting to rate this place since my first check in, but burger joints can be great at first and then disappoint you. So, I have now ate here 4times since I moved to Lenox Village. I have to say, they only surprise me, NOT disappoint me. There service it top notch!First off, we have never ate in yet, only carry out. So I am rating them based on my service with carry out. Upon calling, they always answer cheerful and ready to please. They take my order and confirm everything, then supply a total (with-out having to ask) and the time it will be ready. When arriving, they always have it ready, and everything you need is in the cute bag that you can reuse and keep. Its classy and they presentation is amazing. Take out here is better then MOST 5 stars places...Now THE FOOD. Here is what we have tried here:The ClassicAmerican Cheese, Lettuce, Tomato, Red Onion, Pickle Chips, Toasted Brioche Bun The FenwayBlend of Certified Angus Beef and Ground Hot Italian Sausage, Sauteed Onions and Peppers, Provolone, Soft Hoagie RollChili Chili Bang BangOnion Ring, Sam Adams Chili, Jalapenos, Chipotle Aioli, Monterey Jack My favorite out of these is the Chili Chili Bang Bang. Order extra chili (trust me) it tastes great on the fries as well. I always get my burger medium well. Make sure you tell them or they serve them more medium. I have tried the angus beef and the turkey. I will admit, the turkey, WOW!!! Best turkey burger hands down. They have several sides other then fries such as: Their sides:Republic Chips, French Fries, Fresh Daily Vegetable, Side Salad, Tator-Tots. I however, have to have fries with my burger!! That is a no brainer! I haven't had the pleasure yet to try one of their shakes, but I can't have much dairy, so until they make them dairy free I won't be able. With that being said, all there burgers taste amazing with or with out cheese!!! This is my NEW favorite GO TO burger joint!!! I highly recommend it!!", "Date": "2012-07-30", "Author_Location": "Nashville, TN"}, {"Author": "Geoff T.", "ReviewID": "yg_Q4XM7Qi3JQ1CkJZ32GA", "Overall": "4.0", "Content": "I recently moved to Lennox Village from my beloved Bellevue, and one of the deciding factors was the multiple restaurant options within walking distance. First stop: Burger Republic.Nashville has some great burgers, and I would rank Burger Republic toward the top. I had the Chili Chili Bang Bang. It was pretty tasty, and it had just the right amount of chili so that it wasn't extremely messy. Our table shared the Tater Tot Fondue. While the tots were nothing above what you'd get at Sonic, the \"Loaded Baked Potato\" fondue was fantastic - bacon bits, chives, and a dollop of sour cream mixed in. They didn't last very long, to say the least.I was EXTREMELY happy with the beer selection. I have my new watering hole. They have a great selection of craft brew draughts, and a revolving list of bottled higher-gravity beers as well. There's not many other places on this side of town with a beer list to rival Burger Republic.My server (I wish I could remember her name) was also a standout. She was helpful picking out our table's beer selection (A+ on the product training). When she found out it was my girlfriend's birthday, she pulled a few strings and got her a birthday milkshake on the house. That's great service.Speaking of shakes, I can't write a review of Burger Republic without mentioning the Spiked Shakes. Dessert + liquor: what's not to love? We had the Nutella and the Frozen Black Irish shakes. A lot of chocolate, and a nice kick to boot.Is this the best burger joint in the world? Probably not. Did I leave satisfied. Definitely.", "Date": "2012-09-05", "Author_Location": "Nashville, TN"}, {"Author": "Megan W.", "ReviewID": "TvZu6RrsDprPSyO8BPoJTQ", "Overall": "5.0", "Content": "For those wary of another hyped up burger place, DON'T BE. This place is worthy of any and all hype it receives.I came here with my momma a few weeks ago for dinner (as we live fairly close) in order to try out the new place in Lenox Village.We were seated very quickly (no waiting actually) and I was amused and pleasantly surprised to see the mix of aesthetics here. They have old Army-issue cartridge holders as caddies for the condiments and the overall vibe of the room is pleasing. The have huge plasma screens all over the place so that the men can watch sports (why can we never get HGTV on one of those things, huh?).Anyway, the food was DELICIOUS. I shared a Nutella milkshake with my momma and I was beside myself with happiness at how good it tasted (though I am trying to be dairy-free, it was too tempting to pass up). Their milkshake menu is going to expand to include 'spiked' milkshakes, one of which I may have to have because it has all sorts of chocolate in it. Anyway, on to the burger! I'm normally a picky eater and don't like lots of things on my food, but I decided to branch out by trying their 'Oscar Burger' which our waiter heartily recommended. It's a burger with cooked crab meat on top, drizzled in some Garlic Herb butter...um, let me just say it was FREAKING DELICIOUS. The crab meat added a little something extra to the burger flavor and the garlic butter set it off nicely. They even refrained from salting my fries, at my request (huzzah!).Overall, I had a wonderful experience here and will definitely return.", "Date": "2012-06-23", "Author_Location": "Nashville, TN"}, {"Author": "Dan S.", "ReviewID": "dooLiDUZyBQtA8mB8AyRGg", "Overall": "4.0", "Content": "Good vibe, cool mobile table announcement, really good beer selection and oh my the Buy The Farm burger is amazing.", "Date": "2013-08-17", "Author_Location": "Antioch, TN"}, {"Author": "Bob S.", "ReviewID": "P5HybiIfKsUVFlBHbnAG4g", "Overall": "2.0", "Content": "Still in search for a GREAT BURGER PLACE!!This place didnt do it!! But i think there better than burger ups. After spending 12 bucks for a burger and 6 dollars for a beer, there a lot better meals i can get in town for this price. If you say you cook your burgers on the menu to medium, well cook it pink, it was grey. My biggest complaint, althought it had more juice than other establishments. However there was no flavor to the Chilli burger, you could not taste chilli or Chipolte in this burger. The Milk shake was great!! But guys this is a burger place!! I can get a 11 dollar Chilli burger with a bake potato at Bricktops on saturday. They know how to cooi medium!! They have Chilli on there burger and the meat has flavor. Sorry, another one bites the dust!!! Go back to the drawing board!! Get your prices in line!!! Good luck!!", "Date": "2012-06-10", "Author_Location": "Nashville, TN"}, {"Author": "Katie Jane G.", "ReviewID": "-bl6M4TozYdvuu7SnKj4OA", "Overall": "5.0", "Content": "Fabulous. Took the fam for a quick lunch and it was burg-o-licious. Service was awesome in a non-cheesy way. Loved the food. The kids shared sliders. I had the Hawaiian via Chicken Sandwich (chicken, grilled onions, cheese, avocado), served  on a wheat bun, and a baked sweet potato for my side. Husband had the So-cal salad with chicken. He raved. Finished it off with a salted caramel shake. My 2 year old nearly licked the bottom of the glass like like my dog would. So glad this place is here. Check it out. Wish they had music.  this place is killer. A+", "Date": "2013-10-14", "Author_Location": "Nashville, TN"}, {"Author": "Sarah H.", "ReviewID": "6qdsvMjBwV8qkre84vBC6w", "Overall": "4.0", "Content": "I must say- this place is much better than Burger Up!I ate here last night and was impressed with the cleanliness, service and quality of the food. Both my boyfriend and I had two of their specialty burgers. I had a blue cheese burger with a side salad, and he had a burger with crab and hollandaise sauce on top. The burgers were both very good! Although, I wish our side salads and the burger patty (I didn't have a bun) had been a bit bigger. It didn't quite fill me up post workout. We didn't have one of their milkshakes, but they looked delicious. They also have 16 craft beers and they're getting their liquor license within a week or two. I heard their tater tots were good, so the waitress graciously brought us a couple to try. I was a little disappointed. I don't think they're made in house. As a previous reviewer wrote, I wish burger places would start making their own fries/tots- they just taste so much fresher that way! On a side note, the waitress told us all of their salad dressing are made in house. Anyways, I'd certainly give this place a try! The food was fresh, fairly fast, moderately priced. The service was good and they offer nice outdoor seating.", "Date": "2012-06-06", "Author_Location": "Nashville, TN"}, {"Author": "Alex S.", "ReviewID": "3CRnaZRkqD-OqbQA2HxWMg", "Overall": "4.0", "Content": "Burger Republic has good hamburgers. They should change the name to Good Burger. The Mrs. and I visited the other day. Ambiance isn't what I expected. The venue is smaller and brighter than I anticipated. The staff is friendly, and you could tell they were trying to create some kind of work place synergy, but at times it just seemed like chaos (I mean how many people does it take to bus 1 table?).I got the Black & Bleu burger, and at the recommendation of our server, I added some applewood bacon (GREAT DAY IN THE MORNING!). I haven't been on a Middle Tennessee burger tour or anything, but this was the best hamburger I've had in a long time. I also got a side of the horseradish aioli. This place has good milkshakes, but they could put that horseradish sauce in a cup with a straw and I'd drink it.My wife had the Burger Repulic, which she said was tasty too. It comes with a 'Republic Sauce', that added a kick. The fries...... :-/So, we concluded our meals with 2 milkshakes. Wifey got the s'mores and I opted for the salty caramel. Shakes are on par with the burgers. Delicious. My only problem is on my next visit trying not to order the same thing. Thumbs up.", "Date": "2012-07-26", "Author_Location": "Cane Ridge, TN"}, {"Author": "BT M.", "ReviewID": "WH_Q2Gbx1i7lrfXfgSSwrg", "Overall": "4.0", "Content": "When you have the word \"burger\" in your name, you better be good at making them.  Burger Republic gets that done, and then some.  We went on the weekend and it was  a 40 minute wait.  I'm not sure if the crowd was carry-over from the food trucks in the middle of the housing, but the wait was worth it when the burgers arrived.  There's an eclectic lineup of menu items, so be ready to go off the beaten burger path.  This place is now added to our list of \"go to\" places.", "Date": "2013-10-18", "Author_Location": "Franklin, TN"}, {"Author": "N S.", "ReviewID": "5MUo99SKiLv3SUpU_pXCBg", "Overall": "5.0", "Content": "Heard about this place on Pinterest and had to visit, a decision we did not regret! We had amazing service, amazing food, and left wishing we lived closer to visit more often. We traveled from California because we heard this was a favorite hidden spot of some of our favorite country music stars. When you walk in you can see some of their signatures on the wall. I highly suggest the on the farm burger with an egg and bacon... to DIE for! Also, we ordered the mac and cheese with bacon and sliders. I have never tasted anything like it. To top off our choices, we decided to try the nutella milkshake. Worst and best idea ever since we left so full and bummed we lived so far away from this amazing restaurant! I highly recommend this place! Thank you Burger Republic, we will be back!", "Date": "2013-10-16", "Author_Location": "San Carlos, CA"}, {"Author": "Courtney A.", "ReviewID": "19QtZagCZSwv7gfmwua2jA", "Overall": "5.0", "Content": "Best burgers in Nashville. My husband and I love coming here, especially on Sundays to watch football. Their shakes are also to die for.", "Date": "2013-11-15", "Author_Location": "Smyrna, TN"}, {"Author": "Daniel W.", "ReviewID": "5vvPDeHjhhVGm0p_OHnpMw", "Overall": "4.0", "Content": "One of the best burgers around. They have excellent milkshakes too. The inside of the restaurant is really cool. The decorations are interesting and fit the restaurant well. The only bad part is the service. The waitress was really slow and didn't show much urgency.", "Date": "2013-08-13", "Author_Location": "Nashville, TN"}, {"Author": "Ryan O.", "ReviewID": "5JeZyFjWGDfg5YLLpRJQQw", "Overall": "4.0", "Content": "I've been back to Burger Republic enough times now that I feel an update is warranted.My favorite burger by far is the \"Buy The Farm\". You'll see a take on this at many places around town and typically it includes just about every topping you can imagine. In this case we are talking about smoked gouda, fried egg, and bacon. It's quite a formidable burger because lets be real here people, everything is better when you put an egg on it.Another interesting item and probably my favorite on the menu is the PB&J Sliders. You might have heard of these as the Elvis burger made famous by the king himself and his proclivity to peanut butter, bacon, and banana sandwiches.  You won't find any bananas here but the rest of the ingredients are present -  angus beef, peanut butter, and Benton's bacon jam. It's pretty hard to go wrong with anything that includes Alan Benton's bacon and this is one of the more interesting uses I've seen with it. All I can say is that these sliders are delectable. Other things worth mentioning - beers are half price beers before 6pm. There is an impressive microbrew selection both in bottle and 14 or so on tap all of which can be enjoyed outside on the \"Patty-O\".  The taps are rotating so you'll never know for sure what they have but it's always a diverse list including some high gravity beers since obtaining their liquor license.  Now that football is in full swing they are featuring the Titans games on Sundays. Burger Republic really is a fully featured location - burgers, booze, beers on tap, a patio, and sports. I don't know much else you could as for.", "Date": "2012-09-16", "Author_Location": "Nashville, TN"}, {"Author": "Josh K.", "ReviewID": "gQQ8jtKYYR2NWBAvaygLHw", "Overall": "4.0", "Content": "Great burgers. Good beer. Great atmosphere. Perfect location for a good burger joint near our Lennox Village location rather than having to drive into Franklin or Nashville.  Oh yea, there milkshakes are AWESOME!!! Nothing like a good burger, fries and a milkshake :)Former Titans spotting - Eddie George was there when I went and he signed the wall. Cool dude.", "Date": "2012-06-15", "Author_Location": "Brentwood, TN"}, {"Author": "Jillian H.", "ReviewID": "A0zaDj8rPQbY4enMKhe2Hg", "Overall": "5.0", "Content": "OMG! We found this place by chance one day & we will definitely be back! The service some of the best I have ever seen & the burgers are awesome. The meat is never frozen & you can tell. AND their tater tot are to die for!", "Date": "2013-08-03", "Author_Location": "OLD HICKORY, TN"}, {"Author": "Chris M.", "ReviewID": "NIOSiM6Bj6oRFOIezVbrkA", "Overall": "4.0", "Content": "I have been here a few times.  The food is always very good but the service has been hit or miss. Sunday I went to watch the Patriots play and had a great experience.  The bartender (a young guy with tattoos) was on his game so to speak. He made sure everyone was taken care of quickly and he had a full bar.  If the service is improving to this level, I will be back more often. I wish I could remember his name but I will be back to tell him thanks again.", "Date": "2013-10-22", "Author_Location": "Nashville, TN"}, {"Author": "John R.", "ReviewID": "1sjKeZoN5CAakBTZgilWxw", "Overall": "2.0", "Content": "I have eaten here numerous times in the past. I took some time off, and went back today 10/5/13. Let's say I wasn't impressed anymore. It's a shame to because I have talked this place up.I ordered the burger oscar on this trip thinking I was going to get the burger that my roommate has ordered many times before. However what came out to me was nothing as I remembered. The burgers have gotten smaller, but no price reduction. I paid 12.95 for this burger that was suppose to have lump crab meat on it. Yet the burger I got had barely any crab meat. It was like shredded, smeared on the top, flavorless, and there was maybe a tablespoon on my burger. It honestly looked like something out of a can that you feed to your cats. I was looking forward to this burger because of my roommates past experience with it. This was my first try of it and it failed. The staff there, it's only saving grace now, are really friendly. That I never have a problem with. I can't justify paying 12-13 dollars for a burger a little bit bigger than a slider.", "Date": "2013-10-05", "Author_Location": "Antioch, TN"}, {"Author": "Christy Y.", "ReviewID": "wNmob2MJZwGSFckMOjhPkw", "Overall": "4.0", "Content": "Went on Sunday Afternoon right before church gets out.  Hamburgers are good, potatoes are skimpy. I thought we could split our fries, nope get your own 12 fries and lick the plate clean.  Oh well the servers were super nice and the vanilla milk shake was pulp fiction fantastic.  Went to the Zoo right after, nice day out.", "Date": "2013-04-22", "Author_Location": "Brentwood, TN"}, {"Author": "Mark H.", "ReviewID": "vve8yrcqYx3jDTgdCCxrhw", "Overall": "4.0", "Content": "This is not your fast food burger...cooked to order...unexpected twists...great toppings...you can substitute a very nice side salad for fries...great malts and shakes. with liqueur if you want (and I do!!!)..not the place to go if you are dieting...savored every bite...will definitely go back. Got a little star watching on this trip with 1/2 of \"Little Big Town\" enjoying lunch with the fam.", "Date": "2013-06-22", "Author_Location": "Brentwood, TN"}, {"Author": "Dustin R.", "ReviewID": "L0EC0GcuAHr5weI0uhP5IA", "Overall": "2.0", "Content": "My wife and I went here in the middle of the day with absolutely no one there but us.  As soon as we walked in, there was no one there to seat us, I actually thought they were closed.  They eventually sat us and we ordered milkshakes, which looked very good, but holy cow they were far too sweet and rich with chocolate syrup.  Not many people would have been able to drink that.  Then we ordered burgers and I ordered homemade chips with mine and she ordered a side salad with hers, but we both got tots instead, however they were very quick to change hers out for a salad when she asked, I just ate the tots anyway-nothing special-very greasy.  I do have to admit the burgers are very good and their bacon they put on them is top notch, but I was dissatisfied with the eating experience once we got the bill.  $39 for two burgers that come with a side and two shakes, that is crazy, especially considering all the mistakes they had made.  Anyways, if you are still reading this then you are thinking maybe you will avoid this place, I would recommend doing so.  There are so many better burgers places here in Nashville that are cheaper.", "Date": "2014-05-07", "Author_Location": "Nashville, TN"}, {"Author": "Jennifer M.", "ReviewID": "UZiMHbH3YVpas3QyL7svEw", "Overall": "5.0", "Content": "I had a few gift certificates to Burger Republic, so a couple friends and I went and checked it out yesterday for lunch.  Everything was really good!  We had a couple Classic burgers, a Chili Chili Bang Bang, tater tots, and some crab dip.  Everything was great!  We didn't have any room left for milkshakes, which is regrettable, since they looked awesome!  The tater tots were the best I've ever had. The service was also great.  Totally satisfied!", "Date": "2013-03-31", "Author_Location": "Nashville, TN"}, {"Author": "Meredith H.", "ReviewID": "suYifRXRypnBfSRh8VVBDw", "Overall": "5.0", "Content": "I heart this place and I'm going back!1. Restaurant was super clean. It was open, lots of space, plenty of seating and I like how it's decorated with ammo boxes. Never seen that before.2. We were seated right away at noon on a Sunday (Fun fact: It is a sit down restaurant. I thought it was like take out or whatever. It's not!)3. Davey was our server and he was rad. He was funny and sarcastic. We started out with a party of 2 and after we checked in on facebook three more people came and joined us and Davey was like, no sweat!4. BURGERS = YUM oh my gosh I don't know what they did to this burger but it was made by angels and assigned by heaven to be the tastiest burger in all of Nashville.5. Milkshakes - they have regular and PARTY where PARTY equals ALCOHOL. I saw a Nutella milkshake on the menu. They also have an Reese Peanut Butter malt with vodka. oh dear!6. Prices were reasonable. I got a drink, a shake, burger and fries and spent about $18 pre tip.7. The menu also has a thorough list of beers, many are locally made. 8. My only issue (which was really not that big of a deal) was that after we were seated we waited about ten minutes before he took our drink order. Other than that, Perfect!!", "Date": "2013-06-23", "Author_Location": "Nashville, TN"}, {"Author": "Carolyn S.", "ReviewID": "j3YlBvhUrIq4RCxzcEgAzg", "Overall": "4.0", "Content": "Good beer selection and burgers are pretty good, fresh fries. Service was a little slow and lacked attention, but I'll be back for the food.", "Date": "2013-04-07", "Author_Location": "Nashville, TN"}, {"Author": "Matt C.", "ReviewID": "C05hGeLZy9d8JkrcbaNY1Q", "Overall": "4.0", "Content": "This place is always pretty good, a bit pricey for what it is, but good.", "Date": "2013-07-20", "Author_Location": "Nashville, TN"}, {"Author": "Steve J.", "ReviewID": "vFdfk2htxGdS_0a3RohG5g", "Overall": "4.0", "Content": "My first impression was the hostess opening the door for me, Nice touch!   Very friendly employees, fast service and a nice atmosphere for a burger joint. I had the classic burger with homemade chips. The burger was cooked as requested and very tasty.  I ordered the burger without cheese and without a bun (which is unusual) and it was delivered correctly and within 5 - 10 minutes of my order.  I really liked the homemade chips.  Very crunchy with a great potato flavor.  However, they may be too crunchy for some people.They had 10-12 specialty beers on tap and they were half price until 6pm. Overall, I really liked this place and will visit again!", "Date": "2012-06-11", "Author_Location": "Nashville, TN"}, {"Author": "Melissa B.", "ReviewID": "X0g1BDB3UKT0iHmVB3evMQ", "Overall": "4.0", "Content": "Saturday at 5pm on April 27th, Tony and I decided to satisfy our Burger NEED!!!Location and Size is everything! Tony and I decided to try something new to satisfy our Burger Need..and you know how I like NEW restaurants and trying New Foods. Even though I don't profess to be a big BURGER person, I had a craving every now and then especially since I ate the BEST HAMBURGER IN THE WORLD IN FT SMITH ARKANSAS...so I was game for a new Burger Experience closer to home!!!      Tony and I arrived about 5pm after I finished working all day downtown and fought the Music City Marathon traffic and party goers to get out of town.  So after a long day of work, I was ready for dinner and up for trying something NEW!  Tony and I entered the side door and headed up front to the hostess to get seated, and they greeted us quickly and she was very friendly.       Immediately our server, Jake was at our table smiling and asking for a drink orders and giving us our menus. I asked for a minute and Tony gave me a strange look...\"What are you doing?\"..I turned over the menu and pointed to all the different interesting names for the micro brewery beers and he shook his head...\"NO..why fix something if its not broken\" and besides I never like them...so what do you think he ordered...Yep that's right BUDWEISER in a bottle...I pointed out 2 or 3 that sounded really good from the descriptions but could not turn his head..he is loyal to Budweiser...you got to love that!!! I ordered the Unsweetened tea with lemon and lime..I would have loved to try a few of the micro brews but I can't handle beer anymore, so I only get to dream of it...lol !!!     While Jake was gathering our drink order, we were reading the menu..One of the things we noticed and like immediately..the choices are NOT THAT LARGE...too many decisions can cause issues many times...Quoted by the Great Chef Ramsey..so we like when a menu is simple and offering some really interesting choices..I couldn't decide between three different burgers...1. Chil Chili Bang Bang, 2. Buy the Farm and 3. The Taco Truck...so I had to play \"eeny meany mine-ee mow!\" to make my decision. The winner was the Taco Truck with French fries and Tony opted to choose \"The Fenway\" with a side of Tator Tots. So we were happy with our selections.    Jake brought the food order rather quickly after the drink order, the service here was friendly and fast...and with the customers lining out the door to be seated, we could understand WHY!!!      Once the food arrived, I took my photos and then began dividing up the food. Tony took half of mine and I took half of his..that's the way we do it and we enjoy trying our foods this way..Tony's Fenway was 100% Angus Beef mixed with Spicy Italian Sausage and seasoning and then topped with grilled onions and peppers with cheese and a Brioche bun..It was very good!!! So juice and grilled to Medium (pink in the middle) perfection. If I could change one thing I would have added a smokey BBQ sauce with a bit of heat to give it that sweet and tangy taste..but truthfully it was very good.      These burgers looked wonderful So full and tall showing all the toppings and something you would notice on a TV Commercial...they were very EYE CANDY PLEASING!!!! The Taco Truck burger was topped with Pepper Jack Cheese, Jalapenos, Sour Cream, Guacamole, lettuce and tomatoes...and OMG..it was so good!! Right from the first bite...It was like eating a TACO..it was amazing and in fact MY FAVORITE of the two..Now even though both were good and the TACO TRUCK my favorite thus far..when I go back I will definitely try one of the other two burgers that I wanted but had to forfeit. I have to admit, Neither of these were the BEST Burgers I have ever eaten, but they are worthy of a 2 thumbs up and IF you are in the LENOX VILLAGE AREA and want to try a great restaurant with Above Average Burgers...GO TO BURGER REPUBLIC !!!! I will definitely go again !!!", "Date": "2013-04-28", "Author_Location": "Nashville, TN"}, {"Author": "Toya R.", "ReviewID": "RM3-5vjQvOShi-wlrMvFFw", "Overall": "5.0", "Content": "Best burgers ever with excellent customer service...Ask for Chelsea as your server she was great...James the manager showed excellent customer service by giving us a free Milkshake which was a blessing and a great sweet treat...definitely go check this place out it's a great spot!!", "Date": "2013-06-24", "Author_Location": "Antioch, TN"}, {"Author": "Abi P.", "ReviewID": "18qz2hr3bXjDAocoYtrAvQ", "Overall": "5.0", "Content": "Yum- Just tried the new Gulch location - milkshakes and burgers are just as amazing as Lenox Village! Thank you for bringing this to the gulch!", "Date": "2014-01-27", "Author_Location": "Nashville, TN"}, {"Author": "Allison B.", "ReviewID": "QxlXaF0ZljbFtzgB7PGn3w", "Overall": "4.0", "Content": "I'm a fan. The burgers are super tasty and there is a good variety of toppings. I got the garlic burger the last time I was in there and it was super awesome. I've tried several of the burgers and they are all good. I usually get tater tots as my side but the chips are really good too.", "Date": "2013-05-14", "Author_Location": "Nashville, TN"}, {"Author": "Michelle P.", "ReviewID": "MnzzJgJ2aYEKlvafiWms3w", "Overall": "2.0", "Content": "This was the WORST burger place I have ever been to. I will never return. Our waitress was very nice. Although, her FAKE enthusiasm was a turn off to me. Lets just get to the real...the burger had no seasoning. Not even a mere dash of salt and pepper. Beef doesn't need much but it does need that. I asked about the fries and our waitress compared them to \"McDonald's\" fries. Which is a major foul. She should be talked to about that. I ordered the house chips and they were pretty cold. I expected them to be warm sine they were of \"kettle chip\" variety. They tasted like burnt potatoes. Back to my burger, it was supposed to have an Aioli Mayonnaise. I didn't taste anything remotely close to it on my burger. The only thing I tasted on it was the fresh lettuce and tomato. For a burger that cost $10.00 this place should be ASHAMED. I will go to Pharmacy or heck even Five Guys before I ever go to Burger Republic again. Here's a hint. Save on the ambience and work on the food.", "Date": "2012-12-04", "Author_Location": "Nashville, TN"}, {"Author": "Laila S.", "ReviewID": "eZJ9e-CbylvqnFNjiXcfCw", "Overall": "3.0", "Content": "I hate to do this, as our server was great (sorry, I think her name was Catlin?) anyways it was Friday and I know Fridays are busy and that's cool, so i didn't mind having to wait 10 minutes when I got there with a table for 2 at 6pm. The 2 girls running the front receptionist were cute but it had to been their first job. they were looking around and around (and around) looking for tables...not moving just looking. They decided that they could split the 2 tables that were right in front of their faces into to 2 table tops AND even though i was first in line they gave the better table (the one more IN the restaurant) to the couple that came after me. ok, i forgive you. got our table and since it wasn't lunch time, i was Oh so ready for a flight of beer. The first beer was very bitter, but it was still pretty good and im and expert so i push on through. :) My friends glass though was chipped and/or melted (this is what the server though?) so they gave a new one...ok that will work. So now comes in the dinner rush. It is now 6:30 and my friend and I are now dining with people's asses...pardon my french, but literally their butts were up against our tables...not a good thing. Then the staring started, i know everyone is hungry, so were we, but to stare us down like eat faster eat faster, not cool.I got the Burger Republic burger + egg = my favorite. But due to the cool door and the butts at the table, not only did the egg get hard and gross, but it was gross eating with all those asses...if it were for the flight off beer that took the edge off, I was about to flip out. Like i said before our server was funny and nice, so she helped out but really? at table in the waiting area is pure hell... they need to get a screen or something! awful awful awful", "Date": "2013-01-07", "Author_Location": "Nashville, TN"}, {"Author": "Michelle K.", "ReviewID": "gotNEuKlmeUXotYZjvPCjg", "Overall": "4.0", "Content": "Nice atmosphere with inside and outside seating.  Good food.  Excellent shakes.  Service can be a little slow at times, but still friendly.", "Date": "2014-02-02", "Author_Location": "Nashville, TN"}, {"Author": "Angela B.", "ReviewID": "pVrWVWwRiUoqOSIVJ2mpcw", "Overall": "5.0", "Content": "Phenomenal! I had  the Tennessee burger & it was, hands down,  the best burger I have EVER tasted. The maple glazed Benton bacon was outstanding alone- perfectly crisp, smokey and sweet- the bacon  with the homemade bbq sauce & fried onions;however,  was savory-sweet perfection! The staff was also very  attentive & kind.  Everything was just awesome! Really, what more can you possibly ask for?", "Date": "2013-03-04", "Author_Location": "Covington, GA"}, {"Author": "Caitlin N.", "ReviewID": "5u8epcNBpwowwMWZ7Enleg", "Overall": "2.0", "Content": "Ok, I actually really like their food. The PB&J sliders are life changing. But I've been annoyed by the poor service too many times. Difficult to flag down, not always sure of beer specials, weird apathetic attitudes sometimes, and clearly not very observant since my boyfriend and I sat in a bar booth last time for about ten minutes without any acknowledgment, even though servers kept passing by and we were right in the line of sight of a couple bartenders and ALSO a manager. Ugghh. So frustrating, so we left. Didn't seem to bother the manager too much. Same guy who, another time, spent like fifteen minutes chatting with new customers at the table next to us, giving tons of suggestions and lots of quality checks, but didn't even acknowledge our table. I swear I'm not starved for attention, but I'm in the industry and know how easy those quick interactions are and they make ALL the difference. I hope their service improves because did I mention those sliders?", "Date": "2014-01-10", "Author_Location": "Nashville, TN"}, {"Author": "Aaron W.", "ReviewID": "uAOazqVid6zN4AGHmzfS0g", "Overall": "5.0", "Content": "Stupid good.  Toss up between this place and the pharmacy...buy the farm is my favorite", "Date": "2013-12-22", "Author_Location": "Chattanooga, TN"}, {"Author": "Star T.", "ReviewID": "SUhIU8YSIG6NE3U5pxHbSA", "Overall": "3.0", "Content": "I enjoy the laid back atmosphere, and the beer selection is nice! The burgers are good, however nothing you can't make at home. The staff is well mannered, and I dig the mustaches and proper beards! The shakes are good, just a little on the sweet side. Overall, it is always a pleasant dinning experience.", "Date": "2013-06-07", "Author_Location": "Nashville, TN"}, {"Author": "Debra T.", "ReviewID": "Yoyqpm2-OljBF-Z3i7cc6w", "Overall": "5.0", "Content": "Hands down, one of the best burgers I've ever eaten. Do not shy away from the PB & J sliders. It's a slider with a smear of peanut butter and a dollop of onion jam.  Divine. I've sampled most of the burgers and my favorite is just a good old classic burger. All the milkshakes are amazing. I wish they would sell a shooter sized sampling. The service is perky, helpful and consistent. This is a great family place! But be warned: you will need to go multiple times to fully appreciate the unique menu.", "Date": "2012-12-19", "Author_Location": "Nashville, TN"}, {"Author": "John S.", "ReviewID": "ps7I2OH8I2HDoaZHG1PPFw", "Overall": "5.0", "Content": "It seems I finally found a great burger place in Nashville.... this really seems pretty amazing to me and the best I've been to so far here. Let's begin.So I actually found this place because we felt like getting a Nutella shake specifically, so searching Yelp for that yielded this place, which also happened to have amazing burgers. I had the Chili Chili Bang Bang, while my date had the Black N' Bleu. We just cut them both down the middle and shared, since they were both so good and we wanted to try as much as possible. The Chili Chili Bang Bang was a solid mix of (Sam Adams?) chili and monterey jack cheese and onions, with the burger cooked medium rare right below it all. Honestly, it was quite a mess, but SO good. Meanwhile, the Black N' Bleu was pretty clean, with blue cheese crumbles (obviously) but also cajun spice and onions. I honestly liked the black and blue burger more, but I really want to try the Fenway next time. As for the side, Tater-tots, so crunchy! Haven't had tater tots since middle school, but these were crunchy and delicious. I am a little sad they don't have sweet potato fries though.For drinks/dessert, we had shakes - the Spiked Nutella and the also a spiked Velvet Cake shake whose exact name I don't remember. They were both freakin delicious man, so smooth and cold yet not soft or melted. I preferred the velvet cake one, just because it had little pieces of cake that conveniently were sized to fit perfectly through the straw. Meanwhille, the nutella shake was just delicious because.... well it's nutella, its just always delicious. The consistency was great too though, just like the other one. Not too strong on the alcohol though, so I wouldn't order this mainly as a drink, I just like the kick.Overall, I loved the place and I'm probably on my way there again right now....", "Date": "2012-10-17", "Author_Location": "Dallas, TX"}, {"Author": "Bridget S.", "ReviewID": "Dv5hOznUdbxf2rLDZZ8anQ", "Overall": "4.0", "Content": "Great for lunch...a bit pricey, yet great burgers!", "Date": "2012-09-30", "Author_Location": "Nashville, TN"}, {"Author": "John B.", "ReviewID": "XthvapfBzEeGjTBoSAIxcw", "Overall": "5.0", "Content": "Best burger I've had....in Nashville for sure. Had the Fenway and tasted the Republic, absolutely amazing. Great service and wonderful atmosphere. We will frequent.", "Date": "2012-08-31", "Author_Location": "Antioch, TN"}, {"Author": "Leigh G.", "ReviewID": "3Uc7ecOhzYe_u5YGZh6XrA", "Overall": "5.0", "Content": "Ah yeah! Burger Republic is the joint! Took my fam here and we all loved it. I got the Fenway burger, and it was so good that it's gonna be hard for me to try out anything else there. We'll definitely be back!", "Date": "2013-01-05", "Author_Location": "Nashville, TN"}, {"Author": "Crystal M.", "ReviewID": "5jxCsubkS4b030yUOEr0Ww", "Overall": "5.0", "Content": "Love this place! Never a bad experience and we are there usually once a wk. I recommend the Philly steak egg rolls and any of the burgers. The pb and choc shake is TDF. Excellent selection of brews too:)", "Date": "2013-11-10", "Author_Location": "Antioch, TN"}, {"Author": "Riley M.", "ReviewID": "mRg2tMTMGsGFFxSqtoIlmA", "Overall": "5.0", "Content": "Loving the new beer selections and updated menu. I come here about once a week and glad it's so close, because it's awesome!", "Date": "2012-09-16", "Author_Location": "Nashville, TN"}, {"Author": "Michael G.", "ReviewID": "8auUba9QZgzZya-9fjy24w", "Overall": "4.0", "Content": "Back in the Nashville for a few days and I got to check out a newer burger hang out.  I was excited to see a solid selection of fine barley pops on tap including my personal favorite, Guinness.  Of course, I had to dive into one of their burgers, I opted for the Burger Republic which had Guinness braised bacon... naturally and a very tasty Vermont aged cheddar... the brioche burger bun finished off this fantastic burger.  From the locals I was hanging with they claim the restaurant has very high turnover and the service was casual, TN style.   I ended the meal with a fabulous holiday shake - pumpkin spice and it was absolutely delicious which I shared with a friend with 2 straws... classic.  :)", "Date": "2012-11-28", "Author_Location": "Playa Del Rey, CA"}, {"Author": "Kendrick P.", "ReviewID": "kxoPpqPObzDEPBTYULBijg", "Overall": "3.0", "Content": "I write this review with guilt in my heart...Yelp friends I have a confession.....It's not easy for me to say this but, I cheated on my favorite sports bar \"The Other Place Sports bar\"..with \"Burger Republic\"!! ..THERE I SAID IT!!The Good: Nice atmosphere, very friendly staff but what took the cake for me was the AWESOME WINGS we ordered as an appetizer!!  I don't know how they make 'em but dang they were so good i thought my wife and I were about to come to blows over the last one!.lol Now as for the burgers well its a hit or miss for me. My wife ordered the The Classic - American Cheese, Lettuce, Tomato, Red Onion, Pickle Chips, Toasted Brioche Bun 8.95 and stated it was one of the best burgers she has ever had,..while i ordered the   The Burger Republic- Vermont Aged White Cheddar, Guinness Braised Bacon and Onions, Lettuce, Tomato, Republic Sauce, Brioche Bun 9.95 ....which was decent at best. Kinda lacked in flavor if you ask me.  Wifey's burger was not cooked well done like she asked but it didn't take long for them to rectify it and she was quiet pleased on how the new burger still had its flavor. The few tv's they had were cool, and the manager turned on the NBA finals for me, so customer service is on point!The Badd:  Not much to say bad wise, ummm I'm used to a more sports bar feel where you can hear the sound of whatever game your watching while the music is still playing. I did ask the waiter if it was possible to turn up the sound for the NBA finals but she informed me they didn't have that option and regretfully apologized. It was all good though! In conclusion: I will return for the wings, and even though I strayed from my favorite spot, Burger Republic still lacks in the really cool atmosphere, multiple TVs, pool table,dart board, and great staff the \"Other Place sports bar always offer.", "Date": "2012-06-18", "Author_Location": "Nashville, TN"}, {"Author": "Gabe L.", "ReviewID": "slAmGfCrWOfe_CQkelTcbg", "Overall": "4.0", "Content": "The burgers are really good and creative. The on-tap beer selection is great and I love the atmosphere of the bar. I'm not much of a milkshake person but my girlfriend loves every one she's had. The fries are are probably the worst part  - they should definitely reevaluate their potato situation. But that's it. Love having this place so close.", "Date": "2013-01-03", "Author_Location": "Nashville, TN"}, {"Author": "Katie Y.", "ReviewID": "qvnrxCVIOqeWzNIOGfaAFg", "Overall": "5.0", "Content": "Huge fan of this place. I've had about 5 or 6 different kinds of their burgers and never had a bad burger. Very unique concoctions. My fav appetizer is the PB & J sliders! I can't pick a FAV burger; they are all amazing. Staff is super friendly, place is very clean, and the shakes are made with REAL ice cream and are delicious! I go here at least once a week. Highly recommend going here!", "Date": "2012-11-09", "Author_Location": "Nashville, TN"}, {"Author": "Kristin C.", "ReviewID": "k7V1uTa3mZxnfwxuY8RA-A", "Overall": "5.0", "Content": "Great service! The best burgers. Fresh menu!", "Date": "2012-11-03", "Author_Location": "Antioch, TN"}, {"Author": "MIchele R.", "ReviewID": "UmqxGAxo-wAEBcMcbyvplA", "Overall": "5.0", "Content": "Thank you all at Burger Republic for an incredible experience for my out of town guests. You are awesome! Thank you Thank you...Michele & Tony", "Date": "2012-12-20", "Author_Location": "Nashville, TN"}, {"Author": "Barbara C.", "ReviewID": "NqcSNcNpI4BreDAblhjxBA", "Overall": "5.0", "Content": "This is the first place that has done a Black Bean Burger the correct way!  Yummy and good to the last bite!!", "Date": "2012-06-04", "Author_Location": "Nashville, TN"}, {"Author": "Lovette B.", "ReviewID": "d0Smgg_1bECIad8etLiL1Q", "Overall": "4.0", "Content": "First let me say, my husband and I are always on the hunt for a great burger in Nashville.  We have been to all the usual suspects.  This is one of the best places in town.  The atmosphere is fun, although there will be a wait on a weekend night.  The service was great.  Our waitress made sure we were OK and even gave us a glass of warm milk for my little one.  The food was great!  If you are looking for a specialty burger (i.e. lamb, bison, oyster) then you will still have to go to Burger up.  But for just a straight up great burger this is the place.  Lastly, the spiked and regular shakes.  This place has some excellent shakes!!!  The spiked shakes put them over the top!  They are in great flavors and delicious plus the alcohol is an enhancement not just overpowering.  So, if you don't want to deal with the hipster crowd (and on top of each other seating) at Burger Up or the ridiculously long wait at the Pharmacy but still want a great burger you should go to Burger Republic.  P.S.  I am glad there is finally a great burger place on my side of town.", "Date": "2013-03-14", "Author_Location": "Nashville, TN"}, {"Author": "Chris C.", "ReviewID": "833ulzONkO7XtYzSgmT0UQ", "Overall": "3.0", "Content": "I have gone to Burger Republic twice since it opened a short time ago and have been pleased both times.  I have had the black and blue burger and it was good but it did not compare to the Taco Truck Burger.  This was one of the best burgers I have had in my life and that is saying alot.  I think the beer selection is great but they could stand to come down on the prices a bit.  The spiked shakes are a unique offering and I suggest splitting one with a friend or spouse.  The wait staff has been great both times and there has been little to no wait to get in.", "Date": "2012-10-06", "Author_Location": "Antioch, TN"}, {"Author": "Matt M.", "ReviewID": "NzDxEzNA8av6UTJd00uFxw", "Overall": "5.0", "Content": "Burger Up was my favorite burger joint in Nashville... until I found this place. EVERYTHING on the menu is awesome. The bartenders know their stuff and the beer selection is top knotch. I just so happen to have moved a few blocks from this place so now I go there at least once a week. Also, try to milkshakes, they are delicious and some are liquor-tastic!", "Date": "2013-08-26", "Author_Location": "Nashville, TN"}, {"Author": "Nomar A.", "ReviewID": "xU_5QYkZOhxBw_hr1hl2Nw", "Overall": "5.0", "Content": "Went last night with a large group. Quickly seated. Great beer lists for a place this size. Prices were reasonable for the quality burgers we had   Top 1 or 2 burgers in town for sure.  The real winner was the milkshake!  Crazy good (S'Mores)   All in all great time and we will be back!", "Date": "2012-09-08", "Author_Location": "Hilton Head Island, SC"}, {"Author": "Kyle K.", "ReviewID": "AKskhbJP_L-NDf57BkX7HQ", "Overall": "4.0", "Content": "Great high gravity beer selection. Only complaint is how crowed you feel during your meal.", "Date": "2013-07-22", "Author_Location": "Antioch, TN"}, {"Author": "Meg P.", "ReviewID": "AiKjJBzNdtMYfByLGiOk_Q", "Overall": "3.0", "Content": "im going to start off by saying the burgers are amazing! the burgers and salmon burger is cooked to perfection and im a big fan of the tater tots. i tried the nutella milkshake and it was heavenly. I could never complain about the food. however our service last time was horrendous! my husband and I were out celebrating his birthday and wanted liquor drinks. we only saw spiked milkshakes and beer on the list and when I asked our serve if they had a liquor drinks menu he looked at us like we were crazy and said \"no, we're more of a beer place\". the way he said it made us feel very uncomfortable for even asking. the only reason I could see you for not having a liquor menu is if you don't serve it! anyways well my husband ordered a margarita and it was fine and they were out of the beer I ordered I got something else. they were also out of the salmon burger. I get it sometime places run out of things. then they brought out my burger and my husbands was going to be \"right out\" once I was halfway done with my burger the server brought out my husbands fries and no burger. I was shocked. then when I was done with my meal and another couple minutes goes by and the server brought out the burger. by this time my husband's fries were cold. the server didnt appear phased and by this time we had to leave because we had our young child with us but to say th eleast it was not the way we wanted to spend a special occasion. I do not think I will be back here and if i am it would be for takeout only. I'm only giving there stars because the kitchen has their stuff together!", "Date": "2013-09-04", "Author_Location": "Clearwater, FL"}, {"Author": "Jerry C.", "ReviewID": "ZzKdM2Y1JRj_m8AwKWnzgQ", "Overall": "5.0", "Content": "Wow. Join the republic! Awesome burger, great Tots.  Meat was Tender, moist and cooked to perfection.  Wish I had room for seconds!  Staff was great, still learning tables -can't wait till they hit their stride!", "Date": "2012-06-15", "Author_Location": "Nashville, TN"}, {"Author": "Lori W.", "ReviewID": "-x4Q_jFWWY3XYgRVJYkoFQ", "Overall": "5.0", "Content": "I am drinking the most delicious salted caramel milkshake I have EVER has.  Thanks for being in the hood so that we get to have these treats.   L. Weber", "Date": "2013-01-12", "Author_Location": "Antioch, TN"}, {"Author": "Linda A.", "ReviewID": "UyHKSNqmpLcDohXQ7kKeEw", "Overall": "4.0", "Content": "First visit was a really good/fun experience!  First of all, our server was very knowledgeable about the beer selections.  My husband and I were going to both order the same wheat beer on the menu and our server suggested an alternative that was not on the menu for some reason.  So we ordered one of each...and the \"unlisted beer\" was definitely the better of the two...so YAY for our server!  (Wish I could remember his name).  Hub ordered the Fenway burger...and it really was wicked awesome!  I had the classic with.....BENTON'S BACON.  Delish!  Since we both had a couple beers, a milkshake would have been contraindicated so we'll have to try one of those next time.  Another thing we both really enjoyed was that we were not rushed outta there.  Game 3 of the NBA finals was on one screen and the US Open was ending on another and we cozied up and watched both.  It was a fun experience and we'll definitely be back...so nice that there are more and more choices near Nolensville!", "Date": "2012-06-19", "Author_Location": "Brentwood, TN"}, {"Author": "Rachelle B.", "ReviewID": "rVsWrA_1f2VYjKIUkMn1_A", "Overall": "4.0", "Content": "Casual environment. Really good burgers. Philly Steak Egg Rolls are really good. So glad there is a great burger place in town.. Way better than Burger Up", "Date": "2012-06-21", "Author_Location": "Dallas, TX"}, {"Author": "Lenox Village Area B.", "ReviewID": "FRBjswC7ODw8Kax9xbEnFg", "Overall": "5.0", "Content": "My wife and I have been to this restaurant over a dozen times since it opened and it just keeps getting better and better.  The atmosphere is wonderful, the service is great, and the food is outstanding!  The classic cheeseburger and a salted caramel milkshake make the perfect meal.  When our kids visit from out-of-state, the Burger Republic is the first place they want to eat.  A much need and appreciated addition to the Lenox Village Area.", "Date": "2012-08-29", "Author_Location": "Nashville, TN"}, {"Author": "Ann L.", "ReviewID": "B_67hRZn8_CH_NkcZLPe6A", "Overall": "2.0", "Content": "I prefer Cheeseburger Charlies for quality of food, service and affordability.", "Date": "2012-08-22", "Author_Location": "Nashville, TN"}], "RestaurantInfo": {"RestaurantID": "5F66RN3nSPQN2qiWk8tRtA", "Name": "Burger Republic", "Price": "$$", "RestaurantURL": "/biz/burger-republic-nashville", "Longitude": " -86.71244238252440", "Address": "6900 Lenox Village StNashville, TN 37211", "Latitude": " 36.024356640835002", "ImgURL": "//s3-media3.fl.yelpcdn.com/bphoto/zgMLViu8iDixapjqM_DMhA/90s.jpg"}}