{"Reviews": [{"Author": "Jennifer T.", "ReviewID": "eD6gx3TTalw3Ah6xaYAhPQ", "Overall": "4.0", "Content": "*wam feta (tomato, anchiovy, caper, roasted pepper, olives, pita bread; omg!!!!!! I loved this appetizer! The acidity of everything went so well with the tangy, melted feta cheese. The achiovy took this dish to another level though, loved it! great portion size as well, definitely not cheating you out)*grilled octopus, bean salad (HOLD THE PHONE! the grilled octopus had such an amazing tenderness to it, it was meaty, soft and not tough at all like some other places that overcook their octopus. such a great smokey flavor from the grill. the bean salad with the vinaigrette complimented the seafood so well. could eat this all day!)*sheep's milk dumplings (the dumplings were amazing!!!!!! they were like marshmallows in a bath of garlicky, tomatoey goodness. I loved the texture of the dumplings, so soft and fluffy. the spicy lamb sausage was so good!! can definitely taste the lamb meat but it wasn't gamey at all; the sausage was small and chopped into small rounds that was found throughout the dish; the sauce was absolutely delicious!!!!!!!!!! please ask for more bread to soak it up, don't waste this sauce!!!!! this dish is such a comfort food; it's filling but not overwhelming like heavy pasta dishes)This place is adorable with their decor. The entrance is nice with the bar area and the formal dining area is cozy. Service is good and friendly. The bathroom is surprisingly so clean haha. In regards to their food, such great quality and so fresh. I would go back here in a heartbeat!!!", "Date": "2014-07-03", "Author_Location": "Clifton, NJ"}, {"Author": "N P.", "ReviewID": "XSYo7co6i7EuOg6fEDMtng", "Overall": "2.0", "Content": "When we go to a restaurant we hope to not only enjoy the food, but also to enjoy the overall experience. and when we leave a restaurant, we usually ask- will we be back? The answer with Kefi is no, here's why...we thought the food was ok,  but not memorable, but the experience they delivered was just bland and plain boring.First the good: ..appetizers- the Cypriot salad was a refreshing, very enjoyable light summer salad,  the grilled octopus is good- not chewy, perfect char, with a touch of lemon. Service was efficient and pleasant. Ok so what is not to like? The main dishes we ordered were clumsily presented, over stuffed with chips, and a soggy salad like you would get at a college food truck. The entrees- chicken souvlaki and the lamb burger were just ok. Our biggest dislike was the way the restaurant looked and was laid out. Tables jammed together, hard services, little in the way of decor that reminds you that you are eating at a Greek Restaurant, in other words it has ZERO Greek charm, soul or ambiance. To make matters worse, we were sent to the Kefi basement to eat (even though there were plenty of open tables upstairs). And no surprise here, the Kefi basement smells like ....a musty basement. Also, when sitting downstairs, expect to be in very close proximity with other people (who were banished to the musty basement), and expect to watch the kitchen staff move dirty dishes back and forth while you eat. I mean it was a saddest spot, bleak and bland...not even a little candle to cheer us up. Needless to say, we skipped desert to go up for air.", "Date": "2014-07-06", "Author_Location": "Providence, RI"}, {"Author": "Kristen T.", "ReviewID": "bQkxA6jt7lv7YkpP8_yQ5A", "Overall": "5.0", "Content": "This restaurant is a great place to go, especially if you're from a place without good Greek food-- like me. My family and I tend to eat family style, and everything I tasted was fantastic. My only complaint is that I had too much of their tasty bread and dipping sauces to finish my meal!", "Date": "2014-06-30", "Author_Location": "South Jordan, UT"}, {"Author": "Trisha A.", "ReviewID": "RBHE6Xh9h5W0AAB2n1Z_CQ", "Overall": "5.0", "Content": "This review is long overdue. Went there for brunch a couple of weeks ago and had a whole grilled Branzino. It was cooked to perfection that it just melt in my mouth.", "Date": "2014-07-08", "Author_Location": "New York, NY"}, {"Author": "Bob M.", "ReviewID": "l-CLXJery2mxnoLyS4-_eA", "Overall": "5.0", "Content": "The food and the service were top notch.  We enjoyed the combinations of meats, cheeses and the presentation.  The staff was funny, informative and friendly.Will be back!!", "Date": "2014-06-16", "Author_Location": "Los Angeles, CA"}, {"Author": "Jaci H.", "ReviewID": "ZvXQNuREMht56RKvr2SMTA", "Overall": "4.0", "Content": "Kefi certainly has a reputation for good food and it's nice to know it really lives up to the hype.My UWS friends brought me here yesterday for an early dinner at around 6:30pm.  It's a large space and were thrilled to be seated without issue.  I had no idea there was so much room, be sure to check out the downstairs. Our server was extremely helpful, cheerful and knowledgable with the food and wines being offered.  He recommended a delicious, refreshing and affordable ($30 per bottle) white wine. We skipped appetizers in hopes of enjoying dessert - which we didn't because we were far too full from dinner.  Will have to come back since the desserts looked divine. I ordered the Chicken Thigh Souvlaki special, which was unbelievably delicious. Tender, perfectly grilled chunks of chicken thigh were presented on wooden skewers.  It was a very hearty portion and each bite was pure bliss with the accompanying pita bread, Greek salad (which they were kind enough to present without feta cheese) and a delicious rice.  The salad was fresh and flavorful with lots of olives, tomatoes, onions and peppers.  Loved the salad dressing! The rice was amazing with a butter flavor and spinach.  I literally couldn't stop eating... and ended up cleaning my plate.  If you could have seen the food baby!   I could have easily taken home about a third of the dish but opted to pigging out while the food was fresh.  My friends also thoroughly enjoyed the dinners, ordered the same as me.  We were thrilled with Kefi and will definitely return in the near future.  Yum!!", "Date": "2014-06-09", "Author_Location": "Brooklyn, NY"}, {"Author": "Conrad N.", "ReviewID": "RaXJgtUbYffxNg3p87g6nQ", "Overall": "4.0", "Content": "We got there around 1:30pm and the place was packed!!  It's 4th of july long weekend, and fifa was on with germany vs france.  They have massive tv that broadcast the game, so that might explain why its so packed.We ordered grilled octopus, it came with chickpea salad.  omg.  I loved it!!!!  I also ordered a chicken souvlaki wrap with a side of kefi salad.  It is a lot of food!Normally those sandwich comes with home made chips and salad...but I didnt want any chips and ot was perfect for me.  My husband loved the chips too.I will definitely go back to this place.", "Date": "2014-07-05", "Author_Location": "New York, NY"}, {"Author": "Kai N.", "ReviewID": "yMVQbOOdIAfxhZfRbDmWtA", "Overall": "3.0", "Content": "Walked in on a Monday night. We were able to walk in and seated with no reservations. It was busy, so the servers gave us ample time and extra bread and water before our order was taken. We ordered the braised rabbit pasta, lamb shank, chicken skewers special, and the grilled octopus for an appetizer. The lamb was flavorless. I've never had rabbit before, but it taste more or less like the lamb shank. Yup, unfortunately the chicken skewers is the best plate on the table. We asked for the dessert menu, but nothing jump out at us. Plus, our main course did not leave us wanting more, so we left.The place looks better than the food taste. Would only come back if I'm in the area next time for a drink at the marble top bar with ESPN on the screens.", "Date": "2014-07-07", "Author_Location": "Manhattan, NY"}, {"Author": "Jeff O.", "ReviewID": "jHWeo6-Y4-SFkp-QkL_ncg", "Overall": "5.0", "Content": "HOW HAVE I NEVER REVIEWED KEFI I'M SORRY KEFI FORGIVE ME.OK deep breaths. Straight-up, we've dined here around 25 or 30 times, and we're the kind of people who visit a restaurant twice only if it's really good. So yeah.I'm not going to get into specifics because you can't go wrong - if a dish sounds good to you, trust me, it will be good. OK one example - even the damn tzatziki sauce will blow your mind. Tzatziki is one of those things you think can only be so good and is the same everywhere, but you're freaking wrong, it can pretty much change your life if you infuse it with unicorns and rainbows, as I'm pretty sure Kefi does.Last point: the prices are crazy reasonable, like unreasonably reasonable. Win win win.", "Date": "2014-06-06", "Author_Location": "Manhattan, NY"}, {"Author": "Erica D.", "ReviewID": "G1USxQhtaaty1ePEyJv3Qg", "Overall": "4.0", "Content": "Our server was so fantastic tonight. We came with a group of 12 and he had just the right amount of helpfulness and \"leave us alone-ness\" that we needed. He made excellent wine recommendations, excellent food pacing recommendations and made our gathering just right. I was looking for a place with great service, good food and a quiet room. We sat downstairs in the \"back room\". It was noisy on a Sat night but not overly so. Food was a little too oily.", "Date": "2014-07-12", "Author_Location": "Glen Rock, NJ"}, {"Author": "Alisa G.", "ReviewID": "QJl3FsPnCnT5O5jIVENolA", "Overall": "4.0", "Content": "Tasty and reasonably-priced.  We ordered 4 meze, no entrees or dessert (although I wish I'd looked at the dessert menu before we decided to go out for froyo!).  The Greek sausage was the standout, but the pickled beet salad and warm feta dish were also excellent.  The only dish that was a disappointing was the grilled calamari with beans. Way too many beans (chickpeas), and not enough flavor.  Mint cocktail was also delish!  The servers, runners, and bussers were friendly and attentive.  We sat downstairs, which I would recommend, b/c it's much quieter.  I will definitely go back!", "Date": "2014-07-04", "Author_Location": "Providence, RI"}, {"Author": "Noura Andréa A.", "ReviewID": "96CbMX_d0vOcnPMRb0pKDg", "Overall": "4.0", "Content": "I love Greek/Mediterranean food. And given that I'm from Lebanon, I know a thing or two about the food. I was pleasantly surprised with the food at KEFI.I ordered the eggplant and bulgur fritters, with tahini sauce and pita bread. Whenever I read the word \"fritters\", I get chills and expect a very greasy and crunchy food that will make me feel sick all night long. Tahini sauce is my enemy because they just put too much of it. And your \"falafel\" ends up swimming in the sauce.I ordered the plate with fingers crossed and got a beautiful result. I got a gluten-free (yes that's an option) pita bread and some tahini very lightly (yet enough for flavor) spread on it. The fritters were marvelous! Lightly crunchy on the outside and so sweet and tender on the inside. Your knife just slides through it. The salad is well seasoned, nothing is too salty or greasy.The sandwiches are served with salad and chips. I didn't try the chips because that's not my cup of tea.The people with me were also enjoying their food, fish and meat.This is a place I would definitely go to again.", "Date": "2014-06-13", "Author_Location": "Manhattan, NY"}, {"Author": "Lisa M.", "ReviewID": "3-x-QPLrR7LUvkvqAWvr7g", "Overall": "3.0", "Content": "I was really expecting this meal to wow me but i didn't get that feeling. Everything was good, no real complaints. The sangria was terrible though. We all kinda laughed about the taste, comparing it to HI-C. Pretty loud inside on a Friday night. Loud for my parents, but would be better for a night out with friends. If you want less noise I suggest trying downstairs. Service was decent. We ordered an appetizer without Pine Nuts, specifically mentioning an allergy to the waiter but when the dumplings came out I spotted a pine nut luckily before my boyfriend ate it. No real apology, they just replaced it. Going to stick with Bodrum because nothing compares!", "Date": "2014-06-03", "Author_Location": "Manhattan, NY"}, {"Author": "Eponine J.", "ReviewID": "aPalxxkwctFRPpNa_Ye8QA", "Overall": "5.0", "Content": "Before 6pm, they offer a prix fixe dinner menu for $17 which includes an app, entree and dessert. The two of us ordered mussels, meatball, branzino (+5 extra charge), pork medallions, walnut cake and rice pudding from the prix fixe and selection of spreads to start with. Everything was perfectly cooked but the selection of spreads and branzino definitely stood out.They also have a three-course chef tasting menu for $35, on top of which you can add a pasta course for an extra $7.", "Date": "2014-05-25", "Author_Location": "New York, NY"}, {"Author": "Eytan S.", "ReviewID": "UtBOQS5LpS3a-TXw-OC4wA", "Overall": "4.0", "Content": "Amazing dinner specialties that will fill your mouth with flavor! Get the sheep milk dumplings, feel like pillows in your mouth. I'm full!Bon appetite", "Date": "2014-06-14", "Author_Location": "Bronx, NY"}, {"Author": "Risa H.", "ReviewID": "MF-Kgi4h1A4UALqteHNYwQ", "Overall": "5.0", "Content": "Came here to eat one night, found the place through none other than Yelp!  I love lamb and anything spicy, so I had to try the Sheep's Milk Dumplings with Spicy Lamb Sausage.  It was VERY flavorful, a bit on the salty side, but still delicious.  I would have preferred an atmosphere with not so much lighting, but the food was still good.  Waiter brought the food out quicker than expected.  Bathrooms are located downstairs and there is a separate dining area downstairs with more of the ambiance I like in a restaurant (there was a private party down there).  Would come back to eat if I was in the area!", "Date": "2014-06-18", "Author_Location": "Midtown East, Manhattan, NY"}, {"Author": "Joanna L.", "ReviewID": "iFg6WhrblesEVDOt-CBimA", "Overall": "2.0", "Content": "I loved the way this place use to be....they gutted it since the last time i went. Its way more modern which is cool too but i was more of a fan of the old Kefi..but that's just me. The hostess was ok with my group. We didn't have a reservation so she said it would be 20min. Cool... But she didn't tell us where to wait or if we got a buzzer or how it would work when it was our turn to be sat. Very awkward. There's sooooo many restaurants in NYC with their own methods of seating and hostessing that I feel its the hosts responsibility to let the guests know what to do while they wait and where to go...right?? Anyways... I asked where to go and she said we can have a seat at the bar or go outside. We went to the bar and sat there...we were going to order drinks from the bartender and pay for them upfront before we got sat but the bartender was clearly under the impression that we were just taking up seats in her bar while waiting for our table because she never even looked at us...awkward again because If we didn't want drinks we would of waited outside for our table.We got our table in about 15min which was nice but then to cut this review short....we got sat next to a table that was being very rude to the waiter and so therefore, the waiter came to our table to take our order and drop off drinks ONCE...he stayed away from our area because of the other table...with that being said...you can imagine how asking for the check and paying out went...not well. I'll definitely be back for grandmas meatball.... AND to give this place another shot because our situation was unique so its only fair to try it out again...", "Date": "2014-06-16", "Author_Location": "Manhattan, NY"}, {"Author": "Lesley C.", "ReviewID": "Ul6ILFkRGaSY4661d-h4Ug", "Overall": "5.0", "Content": "Loved the lamb chaps! Cooked to perfection.", "Date": "2014-07-09", "Author_Location": "Manhattan, NY"}, {"Author": "Victoria B.", "ReviewID": "lbclJI1vj4Vb7GvvboLK4A", "Overall": "4.0", "Content": "Great food, the sheep milk dumplings everyone is raving about is amazing, grilled octopus tender and smoky, dips taste authentic. The vegetable side was quite oily, but still tasty. An allover good experience, will be back for the dumplings.", "Date": "2014-06-18", "Author_Location": "Dobbs Ferry, NY"}, {"Author": "A P.", "ReviewID": "Wzjc3Ik2LJM8_SgiU0f26A", "Overall": "1.0", "Content": "Well this place was insanely disappointing.  This was a Yelp fail... don't know what other reviewers were doing but wow it was bad.  Menu was not descriptive and we have food allergies so this is a problem.  We got a dish that didn't list tomato where it was the primary ingredient.  Instead of being polite and offering to take the dish away and replace with something else the incompetent waitress argued over whether the menu listed tomato for the dish - which it didn't - she confirmed later.  She slid the fish onto a plate and told us to pick around and then brought tough broccoli as a substitute.  She was just really bad.  She also brought a salad with peppers and again we can't eat those and was annoyed when I sent it back.  The waitress did almost nothing and the poor bus boys did most of the work.  We were charged for the full $18.95 fish even though we couldn't eat half of it.  My chicken with skin, on the bone, was extremely dry.  Impressive that someone can fail at making roast chicken.  DO NOT GO HERE or be prepared to be disappointed.", "Date": "2014-06-04", "Author_Location": "Hillsboro, OR"}, {"Author": "Nick C.", "ReviewID": "T2A9QgfE-UYjxh3F5CNu6A", "Overall": "5.0", "Content": "Very happy with the Mediterranean food here.  To start we had an octopus appetizer and a several spreads with pita. For our main course we had a whole fish with broccoli rabe and a lemon chicken dish. I would order the fish again. We are looking forward to exploring the menu.", "Date": "2014-06-27", "Author_Location": "Columbus, OH"}, {"Author": "Justin S.", "ReviewID": "mUfLRP_hosUOn1poPTMtzw", "Overall": "5.0", "Content": "Delicious and affordable would be the two best words to describe this place. We ordered about a half dozen appetizers to share between two couples, and every last thing was delicious. The grilled octopus though was, by far, the highlight. Perfectly cooked, slightly tender and well seasoned, it was maybe the best grilled octopus I've ever had. Two bottles of wine and a table full of food, and our bill was less than $130 total. We'll be back.", "Date": "2014-06-23", "Author_Location": "Manhattan, NY"}, {"Author": "William H.", "ReviewID": "wfrHPak3eO4HnZayFA5sUw", "Overall": "4.0", "Content": "Incredible. Greek food is underrated and Kefi is a gem in the Upper West Side. This place simply blows Taverna straight out of the Mediterranean waters. The friendly, attentive staff made sure we were always taken care of and there seems to be plenty of space (multiple floors). Never order chicken at a Greek restaurant...that said, I personally don't eat lamb but can attest to the excellent seafood quality. The grilled octopus was tender and fresh...almost tasted like some type of forbidden land protein. The pita appetizer is a home run too. Multiple difference sauces, all incredibly flavorful. Free refill on the basket just in case too. Highly recommended.", "Date": "2014-04-03", "Author_Location": "New York, NY"}, {"Author": "Sarah F.", "ReviewID": "WjZ_Qi7qMKwIhMkxIMZLkw", "Overall": "3.0", "Content": "I wanted to like it here but found the food lacking. My octopus appetizer was burnt pretty badly, and was sitting on a bed of chick peas so heavily covered in parsley I was picking it out of my teeth for a whole day. I'm not sure that the swordfish I ordered was fully cooked. I had a pretty hard time cutting into it, and it was fairly translucent and clear looking in the middle as opposed to white and cooked. The price was reasonable but I would rather spend a little more to really enjoy my food. Great selection of Greek wines, though.", "Date": "2014-05-27", "Author_Location": "Brooklyn, NY"}, {"Author": "Kendrick W.", "ReviewID": "-N3AWPZ0DAyuSljRLELhOg", "Overall": "4.0", "Content": "Delicious.  That's my memory of this place.  I came on a stormy night, an hour late meeting my friends because my plane was so delayed and this place quickly made me forget it all.  The moment I sat down, the waitress came right over, took my drink order and even recommended some dishes.  I had the sheep milk ricotta ravioli and it was like butter in my mouth.  So creamy and good.  My only complaint was that I felt the portion was a little small, which is unusual for greek places.  But absolutely tasty.  Also the meatballs.  Perfection.  I was a little underwhelmed by the Sangria, but other than that no real complaints.", "Date": "2014-05-26", "Author_Location": "Chicago, IL"}, {"Author": "Kevin C.", "ReviewID": "JKnb3kYu4oNW0PsKBk2zNQ", "Overall": "3.0", "Content": "If your in the UWS the place to go for Greek food would be here. Large restaurant with a downstairs and upstairs. Decor is standard and doesn't wow you and even with a reservation prepare for a bit of a wait.You come here for the greek food. Great apps with hummus and yogurt and their Octopus was grilled perfectly. Had the pressed chicken and it was made great and very flavorful with a bit of crunch from the pressing. If in the area i would stop in again.", "Date": "2014-04-03", "Author_Location": "New York, NY"}, {"Author": "Alisa L.", "ReviewID": "h4OPb3vt4Sy2tTSlUolTlA", "Overall": "2.0", "Content": "1.5 years.  The approximate amount of time Zachary Taylor was in office, or the amount of time I went without Kefi due to its closure/being busy and no longer living in MoHi.The answer is both, but alas, absence did not make the heart grow fonder once we were reunited.To be fair, the food itself was decent, albeit not as good as I remembered.  The sheep's dumplings were merely okay but the sauce was very flavorful, just begging to be scooped up by an extra order of bread.  The lamb burger was also average at best, nothing special and honestly, there are many better burgers in the neighborhood.So far, the restaurant is probably earning a solid 3 stars, but then what merited the drop?The service, oh god, the service.  The food took something like 45 minutes to come, while dessert, which was nothing special and shouldn't have taken that long, took 20.  Any request required attempting to flag down a waiter, already incredibly difficult, and actually ensuring the waiter remembered your request by re-flagging him down and reminding him.  The ambiance was also lacking, especially in the basement.  There was an old moldy smell, though it was very faint, and the place just seemed unappealing.  Perhaps it was the lighting, or the setup of the basement, but this place has definitely lost its charm.", "Date": "2014-03-10", "Author_Location": "New York, NY"}, {"Author": "Jason L.", "ReviewID": "co7e442g4TsVaw9ZHwLb5A", "Overall": "4.0", "Content": "Came here for lunch. If you're a feta fan + mussels fan, get the mussels for the appetizer. It was incredibly good, especially when you dip the bread in the sauce... woah man! We followed the yelper's recommendation and get ourselves the lamb shank. Very delicious, but because of how salty/flavorful the mussels were, it almost overpowered the taste of the lamb shank. So keep that in mind as you're making your choice. My brother had the kefi burger. That thing is HUGE. Not a fan that you have to add money for cheese (who does that?!) but when you have an option to add feta in a burger... go for it! I like this a lot! Cool interior, we had a very early lunch so no one was there yet so that was nice since my family and I wanted to get away from the business of Manhattan... we're tourists...you see...", "Date": "2014-04-15", "Author_Location": "Los Angeles, CA"}, {"Author": "Steve R.", "ReviewID": "pPdqmB-NYwYjMfyWlKE8kA", "Overall": "2.0", "Content": "I had a quite different experience from other Yelpers, because Kefi is way below par... somewhere in the double bogey range. If you must go, I suggest insisting on sitting upstairs, and if you cannot wait for a table there, leave. Downstairs is a loud, windowless, dining area where I felt herded in, like a tourist getting off a bus. In fact, the large groups sitting in another downstairs section, seemed to follow that description. The tables are small, crammed together and it is hard to hear your partner. Guests have to speak loud to be heard, so we couldn't help hearing what our neighbors were saying. It took 45 minutes to get appetizers. The often praised grilled octopus was tender, but it had no taste or brininess to it, as if you couldn't tell it ever came from the sea. Tasted like chicken. The warm feta was good, but I could do that at home. An hour in, we were told that they were out of dumplings, which was the sole reason we went there. Why wait an hour? FAIL. We finally got our good quality lamb chops, under-seasoned and over-grilled, poorly presented on a bed of greens in dire need of flavor. We should have listened to our neighborhood friends and hotel front desk people who didn't suggest Kefi. It really was a letdown.", "Date": "2014-06-24", "Author_Location": "Westlake Village, CA"}, {"Author": "Tara J.", "ReviewID": "gBP5LONGN5jj0lkd1kYLCw", "Overall": "3.0", "Content": "I came here for brunch on a Saturday with my boyfriend, parents, and a friend, and was disappointed that the service and staff were so bad, it almost ruined the good food. First, due to miscommunication on our part, we made two reservations for 5 people. When we got there -on time-, there was no table available for us, and we had to wait for almost 40 minutes for a table to be cleared. How did they not plan for that? What's the point in making a reservation? The manager tried to help but didn't do anything to speed up the process.Then once we sat, it took forever for our waitress to get to us, and then even longer for our food to come out - even though by that time we had told the waitress we were in a rush because we had plans to get to. I ordered some kind of breakfast sandwich with eggs, cheese, tomato, and bacon, on a giant loaf of bread. This was the messiest sandwich I've ever eaten, and the bread was way too large. I had to cut it up just to manage it, but the flavors were delicious. Everyone else enjoyed their food, but also was disappointed by the service. Despite the awful service, I really enjoyed the food and I would give this a second chance.", "Date": "2014-03-06", "Author_Location": "Manhattan, NY"}, {"Author": "Yon L.", "ReviewID": "KrbxD_uiub0AYCtX-BC0jw", "Overall": "4.0", "Content": "Come here by 12pm for brunch and it won't be crowded. It starts getting hectic around 1pm. LOVED the Sheep Milk dumplings. The tomato basil lamb sauce complimented these little treasures so well! The Greek spread was also yums. Really fresh and on point. I can't seem to find it on their menu online, but there was a GREAT Prawns dish on a bed of some grain... I don't know what it's called so this is frustrating, but they were small round bits... larger than quinoa. Reallly well cooked prawns and the other stuff was delicious too. haha.Was not a fan of the Greek Meat and Potato omelette. It was huge but the eggs were overcooked and dry. The sausage was tasty though but this dish definitely went back half finished. Service was great until the 1pm rush. Then our Bottomless mimosas turned into no mimosas for half an hour. Talk about a buzz kill. I'd go back...earlier.", "Date": "2014-02-17", "Author_Location": "New York, NY"}, {"Author": "Rachel B.", "ReviewID": "KwGj__Zgm0dXn78oa0Qu8w", "Overall": "3.0", "Content": "Since moving to the UWS 10 months ago I had been waiting for Kefi to reopen. Many of my friends had recommended the place to me. So, I was thrilled when I managed to secure a reservation last Friday night. Maybe its because the place had been so hyped, but I wasn't overly impressed with my meal. It was good... but nothing I would run back for. The grilled octopus was probably the best dish we tried. But, the rapine was waaay too oily and my simple grilled fish also tasted bathed in oil and butter. The special pasta dish made with a pulled pork was also pretty darn good, but its not that hard to get a good pasta dish in this city.It was also packed that night and we felt a bit rushed by the waitstaff, but that's understandable on a Friday night, and forgivable. Although, jamming so many diners into such a small space and constantly having the waitstaff bump into you really isn't the most preferable way to enjoy a meal. They might want to take out a table, or 3 or 4. The dining room is just so packed.I'm going to give Kefi another try. Hopefully, they were just a bit off that night. And the next time I'll see what all the hype is about and enjoy a great meal.", "Date": "2014-02-17", "Author_Location": "Manhattan, NY"}, {"Author": "lauren l.", "ReviewID": "PpyjVkmdepU64KfNGlMFbw", "Overall": "2.0", "Content": "What a disappointment!  Firstly, we sat at the bar to have drinks and snacks.   It was literally at least 5 minutes before we were acknowledged by the bartender.    She was busy, but a good bartender would know to at least say \"Hello, be with you soon.\"  No.  She walked back and forth and didn't even glance at us.Next-the food.   The dips were BAD!  So surprising because these are not that difficult to get right.  We won't be going back there.", "Date": "2014-03-12", "Author_Location": "New York, NY"}, {"Author": "Kara L.", "ReviewID": "4CaWDlyC41vWs8Y1ydGQzg", "Overall": "4.0", "Content": "Came here on Saturday for dinner with my best friend, and the food was so amazing it made up for some of the restaurants weak points.Since the \"remodel\" kefi has less of a intimate feeling and more of a get in and get out vibe. The two top I sat at was SO close to the table next to us I felt like they were part of our conversation. Also, both my table, and the table next to us ordered appetizers that never came out. My friend and I ordered the tzatziki, hummus, lamb shank, and striped bass which were All amazing. Our grilled octopus never made it to the table, but I saw others eating it and it looked good. I also had a glass of red sangria which was awful, it reminded me of a cheap juice I drank when I was little.The food is worth checking out as long as they keep the idea of quality, not quantity in mind. Also, make a reservation, this place gets packed fast!", "Date": "2014-02-18", "Author_Location": "Manhattan Valley, Manhattan, NY"}, {"Author": "Adam W.", "ReviewID": "aKfv1029XInkpy2T1sDR2g", "Overall": "2.0", "Content": "The food is not bad; it is no longer consistent and good.  The selection is still ... OK to good.  Those are now the only nice (nice-ish) things I can say about a restaurant I used to enjoy weekly, sometimes more often.   Kefi was damaged and spent a few months rebuilding.  When they were closed they lost nearly all of there staff ... and a restaurant takes a team like atmosphere to succeed.   I have been back to Kefi a few times since their reopening, brunch and dinner, and they have failed me every time.  They have problems from management to wait staff to bartenders.   It is a shame. The managment has consistently over booked and understaffed the restaurant while not having trained their staff adequately.  I feel sorry for the people that work there because they are not being given an environment to succeed, let alone excel.", "Date": "2014-03-09", "Author_Location": "New York, NY"}, {"Author": "P L.", "ReviewID": "zuLtRVjQfdyIoseiA0qG4Q", "Overall": "4.0", "Content": "Ambiance: This is a nice casual place to grab a bite to eat. Not pretentious and the staff was very nice and friendly. The manager also came up to us during our meal to make sure everything was okay and if we needed anything.The give bread at the table however since the bread is out before you sit down and seems to have been there for a bit, it was rock hard. We asked for fresher bread which they provided with no problem.We ordered the goat cheese dumplings with spicy lamb sausage-the sauce was very good and the dumplings were soft and pillowy and yummy. The only negative of the dish was the lamb sausage which was very hard and tasted funny.We also ordered the chicken sandwich and the chickpea fritter sandwich. Both were good and came with homemade chips and salad. Con: salad was a bit limp and overly covered with dressing.Overall, a good dining experience- you can be in and out in under an hour. I would go back again.", "Date": "2014-06-01", "Author_Location": "Brooklyn, NY"}, {"Author": "Linda L.", "ReviewID": "lI9RG5Ovflk9LcQVAfFWXw", "Overall": "2.0", "Content": "This review is based not on the food, which was delicious, but some of the most disorganized and chaotic service ever.  Four of us arrived at 7 pm for a birthday dinner and soon after ordered drinks.  45 minutes later I had mine but my friends had not.  One had ordered a virgin bloody mary and the two others vodka on the rocks.  Not complicated.  About 7.55 our appetizers arrived.  Still no more drinks.  We were told after repeated requests that the bar, which was in front of us, was backed up and the waiter himself could not make the drinks.  There was one bartender.  Then waiters seemed to gather to try to sort the mess, the bartender left, and finally the manager stepped in, very late in the game.  We all got drinks about the time the entree arrived.  Why the manager did not see what was going on and step in we could not understand.  It was a train wreck.  And by the way our waiter, who was doing the best he could, delivered the vodka on the rocks with a lemon twist with a lime wedge instead.  Under the circumstances we felt lucky to have drinks at all.  Quite a shockingly bad experience for a good restaurant and not at all appropriate to the quality of the food which was great.", "Date": "2014-07-08", "Author_Location": "Manhattan, NY"}, {"Author": "chip h.", "ReviewID": "W_quj1kp-RBb0NiXCIkumw", "Overall": "4.0", "Content": "The Octopus is still Amazing!!!!  Some people are complaining about the service but I'm sure as soon as the new servers become better seasoned that will no longer be an issue.  I am not a fan of the upstairs so I always have a few cocktails next door at Prohibition while I wait for a table downstairs.  Upstairs (very loud and congested), Downstairs (Cozy and much quieter).  The Lamb shank was still delicious and everyone at my table enjoyed their meal.  The service was a bit on the slow side but the guy was super friendly and trying his best so no big deal.  Love it......Sit downstairs.....Get the Octopus!!!!!", "Date": "2014-05-18", "Author_Location": "New York, NY"}, {"Author": "Tracey M.", "ReviewID": "fEe3btwniJEyhrs14FpIOg", "Overall": "5.0", "Content": "I really like this place a lot. They're a little slow at the checkin desk... But they totally make up with it for the good fresh food and the robust menu. If you can get there before 6 o'clock they have a prefix menu that first $17 gets you an appetizer an entrée and a dessert. For New York -- that's amazing.", "Date": "2014-04-30", "Author_Location": "Los Angeles, CA"}, {"Author": "Erum R.", "ReviewID": "UArx5BI9r7edz_pfFrkgbg", "Overall": "3.0", "Content": "I don't know what all the hype is about. I came here for dinner one night with the hubby and was not pleased. You'd think they have an amazing menu because the wait was about 45 minutes for a Thursday night but it really was not so impressive.Husband had the chicken souvlaki sandwich which he said was really dry. I would have thought they'd have more souvlaki options on the menu (like a platter with sides versus a sandwich) and found the menu limited. I ordered the branzino which was very good but extremely oily. There was so much olive oil on that thing that I felt pretty disgusting at the end of it. We had a crappy table in the middle of the restaurant and kept getting pushed around by rushed waiters. Not the best experience. My husband went to use the bathroom and was grossed out by how yucky it was so better to hold it in!", "Date": "2014-02-12", "Author_Location": "New York, NY"}, {"Author": "Jennifer T.", "ReviewID": "eD6gx3TTalw3Ah6xaYAhPQ", "Overall": "4.0", "Content": "*wam feta (tomato, anchiovy, caper, roasted pepper, olives, pita bread; omg!!!!!! I loved this appetizer! The acidity of everything went so well with the tangy, melted feta cheese. The achiovy took this dish to another level though, loved it! great portion size as well, definitely not cheating you out)*grilled octopus, bean salad (HOLD THE PHONE! the grilled octopus had such an amazing tenderness to it, it was meaty, soft and not tough at all like some other places that overcook their octopus. such a great smokey flavor from the grill. the bean salad with the vinaigrette complimented the seafood so well. could eat this all day!)*sheep's milk dumplings (the dumplings were amazing!!!!!! they were like marshmallows in a bath of garlicky, tomatoey goodness. I loved the texture of the dumplings, so soft and fluffy. the spicy lamb sausage was so good!! can definitely taste the lamb meat but it wasn't gamey at all; the sausage was small and chopped into small rounds that was found throughout the dish; the sauce was absolutely delicious!!!!!!!!!! please ask for more bread to soak it up, don't waste this sauce!!!!! this dish is such a comfort food; it's filling but not overwhelming like heavy pasta dishes)This place is adorable with their decor. The entrance is nice with the bar area and the formal dining area is cozy. Service is good and friendly. The bathroom is surprisingly so clean haha. In regards to their food, such great quality and so fresh. I would go back here in a heartbeat!!!", "Date": "2014-07-03", "Author_Location": "Clifton, NJ"}, {"Author": "N P.", "ReviewID": "XSYo7co6i7EuOg6fEDMtng", "Overall": "2.0", "Content": "When we go to a restaurant we hope to not only enjoy the food, but also to enjoy the overall experience. and when we leave a restaurant, we usually ask- will we be back? The answer with Kefi is no, here's why...we thought the food was ok,  but not memorable, but the experience they delivered was just bland and plain boring.First the good: ..appetizers- the Cypriot salad was a refreshing, very enjoyable light summer salad,  the grilled octopus is good- not chewy, perfect char, with a touch of lemon. Service was efficient and pleasant. Ok so what is not to like? The main dishes we ordered were clumsily presented, over stuffed with chips, and a soggy salad like you would get at a college food truck. The entrees- chicken souvlaki and the lamb burger were just ok. Our biggest dislike was the way the restaurant looked and was laid out. Tables jammed together, hard services, little in the way of decor that reminds you that you are eating at a Greek Restaurant, in other words it has ZERO Greek charm, soul or ambiance. To make matters worse, we were sent to the Kefi basement to eat (even though there were plenty of open tables upstairs). And no surprise here, the Kefi basement smells like ....a musty basement. Also, when sitting downstairs, expect to be in very close proximity with other people (who were banished to the musty basement), and expect to watch the kitchen staff move dirty dishes back and forth while you eat. I mean it was a saddest spot, bleak and bland...not even a little candle to cheer us up. Needless to say, we skipped desert to go up for air.", "Date": "2014-07-06", "Author_Location": "Providence, RI"}, {"Author": "Kristen T.", "ReviewID": "bQkxA6jt7lv7YkpP8_yQ5A", "Overall": "5.0", "Content": "This restaurant is a great place to go, especially if you're from a place without good Greek food-- like me. My family and I tend to eat family style, and everything I tasted was fantastic. My only complaint is that I had too much of their tasty bread and dipping sauces to finish my meal!", "Date": "2014-06-30", "Author_Location": "South Jordan, UT"}, {"Author": "Trisha A.", "ReviewID": "RBHE6Xh9h5W0AAB2n1Z_CQ", "Overall": "5.0", "Content": "This review is long overdue. Went there for brunch a couple of weeks ago and had a whole grilled Branzino. It was cooked to perfection that it just melt in my mouth.", "Date": "2014-07-08", "Author_Location": "New York, NY"}, {"Author": "Bob M.", "ReviewID": "l-CLXJery2mxnoLyS4-_eA", "Overall": "5.0", "Content": "The food and the service were top notch.  We enjoyed the combinations of meats, cheeses and the presentation.  The staff was funny, informative and friendly.Will be back!!", "Date": "2014-06-16", "Author_Location": "Los Angeles, CA"}, {"Author": "Jaci H.", "ReviewID": "ZvXQNuREMht56RKvr2SMTA", "Overall": "4.0", "Content": "Kefi certainly has a reputation for good food and it's nice to know it really lives up to the hype.My UWS friends brought me here yesterday for an early dinner at around 6:30pm.  It's a large space and were thrilled to be seated without issue.  I had no idea there was so much room, be sure to check out the downstairs. Our server was extremely helpful, cheerful and knowledgable with the food and wines being offered.  He recommended a delicious, refreshing and affordable ($30 per bottle) white wine. We skipped appetizers in hopes of enjoying dessert - which we didn't because we were far too full from dinner.  Will have to come back since the desserts looked divine. I ordered the Chicken Thigh Souvlaki special, which was unbelievably delicious. Tender, perfectly grilled chunks of chicken thigh were presented on wooden skewers.  It was a very hearty portion and each bite was pure bliss with the accompanying pita bread, Greek salad (which they were kind enough to present without feta cheese) and a delicious rice.  The salad was fresh and flavorful with lots of olives, tomatoes, onions and peppers.  Loved the salad dressing! The rice was amazing with a butter flavor and spinach.  I literally couldn't stop eating... and ended up cleaning my plate.  If you could have seen the food baby!   I could have easily taken home about a third of the dish but opted to pigging out while the food was fresh.  My friends also thoroughly enjoyed the dinners, ordered the same as me.  We were thrilled with Kefi and will definitely return in the near future.  Yum!!", "Date": "2014-06-09", "Author_Location": "Brooklyn, NY"}, {"Author": "Conrad N.", "ReviewID": "RaXJgtUbYffxNg3p87g6nQ", "Overall": "4.0", "Content": "We got there around 1:30pm and the place was packed!!  It's 4th of july long weekend, and fifa was on with germany vs france.  They have massive tv that broadcast the game, so that might explain why its so packed.We ordered grilled octopus, it came with chickpea salad.  omg.  I loved it!!!!  I also ordered a chicken souvlaki wrap with a side of kefi salad.  It is a lot of food!Normally those sandwich comes with home made chips and salad...but I didnt want any chips and ot was perfect for me.  My husband loved the chips too.I will definitely go back to this place.", "Date": "2014-07-05", "Author_Location": "New York, NY"}, {"Author": "Kai N.", "ReviewID": "yMVQbOOdIAfxhZfRbDmWtA", "Overall": "3.0", "Content": "Walked in on a Monday night. We were able to walk in and seated with no reservations. It was busy, so the servers gave us ample time and extra bread and water before our order was taken. We ordered the braised rabbit pasta, lamb shank, chicken skewers special, and the grilled octopus for an appetizer. The lamb was flavorless. I've never had rabbit before, but it taste more or less like the lamb shank. Yup, unfortunately the chicken skewers is the best plate on the table. We asked for the dessert menu, but nothing jump out at us. Plus, our main course did not leave us wanting more, so we left.The place looks better than the food taste. Would only come back if I'm in the area next time for a drink at the marble top bar with ESPN on the screens.", "Date": "2014-07-07", "Author_Location": "Manhattan, NY"}, {"Author": "Jeff O.", "ReviewID": "jHWeo6-Y4-SFkp-QkL_ncg", "Overall": "5.0", "Content": "HOW HAVE I NEVER REVIEWED KEFI I'M SORRY KEFI FORGIVE ME.OK deep breaths. Straight-up, we've dined here around 25 or 30 times, and we're the kind of people who visit a restaurant twice only if it's really good. So yeah.I'm not going to get into specifics because you can't go wrong - if a dish sounds good to you, trust me, it will be good. OK one example - even the damn tzatziki sauce will blow your mind. Tzatziki is one of those things you think can only be so good and is the same everywhere, but you're freaking wrong, it can pretty much change your life if you infuse it with unicorns and rainbows, as I'm pretty sure Kefi does.Last point: the prices are crazy reasonable, like unreasonably reasonable. Win win win.", "Date": "2014-06-06", "Author_Location": "Manhattan, NY"}, {"Author": "Erica D.", "ReviewID": "G1USxQhtaaty1ePEyJv3Qg", "Overall": "4.0", "Content": "Our server was so fantastic tonight. We came with a group of 12 and he had just the right amount of helpfulness and \"leave us alone-ness\" that we needed. He made excellent wine recommendations, excellent food pacing recommendations and made our gathering just right. I was looking for a place with great service, good food and a quiet room. We sat downstairs in the \"back room\". It was noisy on a Sat night but not overly so. Food was a little too oily.", "Date": "2014-07-12", "Author_Location": "Glen Rock, NJ"}, {"Author": "Alisa G.", "ReviewID": "QJl3FsPnCnT5O5jIVENolA", "Overall": "4.0", "Content": "Tasty and reasonably-priced.  We ordered 4 meze, no entrees or dessert (although I wish I'd looked at the dessert menu before we decided to go out for froyo!).  The Greek sausage was the standout, but the pickled beet salad and warm feta dish were also excellent.  The only dish that was a disappointing was the grilled calamari with beans. Way too many beans (chickpeas), and not enough flavor.  Mint cocktail was also delish!  The servers, runners, and bussers were friendly and attentive.  We sat downstairs, which I would recommend, b/c it's much quieter.  I will definitely go back!", "Date": "2014-07-04", "Author_Location": "Providence, RI"}, {"Author": "Noura Andréa A.", "ReviewID": "96CbMX_d0vOcnPMRb0pKDg", "Overall": "4.0", "Content": "I love Greek/Mediterranean food. And given that I'm from Lebanon, I know a thing or two about the food. I was pleasantly surprised with the food at KEFI.I ordered the eggplant and bulgur fritters, with tahini sauce and pita bread. Whenever I read the word \"fritters\", I get chills and expect a very greasy and crunchy food that will make me feel sick all night long. Tahini sauce is my enemy because they just put too much of it. And your \"falafel\" ends up swimming in the sauce.I ordered the plate with fingers crossed and got a beautiful result. I got a gluten-free (yes that's an option) pita bread and some tahini very lightly (yet enough for flavor) spread on it. The fritters were marvelous! Lightly crunchy on the outside and so sweet and tender on the inside. Your knife just slides through it. The salad is well seasoned, nothing is too salty or greasy.The sandwiches are served with salad and chips. I didn't try the chips because that's not my cup of tea.The people with me were also enjoying their food, fish and meat.This is a place I would definitely go to again.", "Date": "2014-06-13", "Author_Location": "Manhattan, NY"}, {"Author": "Lisa M.", "ReviewID": "3-x-QPLrR7LUvkvqAWvr7g", "Overall": "3.0", "Content": "I was really expecting this meal to wow me but i didn't get that feeling. Everything was good, no real complaints. The sangria was terrible though. We all kinda laughed about the taste, comparing it to HI-C. Pretty loud inside on a Friday night. Loud for my parents, but would be better for a night out with friends. If you want less noise I suggest trying downstairs. Service was decent. We ordered an appetizer without Pine Nuts, specifically mentioning an allergy to the waiter but when the dumplings came out I spotted a pine nut luckily before my boyfriend ate it. No real apology, they just replaced it. Going to stick with Bodrum because nothing compares!", "Date": "2014-06-03", "Author_Location": "Manhattan, NY"}, {"Author": "Eponine J.", "ReviewID": "aPalxxkwctFRPpNa_Ye8QA", "Overall": "5.0", "Content": "Before 6pm, they offer a prix fixe dinner menu for $17 which includes an app, entree and dessert. The two of us ordered mussels, meatball, branzino (+5 extra charge), pork medallions, walnut cake and rice pudding from the prix fixe and selection of spreads to start with. Everything was perfectly cooked but the selection of spreads and branzino definitely stood out.They also have a three-course chef tasting menu for $35, on top of which you can add a pasta course for an extra $7.", "Date": "2014-05-25", "Author_Location": "New York, NY"}, {"Author": "Eytan S.", "ReviewID": "UtBOQS5LpS3a-TXw-OC4wA", "Overall": "4.0", "Content": "Amazing dinner specialties that will fill your mouth with flavor! Get the sheep milk dumplings, feel like pillows in your mouth. I'm full!Bon appetite", "Date": "2014-06-14", "Author_Location": "Bronx, NY"}, {"Author": "Risa H.", "ReviewID": "MF-Kgi4h1A4UALqteHNYwQ", "Overall": "5.0", "Content": "Came here to eat one night, found the place through none other than Yelp!  I love lamb and anything spicy, so I had to try the Sheep's Milk Dumplings with Spicy Lamb Sausage.  It was VERY flavorful, a bit on the salty side, but still delicious.  I would have preferred an atmosphere with not so much lighting, but the food was still good.  Waiter brought the food out quicker than expected.  Bathrooms are located downstairs and there is a separate dining area downstairs with more of the ambiance I like in a restaurant (there was a private party down there).  Would come back to eat if I was in the area!", "Date": "2014-06-18", "Author_Location": "Midtown East, Manhattan, NY"}, {"Author": "Joanna L.", "ReviewID": "iFg6WhrblesEVDOt-CBimA", "Overall": "2.0", "Content": "I loved the way this place use to be....they gutted it since the last time i went. Its way more modern which is cool too but i was more of a fan of the old Kefi..but that's just me. The hostess was ok with my group. We didn't have a reservation so she said it would be 20min. Cool... But she didn't tell us where to wait or if we got a buzzer or how it would work when it was our turn to be sat. Very awkward. There's sooooo many restaurants in NYC with their own methods of seating and hostessing that I feel its the hosts responsibility to let the guests know what to do while they wait and where to go...right?? Anyways... I asked where to go and she said we can have a seat at the bar or go outside. We went to the bar and sat there...we were going to order drinks from the bartender and pay for them upfront before we got sat but the bartender was clearly under the impression that we were just taking up seats in her bar while waiting for our table because she never even looked at us...awkward again because If we didn't want drinks we would of waited outside for our table.We got our table in about 15min which was nice but then to cut this review short....we got sat next to a table that was being very rude to the waiter and so therefore, the waiter came to our table to take our order and drop off drinks ONCE...he stayed away from our area because of the other table...with that being said...you can imagine how asking for the check and paying out went...not well. I'll definitely be back for grandmas meatball.... AND to give this place another shot because our situation was unique so its only fair to try it out again...", "Date": "2014-06-16", "Author_Location": "Manhattan, NY"}, {"Author": "Lesley C.", "ReviewID": "Ul6ILFkRGaSY4661d-h4Ug", "Overall": "5.0", "Content": "Loved the lamb chaps! Cooked to perfection.", "Date": "2014-07-09", "Author_Location": "Manhattan, NY"}, {"Author": "Victoria B.", "ReviewID": "lbclJI1vj4Vb7GvvboLK4A", "Overall": "4.0", "Content": "Great food, the sheep milk dumplings everyone is raving about is amazing, grilled octopus tender and smoky, dips taste authentic. The vegetable side was quite oily, but still tasty. An allover good experience, will be back for the dumplings.", "Date": "2014-06-18", "Author_Location": "Dobbs Ferry, NY"}, {"Author": "A P.", "ReviewID": "Wzjc3Ik2LJM8_SgiU0f26A", "Overall": "1.0", "Content": "Well this place was insanely disappointing.  This was a Yelp fail... don't know what other reviewers were doing but wow it was bad.  Menu was not descriptive and we have food allergies so this is a problem.  We got a dish that didn't list tomato where it was the primary ingredient.  Instead of being polite and offering to take the dish away and replace with something else the incompetent waitress argued over whether the menu listed tomato for the dish - which it didn't - she confirmed later.  She slid the fish onto a plate and told us to pick around and then brought tough broccoli as a substitute.  She was just really bad.  She also brought a salad with peppers and again we can't eat those and was annoyed when I sent it back.  The waitress did almost nothing and the poor bus boys did most of the work.  We were charged for the full $18.95 fish even though we couldn't eat half of it.  My chicken with skin, on the bone, was extremely dry.  Impressive that someone can fail at making roast chicken.  DO NOT GO HERE or be prepared to be disappointed.", "Date": "2014-06-04", "Author_Location": "Hillsboro, OR"}, {"Author": "Nick C.", "ReviewID": "T2A9QgfE-UYjxh3F5CNu6A", "Overall": "5.0", "Content": "Very happy with the Mediterranean food here.  To start we had an octopus appetizer and a several spreads with pita. For our main course we had a whole fish with broccoli rabe and a lemon chicken dish. I would order the fish again. We are looking forward to exploring the menu.", "Date": "2014-06-27", "Author_Location": "Columbus, OH"}, {"Author": "Justin S.", "ReviewID": "mUfLRP_hosUOn1poPTMtzw", "Overall": "5.0", "Content": "Delicious and affordable would be the two best words to describe this place. We ordered about a half dozen appetizers to share between two couples, and every last thing was delicious. The grilled octopus though was, by far, the highlight. Perfectly cooked, slightly tender and well seasoned, it was maybe the best grilled octopus I've ever had. Two bottles of wine and a table full of food, and our bill was less than $130 total. We'll be back.", "Date": "2014-06-23", "Author_Location": "Manhattan, NY"}, {"Author": "William H.", "ReviewID": "wfrHPak3eO4HnZayFA5sUw", "Overall": "4.0", "Content": "Incredible. Greek food is underrated and Kefi is a gem in the Upper West Side. This place simply blows Taverna straight out of the Mediterranean waters. The friendly, attentive staff made sure we were always taken care of and there seems to be plenty of space (multiple floors). Never order chicken at a Greek restaurant...that said, I personally don't eat lamb but can attest to the excellent seafood quality. The grilled octopus was tender and fresh...almost tasted like some type of forbidden land protein. The pita appetizer is a home run too. Multiple difference sauces, all incredibly flavorful. Free refill on the basket just in case too. Highly recommended.", "Date": "2014-04-03", "Author_Location": "New York, NY"}, {"Author": "Sarah F.", "ReviewID": "WjZ_Qi7qMKwIhMkxIMZLkw", "Overall": "3.0", "Content": "I wanted to like it here but found the food lacking. My octopus appetizer was burnt pretty badly, and was sitting on a bed of chick peas so heavily covered in parsley I was picking it out of my teeth for a whole day. I'm not sure that the swordfish I ordered was fully cooked. I had a pretty hard time cutting into it, and it was fairly translucent and clear looking in the middle as opposed to white and cooked. The price was reasonable but I would rather spend a little more to really enjoy my food. Great selection of Greek wines, though.", "Date": "2014-05-27", "Author_Location": "Brooklyn, NY"}, {"Author": "Kendrick W.", "ReviewID": "-N3AWPZ0DAyuSljRLELhOg", "Overall": "4.0", "Content": "Delicious.  That's my memory of this place.  I came on a stormy night, an hour late meeting my friends because my plane was so delayed and this place quickly made me forget it all.  The moment I sat down, the waitress came right over, took my drink order and even recommended some dishes.  I had the sheep milk ricotta ravioli and it was like butter in my mouth.  So creamy and good.  My only complaint was that I felt the portion was a little small, which is unusual for greek places.  But absolutely tasty.  Also the meatballs.  Perfection.  I was a little underwhelmed by the Sangria, but other than that no real complaints.", "Date": "2014-05-26", "Author_Location": "Chicago, IL"}, {"Author": "Kevin C.", "ReviewID": "JKnb3kYu4oNW0PsKBk2zNQ", "Overall": "3.0", "Content": "If your in the UWS the place to go for Greek food would be here. Large restaurant with a downstairs and upstairs. Decor is standard and doesn't wow you and even with a reservation prepare for a bit of a wait.You come here for the greek food. Great apps with hummus and yogurt and their Octopus was grilled perfectly. Had the pressed chicken and it was made great and very flavorful with a bit of crunch from the pressing. If in the area i would stop in again.", "Date": "2014-04-03", "Author_Location": "New York, NY"}, {"Author": "Alisa L.", "ReviewID": "h4OPb3vt4Sy2tTSlUolTlA", "Overall": "2.0", "Content": "1.5 years.  The approximate amount of time Zachary Taylor was in office, or the amount of time I went without Kefi due to its closure/being busy and no longer living in MoHi.The answer is both, but alas, absence did not make the heart grow fonder once we were reunited.To be fair, the food itself was decent, albeit not as good as I remembered.  The sheep's dumplings were merely okay but the sauce was very flavorful, just begging to be scooped up by an extra order of bread.  The lamb burger was also average at best, nothing special and honestly, there are many better burgers in the neighborhood.So far, the restaurant is probably earning a solid 3 stars, but then what merited the drop?The service, oh god, the service.  The food took something like 45 minutes to come, while dessert, which was nothing special and shouldn't have taken that long, took 20.  Any request required attempting to flag down a waiter, already incredibly difficult, and actually ensuring the waiter remembered your request by re-flagging him down and reminding him.  The ambiance was also lacking, especially in the basement.  There was an old moldy smell, though it was very faint, and the place just seemed unappealing.  Perhaps it was the lighting, or the setup of the basement, but this place has definitely lost its charm.", "Date": "2014-03-10", "Author_Location": "New York, NY"}, {"Author": "Jason L.", "ReviewID": "co7e442g4TsVaw9ZHwLb5A", "Overall": "4.0", "Content": "Came here for lunch. If you're a feta fan + mussels fan, get the mussels for the appetizer. It was incredibly good, especially when you dip the bread in the sauce... woah man! We followed the yelper's recommendation and get ourselves the lamb shank. Very delicious, but because of how salty/flavorful the mussels were, it almost overpowered the taste of the lamb shank. So keep that in mind as you're making your choice. My brother had the kefi burger. That thing is HUGE. Not a fan that you have to add money for cheese (who does that?!) but when you have an option to add feta in a burger... go for it! I like this a lot! Cool interior, we had a very early lunch so no one was there yet so that was nice since my family and I wanted to get away from the business of Manhattan... we're tourists...you see...", "Date": "2014-04-15", "Author_Location": "Los Angeles, CA"}, {"Author": "Steve R.", "ReviewID": "pPdqmB-NYwYjMfyWlKE8kA", "Overall": "2.0", "Content": "I had a quite different experience from other Yelpers, because Kefi is way below par... somewhere in the double bogey range. If you must go, I suggest insisting on sitting upstairs, and if you cannot wait for a table there, leave. Downstairs is a loud, windowless, dining area where I felt herded in, like a tourist getting off a bus. In fact, the large groups sitting in another downstairs section, seemed to follow that description. The tables are small, crammed together and it is hard to hear your partner. Guests have to speak loud to be heard, so we couldn't help hearing what our neighbors were saying. It took 45 minutes to get appetizers. The often praised grilled octopus was tender, but it had no taste or brininess to it, as if you couldn't tell it ever came from the sea. Tasted like chicken. The warm feta was good, but I could do that at home. An hour in, we were told that they were out of dumplings, which was the sole reason we went there. Why wait an hour? FAIL. We finally got our good quality lamb chops, under-seasoned and over-grilled, poorly presented on a bed of greens in dire need of flavor. We should have listened to our neighborhood friends and hotel front desk people who didn't suggest Kefi. It really was a letdown.", "Date": "2014-06-24", "Author_Location": "Westlake Village, CA"}, {"Author": "Tara J.", "ReviewID": "gBP5LONGN5jj0lkd1kYLCw", "Overall": "3.0", "Content": "I came here for brunch on a Saturday with my boyfriend, parents, and a friend, and was disappointed that the service and staff were so bad, it almost ruined the good food. First, due to miscommunication on our part, we made two reservations for 5 people. When we got there -on time-, there was no table available for us, and we had to wait for almost 40 minutes for a table to be cleared. How did they not plan for that? What's the point in making a reservation? The manager tried to help but didn't do anything to speed up the process.Then once we sat, it took forever for our waitress to get to us, and then even longer for our food to come out - even though by that time we had told the waitress we were in a rush because we had plans to get to. I ordered some kind of breakfast sandwich with eggs, cheese, tomato, and bacon, on a giant loaf of bread. This was the messiest sandwich I've ever eaten, and the bread was way too large. I had to cut it up just to manage it, but the flavors were delicious. Everyone else enjoyed their food, but also was disappointed by the service. Despite the awful service, I really enjoyed the food and I would give this a second chance.", "Date": "2014-03-06", "Author_Location": "Manhattan, NY"}, {"Author": "Yon L.", "ReviewID": "KrbxD_uiub0AYCtX-BC0jw", "Overall": "4.0", "Content": "Come here by 12pm for brunch and it won't be crowded. It starts getting hectic around 1pm. LOVED the Sheep Milk dumplings. The tomato basil lamb sauce complimented these little treasures so well! The Greek spread was also yums. Really fresh and on point. I can't seem to find it on their menu online, but there was a GREAT Prawns dish on a bed of some grain... I don't know what it's called so this is frustrating, but they were small round bits... larger than quinoa. Reallly well cooked prawns and the other stuff was delicious too. haha.Was not a fan of the Greek Meat and Potato omelette. It was huge but the eggs were overcooked and dry. The sausage was tasty though but this dish definitely went back half finished. Service was great until the 1pm rush. Then our Bottomless mimosas turned into no mimosas for half an hour. Talk about a buzz kill. I'd go back...earlier.", "Date": "2014-02-17", "Author_Location": "New York, NY"}, {"Author": "Rachel B.", "ReviewID": "KwGj__Zgm0dXn78oa0Qu8w", "Overall": "3.0", "Content": "Since moving to the UWS 10 months ago I had been waiting for Kefi to reopen. Many of my friends had recommended the place to me. So, I was thrilled when I managed to secure a reservation last Friday night. Maybe its because the place had been so hyped, but I wasn't overly impressed with my meal. It was good... but nothing I would run back for. The grilled octopus was probably the best dish we tried. But, the rapine was waaay too oily and my simple grilled fish also tasted bathed in oil and butter. The special pasta dish made with a pulled pork was also pretty darn good, but its not that hard to get a good pasta dish in this city.It was also packed that night and we felt a bit rushed by the waitstaff, but that's understandable on a Friday night, and forgivable. Although, jamming so many diners into such a small space and constantly having the waitstaff bump into you really isn't the most preferable way to enjoy a meal. They might want to take out a table, or 3 or 4. The dining room is just so packed.I'm going to give Kefi another try. Hopefully, they were just a bit off that night. And the next time I'll see what all the hype is about and enjoy a great meal.", "Date": "2014-02-17", "Author_Location": "Manhattan, NY"}, {"Author": "lauren l.", "ReviewID": "PpyjVkmdepU64KfNGlMFbw", "Overall": "2.0", "Content": "What a disappointment!  Firstly, we sat at the bar to have drinks and snacks.   It was literally at least 5 minutes before we were acknowledged by the bartender.    She was busy, but a good bartender would know to at least say \"Hello, be with you soon.\"  No.  She walked back and forth and didn't even glance at us.Next-the food.   The dips were BAD!  So surprising because these are not that difficult to get right.  We won't be going back there.", "Date": "2014-03-12", "Author_Location": "New York, NY"}, {"Author": "Kara L.", "ReviewID": "4CaWDlyC41vWs8Y1ydGQzg", "Overall": "4.0", "Content": "Came here on Saturday for dinner with my best friend, and the food was so amazing it made up for some of the restaurants weak points.Since the \"remodel\" kefi has less of a intimate feeling and more of a get in and get out vibe. The two top I sat at was SO close to the table next to us I felt like they were part of our conversation. Also, both my table, and the table next to us ordered appetizers that never came out. My friend and I ordered the tzatziki, hummus, lamb shank, and striped bass which were All amazing. Our grilled octopus never made it to the table, but I saw others eating it and it looked good. I also had a glass of red sangria which was awful, it reminded me of a cheap juice I drank when I was little.The food is worth checking out as long as they keep the idea of quality, not quantity in mind. Also, make a reservation, this place gets packed fast!", "Date": "2014-02-18", "Author_Location": "Manhattan Valley, Manhattan, NY"}, {"Author": "Adam W.", "ReviewID": "aKfv1029XInkpy2T1sDR2g", "Overall": "2.0", "Content": "The food is not bad; it is no longer consistent and good.  The selection is still ... OK to good.  Those are now the only nice (nice-ish) things I can say about a restaurant I used to enjoy weekly, sometimes more often.   Kefi was damaged and spent a few months rebuilding.  When they were closed they lost nearly all of there staff ... and a restaurant takes a team like atmosphere to succeed.   I have been back to Kefi a few times since their reopening, brunch and dinner, and they have failed me every time.  They have problems from management to wait staff to bartenders.   It is a shame. The managment has consistently over booked and understaffed the restaurant while not having trained their staff adequately.  I feel sorry for the people that work there because they are not being given an environment to succeed, let alone excel.", "Date": "2014-03-09", "Author_Location": "New York, NY"}, {"Author": "P L.", "ReviewID": "zuLtRVjQfdyIoseiA0qG4Q", "Overall": "4.0", "Content": "Ambiance: This is a nice casual place to grab a bite to eat. Not pretentious and the staff was very nice and friendly. The manager also came up to us during our meal to make sure everything was okay and if we needed anything.The give bread at the table however since the bread is out before you sit down and seems to have been there for a bit, it was rock hard. We asked for fresher bread which they provided with no problem.We ordered the goat cheese dumplings with spicy lamb sausage-the sauce was very good and the dumplings were soft and pillowy and yummy. The only negative of the dish was the lamb sausage which was very hard and tasted funny.We also ordered the chicken sandwich and the chickpea fritter sandwich. Both were good and came with homemade chips and salad. Con: salad was a bit limp and overly covered with dressing.Overall, a good dining experience- you can be in and out in under an hour. I would go back again.", "Date": "2014-06-01", "Author_Location": "Brooklyn, NY"}, {"Author": "Linda L.", "ReviewID": "lI9RG5Ovflk9LcQVAfFWXw", "Overall": "2.0", "Content": "This review is based not on the food, which was delicious, but some of the most disorganized and chaotic service ever.  Four of us arrived at 7 pm for a birthday dinner and soon after ordered drinks.  45 minutes later I had mine but my friends had not.  One had ordered a virgin bloody mary and the two others vodka on the rocks.  Not complicated.  About 7.55 our appetizers arrived.  Still no more drinks.  We were told after repeated requests that the bar, which was in front of us, was backed up and the waiter himself could not make the drinks.  There was one bartender.  Then waiters seemed to gather to try to sort the mess, the bartender left, and finally the manager stepped in, very late in the game.  We all got drinks about the time the entree arrived.  Why the manager did not see what was going on and step in we could not understand.  It was a train wreck.  And by the way our waiter, who was doing the best he could, delivered the vodka on the rocks with a lemon twist with a lime wedge instead.  Under the circumstances we felt lucky to have drinks at all.  Quite a shockingly bad experience for a good restaurant and not at all appropriate to the quality of the food which was great.", "Date": "2014-07-08", "Author_Location": "Manhattan, NY"}, {"Author": "chip h.", "ReviewID": "W_quj1kp-RBb0NiXCIkumw", "Overall": "4.0", "Content": "The Octopus is still Amazing!!!!  Some people are complaining about the service but I'm sure as soon as the new servers become better seasoned that will no longer be an issue.  I am not a fan of the upstairs so I always have a few cocktails next door at Prohibition while I wait for a table downstairs.  Upstairs (very loud and congested), Downstairs (Cozy and much quieter).  The Lamb shank was still delicious and everyone at my table enjoyed their meal.  The service was a bit on the slow side but the guy was super friendly and trying his best so no big deal.  Love it......Sit downstairs.....Get the Octopus!!!!!", "Date": "2014-05-18", "Author_Location": "New York, NY"}, {"Author": "Tracey M.", "ReviewID": "fEe3btwniJEyhrs14FpIOg", "Overall": "5.0", "Content": "I really like this place a lot. They're a little slow at the checkin desk... But they totally make up with it for the good fresh food and the robust menu. If you can get there before 6 o'clock they have a prefix menu that first $17 gets you an appetizer an entrée and a dessert. For New York -- that's amazing.", "Date": "2014-04-30", "Author_Location": "Los Angeles, CA"}, {"Author": "Erum R.", "ReviewID": "UArx5BI9r7edz_pfFrkgbg", "Overall": "3.0", "Content": "I don't know what all the hype is about. I came here for dinner one night with the hubby and was not pleased. You'd think they have an amazing menu because the wait was about 45 minutes for a Thursday night but it really was not so impressive.Husband had the chicken souvlaki sandwich which he said was really dry. I would have thought they'd have more souvlaki options on the menu (like a platter with sides versus a sandwich) and found the menu limited. I ordered the branzino which was very good but extremely oily. There was so much olive oil on that thing that I felt pretty disgusting at the end of it. We had a crappy table in the middle of the restaurant and kept getting pushed around by rushed waiters. Not the best experience. My husband went to use the bathroom and was grossed out by how yucky it was so better to hold it in!", "Date": "2014-02-12", "Author_Location": "New York, NY"}, {"Author": "Zaman K.", "ReviewID": "GTv8hZUpw71F8JE-KBuxyw", "Overall": "4.0", "Content": "Ever since Michael Psilakis opened MP Taverna in Astoria, I've been a fan and have wanted to try out some of his other restaurants, mainly Kefi.  We got word that it had finally reopened after being closed for so long and we wasted no time in booking a table.This place is popular so reservations are a must.  Even though they had barely been open a week,  it was packed inside. The menu seems more casual than MP Taverna. Once again my wife and I ordered more than we should have. Grilled Octopus with Bean Salad: I couldn't help but compare the grilled octopus here with MP Taverna's. Both have a perfectly soft texture inside but the one at Kefi was over charred. Some people may like this version, but I think there is an ideal amount of char that makes a dish taste great and anything above that is overkill. Still very good though. 4/5Sweetbreads, spinach, shallots, garlic:  I love sweetbreads - especially chunky, mouthful of sweetbreads.  The spinach gave the dish good balance and the fried shallots provided the texture. 4/5Chef's app plate: This wasn't on the menu but since we mentioned Kefi on Facebook, we got a free app from the kitchen. The app plate consisted of four kinds of dipping sauce: chickpeas, tzatziki, caviar and eggplant. They were all good. I was surprised by how much mint there was in the chickpeas but it tasted refreshing. The tzatziki was among some of the best I've had. 4/5Flat pasta, pulled braised rabbit, graviera cheese: I realized that I'm not a huge fan of graviera cheese because it's a bit too sweet and fruity for my liking but the braised rabbit was so good that it didn't bother me too much. The pasta was thin, wide and flat. It's hard to maintain the texture for this kind of pasta but they were able to. A light tomato sauce brought the dish together 4/5Sheep's milk dumplings, tomato, pine nuts, spicy lamb sausage:  This was my favorite dish of the night but I'm partial to all things spicy. All the flavors were bold and the spicy lamb sausage was basically very good quality merguez. There was a lot of tomato sauce present throughout this dish which paired very well with the sausage and the excellent dumplings. 5/5After eating so much food, we obviously didn't have room for dessert, but much of the dessert menu looked similar to MP Taverna's so we left with no regret.  The restaurant is pretty casual but downstairs, where we sat, it was better to come in a group of 4 than 2 because of the way the tables were spaced. They had the tables of 2 on one side which were very close to one another and tables of 4 on another side which had more space in between. They should have tables of 2 and 4 on either side.  Service was good throughout.Glad we made the trip to UWS for this. It's an area we don't come to too often but Kefi was certainly a good reason to go up there.", "Date": "2014-01-07", "Author_Location": "Astoria, NY"}, {"Author": "Erin D.", "ReviewID": "SgHEap5RZusA6F_CLFv7Dw", "Overall": "4.0", "Content": "I feel like I'm cheating on my chosen people in the Upper West Side when I sneak into Kefi to devour their huge, succulent, absolutely-couldn't-be-more-perfectly grilled shrimp. So tender. Scattered generously over the orange citrus salad, it's easily one of the most delicious, naughty non-kosher lunches to be had in this part of town. It's hard to believe I spent almost the same price for a boring over-chopped make-your-own salad next door at Lenny's.... eh. The egg dishes on the lunch menu pale in comparison to the grilled meats, wraps, and assorted dips. At $11 with a Greek salad included, the frittata is a good deal, but pass it up. Get the mezze appetizer, and dig in with their warm grilled pita points - the fish egg spread is other-worldly. Kefi also has notably good service, with waiters that hail from the homeland and know their stuff.Get 'em to the Greek.", "Date": "2014-01-08", "Author_Location": "New York, NY"}, {"Author": "Meredith X.", "ReviewID": "gSkXfaGrAkSLbESq-vewgA", "Overall": "4.0", "Content": "I'm not usually a fan of Greek/Mediterranean food. My palette is more accustomed to a bombardment of flavors and spices. Kefi's emphasis on basic, high quality, lightly dressed ingredients has changed my perspective!Came here with a bud the other weekend, chat bond time over glasses of sangria and cab. We ordered the grilled octopus, pickled beet salad, tasting of spreads, and sheep's milk dumplings. By far, my favorites were the grilled octopus and dumplings. Octopus perfectly charred, hint of lemon, atop a bean salad, both hearty and refreshing. The dumplings were an indulgence, pillowy dumplings nestled in a rich and thick tomato sauce, topped with fresh feta cheese. The only drawback I would note is that it was difficult at times to find our server. Place was busy as hell though so I'm sure his hands were full. A lively, bustling spot, Kefi has inspired me to explore more of the UWS.", "Date": "2014-01-23", "Author_Location": "Boulder, CO"}, {"Author": "Julie E.", "ReviewID": "0RTQNSITb84E-j0L4o6eOA", "Overall": "1.0", "Content": "Meh. Sangria was good but service was slow. Food was only okay. I live in Salt Lake City and was really surprised how far the quality of what is considered \"good Greek\" in NYC compares to that I SLC.", "Date": "2014-06-24", "Author_Location": "Salt Lake City, UT"}, {"Author": "Woo L.", "ReviewID": "YEAHLQmpJR5fdC8gPozckw", "Overall": "2.0", "Content": "Pros- octopus was still good- cleanCons- loud music- music selection didn't fit the cuisine (techno-ish)- the rest of the food was between \"meh\" to too salty- waiter was too busy and rushed us- waitstaff seemed to just be lounging around- lighting and decor is all wrongSummary:I used to love coming here before the renovation. Now it's not even an option.", "Date": "2014-04-19", "Author_Location": "Manhattan, NY"}, {"Author": "Meenie M.", "ReviewID": "0m_d3ns40akKE69iJszOlQ", "Overall": "3.0", "Content": "Seems to always be busy! Got reservations at 8:45, got seated at 9:20 that was kind of a bummer, service was nice, food was tasty, dessert was yummy... Prices are very reasonable!", "Date": "2014-02-03", "Author_Location": "Manhattan, NY"}, {"Author": "Am I.", "ReviewID": "CQNYFCbKUeVthYJCR7JZ-A", "Overall": "4.0", "Content": "4 Stars for the food! We had a large group celebrating an important milestone for two friends, and all the food was fantastic! 1 Star for the service.  I don't think I have ever met a waiter that has hated his life so much. Which is sad, because even though we don't drink, we eat, a lot, at the end of the day, we aren't bashful, and we order lots of things to try. This guy literally hated his life.  I don't know if he was just having a terrible day or whatever, but, dude, it's your job. Fake it.", "Date": "2014-03-12", "Author_Location": "Fairview, NJ"}, {"Author": "Jane N.", "ReviewID": "85S_QCZ8EKUIxVvHyFAr5w", "Overall": "5.0", "Content": "Amazing Greek food. The ambiance is wonderful especially downstairs. Great place for a date. It is affordable and fun to share a few dishes and enjoy family style. Great restaurant, glad it has finally reopened!", "Date": "2014-06-22", "Author_Location": "Manhattan, NY"}, {"Author": "Gee P.", "ReviewID": "D-kdatU-Of0yH8M9GUdk1g", "Overall": "1.0", "Content": "Walking out of a restaurant after being seated is embarrassing. I would rather have never experienced it. Last night, we did just that.Kefi, is loud and the lighting is horrible. I made a reservation there for my fiancé's birthday. I felt extremely terrible about it as soon as we walked in.The restaurant felt more like a fast food chain with florescent lighting. The crammed us in a hallway in the basement thinking that was okay. Me fiancé sat on the bench literally rubbing elbows with the other patrons on a seat barely 6 inches deep. Maybe the food is good but the ambience is just so awful I don't think it's worth it.", "Date": "2014-01-12", "Author_Location": "ASTORIA, NY"}, {"Author": "Lori L.", "ReviewID": "0u-f-iL-zK_maYVF1w_6cA", "Overall": "4.0", "Content": "In an area that isn't exactly known for its culinary landscape, Kefi is quite the gem in the Upper West Side neighborhood. With Michael Psilakis, one of the forefront chefs in Greek cuisine, heading the kitchen, all it took was a quick skim of the menu before I promptly made a reservation for brunch.Conveniently located next to both 86th Street Stations (the 1 and A/B/C), Kefi has one of the most deceptive entrances. The actual doorway is extremely narrow and easy to pass by, but enter, and you'll set eyes on a large, high-ceiling dining room with far too many tables to count. Even better, Kefi has a lower level that can accommodate larger parties and serves as venue for private events. We were quickly seated at a two-top near the front and given the brunch and specials menu. For those that enjoy it, Kefi does offer a \"bottomless brunch\" option, which gives diners a (hypothetically) unlimited number of glasses of mimosa, sangria, or bloody mary's to accompany their meal.We started off with an order of the Albondigas, a traditional Spanish meatball dish that was given a few splashes of Greek cuisine. The meatballs (4 pieces) were tender and full of flavor, a combination of ground pork and lamb seasoned with plenty of garlic, parsley, and dill. The tomato sauce that came with it had the requisite Italian garnishes of onions, garlic, and bay leaves, with a hint of red wine, but also came strewn with tsakistes and kalamata olives. It wasn't a pairing I initially would have thought of, but the tartness and slight bitterness from this addition complimented the dish well.For the main course, we opted to share two of Kefi's signature dishes: the Kefi burger and the Sheep's Milk Dumplings. The burger was one of the better ones I've had; there's some brisket mixed into the beef, which adds an additional layer of juiciness into the patty. Cooked to a medium rare, topped with a generous layer of feta cheese, and finally sandwiched between two halves of ciabatta, it's an impressive piece of work, especially when paired with a Greek salad and a pile of french fries on the side. The Sheep's Milk Dumplings were also a solid dish, though one that seemed as though it had been hastily conceived. It's a Greek pasta dish, featuring a pillowy, gnocchi-like dumpling accompanied by pine nuts, spicy lamb sausage, spinach, and a healthy dose of garlic, all cooked in a robust tomato sauce and finished off with crumbled feta cheese. It reminded me more of a casserole than an actual pasta dish, but the ingredients paired well together and made for a hearty meal.Across the board, Kefi is a solid restaurant and it's no wonder that so many, locals and non-locals, were delighted to hear of its reopening. With plenty of tasty, reasonably-priced dishes served in a such a welcoming environment, it's not difficult to see why.", "Date": "2014-03-27", "Author_Location": "Jersey City, NJ"}, {"Author": "Lawrence R.", "ReviewID": "V7L_P5lRLqCGV8Ay3-j4vw", "Overall": "2.0", "Content": "I cannot, for the life of me, understand how this place gets such good reviews. I've given it 3 tries, partly because I work so close to it. Every meal has been lackluster and one dish, I even had to send back...the spaghetti with Greek bolognese. It was so sweet and cinnamony, I couldn't eat it. I know Greek food. I love Greek food. I've been to Greece twice. I've been to many Greek restaurants here in NYC. I enjoy the cuisine. I know that sweet spices are used in some savory dishes in Greek cuisine. I don't have a problem with that. But balance is everything. I don't know. Maybe I've ordered the wrong things, but if 8 dishes on your menu aren't good, that's a problem.", "Date": "2014-05-13", "Author_Location": "Brooklyn, NY"}, {"Author": "Lou G.", "ReviewID": "-TOPvUkkbcrkItNxvVQNlA", "Overall": "3.0", "Content": "Delicious food but portions are small.  Do not go if you are very hungry.Average service, good ambience.My credentials are I'm Greek.", "Date": "2013-12-21", "Author_Location": "Woodcliff Lake, NJ"}, {"Author": "Mb K.", "ReviewID": "4C3Ziq9arabsgdNVn8JQjw", "Overall": "2.0", "Content": "I love me some KEFI LOVE! No one was more psyched then me to see them reopen on the UWS after a long hiatus.  I could not wait to get my fix of sheeps milk dumplings more on that later. HOWEVER I don't usually write reviews but the service was so bad at our dinner last night I need to vent. We had a 8:30 reservation. We did not get seated until 9pm. Ok not a big deal. Went down down hill from there. We were sooo hungry that we told the waiter we were ready to order when he came over to ask about sparkling or flat. We will take tap thanks. He fills our water glasses and then walked AWAY. Did not come back for 15 minutes.  Then we finally get a drink order in and for our party of 6 ppl he forgets 2 of the 6 drinks.  FINALLY get our food order in. And to my dismay they were out of sheeps milk dumplings. DAMMIT.  The table seated next to us who sat down after us managed to get them. WTF.  Oh and they left well before us as well.  Apps finally come at 9:30 and they forgot one of the apps! Ordered another round of drinks and he forgets  the same 2 vodka sodas  AGAIN.  Main course is served at 10:30!!! Food got cold because we were eating family style and had to ask 3 different people for sharing plates so we just stared at it for 5 minutes.  Eating your main course dinner at 10:30 when your reservation was at 8:30? So much for having a friday night on the town.  We did not get out of there until 11:15.  Waited another 30 minutes for the check.I will never say a bad thing about the food here. The food was, is and continues to be AWESOME.  Meatballs, Sheepsmilk dumplings, Grilled octopus and the greek salad, lamb chops all winners. I would give the food 5 stars. Well priced too. But the service was beyond bad.  Awful. Worst I have had in a while.  We are not douches and still left him a 15% tip and we won't stiff the guy but he deserved 5%. He came over at one point and asked what else did we order and did not get because he clearly was in the weeds and did not have his shit together. Kefi your food rocks but your staff needs some serious help and fast. I don't think they are ramped up for a reopening.", "Date": "2013-12-21", "Author_Location": "Manhattan, NY"}, {"Author": "elizabeth g.", "ReviewID": "Q7ThIEXg1TsY0u0IZTDd8A", "Overall": "4.0", "Content": "I thought the food was really good, and the restaurant was very busy.  It had a light and open feeling to the restaurant.I ordered the sheep's milk dumplings, and they were really really enjoyable.The service wasn't wonderful, but it wasn't terrible either.I'd definitely consider going back.", "Date": "2014-05-12", "Author_Location": "Manhattan, NY"}, {"Author": "Kevin B.", "ReviewID": "ut0xpzIZliHwQggvMFcwWg", "Overall": "3.0", "Content": "Edited 12/29.First tried to get in as a party of 2 on Friday 12/20.  Was told that there was a 30-45 min wait.  No problem, we'll walk around for a bit and come back.  Came back after 20-25 minutes and were told it would be another 10-15 minutes.  Then we waited.  And waited.  And waited.  30 minutes later, we asked for an update and were told it would be another 30-40 minutes.  We said \"Fuck you very much\" and went to B Cafe instead (which is consistently awesome).  Fast forward to 12/28.  Our group of 7 had 8:45 reservations.  We finally were seated around 10:15.  Of course, by 10:15 they were already out of the sheep milk ravioli... something tells me if we got seated on time, there would have been some left.  Also, we had 2 people order branzino and the rest order the dumplings.  They brought us 6 orders of branzino instead.  So yeah, a lot was lacking.That being said, they did fess up to screwing up left and right, and wound up comping most of our meal (total for 7 people, including appetizers, entrees, and multiple drinks each was around $80).  The dumplings entree and meatball appetizer were out of this world good (pro tip - if you have the sauce that accompanies the dumplings left over, take it home and use it as a dip for chips the next day).  The pita and dips were pretty good also.  Greek salad was average.  All in all, the food is good enough to merit another try, but they clearly have no clue what they're doing seating-wise.  Kefi, you get one more chance with me... don't screw it up.", "Date": "2013-12-28", "Author_Location": "New York, NY"}, {"Author": "Mi W.", "ReviewID": "i2gumfKr8YA6SJzFSx0Grw", "Overall": "5.0", "Content": "The food has been consistently good. The staff are always nice and helpful.", "Date": "2014-05-06", "Author_Location": "Manhattan, NY"}, {"Author": "Geoff W.", "ReviewID": "l1s5uqBecjULfWao4ddb1A", "Overall": "2.0", "Content": "Kefi was not ready to reopen.I ordered food from the bar and it took over an hour. The bartender and manager had no idea when the food would be ready. Because the food took so long, they tried to sell me some additional starters. When the food finally came, it was good. The person next to me was served very cold food. I hope things get better because this place used to be great.", "Date": "2014-01-15", "Author_Location": "Manhattan, NY"}, {"Author": "Steve N.", "ReviewID": "SlJrwuenbj-Rxa6Ma0itVA", "Overall": "4.0", "Content": "I'll add my fuel to the fire for this place, which is getting all the love it deserves from Yelpers, seeing that there's more than 700 reviews and four stars.Here's my first visit details, the tips and the bonuses:Warm feta starter ($7.95): More bread than toppings. My tip: skip.Crispy calamari ($7.95): If you like calamari, this is fine. The tzatziki sauce is a nice change. We sopped that up with the bread from the first starter.Sheep's milk dumplings with spicy lamb sausage and pine nuts ($14.50): This has a spicy tomato sauce, lots of feta, and rich, fluffly dumplings shaped like small pillows with chunks of lamb sausage mixed in. Sea bass with Brussels sprouts and potatoes ($17.95): Crispy skin highlighted the perfectly-cooked fish served in an nice-sized portion. Wine - Elios ($35): Nice, and the GF thought it was a good value.TOTAL: $90.75A second visit, as good as the first:Bar snacks - chicken thighs, feta, keftedes, 3.95 each; side of pita, 1.5Wine, red, Rapsani, 10, spicyWine, white, sauvignon blanc, 11 glassLavraki (whole roasted branzino), 21, excellentKima, tubular pasta with chunks of short rib, 14, delightfulTOTAL: 103.7, we drank a little moreBONUS: Good value, especially on the wine.TIP: You can eat at the bar - that is probably ideal for two. The dining rooms seem noisierTIP: One starter and two entrees (or two starters and the sea bass) would have been enough for the two of us.TIP: If you sit at the bar, ask for the bar snacks menu. There are some good choices there.TIP: The chips with tzatziki are pretty good, but they are just potato chips", "Date": "2013-12-30", "Author_Location": "Brooklyn, NY"}, {"Author": "MaeAnn D.", "ReviewID": "qe-7NG03Dord3sTsODEYEg", "Overall": "3.0", "Content": "OMG, the grilled octopus...so soft and tender...and I loved the little bits of char on it!The lamb shank was fall-off-the-bone tender...and the branzino was delicious!The servers were friendly but the service was not that great...we ordered drinks but they kept forgetting to bring them, and it wasn't even like the place was busy or crowded that day. We also waited a long time for our entrees to come out.", "Date": "2014-03-08", "Author_Location": "Manhattan, NY"}, {"Author": "Eric C.", "ReviewID": "7Fa0xGE6axda9Xr6ekA8Xg", "Overall": "5.0", "Content": "I'm a big fan of Michael Psislakis's restaurants.  Fishtag is great.  Gus and Gabriel (the gastropub that occupied Fishtag's space previously) was great.  I'm really happy that Kefi made it back to the UWS in good shape after having been closed for a year.The restaurant feels more open now, especially in the main dining area.  The bar is very large and has a clean feel.  Everything is more streamlined than it used to be.  The open space makes it very comfortable to sit and relax, something that's lacking in a lot of NYC establishment.  As you move further into the restaurant and even downstairs, it may get a little tighter and more cramped.  I sat downstairs for dinner after its reopening and while there were tables on either side of me, it didn't feel cramped.  There was some thought put into the acoustics to ensure that you could hear your date from just across the table, as confirmed by an interview with Psilakis on Gothamist.The food is awesome.  The entrees can be big, like the lamb shank, so be prepared to share or order a bit less.  I always like eating the spread, every dip they give you is great.  Ordering extra pita is relatively cheap too.  The prices are great for the area.  Even just spending around $30-40 per person will get you a ton of food.  So if you aim at $30 a person you'll be well off and have an enjoyable evening and not feel too stuffed.Definitely try their grilled fishes.  Very fresh and comes with a bunch of broccoli rabe.  And if you're adventurous, get the sweetbread.  It's awesome.Will come back many many times.", "Date": "2013-12-13", "Author_Location": "New York, NY"}, {"Author": "Yan H.", "ReviewID": "9je9S9vFFU4Wd-KpaTvUcg", "Overall": "4.0", "Content": "Are you kidding me?! I was fortunate to be treated to a multiple course meal at Kefi, and every dish was DIVINE. From the appetizers to the salad to the braised rabbit to the dessert, every dish placed before us was delicious. Lamb shank, meatballs, delicious pita, pulled rabbit, spreads... I was in heaven with my meal at Kefi. I would rate the plates from the low end of very good to the high end of mindblowing. Words do not suffice, just go now!The only reason Kefi isn't 5 stars by me is the ambiance upstairs where we were seated, which was just okay. Quite bright and packed with tables cafeteria style, it was remarkably loud and crowded on the Saturday night I dined here. While I don't need darkness and silence to eat, it was a bit much. My meal was too amazing for me to care an awful lot, but if I became conditioned to such food quality, I may have felt more miffed.", "Date": "2014-05-11", "Author_Location": "Brooklyn, NY"}, {"Author": "Shazeeda B.", "ReviewID": "hY2lsijD4cp_1X-iVzFPgg", "Overall": "4.0", "Content": "Make a reservation, absolutely. First and foremost, the food is amazing. A little loud for a date, but fantastic otherwise if they can accommodate your party. They're quite busy due to their popularity. Don't get the greek margarita; way too sweet and oddly sour.", "Date": "2014-05-04", "Author_Location": "Manhattan, NY"}, {"Author": "Win C.", "ReviewID": "zEu2rpQJeUIiXVs-3-b2aQ", "Overall": "3.0", "Content": "Came here to celebrate a great friend's birthday. We had a party of 8 and they were able to seat us relatively quickly. The place looks small and packed, but I heard there's more space downstairs too!Their food was okay in my opinion. We ordered a pitcher of both red and white sangria. Although both tasted watered down, I preferred the white over red. The Warm Feta, Tomato, Caper, Anchovy, Pepper, Olive, Pita Bread and calamaris were good starters for the table. My swordfish had a smoky taste to it, but my cauliflower side was delicious! My favorite dish of the night was dessert. They bought out a dessert plate for the birthday girl. The chocolate mousse cake was very rich and creamy...and who can resist a scoop of classic vanilla ice cream! Everything was very reasonably priced considered being on the Upper West Side of Manhattan.", "Date": "2013-12-29", "Author_Location": "Fresh Meadows, NY"}, {"Author": "Kim N.", "ReviewID": "is5_UWEirz5T6L4CdxBVmg", "Overall": "3.0", "Content": "One of the first places I tried after moving to the UWS and loved it!  Was sad to see it closed and excited for its reopening and to remind myself again of how good the octopus dish was.Came by during Sunday brunch recently and things just felt...off, and I was a little surprised that the quality of the food was slightly different.  Service was a little rushed and we had a hard time flagging down our waiter when we were given the wrong orders (breakfast sandwich instead of souvlaki, and sautéed broccoli rabe instead of brussel sprouts).  Didn't mind the vegetable switch perse but it was swimming in oil and lukewarm, and the waiters kept insisting we had received the souvlaki instead of the egg sandwich when it was clearly not souvlaki (where was the pita, peppers, or sausage?  Why fries?) in front of us.  The souvlaki was fresh off the griddle and decent tasting but the skillet egg dishes looked better at the adjacent tables.To be fair, they kindly took off the erroneous charge for the vegetable side only to accidentally also charge us for both the untouched sandwich and the souvlaki!  They were very nice about fixing their mistake, however, and the bill eventually reflected what we actually ordered.The bf and I were bemused because we were having a pretty chill weekend day, but I'm guessing about 1/3 of New Yorkers would have had a slightly different reaction to the chain of errors.Will have to give them another try because  my memory of the food is quite different, and I'm guessing it was an off day for service.", "Date": "2014-02-17", "Author_Location": "Upper West Side, Manhattan, NY"}, {"Author": "Damionitis J.", "ReviewID": "qF2Ifg5Kni11rU7OUN7-2A", "Overall": "4.0", "Content": "Very nice spot.  Food was really good.  vibe was relax and simple.  Not a place to go and get rowdy but a real good spot to go for a meal and conversation with a partner.  Lots of parents will bring kids here so keep that in mind.", "Date": "2014-04-22", "Author_Location": "Morrisania, Bronx, NY"}, {"Author": "Julie F.", "ReviewID": "gXZt1C6BFVZWXOys9lxWog", "Overall": "4.0", "Content": "Pros:  Had a fantastic meal at Kefi.  Everything looked and sounded so good we decided to get a selection of appetizers to split- mussels, octopus, greek salad, homemade lamb sausages- amazing!! From our experience you can't make a bad choice here.Cons: We were seated down in the basement which wasn't the most comfortable setting.  Decor was sub-par and it didn't feel very social.  When making reservations make sure to ask for a floor level table!", "Date": "2014-02-24", "Author_Location": "Manhattan, NY"}, {"Author": "James S.", "ReviewID": "MGfElecWSaD3_3QwZGpDwg", "Overall": "2.0", "Content": "Went here tonight for a friends birthday dinner.  Extremely disappointing.  Was here about 2 years ago and had a fantastic meal.  Tonight something just seemed off.  The place had good energy and was packed especially considering it was before 8pm.  Our waiter while polite and attempting to be responsive was far from it.  Brought our initial round of drinks maybe 20mins into the meal.  Those that ordered soda had to have it brought back as there was no carbonation.  He seemed to have already known this was a problem, acknowledged it, but still brought the drinks anyway?  We settled for some unsweetened iced tea.  3 of the 4 ordered whole fish.  Again the waiter presented all the options for the night.  I opted for the whole grilled red snapper.  10mins later the waiter comes back and states that there is no snapper available tonight red or silver?  Again is this not something that should be known up front?The birthday boy ordered a greek salad and a chicken gyro.  Only to learn that when his meal came it also came with a salad on the side?The good was ok, nothing special nothing outstanding.  I guess our real issue was with the service and lack of communication.  I would come back being that the food is of medium quality and for the area it is relatively reasonably priced.  The high note of the evening is definitively the grilled octopus salad.  It was FANTASTIC!!  I highly recommend it.", "Date": "2014-02-23", "Author_Location": "Williston Park, NY"}, {"Author": "Jami C.", "ReviewID": "zeBAYniTcXxigW5Ln9QCWw", "Overall": "2.0", "Content": "Was really looking to the reopening and finally getting to try Kefi. Unfortunately I was disappointed with our meal. As the reviews noted, the service was not attentive after we ordered. There seemed to be plenty of assistance so I am not sure what the issue was. We ordered the sheeps milk dumplings that everyone raved about. When they arrived, they were almost cold. I wanted to send them back but figured they wouldn't be returned in a timely fashion. The dip spread was pretty good but the second order of pita came with the check. They should have removed it but they didn't. The chicken soup was the highlight of the meal. Ironically it was so warm in there I didn't want to order it but we did anyway. The brussel sprouts we ordered never arrived. They flat out forgot about them. Good job.The house red wine for $6 isn't a bad deal but stay away from the house white. It is not drinkable.", "Date": "2013-12-31", "Author_Location": "Manhattan, NY"}, {"Author": "Michelle R.", "ReviewID": "6p-via8l2-yURp103RpNtA", "Overall": "3.0", "Content": "First I have to say: it was my first time here and the food was amazing! With that said, my boyfriend and I made reservations for 845pm. I \"checked in\" 3 times because every time I gave my name they didn't say if everything was good to go. It was really packed and cramped in there so I figured it would take some time to get seated. By  9pm my bf decided to ask how much longer for our 845 reservation and somehow we were never checked in so we weren't called. But they sat us soon after so that was fine. Again, the reservation was for 845. We got our meal at 10:00pm. That was a long wait for the meal to come out. The waiter never checked in on us either. All in all: great food bad service. But I plan to come back and hopefully add a couple stars to my second visit at an earlier time perhaps during a week day instead of a weekend.", "Date": "2014-01-10", "Author_Location": "Bronx, NY"}, {"Author": "Mike O.", "ReviewID": "kVNRwAvoMhck36EadwDbkA", "Overall": "3.0", "Content": "Like, if you like Greek food, you'll likely like Kefi. Ordered deliver here with a friend last night, and it arrived a half an hour before the estimate. Talk about managing expectations. The fries were a little soggy boo hoo, but the chicken pita/wrap/gyro was all grilled and tasted like all the goodness that sticks to a grill all day. Good stuff. The wraps/pita/gyros come with fries and a side salad. Go to town. In your apartment, that is. Or go visit. FYI beware ordering the pasta because it tends to overcook while it's being delivered, but obvi I can't speak toward the actual dining experience.", "Date": "2014-03-22", "Author_Location": "New York, NY"}, {"Author": "JB S.", "ReviewID": "xHOi_GNxJsOHiB22sw323A", "Overall": "2.0", "Content": "We ate here last night, and while the food was good, the experiences was \"eh.\"We sat in the upper dining room, which is a lot less attractive than the lower dining room. It was extremely loud (which, sometimes, I get, can be fun). But it was also really cramped, and not in that intimate, fun way that most cramped Manhattan restaurants are. The chairs and tables were cheap and I kept getting bumped from behind (ay, oh!). I left here sweaty and in need of air (ay, oh, again!).", "Date": "2014-04-30", "Author_Location": "Manhattan, NY"}, {"Author": "Stacey F.", "ReviewID": "xB55k8eyoRYCjk86gQ-gEQ", "Overall": "4.0", "Content": "This place was great. The seating area is large and not cramped. I ordered the chicken souvlaki pita and switched the chips for grilled brussel sprouts which were out of this world. The chicken pita was good but needed more tzatziki so we ordered a side of it.  Great food and the price is right.", "Date": "2014-03-04", "Author_Location": "New York, NY"}, {"Author": "Amy D.", "ReviewID": "HDx7ood6Z-LW-BNnUq1TAQ", "Overall": "2.0", "Content": "Ordered from here recently. The food was almost cold when it arrived, but whatever, we have a microwave. Still, not a great start. I got the meatballs appetizer. They were sitting in a thick, velvety sauce. They were good, but not great. Almost too salty.I was really looking forward to the lamb burger...however, it was almost inedibly salty. The meat also didn't really seem like lamb. It seemed more like pork, oddly. But the orange, feta-y sauce that came on the side was surprisingly good. So was the side salad with feta and cherry tomatoes. Although when the best part of a dish is the side salad, that probably doesn't say anything very good about that restaurant.I tried a bite of the famous dumplings, too, and it was just meh. The taste of everything was just off somehow.Don't think we'll be getting from here again.", "Date": "2014-01-01", "Author_Location": "Manhattan, NY"}, {"Author": "Joseph C.", "ReviewID": "ikKg32J9wzD7Ug_E7Zt5tA", "Overall": "4.0", "Content": "Greek/Mediterranean fareI ordered the braised rabbit which was very satisfying. The meat was tender and moist and not over seasoned. It was my first time trying rabbit and apparently it was one of their signature dishes as I over heard the manager or boss suggest it to a few other customers. The waiter was very helpful and helpful and  prompt.", "Date": "2014-01-01", "Author_Location": "Houston, TX"}, {"Author": "Vicki C.", "ReviewID": "vS-4IpAVZhw0WoB0hqmY1w", "Overall": "5.0", "Content": "The sheeps milk dumpling was so good, first place I came to eat right after getting off the airplane. So much flavor and the dumpling had an amazing texture. Definitely will be coming back to try the seafood!", "Date": "2014-04-05", "Author_Location": "Diamond Bar, CA"}, {"Author": "Chris T.", "ReviewID": "RZpzUzb_wp-YISnCvTCuqQ", "Overall": "5.0", "Content": "Personally I thought the lamb chops and appetizers were really excellent. The space is simple but the service is nice and the prices are reasonable. I'm not sure everyone else in my party was so enthusiastic about their food but I was happy with mine.", "Date": "2014-06-01", "Author_Location": "Brooklyn, NY"}, {"Author": "Greg T.", "ReviewID": "fEAroB36ZDauBxxtSNKT6g", "Overall": "5.0", "Content": "Absolutely amazing food, amazing staff and amazing atmosphere.  Drinks are strong and decently priced for the neighborhood. It's quieter downstairs and people won't bump into your chair as much. If you're around here, eat here. You won't regret it. Recommend: hanger steak, octopus, sheep's milk dumplings - everything we had was so delicious and authentic.  Plus the owner comes around and talks to each table!", "Date": "2013-12-29", "Author_Location": "Raleigh, NC"}, {"Author": "Alex T.", "ReviewID": "DSgt2aKwuG-Y1NYxpz1O0w", "Overall": "4.0", "Content": "I liked Kefi a lot, as did my ex who is not quite so adventurous.  I even got her to try the sweetbreads, which she really loved (and so did I).  I'd come back here again the next time I'm in the area.", "Date": "2014-02-18", "Author_Location": "Philadelphia, PA"}, {"Author": "Colleen S.", "ReviewID": "AQUgIXh_i4HUWxhjTmOdaA", "Overall": "4.0", "Content": "Food and service was great! House wine was $6 a glass which was a nice perk. Highly reccommend making a reservation (it was packed at 9pm on a Saturday).", "Date": "2014-03-30", "Author_Location": "New York, NY"}, {"Author": "Pauline P.", "ReviewID": "uAfYciyl3aaN9xe0CJZ3-w", "Overall": "3.0", "Content": "Although Kefi was good, I felt it was over-rated and over-priced// LOCATION // UWS// SERVICE // The ambiance in Kefi is very cozy and we were sitting downstairs where it felt like we were in someone's living room. The bartender quenched our thirst while waiting for a table// FOOD //      + Sheep-milk ravioli: Creamy and full of flavor and worth all the hype     + Grill octopus: The portion was very very small, but I loved the flavor      + Roasted lemon chicken: The chicken was on the drier side and I felt the dish lacked a good carb to offset the heavy sauce I loved the appetizers, but felt the entrees were lack-luster. Maybe I did not order the right thing and I'm willing to give this place another try", "Date": "2013-07-17", "Author_Location": "Los Angeles, CA"}, {"Author": "Girl D.", "ReviewID": "0wwl_SLZezArTaYxb2S9cQ", "Overall": "5.0", "Content": "Typically, when I visit NYC, I'm in a frenzy to try as many restaurants as I can.  I usually have only a few days to a week, so it would be sacrilege to eat more than one meal at the same place, right?My companion and I had to break the tourist rules with Kefi.  It's so good, and so close to our UWS hotel, we had to dine there twice in five days.  I also found it to be a great value for the quality and freshness of the food.Our first night, we ordered the four-spreads appetizer (taramosalata, roasted pepper/tomato hummus, baba ghanoush, and tzatziki), determining after we practically licked the little bowls spotless that we could live on those four spreads, with nothing else, into eternity.  Some warm, grilled pita wedges and a gallon each of those spreads, and you could abandon us on a (Greek) island, we're set.  Just keep airlifting us more spreads and pita wedges periodically.My companion had the pan-seared sea bass, and I the roasted lemon chicken.  I kept stealing the Brussels sprouts that lay underneath DBF's large filet of sea bass, because they were the most perfectly-cooked, delicious Brussels sprouts I'd ever had.  Blanched until not quite tender, then grilled, they were still crisp, bright, flavorful, and sublime.  If every kid who'd ever hated Brussels sprouts had these delightful little knots of greenery, Brussels sprouts would become their favorite food.  The pan-roasted chicken was perfection:  tender, lemony comfort food, brightened by sprigs of dill, covering just the right number of halved fingering potatoes.On our next visit, we still needed a mainline IV of those four spreads, but we added grilled octopus.  I always expect octopus to be rubbery, but this was not:  it dissolved on the tongue like butter, and went perfectly with the tangy bean salad accompanying the tentacle.  My companion again went the seafood route with the grilled tuna, and I again stayed on land with the Saturday-night special, a Cypriot-grandmother-approved goat ragout served over dense, house-made egg noodles. Then, because we couldn't live without another dose of those perfect Brussels sprouts, we ordered a side of those.  Holy crap.  We had what's known as a first-world problem:  we were both incredibly stuffed, but didn't want to stop eating because everything was divine.We considered leaving a lousy review just to keep the crowds down until the next time we can get to Kefi, but because that probably wouldn't be for another couple of years, it just wouldn't be fair to the locals to deny them our table in the back.", "Date": "2013-12-17", "Author_Location": "Snohomish, WA"}, {"Author": "Susy B.", "ReviewID": "pGlBj8UZEs9Ay9tc_2Tbtw", "Overall": "1.0", "Content": "I have been a loyal Kefi customer for years. So, when it came time to pick a restaurant for graduation, I thought Kefi would be a great place. I made a reservation for 11 people for 7:00 p.m. I'll cut to the chase: for starters, they tried to put us in a location where water was leaking from the ceiling onto the table. Even though we made our reservation for 7:00 p.m. weeks ahead of time, we were not served entrees until 8:45 p.m. The manager offered us a round of free drinks to make it up to us so we chose a wine to go with the food. By the time they actually gave us the wine, we were already through with our meal. I think the restaurant should have offered to pick up our tab. I don't know if they were just underprepared for grad night or lost our order, but I will not be returning to Kefi.", "Date": "2014-05-22", "Author_Location": "Manhattan, NY"}, {"Author": "Maggie L.", "ReviewID": "6XsY_2OXTZkEzoXLnljC4Q", "Overall": "4.0", "Content": "Loved both the ambiance and the food here. My friend and I split the selection of spreads for our appetizer. The spreads were served with delicious warm pita bread and perfectly portioned for two or three people. Our favorite overall was the chickpea spread, but the eggplant, tzaztiki, and red pepper spreads were really fantastic as well. For dinner, I had the lamb shank. The meat was perfectly cooked and fell right off of the bone. My friend got the braised rabbit pasta, which was absolutely to die for. Would definitely recommend and can't wait to come back and try some of their other dishes.", "Date": "2014-03-14", "Author_Location": "Manhattan, NY"}, {"Author": "Ashley C.", "ReviewID": "LMK4uJuJWdx2eYWNVcvUpw", "Overall": "4.0", "Content": "I had the Sheeps Milk Dumplings with tomato, pine nuts, and spicy lamb sausage and it was soo good! It wasn't spicy at all and it was the perfect portion after eating the spread/pita appetizer. The environment was nice, a bit loud, and they were packed on a Tuesday night which is always a good sign. Will definitely be coming back!", "Date": "2014-03-11", "Author_Location": "Upper West Side, Manhattan, NY"}, {"Author": "Dana A.", "ReviewID": "QoY_yQbOJCWEi0jk0Z00sQ", "Overall": "5.0", "Content": "GREAT place! Superb, rich flavors and very well priced! Order: Spreads (\"caviar\"/eggplant/hummus/tzaziki), Lemon Rosemary Chicken & Potatoes, sheeps milk dumplings in red sauce with spicy sausage and BRAISED LAMB SHANK with orzo!! Loved our server, Neston :)", "Date": "2014-05-20", "Author_Location": "Midtown East, Manhattan, NY"}, {"Author": "Nicole H.", "ReviewID": "w7wCNC4fuIZF42VtY2n5aw", "Overall": "5.0", "Content": "Everywhere else in the UWS was packed for Sunday brunch at noon, but Kefi had a sigh out front advertising half price drinks, so my friend and I wandered in. The place is huge and the staff is helpful and friendly. Our food was DELICIOUS. I ordered the Steak, sausage, and eggs and it was amazing. The mimosas were also good (not made with cheap Sunny D) and the meal didn't break the bank. Would definitely recommend for brunch!", "Date": "2014-05-19", "Author_Location": "Manhattan, NY"}, {"Author": "Hannah H.", "ReviewID": "s68E0putxDCqXf4PiIYKEQ", "Overall": "4.0", "Content": "I thought that this was a cute place - I ordered the spreads for the appetizer - the pita bread was warm and the spreads were delicious!  The crispy cod was great as well - loved the plump baby tomatoes and the cod was indeed crispy.  The pasta with the braised rabbit was great - they could have cut down on the shallots in the sauce, though.  The pork souvlaki was a bit tough, but good.  The rice on the side was fantastic, though!", "Date": "2014-01-25", "Author_Location": "Alexandria, VA"}, {"Author": "Sidney A.", "ReviewID": "JHU34LQp0RqJprLMjyrzAg", "Overall": "1.0", "Content": "I go to Kefi excited that's it's open again open only to walk in and get the most horrendous service. I stand at the bar for a solid 10 mins while all 3 people behind the bar have their backs turned to me. The manager finally asks if I need anything and I say \"Yes. I would like like some service or at least acknowledgment that I'm here.\"  He then proceeds to tell the server and they get into an argument. Mind you, I still haven't been served. I would stay away unless you eat before you come here. Mind you, I'm writing this at the bar as I'm still not being served.", "Date": "2013-12-07", "Author_Location": "Upper West Side, Manhattan, NY"}, {"Author": "Angela C.", "ReviewID": "ffKs2c2BonERqocXWsaPPw", "Overall": "5.0", "Content": "A very large restaurant so there usually is no wait, except dinner on weekends. It's advisable to make a reservation then. Their \"Greek Paella\" is one of my favorite dishes in the entire city.", "Date": "2014-03-06", "Author_Location": "New York, NY"}, {"Author": "Shelly L.", "ReviewID": "1IJEDUBy-y4y8lN8a353-w", "Overall": "4.0", "Content": "If you're looking for a hearty meal in the UWS, Kefi's a great option. Went here with the BF & Brother on a Sunday night, made a reservation, was seated downstairs immediately.First, I have to say that these portions are HUGE and was definitely affordable. We shared everything and it was actually too much for the 3 of us:+ Spread of Eggplant, Chickpea (for two): a HUGE spread of hummus, eggplant dip, tzatziki, and a dip that reminded me of red pepper hummus, loved, and definitely can feed more than 2!+ Grilled Octopus w/ Chickpeas: tender octopus with a flavorful chickpea salad, loved it+ Sheep's Milk Dumplings with Spicy Lamb Sausage: fluffy pillows of dough covered with a great tomato sauce and made even heartier with sausage+ Lamb Shank with Orzo: fall off the bone lamb, so tender, definitely recommend+ Skirt Steak: the least memorable, but still deliciousAll in all, a great place for Greek food, the restaurant was huge so it looks good for big groups as well.", "Date": "2013-08-12", "Author_Location": "New York, NY"}, {"Author": "Anne M.", "ReviewID": "7DkfgkRGaN0YC5aEOVc-Jw", "Overall": "4.0", "Content": "Yum.  Definitely a menu that you need to test a number of items.  Try the lamb chops.  Delic.  All of the dips are excellent too.  Grilled Octopus.  Greek Salad.  Wasnt blown away by the desserts though.", "Date": "2014-04-16", "Author_Location": "Manhattan, NY"}, {"Author": "Z. J.", "ReviewID": "3EvZqPwjrZBbWnUFC4xtgQ", "Overall": "2.0", "Content": "Not what it used to be. So sad that what I used to consider an institution on the UWS has turned into something mediocre.", "Date": "2014-04-11", "Author_Location": "Manhattan, NY"}, {"Author": "George R.", "ReviewID": "QR72xUiUtnnMu_65_pcEZQ", "Overall": "3.0", "Content": "The reopening should have been softer as the kitchen is clueless    Our server did a very good job handling the long wait between apps and entrees.  With all the people working there one would have imagined a better service.  The manager ultimately came by and comped our bottle of wine but it was a bit late!  On the food side it is good not great. Definitely enjoyed the octopus and the Bronzino    The rice pudding dessert was raw and inedible.", "Date": "2014-01-05", "Author_Location": "Teaneck, NJ"}, {"Author": "Kimberly C.", "ReviewID": "wfgVJl3ANN5ljV5cSrEGwg", "Overall": "4.0", "Content": "This place was amazing. The atmosphere was fantastic, people were gracious and talking. The food was amazing (try the lamb shank if you know what's good for you). My only qualm was that since we had a late reservation, most of the specials were gone. Will totally go back!", "Date": "2014-02-10", "Author_Location": "San Marino, CA"}, {"Author": "Tom H.", "ReviewID": "s9Q75RFuM7Zr0KM8yTmM_Q", "Overall": "4.0", "Content": "Came here by 5:45pm on a Friday. Clearly I am still ahead of the crowd.Was seated promptly downstairs. The service was good in the beginning. By the time of entree, the restaurant became full, and the service level dropped. Took a while to order dessert, and check at the end.Enjoyed the lamb shank (really tender). The meat itself was bland, but the sauce and the grain helped greatly. Mussel appetizer was big enough for an entree for one! Would consider going back. Just not sure about during peak hour.", "Date": "2014-02-17", "Author_Location": "San Mateo, CA"}, {"Author": "Jon M.", "ReviewID": "tAgm3hjupEkBwwKasYTMXQ", "Overall": "4.0", "Content": "Food to cost ratio was a solid 1:1 I'd say. It's not cheap but the food's worth it. It's not outstanding. But it's good.", "Date": "2014-05-07", "Author_Location": "New York, NY"}, {"Author": "Abby F.", "ReviewID": "AkZl29g1LIcUfQKOmSDdgw", "Overall": "5.0", "Content": "That was the best restaurant for the vegetarian people. The potato gravy and the beans salad was  sooo yummy . That was the great experience of that restaurant . Goood Work!!!!", "Date": "2013-03-06", "Author_Location": "Manhattan, NY"}, {"Author": "Melody H.", "ReviewID": "NHfZq1wgG_3QRCRi05kILA", "Overall": "5.0", "Content": "We came in for brunch on Sunday at around 11:30 am.  There were very few people at the restaurant and the atmosphere felt very nice.  We were seated upstairs where there are white and blue decorations that remind of beautiful pictures of Santorini. (Check out the website to see what the restaurant looks like). We ordered the sheep's milk dumplings, which was quite a treat.  It arrived and I immediately noticed that it wasn't very big.  However, it was packed with flavor, so eat slowly and savor all the flavors: the tomato, feta cheese, spinach, herbs, spicy sausage, pine nuts (yum!), sheep's milk dumplings (which, FYI, aren't filled with anything!  If you've had Chinese-style dumplings, you will understand my initial confusion).  Fantastic to clean off everything with the delicious complimentary bread they serve.  My husband ordered the Sausage and Egg Skillet, which was recommended by the server.  Unfortunately, though it was a pretty big portion, it wasn't exactly anything special.  It came with Greek salad and some pita bread.  The Greek salad was pretty good. Total bill, before tip, came out to be approximately $28.  Our server was extremely perceptive.  He kept coming back to refill our bread and water.  The last time, we asked one of the other waiters if we could have extra bread and he never came back.  Some of the waiters looked a little confused ie: we asked someone to if we could pack the rest of our dinner to go, and he came back a lot later because he couldn't find something.  But, that was just a small thing.  Will probably be back to try other dishes!", "Date": "2014-01-26", "Author_Location": "Manhattan, NY"}, {"Author": "Emmanuel I.", "ReviewID": "JDD_8jOkMmH57vxsvhEERw", "Overall": "2.0", "Content": "Though I wasn't satisfied with my meal here, the two people I was with really enjoyed it and want to go again. This placed \"temporarily\" closed though.. Has it reopened yet?", "Date": "2014-02-11", "Author_Location": "Brooklyn, NY"}, {"Author": "M S.", "ReviewID": "JcEp9t8JF_0UdZJAqQLj0Q", "Overall": "3.0", "Content": "Food is great, service is fair (not well trained staff); noise level killed dinner; wife and I got tired of yelling at each other so we texted.", "Date": "2014-03-30", "Author_Location": "Manhattan, NY"}, {"Author": "Tiffany T.", "ReviewID": "Xe2P7GhLXXjWsaZ1cSvbGw", "Overall": "4.0", "Content": "Not to sound like a broken record, but Kefi has the best lamb burger I've ever had. Even if you are not a fan of lamb you should try your friend/spouse/partner/family's order of lamb burger. Its deliciousness is definitely due to the magical spice blend (I taste some cumin, among others) they mix into the meat patties. I've also never had another lamb burger as succulent and juicy as this one. It comes with a side salad and potato chips, and while the former is a fresh, light compliment to the burger, the chips are nothing special.Then, of course, get the octopus over chickpeas. I'm a fan of all seafood in general, but I don't think I've ever had grilled octopus as soft and tender as Kefi's. It was generously seasoned (a bit too salty for me but probably perfect for the average palate), flavorful, and has beautiful grill marks. The sheep's milk dumplings + spicy lamb sausage + pine nuts was also really yummy! I've never had anything like it before - not exactly gnocchi, not exactly a \"dumpling,\" but so soft and melty. The lamb sausage was the perfect companion to up the flavor component, and was in a realm of its own and different from the lamb burger.If you call ahead to make a reservation, you'll get seated in the spacious, well-lit downstairs portion of the restaurant, which, in my opinion, beats the darker, noisier, and colder upstairs portion. The service was knowledgeable, warm, and friendly. I want to try their seafood next!", "Date": "2013-02-05", "Author_Location": "Manhattan, NY"}, {"Author": "Katy G.", "ReviewID": "4W4rrB9I79d_TZIVSmZrMQ", "Overall": "2.0", "Content": "Nice spot. Tasty food. Terrible service. Our waitress barely acknowledged our party on a quiet Wednesday night. Hard to imagine the kind of service one would get on a Saturday night. The manager apologized profusely and offered us dessert on the house but failed to communicate this to our waitress. No one came by to take our dessert order 10 minutes after the dessert menu was presented to us.Will not go back. What a shame.", "Date": "2013-12-11", "Author_Location": "Manhattan, NY"}, {"Author": "Annnnnnnie K.", "ReviewID": "i0rLFWa6HqE7a7YQyu4CWQ", "Overall": "4.0", "Content": "Don't judge NY restaurants by their entrances.By passing, Kefi might appear to be another rustic, hole in the wall restaurant. Wrong. There's a whole new restaurant downstairs. This is epic. It means that the wait or the reservation won't be a nightmare, esp. for big events, e.g. graduation, bdays, or just a normal Tuesday dining turned into an engagement dinner (whatever floats your boat).The food won't disappoint, I promise (although there's no condemnation for breaking my promise since you don't really know me... whoever you are).But seriously, food is great. Sadly, I haven't had wine with my meal(s)--I made multiple visits to this restaurant; it's that good. Chicken, Octopus, and etc. Delicious. Try something new at this restaurant.. It's one of those restaurants, statistically speaking, the risk is in your favor.", "Date": "2013-02-03", "Author_Location": "Manhattan, NY"}, {"Author": "S T.", "ReviewID": "ut3CiArxYrpj84Z1C2rDGQ", "Overall": "3.0", "Content": "Food here tasted good. I had the dumplings, which tasted amazing. I usually have an iron clad stomach, but something about these dumplings did not sit well with my stomach. It was really bad. And needless to say, I had to go to the CVS (I think) a few blocks down from the restaurant. The rest my party did not have any issues. They thought the food was good, but nothing amazing.", "Date": "2014-04-26", "Author_Location": "New York, NY"}, {"Author": "Bruce S.", "ReviewID": "dGA5LtEyCkywKRlMPfZp2w", "Overall": "5.0", "Content": "Service was awesome! She wasn't Greek but she knew more Greek food than my buddy from Greece. The octopus was my favorite. Dinner was well worth it since. Expect to spend a little money to taste a variety of food.", "Date": "2014-02-13", "Author_Location": "Jackson Heights, Queens, NY"}, {"Author": "Melly G.", "ReviewID": "ORmBiZCfRlMxAoOS0s7zbQ", "Overall": "3.0", "Content": "Great if you are looking for an affordable and low-key dinner option on the Upper West.", "Date": "2014-01-26", "Author_Location": "New York, NY"}, {"Author": "Cat S.", "ReviewID": "d4i_-hA_L2nNDLO6t1NV9Q", "Overall": "4.0", "Content": "After actually getting my reservation, Kefi was awesome. We had to create a set menu but had plenty of options. The food delicious and the cocktails were great as well. I especially recommend the shrimp orzo and meatballs. Service was great all night and it was a lovely atmosphere for a dinner with friends - so after all the trouble of getting the reservation and preparing for the party, it was totally worth it.", "Date": "2013-12-12", "Author_Location": "Manhattan, NY"}, {"Author": "Carmen C.", "ReviewID": "I6fCQLPq0nVVvFhMyMY8LQ", "Overall": "4.0", "Content": "We used to take the subway up to the upper West side just to dine at Kefi even though we live in the East Village and we are a pretty lazy couple when it comes to traveling for our food. We did this because Kefi has never disappointed us. Almost every dish we have had at this restaurant has been exquisitely prepared. The atmosphere is very pleasant: warm and relaxed but also classy, and the waiters are amicable. We always ordered their assortment of hummus which never disappoints. My personal favorite entre was the sheep's milk dumplings, I was addicted to them. They are so soft... almost like doughy marshmallows.", "Date": "2013-02-17", "Author_Location": "Manhattan, NY"}, {"Author": "Somin Y.", "ReviewID": "nWtTlXcAAUJWdOGmF3yIBQ", "Overall": "3.0", "Content": "Food 3.5/ambience and service 4.0Reservation is MUST for weekend dinner. Good place to try diverse Greeck/Mediterranean dishes, but might be a bit disappointing if you have read all the hypes on Yelp. Stopped by for Saturday dinner with a friend. We reserved for 7:30pm but were seated on downstairs at sometime past 8pm. We started with Sangria and octopus appetizer, which were awesome. Their Sangria is MUST-TRY! We also had hanker steak and sheep milk's dumplings. Both were just okay, not that impresisve. Hanker steak was a bit above average than other places but definately below than aveage steakhouses in nyc. I was so hyped about their sheep dumpling when reading all the Yelp reviews, but it actually turned out to be a bit salty and not flavorful as much as I expected. You can try this place if you're new to greek/mediterranean cuisine, but if you're not, then try another place, somewhere in nyc which is less busy and hectic.", "Date": "2013-02-27", "Author_Location": "Manhattan, NY"}, {"Author": "Jeanette L.", "ReviewID": "eXgamfYWsKWxTqLPpR_oWQ", "Overall": "4.0", "Content": "Clean, fresh flavors. Pretty classic mediterranean. The octopus is a staple. Good value for the food, too.Large space, good for groups celebrating or just catching up. The lighting could be a tad dimmer to avoid feeling too fluorescent.", "Date": "2013-06-29", "Author_Location": "Manhattan, NY"}, {"Author": "Jessica S.", "ReviewID": "ag4VzNgK4ZOXtpfBdjwwtw", "Overall": "5.0", "Content": "Kefi is my FAVORITE restaurant on the Upper West Side!  The food is true traditional Greek style and consistently good and very reasonable.  You will rarely have to wait for a table as there is plenty of seating.  My favorite dishes are the fried calamari, warm feta, hummus, tzaziki, meatballs chicken souvlaki, and any of the fish dishes.  You must end the meal with a frappe (traditional Greek coffee).  The price is right and the food is great!  Enjoy!", "Date": "2014-05-04", "Author_Location": "New York, NY"}, {"Author": "Vas S.", "ReviewID": "Oh0BqH8TmpLm7sGwexkkTQ", "Overall": "2.0", "Content": "3.5 stars for the food. Very poor service and overly high prices drop it to 2 overall.", "Date": "2013-10-11", "Author_Location": "Brooklyn, NY"}, {"Author": "Lindsay S.", "ReviewID": "nRgwqjJTqWGYgBuFSdjoKg", "Overall": "4.0", "Content": "One of my fave manhattan restaurants. great greek food and very reasonable prices for the UWS and manhattan in general.  My boyfriend consistently gets the lamb shank which I have found to always be perfectly cooked, falling off the bone. My favorite dish is the sheep's milk pasta with sausage. Amazing flavors and the pasta is so tender and chewy I love it! The selection of dips is a great way to start off the meal and the bottles of wine aren't going to cost and arm and a leg. Make reservations for this place because it fills up fast!", "Date": "2012-12-11", "Author_Location": "New York, NY"}, {"Author": "Laura M.", "ReviewID": "OFdXypo3lXZ4twXUxZlSJA", "Overall": "4.0", "Content": "Huge portions, and pretty good food.We started with the spreads of hummus, eggplant, etc. And also the calamari.  Both were pretty tasty.  I had the chicken souvlaki as my main dish, and it was HUGE.  Definitely could have shared it.  We also tried the cinnamon cauliflower, which was surprisingly very tasty.  Also ended up sharing a picture of sangria, which was $28 and large enough for about 5-6 glasses...Thus saving us a good amount on drinks.While this definitely isn't an upscale trendy restaurant, it was good for a large group, and the price was right.", "Date": "2013-01-20", "Author_Location": "Manhattan, NY"}, {"Author": "Christine C.", "ReviewID": "vZdyFLGU_aS-lf2W84GJ-A", "Overall": "5.0", "Content": "I looooooove this place. I'm so glad they're back in business after having closed for renovations for months. Been here for both dinner and brunch, and both are fantastic. The Selection of Spreads for 2 is a great plate to share, and the tubular pasta is so deliciously fresh. The only downside to this place is that it's too far away from me :( tinyurl.com/pp6lfp7", "Date": "2014-03-07", "Author_Location": "New York, NY"}, {"Author": "Karen C.", "ReviewID": "Qu2f1K2XH07hefI2hS7bRw", "Overall": "4.0", "Content": "Good prices, good food and a pretty big restaurant.I loved my shrimp orzo dish. The lamb shank was really good but the orzo that came with it wasn't that great. The vegetarian sandwich was pretty good and my friend enjoyed his chicken souvlaki sandwich. The sheep milk ravioli was ok.", "Date": "2013-01-05", "Author_Location": "Lansing, MI"}, {"Author": "Safi C.", "ReviewID": "XTcinDcGx1LgZ8TkHxqkgw", "Overall": "4.0", "Content": "Michael Psislakis is easily one of my favourite chefs. Grilled octopus with bean salad was tender and juicy, the kefthedes reminded me of mom's cooking. Lamb shank with orzo was rich and flavourful & the Branzino was one of the better ones I've ever tried. The service was amicable, the ambiance was loud and casual. All in all it's definitely one of the better restaurants in UWS.", "Date": "2013-12-15", "Author_Location": "Brooklyn, NY"}, {"Author": "Cindy T.", "ReviewID": "18a7Ya-aObVm7JAitFWsnA", "Overall": "3.0", "Content": "My boyfriend and I walked in on a Monday night and didn't know what to do with ourselves. There was no visible host or host stand. After a few discombobulated moments, a waiter motioned us to sit somewhere.Appetizers: KEFI SALAD (recommended!) - the lightly dressed iceberg lettuce, olives, capers, cucumbers, and tomatoes were refreshing. GRILLED OCTOPUS with white beans (so-so) - the grilled octopus was supremely tender and had a nice char, but not much flavor otherwise. The beans seemed to be there only to keep the octopus company...Entrees: GRILLED BRANZINO (recommended!) - my boyfriend and I generally do not like fish but decided to give the branzino a shot - it did not disappoint. The skin was well charred and crispy - both a nice flavor and texture. The fish itself was not the least bit fishy. The fingerling potatoes served on the side have a crisp exterior and soft interior. The roasted tomatoes pop as you bite down and squirt their warm juices into your mouth. The capers are the only part I could have done without - their saltiness completely overshadowed every other element on the plate. SHEEP'S MILK DUMPLINGS (not recommended) - this dish was very rich, even for a cold winter day. The dumplings were soft - even softer than gnocchi - to the point that there was not much texture. The lamb sausage and tomato sauce were the only things that gave any flavor to this dish.Overall, our meal was good and we left satisfied. With that said, no dish left me dying to come back again.", "Date": "2012-11-26", "Author_Location": "San Francisco, CA"}, {"Author": "Shruti K.", "ReviewID": "-pK-jIbDD8HrUORLRf1Alw", "Overall": "4.0", "Content": "Kefi was the perfect choice for lunch on Thanksgiving day. The restaurant is deceptively huge. We were seated in the lower level dining area. The server was very prompt and friendly. He explained the specials for the day and we started off with a glass a wine each. Selection of Spreads: Yogurt, \"Caviar\", Eggplant, Chickpea (for two) - Delicious. The pita bread was warm and the spreads tasty. Perfect start to a good mealSheep's Milk Dumplings, Tomato, Pine Nuts, Spicy Lamb Sausage - The best dumplings I have eaten. It just melts in your mouth. The tomato Sauce was absolutely delicious. Since I don't eat lamb sausage, my dish was made without it. I Highly recommend this dish.Tubular Pasta, Greek Sausage, Peppers, Onions, Tomato, Feta - This was a disappointing dish. I guess because we left out the sausage there was not much flavor left in the dish. It was made well but just did not taste as good as the dumplings. Won't order it next time.Kefi is a great Greek restaurant. It's perfect for large groups. Since I live in Brooklyn I won't make an extra effort to go all the way up to Columbus Avenue, but if I am in the neighborhood will definitely go for another meal. That Dumpling was truly amazing!!!", "Date": "2012-12-31", "Author_Location": "Brooklyn, NY"}, {"Author": "Allegra D.", "ReviewID": "X7tvkWCQvgSwzGPucsLHdw", "Overall": "4.0", "Content": "Sooo good! I got the price fix for $16.95 before 6pm which was supremely worth it. The Greek meatballs were nice, sauce wasn't too acidic (big plus) and the green olives added a lovely touch. The sheep milk ravioli in butter sage sauce were really delicious! The rice pudding was much different from what I am used to and the rice tasted slightly undercooked, but the sauce was lovely and the entire dish as a package was very good. Definitely going to keep them on the radar!", "Date": "2014-01-10", "Author_Location": "West University, Houston, TX"}, {"Author": "Jennifer T.", "ReviewID": "eD6gx3TTalw3Ah6xaYAhPQ", "Overall": "4.0", "Content": "*wam feta (tomato, anchiovy, caper, roasted pepper, olives, pita bread; omg!!!!!! I loved this appetizer! The acidity of everything went so well with the tangy, melted feta cheese. The achiovy took this dish to another level though, loved it! great portion size as well, definitely not cheating you out)*grilled octopus, bean salad (HOLD THE PHONE! the grilled octopus had such an amazing tenderness to it, it was meaty, soft and not tough at all like some other places that overcook their octopus. such a great smokey flavor from the grill. the bean salad with the vinaigrette complimented the seafood so well. could eat this all day!)*sheep's milk dumplings (the dumplings were amazing!!!!!! they were like marshmallows in a bath of garlicky, tomatoey goodness. I loved the texture of the dumplings, so soft and fluffy. the spicy lamb sausage was so good!! can definitely taste the lamb meat but it wasn't gamey at all; the sausage was small and chopped into small rounds that was found throughout the dish; the sauce was absolutely delicious!!!!!!!!!! please ask for more bread to soak it up, don't waste this sauce!!!!! this dish is such a comfort food; it's filling but not overwhelming like heavy pasta dishes)This place is adorable with their decor. The entrance is nice with the bar area and the formal dining area is cozy. Service is good and friendly. The bathroom is surprisingly so clean haha. In regards to their food, such great quality and so fresh. I would go back here in a heartbeat!!!", "Date": "2014-07-03", "Author_Location": "Clifton, NJ"}, {"Author": "N P.", "ReviewID": "XSYo7co6i7EuOg6fEDMtng", "Overall": "2.0", "Content": "When we go to a restaurant we hope to not only enjoy the food, but also to enjoy the overall experience. and when we leave a restaurant, we usually ask- will we be back? The answer with Kefi is no, here's why...we thought the food was ok,  but not memorable, but the experience they delivered was just bland and plain boring.First the good: ..appetizers- the Cypriot salad was a refreshing, very enjoyable light summer salad,  the grilled octopus is good- not chewy, perfect char, with a touch of lemon. Service was efficient and pleasant. Ok so what is not to like? The main dishes we ordered were clumsily presented, over stuffed with chips, and a soggy salad like you would get at a college food truck. The entrees- chicken souvlaki and the lamb burger were just ok. Our biggest dislike was the way the restaurant looked and was laid out. Tables jammed together, hard services, little in the way of decor that reminds you that you are eating at a Greek Restaurant, in other words it has ZERO Greek charm, soul or ambiance. To make matters worse, we were sent to the Kefi basement to eat (even though there were plenty of open tables upstairs). And no surprise here, the Kefi basement smells like ....a musty basement. Also, when sitting downstairs, expect to be in very close proximity with other people (who were banished to the musty basement), and expect to watch the kitchen staff move dirty dishes back and forth while you eat. I mean it was a saddest spot, bleak and bland...not even a little candle to cheer us up. Needless to say, we skipped desert to go up for air.", "Date": "2014-07-06", "Author_Location": "Providence, RI"}, {"Author": "Kristen T.", "ReviewID": "bQkxA6jt7lv7YkpP8_yQ5A", "Overall": "5.0", "Content": "This restaurant is a great place to go, especially if you're from a place without good Greek food-- like me. My family and I tend to eat family style, and everything I tasted was fantastic. My only complaint is that I had too much of their tasty bread and dipping sauces to finish my meal!", "Date": "2014-06-30", "Author_Location": "South Jordan, UT"}, {"Author": "Trisha A.", "ReviewID": "RBHE6Xh9h5W0AAB2n1Z_CQ", "Overall": "5.0", "Content": "This review is long overdue. Went there for brunch a couple of weeks ago and had a whole grilled Branzino. It was cooked to perfection that it just melt in my mouth.", "Date": "2014-07-08", "Author_Location": "New York, NY"}, {"Author": "Bob M.", "ReviewID": "l-CLXJery2mxnoLyS4-_eA", "Overall": "5.0", "Content": "The food and the service were top notch.  We enjoyed the combinations of meats, cheeses and the presentation.  The staff was funny, informative and friendly.Will be back!!", "Date": "2014-06-16", "Author_Location": "Los Angeles, CA"}, {"Author": "Jaci H.", "ReviewID": "ZvXQNuREMht56RKvr2SMTA", "Overall": "4.0", "Content": "Kefi certainly has a reputation for good food and it's nice to know it really lives up to the hype.My UWS friends brought me here yesterday for an early dinner at around 6:30pm.  It's a large space and were thrilled to be seated without issue.  I had no idea there was so much room, be sure to check out the downstairs. Our server was extremely helpful, cheerful and knowledgable with the food and wines being offered.  He recommended a delicious, refreshing and affordable ($30 per bottle) white wine. We skipped appetizers in hopes of enjoying dessert - which we didn't because we were far too full from dinner.  Will have to come back since the desserts looked divine. I ordered the Chicken Thigh Souvlaki special, which was unbelievably delicious. Tender, perfectly grilled chunks of chicken thigh were presented on wooden skewers.  It was a very hearty portion and each bite was pure bliss with the accompanying pita bread, Greek salad (which they were kind enough to present without feta cheese) and a delicious rice.  The salad was fresh and flavorful with lots of olives, tomatoes, onions and peppers.  Loved the salad dressing! The rice was amazing with a butter flavor and spinach.  I literally couldn't stop eating... and ended up cleaning my plate.  If you could have seen the food baby!   I could have easily taken home about a third of the dish but opted to pigging out while the food was fresh.  My friends also thoroughly enjoyed the dinners, ordered the same as me.  We were thrilled with Kefi and will definitely return in the near future.  Yum!!", "Date": "2014-06-09", "Author_Location": "Brooklyn, NY"}, {"Author": "Conrad N.", "ReviewID": "RaXJgtUbYffxNg3p87g6nQ", "Overall": "4.0", "Content": "We got there around 1:30pm and the place was packed!!  It's 4th of july long weekend, and fifa was on with germany vs france.  They have massive tv that broadcast the game, so that might explain why its so packed.We ordered grilled octopus, it came with chickpea salad.  omg.  I loved it!!!!  I also ordered a chicken souvlaki wrap with a side of kefi salad.  It is a lot of food!Normally those sandwich comes with home made chips and salad...but I didnt want any chips and ot was perfect for me.  My husband loved the chips too.I will definitely go back to this place.", "Date": "2014-07-05", "Author_Location": "New York, NY"}, {"Author": "Kai N.", "ReviewID": "yMVQbOOdIAfxhZfRbDmWtA", "Overall": "3.0", "Content": "Walked in on a Monday night. We were able to walk in and seated with no reservations. It was busy, so the servers gave us ample time and extra bread and water before our order was taken. We ordered the braised rabbit pasta, lamb shank, chicken skewers special, and the grilled octopus for an appetizer. The lamb was flavorless. I've never had rabbit before, but it taste more or less like the lamb shank. Yup, unfortunately the chicken skewers is the best plate on the table. We asked for the dessert menu, but nothing jump out at us. Plus, our main course did not leave us wanting more, so we left.The place looks better than the food taste. Would only come back if I'm in the area next time for a drink at the marble top bar with ESPN on the screens.", "Date": "2014-07-07", "Author_Location": "Manhattan, NY"}, {"Author": "Jeff O.", "ReviewID": "jHWeo6-Y4-SFkp-QkL_ncg", "Overall": "5.0", "Content": "HOW HAVE I NEVER REVIEWED KEFI I'M SORRY KEFI FORGIVE ME.OK deep breaths. Straight-up, we've dined here around 25 or 30 times, and we're the kind of people who visit a restaurant twice only if it's really good. So yeah.I'm not going to get into specifics because you can't go wrong - if a dish sounds good to you, trust me, it will be good. OK one example - even the damn tzatziki sauce will blow your mind. Tzatziki is one of those things you think can only be so good and is the same everywhere, but you're freaking wrong, it can pretty much change your life if you infuse it with unicorns and rainbows, as I'm pretty sure Kefi does.Last point: the prices are crazy reasonable, like unreasonably reasonable. Win win win.", "Date": "2014-06-06", "Author_Location": "Manhattan, NY"}, {"Author": "Erica D.", "ReviewID": "G1USxQhtaaty1ePEyJv3Qg", "Overall": "4.0", "Content": "Our server was so fantastic tonight. We came with a group of 12 and he had just the right amount of helpfulness and \"leave us alone-ness\" that we needed. He made excellent wine recommendations, excellent food pacing recommendations and made our gathering just right. I was looking for a place with great service, good food and a quiet room. We sat downstairs in the \"back room\". It was noisy on a Sat night but not overly so. Food was a little too oily.", "Date": "2014-07-12", "Author_Location": "Glen Rock, NJ"}, {"Author": "Alisa G.", "ReviewID": "QJl3FsPnCnT5O5jIVENolA", "Overall": "4.0", "Content": "Tasty and reasonably-priced.  We ordered 4 meze, no entrees or dessert (although I wish I'd looked at the dessert menu before we decided to go out for froyo!).  The Greek sausage was the standout, but the pickled beet salad and warm feta dish were also excellent.  The only dish that was a disappointing was the grilled calamari with beans. Way too many beans (chickpeas), and not enough flavor.  Mint cocktail was also delish!  The servers, runners, and bussers were friendly and attentive.  We sat downstairs, which I would recommend, b/c it's much quieter.  I will definitely go back!", "Date": "2014-07-04", "Author_Location": "Providence, RI"}, {"Author": "Noura Andréa A.", "ReviewID": "96CbMX_d0vOcnPMRb0pKDg", "Overall": "4.0", "Content": "I love Greek/Mediterranean food. And given that I'm from Lebanon, I know a thing or two about the food. I was pleasantly surprised with the food at KEFI.I ordered the eggplant and bulgur fritters, with tahini sauce and pita bread. Whenever I read the word \"fritters\", I get chills and expect a very greasy and crunchy food that will make me feel sick all night long. Tahini sauce is my enemy because they just put too much of it. And your \"falafel\" ends up swimming in the sauce.I ordered the plate with fingers crossed and got a beautiful result. I got a gluten-free (yes that's an option) pita bread and some tahini very lightly (yet enough for flavor) spread on it. The fritters were marvelous! Lightly crunchy on the outside and so sweet and tender on the inside. Your knife just slides through it. The salad is well seasoned, nothing is too salty or greasy.The sandwiches are served with salad and chips. I didn't try the chips because that's not my cup of tea.The people with me were also enjoying their food, fish and meat.This is a place I would definitely go to again.", "Date": "2014-06-13", "Author_Location": "Manhattan, NY"}, {"Author": "Lisa M.", "ReviewID": "3-x-QPLrR7LUvkvqAWvr7g", "Overall": "3.0", "Content": "I was really expecting this meal to wow me but i didn't get that feeling. Everything was good, no real complaints. The sangria was terrible though. We all kinda laughed about the taste, comparing it to HI-C. Pretty loud inside on a Friday night. Loud for my parents, but would be better for a night out with friends. If you want less noise I suggest trying downstairs. Service was decent. We ordered an appetizer without Pine Nuts, specifically mentioning an allergy to the waiter but when the dumplings came out I spotted a pine nut luckily before my boyfriend ate it. No real apology, they just replaced it. Going to stick with Bodrum because nothing compares!", "Date": "2014-06-03", "Author_Location": "Manhattan, NY"}, {"Author": "Eponine J.", "ReviewID": "aPalxxkwctFRPpNa_Ye8QA", "Overall": "5.0", "Content": "Before 6pm, they offer a prix fixe dinner menu for $17 which includes an app, entree and dessert. The two of us ordered mussels, meatball, branzino (+5 extra charge), pork medallions, walnut cake and rice pudding from the prix fixe and selection of spreads to start with. Everything was perfectly cooked but the selection of spreads and branzino definitely stood out.They also have a three-course chef tasting menu for $35, on top of which you can add a pasta course for an extra $7.", "Date": "2014-05-25", "Author_Location": "New York, NY"}, {"Author": "Eytan S.", "ReviewID": "UtBOQS5LpS3a-TXw-OC4wA", "Overall": "4.0", "Content": "Amazing dinner specialties that will fill your mouth with flavor! Get the sheep milk dumplings, feel like pillows in your mouth. I'm full!Bon appetite", "Date": "2014-06-14", "Author_Location": "Bronx, NY"}, {"Author": "Risa H.", "ReviewID": "MF-Kgi4h1A4UALqteHNYwQ", "Overall": "5.0", "Content": "Came here to eat one night, found the place through none other than Yelp!  I love lamb and anything spicy, so I had to try the Sheep's Milk Dumplings with Spicy Lamb Sausage.  It was VERY flavorful, a bit on the salty side, but still delicious.  I would have preferred an atmosphere with not so much lighting, but the food was still good.  Waiter brought the food out quicker than expected.  Bathrooms are located downstairs and there is a separate dining area downstairs with more of the ambiance I like in a restaurant (there was a private party down there).  Would come back to eat if I was in the area!", "Date": "2014-06-18", "Author_Location": "Midtown East, Manhattan, NY"}, {"Author": "Joanna L.", "ReviewID": "iFg6WhrblesEVDOt-CBimA", "Overall": "2.0", "Content": "I loved the way this place use to be....they gutted it since the last time i went. Its way more modern which is cool too but i was more of a fan of the old Kefi..but that's just me. The hostess was ok with my group. We didn't have a reservation so she said it would be 20min. Cool... But she didn't tell us where to wait or if we got a buzzer or how it would work when it was our turn to be sat. Very awkward. There's sooooo many restaurants in NYC with their own methods of seating and hostessing that I feel its the hosts responsibility to let the guests know what to do while they wait and where to go...right?? Anyways... I asked where to go and she said we can have a seat at the bar or go outside. We went to the bar and sat there...we were going to order drinks from the bartender and pay for them upfront before we got sat but the bartender was clearly under the impression that we were just taking up seats in her bar while waiting for our table because she never even looked at us...awkward again because If we didn't want drinks we would of waited outside for our table.We got our table in about 15min which was nice but then to cut this review short....we got sat next to a table that was being very rude to the waiter and so therefore, the waiter came to our table to take our order and drop off drinks ONCE...he stayed away from our area because of the other table...with that being said...you can imagine how asking for the check and paying out went...not well. I'll definitely be back for grandmas meatball.... AND to give this place another shot because our situation was unique so its only fair to try it out again...", "Date": "2014-06-16", "Author_Location": "Manhattan, NY"}, {"Author": "Lesley C.", "ReviewID": "Ul6ILFkRGaSY4661d-h4Ug", "Overall": "5.0", "Content": "Loved the lamb chaps! Cooked to perfection.", "Date": "2014-07-09", "Author_Location": "Manhattan, NY"}, {"Author": "Victoria B.", "ReviewID": "lbclJI1vj4Vb7GvvboLK4A", "Overall": "4.0", "Content": "Great food, the sheep milk dumplings everyone is raving about is amazing, grilled octopus tender and smoky, dips taste authentic. The vegetable side was quite oily, but still tasty. An allover good experience, will be back for the dumplings.", "Date": "2014-06-18", "Author_Location": "Dobbs Ferry, NY"}, {"Author": "A P.", "ReviewID": "Wzjc3Ik2LJM8_SgiU0f26A", "Overall": "1.0", "Content": "Well this place was insanely disappointing.  This was a Yelp fail... don't know what other reviewers were doing but wow it was bad.  Menu was not descriptive and we have food allergies so this is a problem.  We got a dish that didn't list tomato where it was the primary ingredient.  Instead of being polite and offering to take the dish away and replace with something else the incompetent waitress argued over whether the menu listed tomato for the dish - which it didn't - she confirmed later.  She slid the fish onto a plate and told us to pick around and then brought tough broccoli as a substitute.  She was just really bad.  She also brought a salad with peppers and again we can't eat those and was annoyed when I sent it back.  The waitress did almost nothing and the poor bus boys did most of the work.  We were charged for the full $18.95 fish even though we couldn't eat half of it.  My chicken with skin, on the bone, was extremely dry.  Impressive that someone can fail at making roast chicken.  DO NOT GO HERE or be prepared to be disappointed.", "Date": "2014-06-04", "Author_Location": "Hillsboro, OR"}, {"Author": "Nick C.", "ReviewID": "T2A9QgfE-UYjxh3F5CNu6A", "Overall": "5.0", "Content": "Very happy with the Mediterranean food here.  To start we had an octopus appetizer and a several spreads with pita. For our main course we had a whole fish with broccoli rabe and a lemon chicken dish. I would order the fish again. We are looking forward to exploring the menu.", "Date": "2014-06-27", "Author_Location": "Columbus, OH"}, {"Author": "Justin S.", "ReviewID": "mUfLRP_hosUOn1poPTMtzw", "Overall": "5.0", "Content": "Delicious and affordable would be the two best words to describe this place. We ordered about a half dozen appetizers to share between two couples, and every last thing was delicious. The grilled octopus though was, by far, the highlight. Perfectly cooked, slightly tender and well seasoned, it was maybe the best grilled octopus I've ever had. Two bottles of wine and a table full of food, and our bill was less than $130 total. We'll be back.", "Date": "2014-06-23", "Author_Location": "Manhattan, NY"}, {"Author": "William H.", "ReviewID": "wfrHPak3eO4HnZayFA5sUw", "Overall": "4.0", "Content": "Incredible. Greek food is underrated and Kefi is a gem in the Upper West Side. This place simply blows Taverna straight out of the Mediterranean waters. The friendly, attentive staff made sure we were always taken care of and there seems to be plenty of space (multiple floors). Never order chicken at a Greek restaurant...that said, I personally don't eat lamb but can attest to the excellent seafood quality. The grilled octopus was tender and fresh...almost tasted like some type of forbidden land protein. The pita appetizer is a home run too. Multiple difference sauces, all incredibly flavorful. Free refill on the basket just in case too. Highly recommended.", "Date": "2014-04-03", "Author_Location": "New York, NY"}, {"Author": "Sarah F.", "ReviewID": "WjZ_Qi7qMKwIhMkxIMZLkw", "Overall": "3.0", "Content": "I wanted to like it here but found the food lacking. My octopus appetizer was burnt pretty badly, and was sitting on a bed of chick peas so heavily covered in parsley I was picking it out of my teeth for a whole day. I'm not sure that the swordfish I ordered was fully cooked. I had a pretty hard time cutting into it, and it was fairly translucent and clear looking in the middle as opposed to white and cooked. The price was reasonable but I would rather spend a little more to really enjoy my food. Great selection of Greek wines, though.", "Date": "2014-05-27", "Author_Location": "Brooklyn, NY"}, {"Author": "Kendrick W.", "ReviewID": "-N3AWPZ0DAyuSljRLELhOg", "Overall": "4.0", "Content": "Delicious.  That's my memory of this place.  I came on a stormy night, an hour late meeting my friends because my plane was so delayed and this place quickly made me forget it all.  The moment I sat down, the waitress came right over, took my drink order and even recommended some dishes.  I had the sheep milk ricotta ravioli and it was like butter in my mouth.  So creamy and good.  My only complaint was that I felt the portion was a little small, which is unusual for greek places.  But absolutely tasty.  Also the meatballs.  Perfection.  I was a little underwhelmed by the Sangria, but other than that no real complaints.", "Date": "2014-05-26", "Author_Location": "Chicago, IL"}, {"Author": "Kevin C.", "ReviewID": "JKnb3kYu4oNW0PsKBk2zNQ", "Overall": "3.0", "Content": "If your in the UWS the place to go for Greek food would be here. Large restaurant with a downstairs and upstairs. Decor is standard and doesn't wow you and even with a reservation prepare for a bit of a wait.You come here for the greek food. Great apps with hummus and yogurt and their Octopus was grilled perfectly. Had the pressed chicken and it was made great and very flavorful with a bit of crunch from the pressing. If in the area i would stop in again.", "Date": "2014-04-03", "Author_Location": "New York, NY"}, {"Author": "Alisa L.", "ReviewID": "h4OPb3vt4Sy2tTSlUolTlA", "Overall": "2.0", "Content": "1.5 years.  The approximate amount of time Zachary Taylor was in office, or the amount of time I went without Kefi due to its closure/being busy and no longer living in MoHi.The answer is both, but alas, absence did not make the heart grow fonder once we were reunited.To be fair, the food itself was decent, albeit not as good as I remembered.  The sheep's dumplings were merely okay but the sauce was very flavorful, just begging to be scooped up by an extra order of bread.  The lamb burger was also average at best, nothing special and honestly, there are many better burgers in the neighborhood.So far, the restaurant is probably earning a solid 3 stars, but then what merited the drop?The service, oh god, the service.  The food took something like 45 minutes to come, while dessert, which was nothing special and shouldn't have taken that long, took 20.  Any request required attempting to flag down a waiter, already incredibly difficult, and actually ensuring the waiter remembered your request by re-flagging him down and reminding him.  The ambiance was also lacking, especially in the basement.  There was an old moldy smell, though it was very faint, and the place just seemed unappealing.  Perhaps it was the lighting, or the setup of the basement, but this place has definitely lost its charm.", "Date": "2014-03-10", "Author_Location": "New York, NY"}, {"Author": "Jason L.", "ReviewID": "co7e442g4TsVaw9ZHwLb5A", "Overall": "4.0", "Content": "Came here for lunch. If you're a feta fan + mussels fan, get the mussels for the appetizer. It was incredibly good, especially when you dip the bread in the sauce... woah man! We followed the yelper's recommendation and get ourselves the lamb shank. Very delicious, but because of how salty/flavorful the mussels were, it almost overpowered the taste of the lamb shank. So keep that in mind as you're making your choice. My brother had the kefi burger. That thing is HUGE. Not a fan that you have to add money for cheese (who does that?!) but when you have an option to add feta in a burger... go for it! I like this a lot! Cool interior, we had a very early lunch so no one was there yet so that was nice since my family and I wanted to get away from the business of Manhattan... we're tourists...you see...", "Date": "2014-04-15", "Author_Location": "Los Angeles, CA"}, {"Author": "Steve R.", "ReviewID": "pPdqmB-NYwYjMfyWlKE8kA", "Overall": "2.0", "Content": "I had a quite different experience from other Yelpers, because Kefi is way below par... somewhere in the double bogey range. If you must go, I suggest insisting on sitting upstairs, and if you cannot wait for a table there, leave. Downstairs is a loud, windowless, dining area where I felt herded in, like a tourist getting off a bus. In fact, the large groups sitting in another downstairs section, seemed to follow that description. The tables are small, crammed together and it is hard to hear your partner. Guests have to speak loud to be heard, so we couldn't help hearing what our neighbors were saying. It took 45 minutes to get appetizers. The often praised grilled octopus was tender, but it had no taste or brininess to it, as if you couldn't tell it ever came from the sea. Tasted like chicken. The warm feta was good, but I could do that at home. An hour in, we were told that they were out of dumplings, which was the sole reason we went there. Why wait an hour? FAIL. We finally got our good quality lamb chops, under-seasoned and over-grilled, poorly presented on a bed of greens in dire need of flavor. We should have listened to our neighborhood friends and hotel front desk people who didn't suggest Kefi. It really was a letdown.", "Date": "2014-06-24", "Author_Location": "Westlake Village, CA"}, {"Author": "Tara J.", "ReviewID": "gBP5LONGN5jj0lkd1kYLCw", "Overall": "3.0", "Content": "I came here for brunch on a Saturday with my boyfriend, parents, and a friend, and was disappointed that the service and staff were so bad, it almost ruined the good food. First, due to miscommunication on our part, we made two reservations for 5 people. When we got there -on time-, there was no table available for us, and we had to wait for almost 40 minutes for a table to be cleared. How did they not plan for that? What's the point in making a reservation? The manager tried to help but didn't do anything to speed up the process.Then once we sat, it took forever for our waitress to get to us, and then even longer for our food to come out - even though by that time we had told the waitress we were in a rush because we had plans to get to. I ordered some kind of breakfast sandwich with eggs, cheese, tomato, and bacon, on a giant loaf of bread. This was the messiest sandwich I've ever eaten, and the bread was way too large. I had to cut it up just to manage it, but the flavors were delicious. Everyone else enjoyed their food, but also was disappointed by the service. Despite the awful service, I really enjoyed the food and I would give this a second chance.", "Date": "2014-03-06", "Author_Location": "Manhattan, NY"}, {"Author": "Yon L.", "ReviewID": "KrbxD_uiub0AYCtX-BC0jw", "Overall": "4.0", "Content": "Come here by 12pm for brunch and it won't be crowded. It starts getting hectic around 1pm. LOVED the Sheep Milk dumplings. The tomato basil lamb sauce complimented these little treasures so well! The Greek spread was also yums. Really fresh and on point. I can't seem to find it on their menu online, but there was a GREAT Prawns dish on a bed of some grain... I don't know what it's called so this is frustrating, but they were small round bits... larger than quinoa. Reallly well cooked prawns and the other stuff was delicious too. haha.Was not a fan of the Greek Meat and Potato omelette. It was huge but the eggs were overcooked and dry. The sausage was tasty though but this dish definitely went back half finished. Service was great until the 1pm rush. Then our Bottomless mimosas turned into no mimosas for half an hour. Talk about a buzz kill. I'd go back...earlier.", "Date": "2014-02-17", "Author_Location": "New York, NY"}, {"Author": "Rachel B.", "ReviewID": "KwGj__Zgm0dXn78oa0Qu8w", "Overall": "3.0", "Content": "Since moving to the UWS 10 months ago I had been waiting for Kefi to reopen. Many of my friends had recommended the place to me. So, I was thrilled when I managed to secure a reservation last Friday night. Maybe its because the place had been so hyped, but I wasn't overly impressed with my meal. It was good... but nothing I would run back for. The grilled octopus was probably the best dish we tried. But, the rapine was waaay too oily and my simple grilled fish also tasted bathed in oil and butter. The special pasta dish made with a pulled pork was also pretty darn good, but its not that hard to get a good pasta dish in this city.It was also packed that night and we felt a bit rushed by the waitstaff, but that's understandable on a Friday night, and forgivable. Although, jamming so many diners into such a small space and constantly having the waitstaff bump into you really isn't the most preferable way to enjoy a meal. They might want to take out a table, or 3 or 4. The dining room is just so packed.I'm going to give Kefi another try. Hopefully, they were just a bit off that night. And the next time I'll see what all the hype is about and enjoy a great meal.", "Date": "2014-02-17", "Author_Location": "Manhattan, NY"}, {"Author": "lauren l.", "ReviewID": "PpyjVkmdepU64KfNGlMFbw", "Overall": "2.0", "Content": "What a disappointment!  Firstly, we sat at the bar to have drinks and snacks.   It was literally at least 5 minutes before we were acknowledged by the bartender.    She was busy, but a good bartender would know to at least say \"Hello, be with you soon.\"  No.  She walked back and forth and didn't even glance at us.Next-the food.   The dips were BAD!  So surprising because these are not that difficult to get right.  We won't be going back there.", "Date": "2014-03-12", "Author_Location": "New York, NY"}, {"Author": "Kara L.", "ReviewID": "4CaWDlyC41vWs8Y1ydGQzg", "Overall": "4.0", "Content": "Came here on Saturday for dinner with my best friend, and the food was so amazing it made up for some of the restaurants weak points.Since the \"remodel\" kefi has less of a intimate feeling and more of a get in and get out vibe. The two top I sat at was SO close to the table next to us I felt like they were part of our conversation. Also, both my table, and the table next to us ordered appetizers that never came out. My friend and I ordered the tzatziki, hummus, lamb shank, and striped bass which were All amazing. Our grilled octopus never made it to the table, but I saw others eating it and it looked good. I also had a glass of red sangria which was awful, it reminded me of a cheap juice I drank when I was little.The food is worth checking out as long as they keep the idea of quality, not quantity in mind. Also, make a reservation, this place gets packed fast!", "Date": "2014-02-18", "Author_Location": "Manhattan Valley, Manhattan, NY"}, {"Author": "Adam W.", "ReviewID": "aKfv1029XInkpy2T1sDR2g", "Overall": "2.0", "Content": "The food is not bad; it is no longer consistent and good.  The selection is still ... OK to good.  Those are now the only nice (nice-ish) things I can say about a restaurant I used to enjoy weekly, sometimes more often.   Kefi was damaged and spent a few months rebuilding.  When they were closed they lost nearly all of there staff ... and a restaurant takes a team like atmosphere to succeed.   I have been back to Kefi a few times since their reopening, brunch and dinner, and they have failed me every time.  They have problems from management to wait staff to bartenders.   It is a shame. The managment has consistently over booked and understaffed the restaurant while not having trained their staff adequately.  I feel sorry for the people that work there because they are not being given an environment to succeed, let alone excel.", "Date": "2014-03-09", "Author_Location": "New York, NY"}, {"Author": "P L.", "ReviewID": "zuLtRVjQfdyIoseiA0qG4Q", "Overall": "4.0", "Content": "Ambiance: This is a nice casual place to grab a bite to eat. Not pretentious and the staff was very nice and friendly. The manager also came up to us during our meal to make sure everything was okay and if we needed anything.The give bread at the table however since the bread is out before you sit down and seems to have been there for a bit, it was rock hard. We asked for fresher bread which they provided with no problem.We ordered the goat cheese dumplings with spicy lamb sausage-the sauce was very good and the dumplings were soft and pillowy and yummy. The only negative of the dish was the lamb sausage which was very hard and tasted funny.We also ordered the chicken sandwich and the chickpea fritter sandwich. Both were good and came with homemade chips and salad. Con: salad was a bit limp and overly covered with dressing.Overall, a good dining experience- you can be in and out in under an hour. I would go back again.", "Date": "2014-06-01", "Author_Location": "Brooklyn, NY"}, {"Author": "Linda L.", "ReviewID": "lI9RG5Ovflk9LcQVAfFWXw", "Overall": "2.0", "Content": "This review is based not on the food, which was delicious, but some of the most disorganized and chaotic service ever.  Four of us arrived at 7 pm for a birthday dinner and soon after ordered drinks.  45 minutes later I had mine but my friends had not.  One had ordered a virgin bloody mary and the two others vodka on the rocks.  Not complicated.  About 7.55 our appetizers arrived.  Still no more drinks.  We were told after repeated requests that the bar, which was in front of us, was backed up and the waiter himself could not make the drinks.  There was one bartender.  Then waiters seemed to gather to try to sort the mess, the bartender left, and finally the manager stepped in, very late in the game.  We all got drinks about the time the entree arrived.  Why the manager did not see what was going on and step in we could not understand.  It was a train wreck.  And by the way our waiter, who was doing the best he could, delivered the vodka on the rocks with a lemon twist with a lime wedge instead.  Under the circumstances we felt lucky to have drinks at all.  Quite a shockingly bad experience for a good restaurant and not at all appropriate to the quality of the food which was great.", "Date": "2014-07-08", "Author_Location": "Manhattan, NY"}, {"Author": "chip h.", "ReviewID": "W_quj1kp-RBb0NiXCIkumw", "Overall": "4.0", "Content": "The Octopus is still Amazing!!!!  Some people are complaining about the service but I'm sure as soon as the new servers become better seasoned that will no longer be an issue.  I am not a fan of the upstairs so I always have a few cocktails next door at Prohibition while I wait for a table downstairs.  Upstairs (very loud and congested), Downstairs (Cozy and much quieter).  The Lamb shank was still delicious and everyone at my table enjoyed their meal.  The service was a bit on the slow side but the guy was super friendly and trying his best so no big deal.  Love it......Sit downstairs.....Get the Octopus!!!!!", "Date": "2014-05-18", "Author_Location": "New York, NY"}, {"Author": "Tracey M.", "ReviewID": "fEe3btwniJEyhrs14FpIOg", "Overall": "5.0", "Content": "I really like this place a lot. They're a little slow at the checkin desk... But they totally make up with it for the good fresh food and the robust menu. If you can get there before 6 o'clock they have a prefix menu that first $17 gets you an appetizer an entrée and a dessert. For New York -- that's amazing.", "Date": "2014-04-30", "Author_Location": "Los Angeles, CA"}, {"Author": "Erum R.", "ReviewID": "UArx5BI9r7edz_pfFrkgbg", "Overall": "3.0", "Content": "I don't know what all the hype is about. I came here for dinner one night with the hubby and was not pleased. You'd think they have an amazing menu because the wait was about 45 minutes for a Thursday night but it really was not so impressive.Husband had the chicken souvlaki sandwich which he said was really dry. I would have thought they'd have more souvlaki options on the menu (like a platter with sides versus a sandwich) and found the menu limited. I ordered the branzino which was very good but extremely oily. There was so much olive oil on that thing that I felt pretty disgusting at the end of it. We had a crappy table in the middle of the restaurant and kept getting pushed around by rushed waiters. Not the best experience. My husband went to use the bathroom and was grossed out by how yucky it was so better to hold it in!", "Date": "2014-02-12", "Author_Location": "New York, NY"}], "RestaurantInfo": {"RestaurantID": "5FB9Nm7hLqUT8uIcJX6QuA", "Name": "Kefi", "Price": "$$", "RestaurantURL": "/biz/kefi-new-york-2", "Longitude": " -73.97262200000000", "Address": "505 Columbus AveNew York, NY 10024", "Latitude": " 40.785293000000003", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/7KLsT0jVKXNH3KwuQ-TgAg/90s.jpg"}}