{"Reviews": [{"Author": "Elizabeth V.", "ReviewID": "1Q3tAwvvHSIXHX-PfL3WRQ", "Overall": "5.0", "Content": "This place is definitely a hole in the wall but is the best place to get banh beo, banh bot loc, and other Hue-style appetizers! I usually get a few orders of the banh beo and they are super tasty. The fish sauce they give you is separate and a little bit sweeter than normal with jalapenos to add a nice kick. I also normally get the bun tom nuong (vermicelli noodles with grilled shrimp). They give you large pieces of shrimp and shrimp cake pieces as well and it's sooooo good! I get cravings for it regularly. I have also tried the bun bo hue and while that is not my first choice, it's really good as well.If you're craving banh beo, there is no better place! Their sister restaurant, Hue, is on Silver Creek if that's closer to you.", "Date": "2014-06-17", "Author_Location": "San Jose, CA"}, {"Author": "Tina N.", "ReviewID": "MfgkwOgLKq4ZpFNIxXdjlw", "Overall": "5.0", "Content": "I love coming here for lunch with my mom or friends! I only order the appetizers though. Banh beo, banh bot loc, banh nam, banh ram it, or cha hue. I love it all!They're all so good and yummy to eat and share with loved ones! It's definitely a little hole in the wall and I think I come here every other week to get my banh beo fix. The grandpa server who always seems to be there when I stop by always jokes around with me and my friends. I've never had a bad experience coming here! Parking is slanted and the lot is one-way. This place is cash only and the bill usually comes out to be about $10 a person with all the food we order~", "Date": "2014-06-02", "Author_Location": "San Jose, CA"}, {"Author": "Holly V.", "ReviewID": "PVg2Y-A31LlhyAajQ1HTag", "Overall": "3.0", "Content": "the mom and pop shop of Huei havent been here in a while but now i realized why i go to the one near my house.i mean it tastes the same but the pork rinds here arent as crunchy for the people i go here to eat with. plus this place is much more tiny. parking sucks too. never mix small driiveways and asians togther.", "Date": "2014-03-10", "Author_Location": "San Jose, CA"}, {"Author": "Quynh V.", "ReviewID": "RpU2Tej-c4QGre8waGWsaA", "Overall": "2.0", "Content": "Just tried it out with morning. My friend was there waiting for me. When I came, we asked a guy if we can put an order. He told my friend: \"I've been waiting to take yr order, now can you wait?\" WHAT THE HECK??? You can just say let me finish cleaning and I will be right back? Abt myself, I love to spend my money only where they know how to treat their customer right. It is all about customer service. I know I should not expect too much for customer service when going to Asian restaurant, but it just bothers me. We pay for what we eat, we tip its service, and we did not do anything wrong to get treated poorly. Anw, I did enjoy my breakfast. My friend and I ordered \"Bun bo hue\" both with small noodles, \"Banh Ram It\", \"Banh Beo\", and \"Cha Hue.\" Somehow mine \"Bun Bo Hue\" was delivered with big noodles. Food is okay, not the best; but I won't come back.", "Date": "2014-06-23", "Author_Location": "San Jose, CA"}, {"Author": "K L.", "ReviewID": "qa6aW4krYbQo1kvQK12-5Q", "Overall": "2.0", "Content": "Two star for their cha hue. The name of the place is Bun Bo Hue, but the broth came out a little over room temperature and it was very BLAND. We also tried banh beo, banh it ram, and banh bot loc, which was also mediocre. Definitely will not be back and will not recommend it to anyone.", "Date": "2014-06-22", "Author_Location": "Los Angeles, CA"}, {"Author": "Kathleen U.", "ReviewID": "FLp-y3YvAOGw3AQmjZRudw", "Overall": "4.0", "Content": "Troi oi, so many things to say about this place. Bun Bo Hue is definitely hole in da wall Vietnamese place. I have a sweet spot for this place because I can get all my Hue food and soup at one place. I have cravings for banh bot loc, banh beo and banh nam. The banh beo is da bomb here. The banh bot loc is just decent. I feel like it's been in the fridge and then just microwaved & served to customers. The banh nam is yum, no complaints here. Funny, how the restaurant is called Bun Bo Hue and doesn't have amazing BBH to my standards. The broth isn't as spicy enough. It seems as if it's been degraded down to being more catered to \"Americanized\". The spice level is not up to par to the \"normal\" standards of BBH. However, the Bun Rieu here is very delicious & flavorful. And brownie points for having the shrimp paste! I'd order the bun rieu over bbh next time I come, although it is called \"bun bo hue\".Bun Rieu & Banh Beo!Cash Only!", "Date": "2014-03-04", "Author_Location": "San Francisco, CA"}, {"Author": "Susy C.", "ReviewID": "LURPusoHOfGMtIJEL_-0_g", "Overall": "4.0", "Content": "4 stars for the banh beo alone. Although the restaurant is called bun bo hue, do not order the bun bo hue here. It isn't their strong suit. Banh beo is where it's at!  Banh beo literally translates to water fern cake. It's a steamed little cake with savory goodies on top. Best thing is the pork cracklings they give you (and they're not stingy!) drizzle some nuoc mam and have at it. I could go through a couple dozen of these alone I am sure of it. We did order the bun bo hue (group of us shared) just to try. Broth was not heavy enough to my liking. It was like a baby bun bo hue, not matured enough yet hahahaha. Stick to banh beo  Affordable, ca$h only.", "Date": "2014-02-09", "Author_Location": "San Francisco, CA"}, {"Author": "John D.", "ReviewID": "jcqJGuaLoE3apYpPBfJ_hw", "Overall": "4.0", "Content": "One of my cohorts and I were sitting back at the office trying to decide what was for lunch. I had been stuck in the culinary wasteland known as Alviso for so long that I was literally feeling overwhelmed with choices. So, we wrote down the names of 5 places on small pieces of paper; crumpled them up; stuck them in a hat; and just let the Yelp Gods decide as we picked one. The Yelp Gods apparently deemed it a soup day as we drew Bún Bò Huê (BBH) as our destination. It was actually an appropriate choice seeing as how it was a cloudy and overcast day and I've been hankering to expand my Viet-soup knowledge beyond the normal Phô. Plus, any Eastside Viet joint that gets a 4-star average is worth checking out just on those merits alone.    #1: Bánh Bèo- BBH has a large variety of appetizers that are apparently very popular with the locals. We opted for the bánh bèo, which is steamed rice cakes topped with dried shrimp. You then top it with a spicy fish sauce and enjoy. I thought it was pretty good,but not great. I will definitely have to try some of their other selection on future visits. 3*#10: Bún bò Huê:Broth- For the uninitiated, Bún bò Huê broth is much different than Phô broth in that it's a much more complex balance of spicy, sour, salty and sweet as opposed to the predominant beef flavor you find in the typical Phô. The smell of the broth emanating from the bowl was magnificent; I swear it had the subtle aroma of buttery popcorn. Unlike Phô, I didn't have to add anything (OK, I did a little bit of Chili Oil but it was completely unnecessary) to it to enhance the flavors. It was perfection. I can't  remember the last time I slurped up every last drop of broth, but I did here. 5*Noodles- Bún bò Huê noodles are thicker and more cylindrical than your typical Phô noodles and can be a little harder to manage with the chopsticks for those of us that don't use them everyday. With that being said they were pretty good and BBH is very generous in their servings. 4*Meat- Typically there can be all kinds of \"strange\" meats (e.g., Pig Knuckle, Oxtail, Congealed Pig's Blood, etc.) in Bún bò Huê, but BBH sticks with only two: Cha lua (aka Vietnamese Bologna) and some kind of fatty brisket. I would've preferred a little variety in my soup, but what they had was fine and plentiful. I really enjoyed the Cha lua; I think I may look into a sandwich next time I get some Bánh mì.4*Service and Ambiance- The service is actually slightly better than most Viet-joints as the lady serving us was actually quite friendly and pleasant. The store itself is the classic tiny Hole-in-the-Wall and hold a max of maybe 25 people. Ordinarily I really dig these kinds of places as they usually serve up the best food, but BBH's only downfall is it's location. They're located in the Caribbees Shopping Center and for anyone who's been here knows what I'm talking about when I say navigating the parking lot is a complete nightmare. Service-3.5*/Ambiance-4*/Location-1*BBH is a real diamond in the rough that serves up some mean Bún bò Huê. If it weren't for the terrible location, I think I could easily see going up to 5-stars, but the shopping center really is that bad. Be that as it may I still highly recommend it, but I suggest you leave your Maserati at home if you know what's good for it.", "Date": "2014-01-25", "Author_Location": "San Jose, CA"}, {"Author": "Denny L.", "ReviewID": "Y3B4kMy_1Rs2uVodwpdzhQ", "Overall": "5.0", "Content": "A pretty good place if you want to get your banh beo craving fixed. This was a go to place for my parents abd me when I was little and even now I still find it my go to place. Taste and quality hasn't changed over the year like most places.", "Date": "2014-05-30", "Author_Location": "San Jose, CA"}, {"Author": "Andrea S.", "ReviewID": "GnYcFjlwiEAxAIL7k--jRA", "Overall": "4.0", "Content": "During the past weekend, it was my first time here. My uncle invited my dad & I out to lunch last minute. I thought we were meeting at my deceased grandmother's cemetary grave, but he decided to eat at this restaurant. I heard this location has been here a long time, but never ate here before. There was a large party of people lingering around outside as we arrived. We didn't see our uncle inside yet. My dad asked those people if they were waiting, and they replied that we can go inside since they were just waiting for a bigger table. Majority of the tables are very small. Even a table of four is crampy. Only one table in the center would fit a large party. Wow, the aroma of mam ruoc just permeates out to the door before we even entered. I didn't want my hair to permeate with the smell of nuoc mam and mam ruoc so I immediately clipped my hair up. LOL. We ordered bun bo hue, cha hue, banh beo, banh bot loc, and banh ram it. The servers brought out our order along with a small bowl of nuoc mam (fish sauce) and crunchy pork skin (chicharron) to share. Since I already had lunch at home, I only ate the little things: banh beo, banh bot loc, and cha hue. The banh beo was good. It had the right consistency of rice flour and dried shrimp ratio, but green onion distribution was hit or miss. Majority of our little plates did not have green onion, oh well, but the dried shrimp is more important. I just like pretty food and a little green here and there would of been a nice contrast presentation to see. The banh bot loc I ate was chewy and not so good because it seemed reheated but not warmed enough. Even my uncle says banh beo is good here. He says the banh bot loc is not too good. The cha hue is just okay. I really want to try the banh ram it. It looked so good, but my dad and uncle ate it all. None left for me. My dad & uncle also ate a small bowl of bun bo hue. It looked very good and authentic! I am assuming the bun bo hue is good or else since my dad is highly critical with food, I would of heard a bad remark during or after him eating the bun bo hue. Surprisingly, none. If I ever come again, I would like to try the banh ram it & bun bo hue.", "Date": "2014-01-20", "Author_Location": "San Jose, CA"}, {"Author": "Elizabeth H.", "ReviewID": "lq0FTd518lw3V83vRVLBmw", "Overall": "4.0", "Content": "Came here on a weekday night at around 7:15 as a group of three. Unlike what seems like everyone else, of all the things that we ordered: bun cha gio, nem nuong, bun bo hue, banh beo, and banh bot loc, the banh beo was the only thing that we didn`t really like. Maybe it`s because we didn`t really know what it`s supposed to taste like, but even with the fish sauce, there wasn`t much flavor. Aside from that, everything came out pretty fast - although, we were the only customers there. The place is pretty quaint, and has a nice hole-in-the-wall feel to it.", "Date": "2014-03-01", "Author_Location": "Sunnyvale, CA"}, {"Author": "Jennifer T.", "ReviewID": "DV4tn3Lzz22weTJ-OSZkVA", "Overall": "5.0", "Content": "This is the OG Hue Vietnamese food place. I remember coming here as a kid and I get all these tingly good feelings every time I come back.Yes, there are other places that are comparable and cleaner, but for me, this location still makes the BEST BANH BEO!!!  It's about the food anyways, so who cares if the place could use a little renovation?Banh Beo, Banh Nam, Banh Ram It and Cha Hue are all delish. I keep coming back for more :) Don't get the Banh Boc Lot!  it's just not as good as the Banh Beo and other things there.....Reminder - CASH ONLY!", "Date": "2014-01-07", "Author_Location": "San Jose, CA"}, {"Author": "Vy C.", "ReviewID": "y1av9lwbOlr-cb7tf2vPrw", "Overall": "1.0", "Content": "Man I don't know where to start. I'm not sure what's the hype about this place. I went to eat there yesterday with my brother and they ignored us for a while. We just sat ourselves.  We like to go eat bun Bo hue so we decided to try this place since it got good reviews. So we order a bowl each of bun Bo hue and the size of the small and the large looks almost the same. When it came out, there was a top layer of straight up red oil. I had to scoop some of it out of my bowl. There soup had no flavor at all. We put some hot sauce in the soup and it still tasted plain and bland. The noodles tasted like they've been overcooked and in the pot for too long. There was a big group of people that were in this place while we were eating and they ordered the bun Bo hue. I can just here the waiter that put in the order say that they had ran out of noodles in the back and was just laughing. Wth? I would not go back to this place, there are far more better places then this place.", "Date": "2014-06-26", "Author_Location": "San Jose, CA"}, {"Author": "Misha T.", "ReviewID": "X28CE2Yey7pL7Jh7IVDFew", "Overall": "4.0", "Content": "3.5 stars. The bbh here isn't quite as fishy or hot as I was hoping. It still did the trick to settle my turbulent stomach at the time. You'd kinda think though that for a place called BBH it'd be their main thang. Looking around it looks like it's really banh beo.They have banh ram it which wasn't as much as a contrast between the crisp and the sticky that I had hoped for.", "Date": "2014-02-18", "Author_Location": "New York, NY"}, {"Author": "Lendle N.", "ReviewID": "dF6J-FdCeecy8zsZHFv_uA", "Overall": "5.0", "Content": "Bested banh beo ever!  Can't get enough. When you go make sure to also get banh ram it when you go. It's small and old so don't expect a fancy place. Haha just go for food.", "Date": "2014-05-06", "Author_Location": "San Jose, CA"}, {"Author": "Kelly T.", "ReviewID": "GZ0e0iiHmOoQ23-ADG3PQg", "Overall": "4.0", "Content": "I've been eating here every since I was little and all I can say is that their banh beo and banh canh have never let me down. Their banh canh is not the usual banh canh that you see around, it's very different and original but you have to go there and try it for yourself ! I gave it a 4 because it's old and look a little unsanitary but I still think it's pretty clean ish I guess. There's another place exactly like it in the silver creek plaza and it's also owned by the same family. Even though that place is newer the banh beo is still the same. But I'm not sure exactly if they have banh canh there or not.", "Date": "2013-12-22", "Author_Location": "San Jose, CA"}, {"Author": "Theo T.", "ReviewID": "dAcUvrsWJsbo9o_BtLXZNw", "Overall": "5.0", "Content": "This place is the epitome of a hole in the wall restaurant. It is located in a random Vietnamese plaza that looks like every other Vietnamese plaza in San Jose. If you blink you might even miss it. but if you miss it then you will miss out on some delicious food. And everything has stayed the same ever since I went here when I was a little kid.The Bun Bo Hue is delicious! It has thick broth, lots of meat, and it doesn't have an overwhelming amount of noodles either. Other items that are just as good, if not better are the Banh Beo (SO GOOD! I dont even like banh beo too) and the Banh Canh. Two simple dishes done brilliantly.The services isn't as bad as the rest of the Vietnamese hole in the walls. The place is small and it also gets packed pretty quickly so there might be a wait, but wait it out. It is totally worth it!", "Date": "2014-01-14", "Author_Location": "Campbell, CA"}, {"Author": "Tiffany T.", "ReviewID": "-hpzPDNZU0LOiSC3Wn009A", "Overall": "5.0", "Content": "Hands down, my favorite Bun Bo Hue restaurant EVER! You haven't tasted real authentic Bo Bo Hue until you come here. First start with gathering a little noodles, some meat, veggies onto our spoon, take the spoon and scoop up a bit of soup. 2. slurp the entire spoon into your mouth. 3. then its going to be ....waitttttt for it......LEGENDARY.", "Date": "2013-09-25", "Author_Location": "Alviso, CA"}, {"Author": "Angela C.", "ReviewID": "S2Vvk29AtktS_WGdqMAM-w", "Overall": "5.0", "Content": "This place is definitely a hole in the wall. It's not the cleanest restaurant and the service isn't all that great either but the food sure makes up for all that business.I love the banh beo, banh nam, banh ram it, and the banh canh here. Can't go wrong with any of those items!I believe Hue on Silver Creek by Target is the sister store to this restaurant. They're cousins or family by some sort. Hue is the cleaner restaurant and better service but I think the food at Bun Bo Hue is better in quality.", "Date": "2013-12-17", "Author_Location": "San Jose, CA"}, {"Author": "Lynn C.", "ReviewID": "wVqG6NDt4fqwXDnjrpc0qQ", "Overall": "4.0", "Content": "We sat down and someone instantly came to take our order. From there we got the banh beo in under 5 minutes and we got our bun bo hue in under 10 minutes. The service was FAST.The banh beo was yummy and I've recently eaten a ton of bum no hue all over San Jose, but this was one of the best. The broth was actually really flavorful and good. Not the best atmosphere but worth it for the food.", "Date": "2013-11-10", "Author_Location": "SoMa, San Francisco, CA"}, {"Author": "Randy F.", "ReviewID": "21u5Tp_557jmbHEpvriWhw", "Overall": "4.0", "Content": "One of the first times I had banh beo was at this location and I must have been thrilled to find so many small Vietnamese appetizers that were novel and delicious.After having had banh beo at many more locations, would have to echo that these pale in comparison to SoCal (specifically Quan Hy).  The banh beo are too large and too thick.  The dried shrimp topping is good, but I like the smaller ones better.Really hole-in-the-wall but it's nice that you can stop by and just order an appetizer for a small snack.Cash only.", "Date": "2013-08-21", "Author_Location": "Palo Alto, CA"}, {"Author": "Crystal H.", "ReviewID": "S5lBF4fZ_J0TKLwgBouroA", "Overall": "3.0", "Content": "Very empty place when we came at 6pm. The plaza it was located was really ghetto looking that my bf said we should go somewhere else haha. But I wanted to give it a try.Banh Beo was alright, I had better at Hue.Banh Ram was good, but looked kind of messy compared to the one I had at Hue. Bun Bo hue was very much the same and good as Hue. Service was fine since we were the only people there. A little too empty, far, and dead for me to come back. If I lived closeby, I would come back.", "Date": "2013-11-01", "Author_Location": "Milpitas, CA"}, {"Author": "Andrea G.", "ReviewID": "CY6XqzLGmEMRqsf9dTeT-w", "Overall": "4.0", "Content": "I've lived nearby for years and yet I haven't been to this restaurant until today. Located in the plaza with Senter Market, it is almost invisible among all the other stores and restaurants. When you walk in, the place appears very small with only a few tables. We ordered three bun bo hue, two mi quang, one banh canh, one banh ram it, and one banh beo. I didn't eat the bun bo hue since it had beef. But it smelled good and the color makes the bun bo hue look absolutely delicious. My cousins thinks that the pork blood was overcooked but the soup was flavorful.I ordered the mi quang, which had a combination of vegetables, soup, shrimp, pork, and shrimp chips. I thought that it was very good. The different flavors came together nicely and was very tasty. I added extra chili to the soup because I like my food to be spicy. My cousin ordered the banh canh, but when it came out, we were really surprised. It looked partially like egg drop soup or porridge. It turns out this is the Hue version, which we've never had before. They had the udon like noodles in the soup with shrimp balls. I had a bite and I thought that it could have been more flavorful. However, it was pretty good.We also ordered the banh beo and the banh ram it. The banh beo was freshly made so it came out pretty hot. The banh ram it was very delicious. It has a chewy mochi like top with shrimp on the inside. It resembles banh bot loc. It is placed on top of a tempura like batter. Very tasty with fish sauce.Overall, I am amazed that I have not been here before today. I definitely will return here to try their other dishes.", "Date": "2013-07-27", "Author_Location": "San Francisco, CA"}, {"Author": "Lisa N.", "ReviewID": "AjQDGbOCS9ZI48CsuJgjgQ", "Overall": "5.0", "Content": "Banh Beo, Cha Hue, and Banh Ram Khong It are delicious! I love hue food it's so good! We called a head and they reserved a table for us which was really nice! The other location on Aborn was so full so we drove here and were seated immediately. Great customer service!", "Date": "2014-01-02", "Author_Location": "San Jose, CA"}, {"Author": "Tran N.", "ReviewID": "r0O_hoaDU_SSXy7ngDgz6Q", "Overall": "4.0", "Content": "This is literally a hole in the wall. I've lived across the street from this place all my life, but I've never actually eaten here. For parties, we always cater banh beo from here. I would recommend the bun bo hue and banh beo for appetizers. The bun bo hue tasted a little bit different compared to the other famous places around, but I thought it was flavorful and the broth was well rounded. The soup does not come out very spicy, but there's extra chili on the tables. I probably would not go out of my way to eat bun bo hue at this place, but I'd come for the banh beo. A con is that the parking situation is ridiculous. The lot is small, packed, and difficult to maneuver in.", "Date": "2013-04-25", "Author_Location": "Kentfield, CA"}, {"Author": "Judy W.", "ReviewID": "oli_lrr0N1uVWE61Ceri-g", "Overall": "4.0", "Content": "I know this place is called Bun Bo Bue #1 lol, but i dont really like the bun bo hue here. but what i do love is the banh beo!!! it's supppppeerrrr bombdotcom haha. not sure if thats even how i should use the phrase. but yeah. Hole in the wall, cash only, plenty of surrounding markets and stores, parking ... ehhh. theres spot. but u know asian drivers. =Pmmmmmmmm BANH BEO!!! NOM NOM NOMS!!!", "Date": "2013-03-19", "Author_Location": "Oakland, CA"}, {"Author": "Andrew D.", "ReviewID": "_Zm1oTZfGTPHvH8Cmu3Lbg", "Overall": "4.0", "Content": "If you want some of the best hue cuisine from central Vietnam, this place carries the crown here in the Southbay. The only reason I'm not giving my review 5 stars is because of cleanliness. It's a straight up \"hole in the wall\" joint so don't expect modernize decor.The most popular dish and my favorite has to be the Banh Beo (rice cake). They come out each individually in small little plates and I was addicted! I recommend eating it together with the Cha Hue (pork patty) to enhance the flavor. The Banh Nam (steamed flat rice dumplings) and Banh Bot Loc (vietnamese ravioli) was also tasty and I enjoyed it. The Mi Quang (yellow noodle) which is also another popular dish that I see people ordering was pretty good and refreshing.I recommend coming here if you want good authenticate Vietnamese food from the central. Just make sure you are willing to go down and dirty with your food.", "Date": "2013-01-28", "Author_Location": "Milpitas, CA"}, {"Author": "cong m.", "ReviewID": "xpHb8ghORbHCSP-NRQK6kA", "Overall": "1.0", "Content": "I came here with my girlfriend and mom. We ordered a few orders of banh beo, banh bot loc, and mi quang. The food came out fast, but most of what we ordered was precooked and only required reheating anyways. While eating the plates of banh beo, my girlfriend noticed a long strand of hair in the plate of banh beo that I was about to eat. We called the server over who was an elderly man and told him about the hair. The elderly man gave us an unpleasant look and took the plate to the back kitchen. Prior to calling the server, my girlfriend took a chopstick and made an indentation into the banh beo. Why? You will know as you continue to read. We thought the server was going to switch out a new plate of banh beo, but it was otherwise. The server brought out a plate of banh beo that was covered in a thick layer of shrimp shaving. My girlfriend gently scraped the shrimp aside and found the indentation that she made earlier. Disgusted, we did not touch the plate for the rest of the night. We paid for our meal, did not leave a tip, and vowed not to come back to this establishment.I understand mistakes happen, but to deliberately deceive your customer for something that merely cost less than a dime to make? You've just lost yourself another customer.", "Date": "2014-01-03", "Author_Location": "Alameda, CA"}, {"Author": "Amy P.", "ReviewID": "5HaanmM8HOBmyi_xkdlijQ", "Overall": "5.0", "Content": "best Hue dishes here! mostly the banhs. it's funny how this place is called Bun Bo Hue but they specilize more in banh beo, banh bot loc, and all the other banhs. their bun bo hue really isn't that great. I only go here for the banh beo. best there is around here and I've tried quite a handful. my Mom is nguoi hue so I grew up eating hue food and this place does banh beo right!", "Date": "2014-06-10", "Author_Location": "Sunnyvale, CA"}, {"Author": "Diana N.", "ReviewID": "L-g-rXIBLWEtyrtc_oqv8A", "Overall": "5.0", "Content": "A hole in the wall that's been around for as long as I can remember. This is the best place for banh beo. I also get banh ram it and cha hue. You can't go wrong by ordering many orders of appetizers here. Bun Bo Hue and Mi Quang are not worth it -you'd be missing out on the appetizers.", "Date": "2014-01-03", "Author_Location": "Bay Area, CA"}, {"Author": "Kevin H.", "ReviewID": "_u0xoH9wZXugjCdvwCdKzQ", "Overall": "3.0", "Content": "This place gets 3 stars for their banh beo! I really like them here for some reason. The little cake stuff are pretty good too ( I forgot what theyre called ).The place is small, takes cash only, and the Bun Bo Hue is only alright. I usually come here with a friend just to order a bunch of banh beo so we can just chill for a little and talk.", "Date": "2012-12-24", "Author_Location": "San Jose, CA"}, {"Author": "Betty N.", "ReviewID": "GrUb8EjBVk7xXQx06JgZ7A", "Overall": "4.0", "Content": "My favorite bun bo hue joint. Period.Sure, it's divey, small, but oh so worth it. My friend and I would share the banh beo and banh ram it (love the name) for appetizers before immersing ourselves in the bun bo hue. It's so damn good.The broth tastes perfect, not oily, and not too sweet or salty. It's authentic old school with a generous portion of pork shoulder attached to bone and skin. Yes!There is a reason why this place has been around for many, many years.-1 one star for the fugly decor. It needs a makeover, but don't raise the prices, please.", "Date": "2008-12-13", "Author_Location": "Beverly Hills, CA"}, {"Author": "Carol L.", "ReviewID": "FLce9_ZHVp7aEQdttzcwug", "Overall": "4.0", "Content": "Usually, I tell people that when you go to a Vietnamese restaurant, you should order their specialty... and usually, that specialty is in the name of the restaurant.  But this one is a little trickster!  The name of the restaurant says Bun Bo Hue, which is definitely good here.  However, their specialty is their Banh Beo!!We ordered Banh Beo, Banh Ram It, Banh Nam, Banh Bot Loc, and Cha Hue.  I'm not going to describe them all, but at the very least,  I'll describe two.   Banh Beo: small plates of rice flour goodness, covered in dried shrimp.  Pour some fish sauce on it, and enjoy.  This dish is one of the many central Vietnamese popularities, and my family and I have had it here since I was just a toddler.  Also, Banh Ram It is always a crowd favorite at any restaurant that carries it:  crispy fried bottom, sticky rice flour based top, with shrimp and pork.  Again, cover with fish sauce, and enjoy.If you feel like being adventurous with Vietnamese food outside of Pho, this hole-in-wall is a great option.", "Date": "2011-05-03", "Author_Location": "Campbell, CA"}, {"Author": "Lolia S.", "ReviewID": "lBA5aL853DA5t9lEAWuV_A", "Overall": "5.0", "Content": "BBH definitely looks authentic: a hole in the wall located within a Vietnamese strip mall, with barebones décor and mostly Vietnamese clientele. They specialize in Hue cuisine. The menu includes rice plates, noodles, porridge, Vietnamese beverages and Vietnamese desserts (che). You'll find a lot of rice noodles on the menu. Just about every table had at least one order of the banh beo.* Banh beo ($3.28): You get five small plates per order. Each plate has a thin steamed rice cake topped with finely ground dried shrimp (not as pungent or strong as Chinese dried shrimp) and a crispy nugget of fried pork rind. You add their fish sauce concoction to it and it's so good, the soft rice cake, the crunchy rind, definitely order.* Bun Nem Nuong ($7.25) aka grilled meatball vermicelli bowl: their homemade grilled pork meatballs were fantastic and so was everything else - the vermicelli rice noodles, the pickled veggies, lettuce, fresh mint, ground peanuts, and fried shallots. Crunchy, savory, tangy goodness* Soy milk - way too sweetCash only.", "Date": "2012-01-06", "Author_Location": "Los Angeles, CA"}, {"Author": "Ryan O.", "ReviewID": "aRXtJXmjMqNtjIkYabPClQ", "Overall": "4.0", "Content": "This place kicks ass amongst the other so-called \"best Bun Bo Hue\" places. It's very small and may not be the cleanest, but you definately get the feeling of Vietnam in this place. The old man working working the cash register just sits there smiling all day long while the ladies in the back cook up their delightful dishes. Their house specialty is as the name suggests... Bun Bo Hue... and it is absolutely delicious! It comes out medium spicy and you can add more jalepeno peppers and chili oil if you like. Also tasty are the Banh Beo and the Banh Ram It dishes. It's hard to find places that have this stuff, so if you go here, definately order these. I thank my wife for bringing me to this dive and consider it the best I've had, ever.", "Date": "2008-12-13", "Author_Location": "Campbell, CA"}, {"Author": "Wanugee N.", "ReviewID": "YcUT7Mr4jDXVAtcr6CMOlw", "Overall": "4.0", "Content": "Bun Bo Hue is perhaps the signature dish from Central Vietnam. It is a spicy noodle soup, with noodles that are spaghetti like, and filled with pork meat, pork fat, and large cubes of solid pork blood, and a lot of veggies you add, such as bean sprouts, cabbage, etc. This restaurant is named after this dish, and has been in this all Viet strip mall for decades, as this is perhaps the first restaurant in SJ that specialized in Central Vietnam food, and this all Viet mall is the oldest all Viet strip mall in San Jose. Their Bun Bo Hue is very good, but not fantastic. A small bowl is $5.95 and chock full of ingredients. But most people come here for the little small dishes of Banh Beo.  For $2.95, you get 5 little dishes of Banh Beo, which are filled with rice flour, then sprinkled with minced dried shrimp and topped with a little crispy ball of pork rind. They also have several other little dishes, which if you order them all, is kind of like your own little Vietnamese Dim Sum meal! There is Banh Ram, which is a crispy fried base topped with a chewy rice ball topped with shrimp for $2.95 (for 3);Banh Bot Loc, which are little chewy dumplings like steamed Har Gow (shrimp dumpling) at a Dim Sum tea house, but the casing is made out of a clear rice/tapioca combo, making it chewier than the Chinese variety. ($2.95 for 5) Cha Hue ($2.95) is a Vietnamese pork sausage rolled in a banana leaf, with a spicey flavor as are many dishes from Central Vietnam.  The restaurant is old and a complete Dive type place, accepting cash only. It is very small,  with about 12 little tables crammed inside. But service is friendly and the food is different, fun to eat and very inexpensive. The table next to us was occupied with 2 woman with 5 kids, and they must have eaten 35-40 Banh Beo between them! This is a 3.5 star rating, rounded up for authentic Central Vietnam food.", "Date": "2008-01-02", "Author_Location": "San Francisco, CA"}, {"Author": "Lien T.", "ReviewID": "bVkMVuv8wQmJfaGdm5EOaA", "Overall": "3.0", "Content": "My parents used to take me here all the time when I was younger, but with so many nicer bun bo hue restaurants around now, my family does not come here that often anymore.It had been months since my last visit and so I decided to come back. I was craving for some mi quang anyway, so it was only appropriate. My friend and I shared an order each of banh beo (yelp.com/biz_photos/-ZEO…), banh bot loc (yelp.com/biz_photos/-ZEO…), and banh nam. I got myself a bowl of mi quang (yelp.com/biz_photos/-ZEO…) and he got a bowl of bun bo hue. The mi quang was exactly how I remembered. It had just the right amount of broth to coat the noodles, but not too much where it was like eating soup--that's exactly how mi quang should be served. It was very flavorful and there was plenty of pork and shrimp. What I really enjoyed were the bits of tomato in the bowl too.I didn't like the banh bot loc so much here. Banh bot loc is one of my favorite Vietnamese dishes, so I am very particular about how it taste. It was just too chewy for my liking. On the other hand, the banh beo and banh nam were great. The steamed rice cake in both dishes were steamed perfectly. It was very light and did not taste doughy at all. I know there are a handful of other good Hue restaurants in town, but Bun Bo Hue #1 Seafood Hut is worth checking out. I know it's tiny and dingy, but they serve delicious food and that's all that matters!", "Date": "2011-10-25", "Author_Location": "San Jose, CA"}, {"Author": "Veronica S.", "ReviewID": "dAmasWczIK3yOF6HqEJe6A", "Overall": "4.0", "Content": "Delicious, Authentic, and Cheap - what more can you ask for a Viet joint?The Ba'nh Beo - 5 little dishes for $3.95 (rice flour steam w/ dried shrimp scraps and light Viet fish sauce is probably the best one I've had, with pork grinds)Ba'nh Bot Loc - 5 pieces on a single dish for $3.95 ( shrimp/pork dumpling - yummy!)Cash Only. Ghetto-fab place. Authentic and homey mom and pop shop!", "Date": "2011-01-12", "Author_Location": "San Francisco, CA"}, {"Author": "Irvin C.", "ReviewID": "u82hAbM4ZeioNpKCc5Kb2w", "Overall": "5.0", "Content": "If you are not giving this place a 5 Star, your definitely not ordering the right food.Com Bi +Suong+ Cha (Special soy sauce zomg FOODGASM)(PORKCHOP OVER RICE)Banh beo (hands down the best in san jose)Mi quang (yellow noodle soo cheap and yummy)This place is so close to my house. This is a good example of how a hole-in-the-wall is sooo delicious everything in here is made with love(you can just taste it) real authentic vietnamese food can get.Words cannot explain how much the food taste good in here +prices are so darn cheap+a hole in the wall+Banh beo is amazazing-Hole in the wall/Little dirty-They dont give me enuff water =[", "Date": "2010-12-23", "Author_Location": "San Jose, CA"}, {"Author": "Bobby l.", "ReviewID": "qApr5jOvCRt9PAQm96RzYA", "Overall": "3.0", "Content": "Interesting place that I would never have thought of going to....(i think that makes sense).My friend ordered the Banh Beo and something else for us to try.Do you remember those to-go meals vietnamese sandwich shops usually have? remember seeing those circle rice things with orange \"flakes\" on them? well this is the homemade authentic version.   Like most homemade things, it tastes alot better than the packaged stuff, mostly because its fresh.  I hesitantly ordered the Bun Bo Hue.  I believe I had it in the past and didn't like it, but since my memory was cloudy, I decided to order it.  Once it came out, I just knew that it wasn't for me.  Luckily! my friend John had ordered something more tasty and was generous to swap his for mines.  So my meal of clams and rice was also new to me.  To me it reminds me of vermicilli but with rice instead.Layered of mixed greens and rice, topped with tons of mini clams with fermented shrimp sauce and clam broth? on the side.overall the food was interesting, nothing spectacular.most dishes ranged from 5-6.", "Date": "2008-03-17", "Author_Location": "San Jose, CA"}, {"Author": "Manda Bear B.", "ReviewID": "90Et0aUr_hXCjtPI2Frxuw", "Overall": "4.0", "Content": "Authentic Hue City food. Hue City is located in the center of Vietnam. this restaurant runs by the same family for the last 20 plus years.Ba'nh Beo` - rice flour steam/bake with dried shrimp scrump over, serves in 5 small tiny dishes & nuoc mam (Vietnamese light fish sauce) delicious.Ba'nh Bot Loc - shrimp & pork dumpling is also an awesome dish.Ban' La' - rice flour rolled in banana leaves steam with shrimp is my FAV dish here.Their ham (NEM & CHA~) dishes are also excellent.Food: Very authentic!Price: darn cheap!Location: Ghetto!Service: Typical Asian place, what service?Cleanliness: below average.", "Date": "2008-07-14", "Author_Location": "San Francisco, CA"}, {"Author": "Reese R.", "ReviewID": "Bkirt1OtxpWphLReKYZxIA", "Overall": "5.0", "Content": "OMG, the best Banh Beo in the world!!!!If you love vietnamese food, then this is the place!! I remember eating here all the time as a little girl and going back to it just lightens my day. :-) You will not get full from just one order of Banh Beo... I always end up ordering 3 or 4 sets cuz they are so addicting!! Their Bun Bo Hue is even the best here (hence the restaurant name). Food comes fast, and they get packed quick so try not to come during busy hours. Seriously you are missing out if you haven't tried. :-)", "Date": "2010-01-17", "Author_Location": "San Francisco, CA"}, {"Author": "Kristi H.", "ReviewID": "byaLpYy8OL8p2cATs_RTsw", "Overall": "5.0", "Content": "Let me be clear, I'm only going to review the banh beo.Because let's be honest, that's the only thing I ever order from here. LOL. So, I've been hitting this place up since I was a little tyke with my mom. I ignored the \"ghetto-like\" environment because my mouth used to salivate from anticipating that first bite. Now, I don't really go here that often but whenever I do, the child in me is like, \"Hallelujah!\" Another reason why I like the banh beo is because they're all in individual plates, making it so much easier to have banh beo eating contests with your sibs! Other than my mom's homemade banh beo, this is probably the best in the San Jo.", "Date": "2011-01-09", "Author_Location": "San Jose, CA"}, {"Author": "Samantha L.", "ReviewID": "FYuIGMRzgxaLwKdn31l0wg", "Overall": "5.0", "Content": "Five star rating for just the banh beo...too scared to try anything else, lol.The Hue style restaurant has been open for years and although the service is lacking and cleanliness is poor, I keep on coming back. It's an hole in the wall with few tables and is usually packed around lunch.Banh beo is steamed rice flour cakes with ground shrimp and a bit of fried onion. It's served with fish sauce with sliced jalapenos and pork rinds. Same thing you see at the Vietnamese sandwich stores in the dish but much more delicious! I recommend eating there, it's not quite the same to-go.I would also recommend the banh ram it, it's chewy with pork and shrimp with a fried bottom. Any who, try any of the banhs, I'm pretty sure they're all good! :)", "Date": "2008-08-02", "Author_Location": "Milpitas, CA"}, {"Author": "Monica T.", "ReviewID": "IqGGKvII4FpQwHkAtZ3KSQ", "Overall": "4.0", "Content": "Bun Bo Hue #1 specializes in the cuisine from Central Vietnam.  Although the Vietnamese food in San Jose is still inferior to SoCal, this place ranks pretty high for the South Bay.Everyone comes here for the banh beo [tiny rice flour pancakes,topped with minced shrimp and eaten with fish sauce] and though the pancakes could be thinner, the flavor is good.I also highly recommend that Mi Quang, yellow noodles w/broth, and the Bun Bo Hue, a spicy beef noodle soup.  The distinguishing mark of noodle dishes from Central Vietnam is that they come with heaps of fresh cabbage and other veggies, which you're supposed to mix into your bowl.", "Date": "2007-05-18", "Author_Location": "Berkeley, CA"}, {"Author": "Mary T.", "ReviewID": "iBzcvHAcrrp_WKyucTjJRw", "Overall": "5.0", "Content": "This place is really as good as it gets!  Love coming here for the banh beo.  I swear I can eat about 20 of these babies, all by myself!  They are so delicious!  My honey and I love coming to this joint!  I've also tried the Mi Quang and the Bun Tom Thit Nuong.  The Mi Quang is just right with not too much broth and all the flavors really come together.  Bun Tom Thit Nuong is really good too, the grilled pork and shrimp are seasoned just right and add the fish sauce to make your dish complete!  Next time I think I'll try their Banh Canh.  This place is super affordable!  If you want some great tasting Vietnamese food from a hole in the wall type of this...come here!  FYI...this place only accepts cash!", "Date": "2010-07-27", "Author_Location": "Hayward, CA"}, {"Author": "Regina N.", "ReviewID": "7rDVrtWWvoEu4p31PtVRUA", "Overall": "4.0", "Content": "This place is real tiny and a hole-in-the-wall, which we all know = Yummy in ma Tummy! Even though the name suggests you should get Bun Bo Hue, I personally like the appetizers. Can't go wrong at 3 baby bucks!The Banh beo and Banh bot loc are worth coming here for. * BANH BEO - very thin, which is how it's supposed to be. Smother them in fish sauce paired with a piece of fried pork fat.. oh lawdy lord! * BANH BOT LOC - tasted very fresh and the clear dough was actually soft, not chewy at all. Don't get Banh Ram It. The fried tofu or whatever on the bottom is good but the doughy ball on top was way too chewy. If you eat these, ladies, prepare for some swallowing exercises on your throat because these babies will go down whole. VERY difficult to break apart by chewing.. unless you're a camel.  My only gripe: fish sauce was on the lighter, bland side. Oh yeah, and the small, narrow parking lot filled with Asian drivers. Yikes!!! Definitely leaving my Audi at home!", "Date": "2013-01-03", "Author_Location": "Elk Grove, CA"}, {"Author": "Annie P.", "ReviewID": "YZchMyMgYVCkzFpnjV0Sbg", "Overall": "4.0", "Content": "From the bottom of my partially Vietnamese heart one of the best Vietnamese restaurants in town to get authentic Hue food. Hue is a certain part of Vietnam and every part of Vietnam makes their food a little different. Here's what to order when you go:-Banh Beo (Shrimp paste cakes)-Mi Quang (Yellow noodles w/pork)-Cha Hue (Pork rolls w/whole pepper)-Banh Ram (Fried on flour w/shrimp paste)-Bun Rieu (Shrimp and crab paste w/noodles)Ahh, so good. And yes, it is a hole in the wall restaurant. It's pretty dirty and the restaurant itself is very small but hey the food has never changed nor has it disappointed me and I've been eating here since I was sixteen! Bottom line...go because the food is yummy! :)", "Date": "2010-03-02", "Author_Location": "San Jose, CA"}, {"Author": "Shannon L.", "ReviewID": "hO95ZvKunXOnfTeOjF0ppQ", "Overall": "4.0", "Content": "Cheap and good if you're not scared of being in the ghetto.   Just kidding... well maybe.1. Banh beo (ground shrimp with pork rind over rice cakes):  One order comes with 5 and costs $3.28.  I find it interesting that some people eat this ONLY as their primary meal and order multiple orders of 5.  It's definitely delicious but there are other good things to order here too.2. Banh ram it (Steamed dumpling filled with shrimp and pork over fried dumpling which resembles Chinese donut):  If you're not on a major gluten craving like I usually am, getting #1 & #2 might be too much for you.  This one is good because there's a crunchy element to it but that part didn't seem too fresh.3. Bun bo hue:  The style is definitely different from the popular Bun Bo Hue An Nam.  From appearance, it doesn't have that much spicy chili oil so it won't look as red/orange but there's still a hint of spiciness to it.  It's jam packed with goodies like pork blood, a little pork knuckle, beef shank slices, and cha lua (Vietnamese ham).  The broth was just so flavorful and a regular is only $6.4. Com am phu (combination rice plate):  Man they really love to use the dried shrimp on everything!  I admit that it might not be to everyone's liking but it definitely is to mine.  If you're tired of eating the typical Vietnamese rice plate with only grilled pork and egg rolls, then you'll be happy to find the familiar grilled pork but also pork meatballs, dried shrimp, and more cha lua.  Also, the fish/chili sauce that comes with this is SO GOOD.  I wanted to do shots with it.  All these dishes cost us $15.46 before tip.  Can you believe that?!  I was stuffed to my brains.", "Date": "2012-03-09", "Author_Location": "Oakland, CA"}, {"Author": "Daniel H.", "ReviewID": "-6EA6rzs_iZ84JvGGZVUHg", "Overall": "4.0", "Content": "This hole-in-the-wall is basically as good as it gets for authentic Central Vietnamese food.  I always make a meal out of just the appetizers: 1 order of Banh Beo (5 saucers for $3.50!) served with fried pork rinds and the lightest nuoc mam (fish sauce); 1 order of Banh Ram It (half fried, half steamed rice dumplings with shrimp) and an order of their Banh Bot Loc (clear shrimp dumplings).  Each dish under 4 bucks and delicious as can be? How can anyone not be sold?  Highly recommended for high quality, cheap Central Vietnamese cuisine, regardless of their kinda crummy location and ambience.", "Date": "2013-03-06", "Author_Location": "San Jose, CA"}, {"Author": "Dorothy L.", "ReviewID": "zK0NbYE_RajtQqKB5LJyPg", "Overall": "5.0", "Content": "Like many Vietnamese restaurants, decor is not a priority here..because it's all about the FOOD!!! Their banh beo is seriously out of this world. Extra chilis and pork rinds please! Two orders (10) is perfect for me. I usually order the banh nam as well, which is also very good. The last time I was here I tried the banh bot loc and was really disappointed. The shrimp and pork  stuffing wasn't well seasoned, so it was pretty bland. Not even fish sauce could mask my disappointment! I'll just stick to what I know.. delicious banh beo. YUM!!", "Date": "2012-02-21", "Author_Location": "San Jose, CA"}, {"Author": "Nha D.", "ReviewID": "j2v2T315BIEEvf14usmyoA", "Overall": "4.0", "Content": "This is my moms favorite since I was 5yrs old. This is my favorite place too if it wasn't so crowded. Which is why this place only has four stars instead of five.The food is always cooked to perfection. The people are nice, though some customers do cause a ruckus when they barely just sat down and complain how they had to wait for food.This place is wonderful if you want excellent Vietnamese food.-SNps the place is very small. Very very small.", "Date": "2009-08-18", "Author_Location": "San Jose, CA"}, {"Author": "Lily L.", "ReviewID": "V_T9ucxZjzBYx8derLfc6Q", "Overall": "3.0", "Content": "Food: low 3 starsAmbiance: low 2 starsFirst time trying this place based on solid Yelp reviews.  The place is small and is grungy looking.  I ordered the Banh Beo and the Bun Bo Hue.  Had no idea what to expect for the Banh Beo.  Turned out to taste a lot better than it looked.  It was warm, soft and flavorful.  The Bun Bo Hue was nice but I don't eat blood so I was a bit shocked to see it in the bowl.  I picked it out.  The noodle had the perfect al dente texture.  Although the soup tasted good, I felt it had more fish sauce, lime and chili to give it flavor instead of simmering meat and bones for hours to develop a rich flavor.  It was good but not as nice as the Bun Bo Hue I've had elsewhere.The restaurant is sort of dirty looking and I am afraid to go look at the kitchen.  Inexpensive.  I think I will try other places.", "Date": "2013-03-13", "Author_Location": "Santa Clara, CA"}, {"Author": "Hang T.", "ReviewID": "5xWECvp_5OIyC5eeNCV_qw", "Overall": "5.0", "Content": "This place is my textbook definition for a hole in the wall with fantastic food!!! It looks all small and dingy from outside, but to me that usually means that the food is probably the most authentic. I've been going here since I can remember. Sunday family lunches consisted of eating at this place at least once every month. I never go here for the bun bo hue even though my family is from Hue. When you go here, you go for their appetizers. My family always orders like 5 or 6 orders of the banh beo because they are so good. The texture and the fish sauce is great. Not too watery or fishy. My favorite is the banh ram it. I love the sticky versus the crispy texture. I would say the food is fairly priced, but since the portions are so small, you better make sure you remember how much you order. =)", "Date": "2009-11-13", "Author_Location": "San Jose, CA"}, {"Author": "Vivian T.", "ReviewID": "dn5VkAJ6Iv_nDO1cM9Q-Jg", "Overall": "4.0", "Content": "I absolutely LOVE their banh beo here! Taste just like momma's! Price is decent too. You get 5 plates for 4 bucks! Def enough to get your banh beo fix on. Bun bo hue is pretty good also. Banh ram it is so freaking yummy.Downside to this place, its really a \"hole in the wall\" and CASH only.", "Date": "2011-08-12", "Author_Location": "Hayward, CA"}, {"Author": "Nancy H.", "ReviewID": "kbOGdst-IMBVKwkeKYOuTw", "Overall": "5.0", "Content": "My goto place for 'Banh Beo'! Been coming here for the last 10+ years to get my banh beo fix.  I used to compete with my siblings and stack up our plates to see who could eat the most.  Their 'Banh Ram It' is also really yummy! If you come here, I def recommend those two dishes.CASH ONLY", "Date": "2011-10-10", "Author_Location": "San Jose, CA"}, {"Author": "Michael N.", "ReviewID": "EM3vjF5qKsa3S-DAlna7wA", "Overall": "4.0", "Content": "Whenever I'm back in the bay, my grandparents always take all the college-grandchildren to this place to devour one of our favorite vietnamese foods: banh beo. The only way I can describe them is as shrimp rice mini-pancakes?!? It's something that once you see you will understand what I mean. I went today with my 2 cousins and my grandparents and we ordered 13 orders of banh beo. Its 5 mini-pancakes for 3.25 so we ordered 65 of these little delights. Definitely add the fried fat and spicy fish sauce on these because otherwise they taste a little too ricey. We also got 2 orders of the Cha Hue (its like a vietnamese sausage) and we devoured those too.An awesome place to grab lunch and probably THE place in San Jose to go for banh beo! Side notes: parking is a little crowded sometimes and they only take cash, so leave your credit cards at home!", "Date": "2010-03-22", "Author_Location": "San Francisco, CA"}, {"Author": "Vanna S.", "ReviewID": "BrzqK4iN9lQhoESuTWRXaA", "Overall": "4.0", "Content": "My foodie BFF have long raved about this place and we finally had the time to try it with her mom accompanying us.  BFF ordered all the meal from the appetizer sections and from what I can gather from the photos are:5 orders of Banh Beo - steamed rice flour cakes, served with nuoc mam (fish sauce) and pork cracklingBanh Bot Loc - frosty-wrapper shrimp dumplingShrimp Rice Rolls - finely mashed cooked shrimp in rice flour cakes cooked steamed in banana leafBanh Ram It - banh bot loc on top of deep fried shrimpCured Beef - plastic wrapped raw meat cured with fish sauce, Thai chili, whole peppercorn and a sliver of fresh garlic.It's my first time having a few of the above items and it tasted delicious.  Some of the Ban Beo was not piping hot, but I think it's understandable because of how thinly it was made and it took time to get to the remaining dishes.  My favorite of all the dishes is the Banh Ram It.It's funny that they name this place wrong since the patrons all go there for the famous Banh Beo, not the Bun Bo Hue.", "Date": "2010-11-11", "Author_Location": "Fremont, CA"}, {"Author": "Diana T.", "ReviewID": "fhCI7O54sX14Gu4a2cf7Sg", "Overall": "4.0", "Content": "My friend took me here a few days ago and for a place whose name is \"Bun Bo Hue\", I was surprised to find out that the dish isn't want they're known for.I ate (and enjoyed it all):- Banh beo- Banh ram it- Banh nam- Chaand another dish I can't remember. We had a large party so we ordered at least 10 orders of the Banh Beo and they were so fast with the service - they just kept coming out! I stopped counting after a while and just ate and ate and ate.The food was delicious! Even now, I'm craving it again and can't wait to go back!Yes, the place is a little dingy. Yes, I don't expect 4-star service, but for this place, it delivered 4-star food!This is a CASH ONLY place, so please be forewarned.", "Date": "2012-09-17", "Author_Location": "Santa Clara, CA"}, {"Author": "Marco O.", "ReviewID": "jNJfoiCB7gSf6zhvhNJ01Q", "Overall": "4.0", "Content": "Food here is crazy authentic!! My nerd showed me this place and at first.. I was'nt too sure because when we sat down, my elbow landed on something sticky. YaaaaH!! I haven't had a sticky elbow since I was 9 years old!! LOL! Thaanks guys, I knew I could count on this place for trip down memory lane. LOL! okaaay so!We had the Shrimp and Pork dumpling aaand that was really good! I ate my plate, and everything on it because it was easy to eat, and the shrimp is actually prounced instead of just being in the title. good stuff!Then I had about 50 of those steamed flour cakes, the one where we pour nuc mum and pry off the saucer.. this dish made me LOOK fat because of all the saucers stacked in front of me and there was a cute girl there:(tip: bring cash! cash only! and a friend who knows what they're doing.. LOL! not for the \"adventurous\" type.. you might just order something you dislike so good luck!", "Date": "2012-06-20", "Author_Location": "San Jose, CA"}, {"Author": "Sam K.", "ReviewID": "72jIF2eQ5mjNS9OIPFPk_w", "Overall": "4.0", "Content": "I've been coming here atleast once a month for almost a year now and I always get the same thing ... no it's not the bun bo hue. (bun bo hue is too blan here, not  spicy enough .. but they do hook you up w/ a huge pork bone)I usually come here when I want the banh beo or just feel like eating lightly.I always get #1, 2,3 and 5 and if I remember correctly, #16  the  ....something ......Tom chua.  it's has vermicelli noodles, veggies, mints that you put into a bowl and then there is a papaya, carrot, shrimp, peppers and pork type of salad that you place on top of the noodles and mix so the flavors coat the noodles.  Very light and great for hot weather.", "Date": "2009-09-25", "Author_Location": "San Jose, CA"}, {"Author": "julie n.", "ReviewID": "uh-PYFHG3PhSbaVxuKU3QA", "Overall": "4.0", "Content": "It's a small hole in the wall with so-so service but excellent food!!!!Banh Beo 5 for $3.95Banh bot Loc 5 for $3.95Banh nam 2 for $2.95Bun Bo hue $6.50Bun rieu $6.50Banh beo and banh nam was great!!!!! Nuoc mam was a little on the plain side today. This place has the best bun rieu that I've had bedsides from being home made.Only really downside is cash only.", "Date": "2010-12-23", "Author_Location": "Sunnyvale, CA"}, {"Author": "Rick T.", "ReviewID": "GivUxTm5FSOvYcmwPwmXvw", "Overall": "4.0", "Content": "Hole-in-the-wall?  Yes.  One of the best Vietnamese food in San Jose?  Absolutely, yes.  Funny enough, even though the place is called \"bun bo hue\", that is not its best dish.  Here are the highlights:1)  The best \"banh beo\" (soft rice cakes topped with shredded shrimp and eaten with nuoc mam sauce) in San Jose.2)  Very good \"banh ram it\" (rice ball filled with a shrimp, topped with shredded shrimp, and served on a crispy rice cake).3)  Very good \"my quang\" (noodles with pork, shrimp, vegetables mixed with a mild fish sauce).  Add the chili oil condiment on the table and this dish will be perfect.4)  The best \"cafe sua nong\" (French-dripped coffee) in town.  Trust me on this one because I try coffee everywhere I go, and this is great coffee.  It's potent, the grounds are fresh, and just the right amount of sweetened condensed milk is added.  There is also a pot of hot water on the side for you to dilute it to taste.The place is small and the tables are cramped, but these inconveniences are easily overlooked in favor of the great food.", "Date": "2009-02-12", "Author_Location": "Los Altos, CA"}, {"Author": "Lan N.", "ReviewID": "QjkO_cP7PzgDdpesE11OZA", "Overall": "4.0", "Content": "The Hue dishes are excellent here.  I come here basically for these.  Banh Beo is awesome, but the other Hue dishes are very good as well.  Try and bunch and make your own sampler of Hue dishes.  Many years ago they used to have \"fish and chips\" stil painted in their window and never bothered to rub it off.  It is finally gone now, but because of that we always call it the fish and chips place.Anytime I need a banh beo fix, this place is the first to come to mind.Remember to bring cash!", "Date": "2009-02-03", "Author_Location": "San Jose, CA"}, {"Author": "Calily B.", "ReviewID": "5eg2c5ijj2dHJppdnHFwpg", "Overall": "5.0", "Content": "This place has been opened as long as I have been alive. This place has always been the best place for banh beo and banh bot loc, back in the 80s and even now. Even though my family moved to TX in 1994, I still dream about the little small plates and fragrant smells!  When we visit SJ, we make it a point to get our butts to this joint. The fish sauce to top the steamed dishes is perfectly seasoned. The banh bot loc is chewy and unctuous. It's a small place but it's perfect in every way. I miss it in my life.", "Date": "2012-02-15", "Author_Location": "Austin, TX"}, {"Author": "judy n.", "ReviewID": "Lwbl8q6aIsh4G8MIaK_aGw", "Overall": "4.0", "Content": "Mm. Brunch with the family before my niece heads back to Boston College. this is a super small hole-in-the-wall-cash-only type of place. but it's real authentic viet food... and great cuz it reminds me of saturdays growing up. Banh beo - uber fave! each serving comes w/ 5 small plates. I think I can eat like 10-12 plates. not much more. Banh bot loc - great! clear rice flour dumpling w/ shrimp and pork inside. Ban ram - it's the rice flour, half is deep friend stuck to the other half which was steamed. so you get this texture filled bit of food, sticky, savory, and crunchy, and there is pork and shrimp inside. yum. Cha hue - it' sthis small cylinder of cha, viet ham pretty much, with big bits of black pepper. Soda chanh Banh nam- this one is just ok. it's rice flour within a banana leaf... I'd order the others long before ordering this one.", "Date": "2012-01-28", "Author_Location": "Sunnyvale, CA"}, {"Author": "Kara M.", "ReviewID": "YVQIZl7sErFbcSyk7m9Z9g", "Overall": "4.0", "Content": "Really delicious Banh Beo and Banh Bot Loc that we took home to watch the Sunday Niners game. The Banh Bot Loc is my favorite, I love everything about it. The place looks a bit run down, eh. And the kitchen looks...... even worst. I guess the good food and amazing prices make up for it.", "Date": "2013-10-22", "Author_Location": "San Jose, CA"}, {"Author": "shel n.", "ReviewID": "QgbdU7X2XD3jJIIG5p0vZQ", "Overall": "1.0", "Content": "Both the mi quang and bun rieu tasted like crap here; both lacking in flavor.My mom can't cook for sh*t but her bun rieu tastes better than this place..", "Date": "2012-06-05", "Author_Location": "San Jose, CA"}, {"Author": "Star'leigh A.", "ReviewID": "0AXVB8f7f0XYqlPuHzXCrA", "Overall": "3.0", "Content": "I'm not even going to try to name the dishes and sides that we ordered because I'll totally butcher them! A couple of my coworkers and I went to lunch here the other day (one of which is Vietnamese -  her brother told her to check this place out). The food here is SO different from the Vietnamese food that I know. The soup (Bun Bo Hue) that I ordered tasted nothing like the pho I'm used to eating.For one, the broth reminds me of soups they would serve @ Thai restaurants. Lemon grass based, etc... The noddles were very similar to Udon noodles, so it was a little tough to eat with the chop sticks.  I'm so used to being able to twirl it around in my spoon and stick a wad in my mouth.Overall, I had a good experience eating at this place. The restaurant itself is pretty small, and it's not the most \"booshi\" of places. It was definitely a learning experience. Now I know a little more about the different styles of cooking from the various regions of Vietnam.", "Date": "2009-07-16", "Author_Location": "Anchorage, AK"}, {"Author": "Diana C.", "ReviewID": "oejblNEj1F-8C7PJHYQGPA", "Overall": "4.0", "Content": "While I was in San Jose, I knew I had to find me some good Vietnamese food to cure my hungry tummy before I trekked home to Sacramento. Thank you Yelpers for helping me find this place that serves up banh beo. It was delicious! I don't know my Vietnamese cuisine very well, so I ordered #11 bun rieu (shrimp and crab paste with noodles), which was something my friend used to make a lot in college. The broth tasted really good yet familiar. At first I didn't know what it was, but it turns out that it tasted like a hot and sour Tom Yum Soup. I had no idea I was going to get fixings other than the shrimp and paste in the broth, but it included pieces of pork and pork blood. I'm not a fan of that, so I put them aside, but everything else was absolutely delicious.This is a no-nonsense sort of place. When I got there at 5:30pm, several tables of people were getting down eating and not talking. They serve up food quickly here too, which is good if you plan to just get in to fill your tummy with good food and get out. Don't expect any ambiance. Bun Bo Hue's strictly business.", "Date": "2010-05-30", "Author_Location": "Sacramento, CA"}, {"Author": "Chau L.", "ReviewID": "2c6XHgVzSwvq4dBDlAWCoA", "Overall": "4.0", "Content": "This is my people's food!  Delicious Banh Beo (small steamed rice cakes topped with shrimp bits and eaten with sweet fish sauce)!!!  I could eat like 30 of them in one sitting.  Other dishes that are good are banh canh and bun bo hue.  They also have other snacks (Cha - or fermented pork paste) that are so yummy to eat by itself or with bread.After breakfast/lunch, you could walk around and get a cup of coffee, watch some football games, or go to the market.  All in the same square!", "Date": "2012-12-04", "Author_Location": "Milpitas, CA"}, {"Author": "Linh N.", "ReviewID": "frA1LeHqSDlUJ0pv4TjJDA", "Overall": "3.0", "Content": "3.5 StarsThe first time I tried banh beo was at this location. I also tried the banh bot loc and it was good. I also had bun tom chua once and it was ok. I took two friends here on two different occasions and both complained about the odor in the bathroom. One of my friend complained that it smelled like dead rats in there. The other friend complained that it smelled like  some sort of moldy food or some sort of weird smell that she couldn't explained. My friends could no longer enjoy their meal after using the bathroom. One of my friend refused to eat here again. Luckily, I never had to use the bathroom here.The restaurant isn't in the best plaza because parking is horrible. All of the spaces are made for compact cars. It's not a very clean looking plaza either. Overall, this joint has good authentic Vietnamese food but try not use the bathroom unless you have to.", "Date": "2009-11-17", "Author_Location": "Milpitas, CA"}, {"Author": "Steven H.", "ReviewID": "2yhA4fXyf9QFsTiv6W5rWQ", "Overall": "5.0", "Content": "I can't believe I forgot about this place.  I used to go here a lot back in the day but probably haven't been by for atleast 7+ years.  I'm glad I made another visit though.  The place isn't the cleanest but the food is definitely excellent.  Although it's named Bun Bo Hue, they're actually very famous for their Banh Beo as well.  The Banh Beo are actually served individually in small plates which is something you don't see anywhere else.  This time I decided to try the Mi Quang since it's hard to find this dish at other places.  It was pretty darn good.The prices have stayed pretty decent, butI guess I try to avoid this area because it is kind of ghetto and get's pretty crowded on the weekend.  Now that I remember what good food they have, I'll surely be back when I have those cravings for their special dishes.", "Date": "2009-10-10", "Author_Location": "San Jose, CA"}, {"Author": "Lily G.", "ReviewID": "hP_lKOs8chtreCEzCFzWIg", "Overall": "4.0", "Content": "My friend's family brought me and my bf here. It was really good, the quintessential hol-in-the-wall with excellent food and service. The banh beo were great, the fish sauce is yummy, and the banh ram and banh bot loc was really good too. I tried mi quang for the first time and really liked it. The sauce was very flavorful and lots of fresh herbs, the meat and shrimps weren't huge or spectacular, but the dish as a whole was super tasty. Also, I have since been to Hue's on silver creek to try their mi quang and it was SOOO horrible in comparison. It was super crowded so we thought it must be okay, WRONG.  My bf and I left there after eating sticky, blah banh beo and blegh fish sauce, bland mi quang, angry that we didn't just go back to Bun Bo Hue #1.", "Date": "2012-02-01", "Author_Location": "Bay Area"}, {"Author": "Pete N.", "ReviewID": "QE91moI0ntWdwzF3DWtzwg", "Overall": "4.0", "Content": "I made a return trip to impress the parents on the regional Hue food of Vietnam. I had been here before, hoping nothing had changed. We entered and I figured since my parents were a little older than me, I would get better service. As usual, I got the mediocre Vietnamese service. Ignored to start and an eventual appearance by the waiter to only to ask for my order, nothing else. How about a robotic greeting of,  \"How are you doing?\" Not, \"You ready to order?\" But I'm used to this type of service at Vietnamese restaurants. You get accustomed to this and you become mute to the responses.We ordered the Banh Beo (Shrimp paste cakes), Banh Ram (Fried on flour w/shrimp paste), and three bowls of the Bun Bo Hue. Food came rapidly. We were highly disappointed with the Banh Beo. The shrimp was too ground up and there was nothing special about this dish. The flour was too thin but hey you get five of them, lucky me. The Banh Ram was not impressive too. It seemed pre-cooked because it was rather cold and chewy. Not the usual hot and crunchy feeling. The highlight was the Bun Bo Hue. The name of the restaurant says it all. The broth was rich and not watery. The pork and beef were succulent and filling. The noodles were soft and not over cooked. The congealed pork blood was large and flavorful. Even though the service here is pathetic, the Bun Bo Hue here is excellent. Stick with the Bun Bo Hue and Mi Quang. Ignore the service and give the usual Vietnamese tip, $1 or $2 for everything.", "Date": "2010-03-14", "Author_Location": "San Jose, CA"}, {"Author": "Jen H.", "ReviewID": "WtbsxkvDroAP8KH3skCqFg", "Overall": "3.0", "Content": "eh, more like 2.5 stars. Definitely, I will not be back!I been here twice already (didn't like it the first time!), and i only came here AGAIN b/c i was craving banh beo ( not the ones you get at VN fast food stores, but the good ones!), and I yelped Ban beo, and this place was supposedly known for ban beo that was close by to my cousin. What I have ordered at this place:1) Ban beo: 3/5--it came out cold!!2) Bun Bo Hue: 3/5--if you're going to name your store after a dish, you should better master this dish!3) Mi Quang: 2/5--blah, I have had better!4) Some hue appetizer wrapped in banana leaf: 3.5/5--it was fairly good, esp since it came out steaming hot!Wow, very disappointed with this place! How can ppl yelp it this high?!", "Date": "2010-09-28", "Author_Location": "San Jose, CA"}, {"Author": "Catherine L.", "ReviewID": "2M2xT9SPdP-Kb_pQdIPBnA", "Overall": "3.0", "Content": "If I hadn't read all the wonderful reviews for this place I would probably would have enjoyed the Bun Bo Hue more. This place is in a plaza far (enough) from the freeway.. well, it felt far.We ordered the Banh Beo and the pork sausage. We both really liked the appetizers. I actually liked the Banh Beo more than the Bun Bo Hue and the pork sausage. We weren't sure how to eat the Banh Beo so the man who brought our food out showed us. He was really nice :). The pork sausage was pretty good but I felt like it was a little bland. I really liked the pork knuckle that came in the Bun Bo Hue. It had a great skin texture but I thought the soup was kind of bland. I added some fish sauce which made the broth yummier. I thought the pork blood was too big. I'm used to smaller pieces in Chinese food so I didn't enjoy the pork blood as much as I would have liked. The thicker the piece the less consistent the soft texture.. not sure why.The noodles were a great texture. They kept their shape and didn't break down in the broth.. maybe because my broth wasn't very hot. The table next to me got piping hot bowls of broth while mine was barely luke warm. Wahhh! I love my soup thats HOT HOT HOT!", "Date": "2011-03-23", "Author_Location": "Palo Alto, CA"}, {"Author": "Lyn C.", "ReviewID": "sufyWPbRvRlqcqn9mjXhJQ", "Overall": "4.0", "Content": "Why is this place called bun bo hue #1?  It should be called banh beo #1!  I hear the bbh is not that great (havne't tried it myself) but the banh beo is yummy!Authentic Vietnamese food and not for the unadventurous type.  The atmosphere is very similar to the laundry mat next door but don't let that stop you from eating here!Banh ram it- favorite!!  crispy flour (like a chinese donut) topped with doughy goodness and shrimp Bahn beo-  flour noodle with dried shrimp + fish sauce w/peppers and chicharon Banh bot loc- shrimp dumpling.  didn't like this so much bc it was too chewyCha hue- pork roll to eat with the banh beoCA$H ONLY!", "Date": "2011-10-22", "Author_Location": "Los Angeles, CA"}, {"Author": "Elizabeth N.", "ReviewID": "VfSg8uqbSmyBVioKeSwMVw", "Overall": "4.0", "Content": "Few places do Mi Quang right.Here, the noodles are nice and not soggy and they do the broth right (shallow and not to the top of the bowl).They have decent bun and thit nuong (grilled plate). I can't vouch for their bun bo hue, but they make a decent Mi Quang.", "Date": "2012-05-28", "Author_Location": "San Jose, CA"}, {"Author": "Phuong H.", "ReviewID": "a2D8SWC18MWa-Q6Wv3WS2A", "Overall": "3.0", "Content": "Banh beo was alright - we got 4 orders and the pork rinds came out separately in a small bowl, the shrimp topping was ok.  Bun bo hue was decent...the broth was not very flavorful and the noodles were broken.  It was worth a try since everything is pretty cheap.I'm giving them a 3 star because my bf likes this place, it's his favorite hole in the wall Vietnamese restaurant apparently.", "Date": "2009-10-25", "Author_Location": "Sunnyvale, CA"}, {"Author": "Jeanne C.", "ReviewID": "0iZR9Och65W2-G3hLlzIqA", "Overall": "3.0", "Content": "I would give the banh beo 4 stars but the rest of our food was meh.  I ate two orders of banh beo.  It was not worth the drive to San Jose from SF.I wish I could write a more accurate review but I don't know what the dishes are called.  I tried the seafood noodle soup and some one the little appetizers wrapped in banana leaf.  It was cured pork with peppercorns and garlic.  It was kinda gross actually.  The other dish was pig cartilage and skin.  Don't dismiss my opinion because I don't know what it's called in Vietnamese.  I love me some pig ear!", "Date": "2010-09-01", "Author_Location": "San Francisco, CA"}, {"Author": "Q L.", "ReviewID": "fj22ttHSsP7HgIO3RpVI7A", "Overall": "2.0", "Content": "I really wanted to like this place.  I drove 30 minutes for the Bun Bo Hue expecting something spectacular.  This is what I got instead:- broth was barely warm-noodles were crinkly..like they had been sitting there a for a while and they were cold.-broth was lacking color and flavor.paid and left.  The search continues.", "Date": "2012-05-02", "Author_Location": "Richmond, VA"}, {"Author": "David N.", "ReviewID": "dwPc7UDdoLSIkEmrtivlAQ", "Overall": "3.0", "Content": "I've been going to this place for years - ever since I was a little kid. For a place thats been around as long as this place has, you'd think they'd might want to update it a bit. There's a mirror to the left as you enter and it makes it look bigger than it is, but the place is small - my mom affectionately calls it a mouse hole. Real estate is so tight that this place is always occupied at maximum capacity. I've never eaten here for anything but lunch and always order banh beo. The dishes stack up fairly quickly given the tiny tables. Order the Soda Limeade - its very sugary, feels like candy in your mouth without being powerfully sweet. This place doesn't do anything to stand out except for the fact that you don't come here for the bun bo hue.I cannot really say much about this place, nor can I bash on it. Its a Sunday Lunch kind of a place - you go there with family or friends to recap the weekend. You don't really care whats in front of you, so long as you have a reason to get out of the house and meet up with people.", "Date": "2008-03-24", "Author_Location": "San Jose, CA"}, {"Author": "Karen A.", "ReviewID": "9TIM2bb_gDeCtZmci8mtcQ", "Overall": "3.0", "Content": "Noodles are really fresh and cooked perfectly. Bun Bo Hue was loaded with beef, pig blood, vietnamese sausage, a bit spicy, thought it was ok but not too excited about it. Banh Beo was just ok, can't compare with homemade. Banh Bot Loc good.Salty lemonade soda was not lemony enough.Everything was just ok, was not very satisfied with it so we went to the bakery next door to get some more food.", "Date": "2011-02-10", "Author_Location": "San Jose, CA"}, {"Author": "Joanne C.", "ReviewID": "0zKEULLvYFGdJVwjB0RAfQ", "Overall": "5.0", "Content": "BANH BEO!!!!!! And Cha Hue!!! All I order here and I loooooooooooooooooveeee it!I know I can always depend on this place when I  need my Banh Beo fix. This place is definitely a hole in the wall, but the food here beats Hue (in the paloma plaza next to target) which is definitely cleaner, but the food is no where near this place. (I'm only speaking for the banh beo and cha hue)... Their banh canh cua and mi quang deserves ZERO stars.. It looks and tastes like shit.. and their banh canh cua (crab noodle soup) gave my sister food poisoning!", "Date": "2011-06-27", "Author_Location": "San Jose, CA"}, {"Author": "Uyen L.", "ReviewID": "ultTVD4zRf3HWgQ0EpUpSQ", "Overall": "5.0", "Content": "I just ate here 2hrs ago and it still tastes as good as the last 30 times, if not better. Always have to get the banh beo, cha tom, banh nam, and banh ram it. They're all under appetizers and costs around ~$3 for each item. I LOVE their nuoc mam (fish sauce)! Tried the mi quang for the first time and surprisingly its good!", "Date": "2010-10-13", "Author_Location": "San Jose, CA"}, {"Author": "Brian F.", "ReviewID": "nOOyA6ydY_Vnb6Zy6DGxvw", "Overall": "4.0", "Content": "I had the Bun Bo Hue and Banh Beo. The place itself is very hole in the wall style, which means dirty, but lets get on to the food.If it were only the Bun Bo Hue, this place would get 3 stars, but the Banh Beo is really good so I gave them 1 extra star.  The fish sauce they use for the Banh Beo is perfect, not too salty, which is how most place make it.The Bun Bo Hue was just ok, normal price and portion.  The broth was a little on the bland side and the noodles were your average noodles.  I don't think I'd come back here for the Bun Bo Hue, but the Banh Beo alone might entice me.I was here with two friends today and we noticed this one younger vietnamese girl that had tattoos all over her body, we were kidding around and called her the Bun Bo Hue Gansta, lol.  My friends had joked that she might back her car into mine while trying to leave and that if she did, she would have to pay me in Bun Bo Hue as it seemed like she was a regular there.", "Date": "2009-08-17", "Author_Location": "San Jose, CA"}, {"Author": "Lyna K.", "ReviewID": "aJtMLXFvwkz51io6pVfMGg", "Overall": "5.0", "Content": "One of my favorite Vietnamese food places by far. My mom brought me here when I was in high school, and thats when I learned about the \"small plates\" as we call it.  A lot of vietnamese sandwhich shops carry pre-made banh beo things, but they do not do it justice. I also love the chewy banh bot loc, especially with the fatty pork and small crunchy shrimp inside.      I think i'll go there for lunch and try the banh ram, today. mmmm spicy nuoc mam sauce and pork cracklings. so good.", "Date": "2009-03-01", "Author_Location": "San Jose, CA"}, {"Author": "Phung D.", "ReviewID": "H4K9DACDNOsd_rAHhAKwNQ", "Overall": "3.0", "Content": "You'd think they specialize in \"BUN BO HUE\" since that's what their restaurant called right? Well, in this case...they don't. Instead, they're known for \"BANH BEO\" (steamed rice cake) which many people come here for.Food:- Bun Bo Hue: what they lack of is the soup base. It wasn't spicy and flavorful enough.- Banh Beo ($2.95 for 5 small dishes): I thought it was alright, not the best one I've ever had or anything. The rice cake was perfectly steamed but other than that, it's nothing special. Surprisingly a lot of people like it but that's probably because there's no where that makes it as good? I preferred the one in Socal better.- Cha Hue ($1.50): typical cha, not much flavor to it- Banh Nam (steamed flat rice cake): they steamed the rice cake way too long, so it was really plain soft. I had better.- Soy Bean ($2): I like it because it's fresh made at the restaurant.Service:Maybe cause the guy knew I was gonna yelp this so he was nice? But they were pretty okie, not so rude like many Asian restaurants out there. No complaints here.", "Date": "2010-04-08", "Author_Location": "Rosemead, CA"}, {"Author": "Sally Z.", "ReviewID": "AC8ce-12Zh3P3FaWfC_g4w", "Overall": "4.0", "Content": "This place was sooo interesting. It's 3.5 stars for me, because I don't really have anything else to measure this experience up against. I've never had Banh Beo before and this is the first time I ate Bun Bo Hue at a restaurant (and I didn't like it the first time I ever tried it.)The Ban Beo was hecka funny to eat. One order's like $3.50 and you get five plates the size of your palm of this white gelatinish-looking food with shredded shrimp on top. Add a little fish sauce, some pork grinds and BAM! That's your appetizer. Apparently, folks can eat like two to three orders of this stuff. I thought it was intriguing, but it wasn't mind blowing. I was actually surprised by their noodles though. I'm a bun bo hue convert now! They have a pretty tasty broth here for their noodles. I didn't get the Bun Bo Hue, but the #11, which is kinda the same thing but instead of pig knuckle I got shrimp paste balls. It was hecka good. I was surprised. I didn't eat the pork blood though. I'm not a fan of its texture. This place has the charm of being a hole in the wall with really nice staff. It's a Hue restaurant, but they speak the more mainstream Vietnamese dialect, as well. The restaurant is TINY and it's pretty uncomfortable if you're at one of the single tables. But the staff let us move to the bigger tables after the other big group took off. They also helped us split the bill to us individually! Pay in cash, friends. Last note, parking is a squeeze here.", "Date": "2010-09-07", "Author_Location": "El Monte, CA"}, {"Author": "Jimmy D.", "ReviewID": "3V0x3ZqIo2f3ApdymmCvyg", "Overall": "4.0", "Content": "A friend took me here specifically for their Banh Beo and it surely lived up to the hype. The Banh Beo came out in individual plates and the plates were all huge!  I was expecting some tiny little banh beo, but these things were a good size.  One order came with 5 and it was just enough to get my fix of them.The Banh It Ram was amazing as well.  The dough had the right balance of sweetness and stickiness, the pork's tenderness complemented the sweetness of the dough very well and the crispy rice cracker just completely changed the texture.  Chewy, sweet, salty, crispy, winner.My only complaint is the beer.  I got a Heineken and it came out warm.  They did give me a cup of ice to go with it.. but come on now.  Minus 1 star.", "Date": "2011-08-01", "Author_Location": "San Diego, CA"}, {"Author": "Norman P.", "ReviewID": "s8tP2c5Z3NxsEKxdpvj6QQ", "Overall": "5.0", "Content": "I am going to come back over and over again for the Bahn Ram It.It is a fried dumpling with rice cake dumpling on top.Of course, the Bahn Beo were excellent.Bahn Bot Loc were not soft enough for my liking. Seemed like they werent 100% fresh, otherwise I would think they'd be softer.Bahn Nam were very good. Ate Mi Quang as well. Its good, but is blown away by the Bahn Ram It.Its a hole in the wall, parking is tight, food is more than worth it !", "Date": "2010-07-18", "Author_Location": "San Jose, CA"}, {"Author": "Tiffany L.", "ReviewID": "fMw7akv5vjoCB5_2ZJ-gfQ", "Overall": "4.0", "Content": "My parents took me here the other day and I was a little skeptic because the only place that I go to for my bun bo hue is Bun Bo Hue an Nam.   Although i didn't get the bun bo hue here, my mom got it and she said it wasn't good because the soup wasn't hot enough and it was barely lukewarm.  Instead, i got the Bun Rieu and it was DELICIOUS!!!  I have included a picture of it.  I think the people really come here for the little plates of banh beo.   yummmmmmm, between my mom, dad, and i, we ordered 15 plates and we killlllled it.  They're pretty cheap at 2.95 for 5.  This place is pretty small, less than 20 small tables so I'm pretty sure on weekends and during lunch it gets packed.", "Date": "2008-04-13", "Author_Location": "San Jose, CA"}, {"Author": "John T.", "ReviewID": "MoeZKOMc4yCtdqpZY2VXNQ", "Overall": "1.0", "Content": "Not sure how people could give this place more than a two star rating. First, the waiter screwed up our order even after we made him repeat our order. Secondly when the food came out the waiter had his thump in my soup which was totally disgusting. He even told me to be careful because the soup was hot LOL! Anyway the food was terrible and the bun Bo didn't even taste like what it should be.. Never again this place", "Date": "2013-11-29", "Author_Location": "Fountain Valley, CA"}, {"Author": "Danny V.", "ReviewID": "1YKaXShCjtEyQGxiSZ4ipA", "Overall": "4.0", "Content": "The only time I go here is when I'm full, cause the only thing I eat here is Banh Beo, 5 tiny dish of steamed flour and some pork grinds, (not crackling) and fish sauce with some dried shrimps for 2.95 sounds is not too shady. Not much to the dish but the labor involved is worth 3 bucks. The service is pretty good but don't expect white table cloth service. It's a hole in the wall kinda restaurant with few tables and looks very worn down.", "Date": "2007-10-05", "Author_Location": "San Jose, CA"}, {"Author": "Anette N.", "ReviewID": "aqKidweTaTRYRR68KoRI-g", "Overall": "3.0", "Content": "I would go back for their banh beo. But that's all I'm going to order from them. This place is definitely a hole-in-the-wall. There's plenty of parking around and you can get desert or other Vietnamese treats in that plaza, which is a plus for me!", "Date": "2011-04-21", "Author_Location": "San Francisco, CA"}, {"Author": "Herbert K.", "ReviewID": "EXqARUjcu_-ZPrcWblu7ZQ", "Overall": "3.0", "Content": "Restaurant will down for a while.A car drove into the place this morning - so I don't think they will be able to serve anyone for a few days.", "Date": "2012-01-06", "Author_Location": "Union City, CA"}, {"Author": "Thy Minh V.", "ReviewID": "x19h2tEYuzfs0CqN08bzFQ", "Overall": "5.0", "Content": "Really small place. We were on vacation and my gf insisted we come back to this place again before we left San Francisco. We ate here twice. Love the Bot Loc and Banh Beo.We ate only those two dishes. Soooooo much better than the one in Chicago", "Date": "2012-10-12", "Author_Location": "Des Plaines, IL"}, {"Author": "Jes D.", "ReviewID": "8GPtvMAaW9stVQb7iqBv_w", "Overall": "4.0", "Content": "If you want the best Banh Beo in San Jose, go here.This place is what I refer to, as a hole in the wall, but the food is soooo good.  Although the name of the restaurant is Bun Bo Hue, do not order the Bun Bo Hue here.  People come here for the Banh Beo, Banh Bot Loc, Cha Hue, etc (everything on the appetizers menu).   I usually get Banh Beo & Cha Hue when I go here.  One time, I decided to be adventurous and tried the Bun Mam Tom and it was pretty good.  I think Mam Tom is an acquired taste, so try it at your own risk!!!The food is cheap!!!  But do not expect any customer service at all.  If the banh beo wasn't so good, I wouldn't have returned after the first time.  Also, if you order multiple orders of Banh Beo, most of the time, they short count your order, so make sure you get what you ordered.Happy eating!!", "Date": "2010-05-29", "Author_Location": "San Francisco, CA"}, {"Author": "Thuy V.", "ReviewID": "b7mEOUejYkVWpf1GrazI6A", "Overall": "3.0", "Content": "Don't take your first date here is all I'm saying. Do come here however, if you like to see yourself from all angles. There are 2 opposing walls of mirrors. I crave banh beo every so often, but the thought of the restaurant halts that urge stat! I get the lack of decor thing but last time I was there, it smelled like...unpleasantries...That's a nasty no-no. I can only rate their banh beo which is the best I've had compared to any other place- down to the fish sauce and pork rind bits. 4.5 stars for banh beo here.  5 banh beo for 3.28.", "Date": "2012-02-25", "Author_Location": "San Jose, CA"}, {"Author": "Katheryn H.", "ReviewID": "4HD_A5qzzHJJ2kO4Ns0yMA", "Overall": "5.0", "Content": "Best banh beo in town. Hands down. I always try to look for other places that sells banh beo, but it's always a let down, so I always come back to this spot.I usually get 2-3 orders with extra thet mo (pork rinds). They come out warm and fresh. They got the fish sauce down to a tee. I also love their banh nam (flat shrimp cake in banana leaf) and their cha Hue. Relatively cheap and good.", "Date": "2010-07-07", "Author_Location": "Los Angeles, CA"}, {"Author": "Jason A.", "ReviewID": "LzkTrapZrzsl67e31JpUfg", "Overall": "5.0", "Content": "Love it, and this is the only review where I've looked at the Yelp Business Photos and had my mouth water...it's like they're RIGHT THERE.I didn't really know what to expect when a friend suggested this place. Whenever we get together in San Jose we're either out for the Pho or Bun Bo Hue that they miss from being out of town for so long. This place was different. $5 a head was more than enough to fill our party up on the 5 Banh Beo dishes and Banh Ram (a new personal fave). One thing I should've been warned about though was the stickiness of the rice flour---so a heads-up: That banh ram will glue your pie hole shut if you try to eat it whole or don't have a big enough mouth. Believe you me, I've tried, and could not even begin to tell you how much air I lost trying to swallow the damn thang O_O.Regardless: will definitely try again!", "Date": "2008-08-13", "Author_Location": "San Jose, CA"}, {"Author": "Tran M.", "ReviewID": "mJ6NAe51LsJkkTN_YjuMdg", "Overall": "4.0", "Content": "They have the best \"banh beo\" in San Jose. I LOVE their fish sauce. It taste just right and not too salty like other places that I've been to. Their \"Bun Bo Hue\" are okay compared to my mom's cooking, but would rank \"good\"compared to other restaurants in town. I tried the Mi Quang twice. The first time was really good that I had to order a to-go one and saved it for the next day. I came back after  2 weeks and this time it wasn't as good. I don't know why. Maybe it's just me. The prices are reasonable. The waiter is nice but the place seems rusty old. They definitely need to remodel.", "Date": "2009-07-15", "Author_Location": "San Jose, CA"}, {"Author": "Brian T.", "ReviewID": "ryg2uLlaX9wmjFOndKohBQ", "Overall": "4.0", "Content": "We went here specifically for the Banh Beo. This was my first time here and I've heard amazing reviews about their banh beo.  So we tried it. AMAZING! It came out really fast and warm and fresh! It was heaven in my mouth (especially for those banh beo enthusiasts!)We also ordered a rice plate and i highly DONT recommend it. ONLY ORDER THE BANH BEO.This place is known for that, and that only! Def a must try!", "Date": "2012-03-21", "Author_Location": "Santa Clara, CA"}, {"Author": "Laurie W.", "ReviewID": "owDwT-imI4T4Yy4-H59fZg", "Overall": "5.0", "Content": "why have i never visited this place when i lived in SJ?!?!?!located in the plaza, where english is no longer the #1 language, you see this place.  Tiny that barely fit 30 people...this place is a hidden gem!I know the name said Bun Bo Hue but i came here and tried banh beo and banh bot loc and im sold over the bun bo hue!  Banh beo is small little rice cakes with ground dry shrimp with fish sauce and its so simple yet so satisfying! 5 for 3.50 and after 7 dishes, you're pretty full.  To give it a crunch, they give pork rinds and it oddly makes a differences.  I like to add a little bit of their hot sauce =)Banh bot loc...YUM! clear skin dumplings with almost dry shrimp and chasu?...yum yum yum...the texture of the meat is dry, kinda almost like jerky and add a little fish sauce....yum yum yum you can just eat off of appetizers but i got it bun bo hue to try...hello! the name!  its odd to me but this place's isnt red or spicy...it comes with the pig's blood and all the meat, the noodle but its not red or spicy...apparently you addd that yourself with their own homemade hot sauce (i think its homemade)...its not bad since you can make it as spicy as you wan to.  Their hot sauce - it has a been of a sweetness to it, odd...but i like it! i really like their hot sauce.  The bun bo hue...eh i can do without it, but their banh beo and banh bot loc...i dont wanna live without it!Cash only and one last thing - dont expect anything fancy or tell them you want anything a certain way...they'll give you a look and walk away. good luck", "Date": "2013-02-10", "Author_Location": "New York, NY"}, {"Author": "Tho V.", "ReviewID": "VRkPkBUiUQ7m7vRAEjJUbQ", "Overall": "4.0", "Content": "Pros: the best \"bun bo Hue\" noodle soup; pretty good \"banh beo\"Cons: very small place; very small and crowded parking lot; not the best service; place smells (which seriously curbs my appetite sometimes)Like I said, they have the best \"bun bo Hue\" noodle soup I've ever tasted and I thoroughly enjoy their \"banh beo\" (not sure how to translate this). That said, I usually do take-out for the noodle soup and very infrequently eat \"banh beo\" here. I should one of these days come back for it though.", "Date": "2008-12-10", "Author_Location": "San Jose, CA"}, {"Author": "Kimberly T.", "ReviewID": "qAoyR95AWnl_ZSuZRfLMYg", "Overall": "4.0", "Content": "Banh beo and banh bot loc is bomb !", "Date": "2013-05-17", "Author_Location": "Tucson, AZ"}, {"Author": "Bernard F.", "ReviewID": "7nGjPKWyZO7dWDj5QkQZgQ", "Overall": "3.0", "Content": "Didn't care much for the decor.  The table seemed small for 4 people and it kind of smelled like they didn't close the door to the bathroom.After I got past all of that the grilled pork and vermicelli was decent.  I especially liked the fish sauce.", "Date": "2012-03-05", "Author_Location": "San Jose, CA"}, {"Author": "Cindi N.", "ReviewID": "5n1hQqycj2ot2RlzERWLsQ", "Overall": "4.0", "Content": "wow. this place has lots of stars. only 3.5 stars from me for the BANH BEO. one order consists of 5 small bowls, nuoc mam (prepared fish sauce), and Vietnamese bacon. this is the only place i know in SJ that serves good banh beo. i had bun bo hue here. it smells reaaaaaaally good, but doesn't taste as good. the taste doesn't even come close to bun bo hue. mi quang (with yellow egg noodles) is a noodle dish from another region of Vietnam. is alright. i know of a better place that serves mi quang. bun mam is superb here. this dish is best eaten when it's cold or raining outside. it's exactly what i thought it would be. white vermicelli noodles eaten with veggies and boiled pork belly and sour shrimp/fish sauce. so there are only 2 things i would order at this restaurant. the place is small, either come before lunch or after lunch to sit freely. i like how they instantly bring you water or hot tea without asking. the service is here is great & very polite. imo. i never had to pay whenever i go out to eat with the bf. so i don't pay attention to the fact that almost all Viet restaurants accept cash only. one day i went to eat without him, and ordered a bunch, in my wallet i only had a 20. not enough to cover, i think i was about 2 dollars short. i panicked and asked the lady at the register (i think she's the owner) if she accepts credit card. she said no...then i asked for an ATM machine. their place is too small for that. she told me not to worry about it...i can come back and pay next time. WHAT?! are you kidding me? you don't know me. i could run off....but i wouldn't. i was embarrassed. flustered. fumbled in my coin purse and fished out all the quarters i have. voila! enough to pay. i've never had to pay in coins before...but that was my first and my last time. heck. i'll just bump them up to another star, because the service here makes me a happy diner.", "Date": "2008-09-04", "Author_Location": "San Jose, CA"}, {"Author": "Jennifer N.", "ReviewID": "8rrx6Rwa5sTjdqatMG32og", "Overall": "4.0", "Content": "First off - do not, and i mean do not, underestimate this place because it is truly, truly (with italicized wording and everything) a hole in the wall, down home, authentic to the max (and hardcore), restaurant. I say this in all truthfulness because the name of the restaurant isn't what it appears at the physical location. I believe it just has bun bo hue in a banner or something. It is situated in a plaza that's off course in a suburban-ish neighborhood next to a laundromat and a liquor store. I'd say a shady neighborhood but i've seen worse.I came here mostly for the banh beo, an appetizer in the city of Hue (Vietnam) that is supposed to be an homage to all things steamed and served in little dishes. I went inside the supposed restaurant (name on Yelp is different from the actual location but I verified the address and it's correct) and ordered a bunch of little appetizers including the banh beo, banh ram it and the Vietnamese sausages and banh bot loc. I apologize in advance if i've spelled anything wrong. I also had the bun bo hue and the mi quang noodles. The banh beo appetizer was really delicious. I love the idea of appetizers steamed and served in small dishes. The fried shrimp cracker thing was a nice little contrast to the mild steamed rice flour. The dipping sauce (which consisted of sliced jalapenos and fish sauce) was flavorful and the perfect companion.The Vietnamese sausages were unexpected, but it was really nice. They're wrapped in a banana leaf to steam (i believe) and they served it to us minus the leaf. I loved the peppercorns inside.The banh boc lot was really good. I don't remember much of that one but I remember liking it a lot.The banh ram it was my favorite of the few. There is a fried counterpart to it, and it is also steamed with rice flour and has all the yumminess of a banh beo but with a fried bread thing on top. Really delicious and something I will always order. The bun bo hue was nothing special, but it wasn't bad. I still loved the tangy and spicy flavors of the soup. The mi quang noodles were yellow, very yellow. Really good, not spicy, nice tasting in my palette. I remember lots of raw onions that I had to pick out, but it was still hearty and good.And this is the part where many people are concerned with - the cleanliness. This is also the part where I describe how \"down home\" and \"authentic\" this place is. This place is absolutely not for one with a mental appetite, meaning one who eats with their eyes first (even though we all kind of do that....yeah). The place is strikingly not clean looking, the seating is pretty limited and the tables are sticky. The fridge right behind the counter is like a metal meat chamber that the employees go in and out to get stuff. What i noticed is that they do not cover any of their food in plastic wrap, unless they take it take it out inside the fridge? But that would mean they must have a trash bin inside, and we'd all hope to god they don't because that would be even grosser than not having plastic wrap.  I'm not fond of them mixing raw meats with noodles and other things to steam sharing the same frigid air because that still can promote cross contamination through some airborne way, am I right? I", "Date": "2012-02-20", "Author_Location": "San Jose, CA"}, {"Author": "Jackie D.", "ReviewID": "lPQCcyEMwD3vyiMHwCQzjw", "Overall": "4.0", "Content": "i was reminded of this place by ryan o's ROTD. i had to go and make a review after that. since i've recently been having cravings for bun bo hue, i made the bf take me here. we weren't sure where to go but soon found this small little place.we ordered banh beo, banh ram it, banh bot loc, and bun bo hue. it was so much food. luckily, we only ordered one bowl of bun bo hue we would not have been able to eat it all if we got our own bowls. i wanted my own bowl since i thought i'd want more. i was wrong. this place is really good. the banh beo had a crunchy pork piece on it. i'm not used to having them served in little individual dishes but i guess that just tells you that i just get banh beo from the veitnamese sandwich places or on party trays. i've never had banh ram it before and boy, is it chewy. a good kind of chewy. i like the fired bit underneath it too. the banh bot loc, i an't really remember all that well but i'm sure it was good. bun bo hue came out nicely too. i think i would have preferred it spicier but hey, it's all good.the time that i went here, they were getting a visit from the health inspector...i hope all is well there. yes, this place looks dirty but all that aside, it's worth a visit.", "Date": "2009-03-23", "Author_Location": "San Jose, CA"}, {"Author": "Rob C.", "ReviewID": "S1Qze8ykkCEkm7SlWblAEQ", "Overall": "4.0", "Content": "3.5 very hole in the wall, you know flies, dripping condensation overhead, dark plastic chopsticks, etc.  homemade feeling though.anyways, ordered banh beo.  not up to par with ones i've had in LA.the dish is larger so the ratio was a little off.  too much rice cake and need more topping.  very dry pork rinds.did like the banh ram it.  good flavor, sticky rice, shrimp, crunchy base, perfect for dipping in the fish sauce from the banh beo.also had the bun bo hue.  classic with the right ingredients and large knuckle for broth flavor.", "Date": "2011-08-01", "Author_Location": "Palo Alto, CA"}, {"Author": "Nhu H.", "ReviewID": "hW4mWw-9OhJ9ohEEMJsY9A", "Overall": "4.0", "Content": "The name suggests it. This place has great Bun Bo Hue. Literally a hole in the wall, the restaurant is a little bit smelly, but that was what I expected it (not that clean too).  Now lets start with the food. Unfortunately, I didn't get to try all of the food I would like too, for I was in a hurry. I got the regular Bun Bo Hue for $6.50. The portion wasn't that fulfilling, but oh lawdy lord was it good. However, the atmosphere in which this restaurant is located did not feel safe. There were literally 4 beggars outside this place asking for money. This place feels ghetto as heck, and be prepare to fight for parking spaces!! Other than that, I will definitely go back to try more food. 4 star for food, and minus one star for bad parking, unsafe, and dirtiness!", "Date": "2013-05-29", "Author_Location": "San Jose, CA"}, {"Author": "Toy T.", "ReviewID": "NtPJ4NRk04d61-FqFZq6tQ", "Overall": "4.0", "Content": "Came here once with a friend. People always talk about this place being the best. As for me, Bun bo hue all taste very similar so i dont know how this stands out to people. Nontheless Its still good food and friendly service.", "Date": "2013-12-07", "Author_Location": "Santa Teresa, San Jose, CA"}, {"Author": "Chi N.", "ReviewID": "dW8ZgS0hlZrACspffFK9uw", "Overall": "5.0", "Content": "I've been here a few times and I have to say that this is the BEST place for Bun Bo Hue in town - outside of my aunt's kitchen that is. Their Mi Quang and Banh Beo are also out of this world. Better than My Khe and An Nam, I must say. It is in a sketchy area with tight parking so beware. I have to try the Banh Ram It next week when I go there. I can't wait - my mouth is already watering at the thought of it.", "Date": "2011-06-09", "Author_Location": "Fremont, CA"}, {"Author": "Vu P.", "ReviewID": "_8dxQenvCKt-0qPpHrLuJw", "Overall": "3.0", "Content": "I used to love coming here to get the banh beo. Don't let the looks fool u, the plaza and restaurant may not look too tempting but it's awesome!! Parking lot was designed by blind people but other than that its well worth it. i stopped going here because i dont live in that area anymore but if someone invited me to eat there, i wouldnt hesitate to say yes! the banh beo is awesome and the bun bo hue's broth is very flavorful. with a name like bun bo hue #1 there bun bo hue better be #1", "Date": "2010-11-01", "Author_Location": "San Jose, CA"}, {"Author": "Ngoc L.", "ReviewID": "MDOVq8v7dP-CdaPKFvHWNA", "Overall": "5.0", "Content": "I loveeeee this restaurant. It looks really crappy and all that, but the food here is really good. Their cha is like the best and I also love their banh beo, I can eat like 3 orders all by myself..seriously. Their banh it ram is good too. I used to eat here alot with my lil brother when he was a kid, now we just get take out. The kitchen doesn't really look that clean and this is a pretty small shop, but hey..who cares..I never got sick eating here before.", "Date": "2011-04-09", "Author_Location": "San Jose, CA"}, {"Author": "Cheryl L.", "ReviewID": "r1pnxbNKkxAGMT-DKMeywA", "Overall": "5.0", "Content": "Tried the bun bo hue finally (gotta see if the food is as good as the name) and it was really good.  Yay! Another winning dish at this gem!", "Date": "2011-01-05", "Author_Location": "San Jose, CA"}, {"Author": "Katie N.", "ReviewID": "mQCCVExX0rUQx7DEZYByGg", "Overall": "3.0", "Content": "One of the decent places to go in San Jose", "Date": "2012-12-03", "Author_Location": "San Francisco, CA"}, {"Author": "Andrew N.", "ReviewID": "uE9rXPjkQm9PAovIQP8dUQ", "Overall": "5.0", "Content": "I grew up eating at this place. I started going here when my family brought us here. Hands down the best place for ban beo! I haven't even found anything near as good in Santa Ana. Every time I head back to San Jose, I have to go back. They are in a not so nice area, and parking sucks. But the food is cheap!! I don't think they have even raised their prices since the last time I came back there. (2 years). I also like the Mi quang and banh it ram. Definitely try them if you have a chance.", "Date": "2010-08-09", "Author_Location": "Lawrenceville, GA"}, {"Author": "Kelly S.", "ReviewID": "1JQdfo4NIOGfazbIwYj6_w", "Overall": "4.0", "Content": "i'm not very experienced with this type of food, so this review will be brief. I came here in 2009  through recommendation of the most fobbiest guy i know and he delivered.  Like he had stated, Banh Beo is numba one ! I loved how they come out with 10 little plates. It looked like it would never run out, which made this hungry girl so delighted. They're fast and have other great quick dishes (banh nam & banh ram) that we thoroughly enjoyed!There's so much more there, so don't hesitate to try new things!  Go on, make like Tom Cruise and start feeling risky.", "Date": "2011-02-22", "Author_Location": "Santa Clara, CA"}, {"Author": "jillian V.", "ReviewID": "6OFjfxFd-__IRo4YEhKPNA", "Overall": "5.0", "Content": "I've been coming here for years since living in San Jose and every time I come back to visit, I have to have their banh beo which is the steamed rice flour with shredded shrimp sprinkles where you dip it in sweet fish sauce. I've had this in Houston as well and it doesn't compare to this mom and pop restaurant. Banh be`o with cha Hue' (Hue style pork patty) will fill you up for lunch, but in addition you MUST get the bu'n rieu (shrimp/ pork vermicelli soup). Bun bo` Hue is alright but definitely edible. This place is the next best thing to your mom's Vietnamese home cooking and I will definitely return for some more.", "Date": "2009-07-15", "Author_Location": "Round Rock, TX"}, {"Author": "Hang N.", "ReviewID": "xXA9W8MhsAgr3yws7LZPKg", "Overall": "4.0", "Content": "I've been eating the banh beo here since I was a little kid. I haven't had it for about a year or so but I bet it's still as yummy. Banh bot loc and banh ram it here are good too.", "Date": "2011-02-25", "Author_Location": "San Jose, CA"}, {"Author": "Danny P.", "ReviewID": "tJo0jt2z5aYFYjIN8Sba6A", "Overall": "4.0", "Content": "this place has delicious everything.. woulda given them 5 stars except i felt a bit sick shortly afterwards.. oh well.don't order too many ban beo!! they come in a sets of 5.. so one or two sets should fulfill you, especially if you plan on eating other things.order from the left portion of the menu!! banh beo.. banh nam, banh bo loc, and the che lua!! all so delicious and the food comes out so speedily as if made from an assembly line. our food came out steaming hot, which was a plus. we didn't know what to attack first!!i'll definitely be back when i feel my stomach can handle it..", "Date": "2010-01-04", "Author_Location": "San Jose, CA"}, {"Author": "Chris N.", "ReviewID": "WiUoc-kaecclyeo1jSAtQA", "Overall": "5.0", "Content": "This place has been open since I can remember being alive.  My mother owned a bridal shop called \"Thuong Thuong\" about 6-7 stores down near the rental store that's there now (that place was called \"99 cent video\" back in '95, owned by one of my uncles).  We used to go here as kids and stack up the seemingly endless plates of banh beo!  15 years later, i still drop by this joint to eat any time i visit san jose and i take my friends (old and new) to try as well.  we started trying out the \"banh ram it\" as well, really really chewy, but tasty nonetheless!  very cheap for what you're getting, i highly recommend this place to anyone who wants to eat some OG banh beo", "Date": "2008-04-02", "Author_Location": "San Jose, CA"}, {"Author": "Anh T.", "ReviewID": "QwVXMQjONPCOxGfmY_ebvA", "Overall": "3.0", "Content": "I've had the mi quang and the bun rieu here. Both were really good and decently priced. The place is pretty shabby and I'm taking off 2 stars for having to find 2 hairs in my mi quang. After the first hair, I was a little turned off, and after finding the second one, my meal was over and I couldn't finish it. I wouldn't come back here for the soup, but I'll give it another try to have the banh beo.", "Date": "2011-04-27", "Author_Location": "Milpitas, CA"}, {"Author": "Thuyvi F.", "ReviewID": "5j6dtxUf47GgB8bC5FyiCg", "Overall": "5.0", "Content": "Dude I been coming to this place since I was a kid.  This is a mom and pop hole in the wall but everything is hella bomb here.  I dont think I ever had anything that was not good.  Bun Bo Hue and the banh ram is BOMB!! drool* damn I hella wanna drive to san jose rite now typing this review.  The fish sauce that u put on the banh beo is light not too overpowering.", "Date": "2009-09-22", "Author_Location": "East Bay, CA"}, {"Author": "Karen L.", "ReviewID": "Osmheqh2fMYZHMfg0f6Jsg", "Overall": "3.0", "Content": "Hole in the wall kind of place that offers good eats. They're called Bun Bo Hue but I'm not a fan of their Bun Bo, I think my mommy still makes the best Bun Bo, however I think more people come here for their awesome Banh Beo! Mmmm mmmm good! No meal is complete without a few of these babies along with an order of Cha Hue. On days when I'm feeling hungry, I'll get the Mi Quang too! Probably the only place that makes it the way I like it! 3.5 stars!", "Date": "2010-04-14", "Author_Location": "San Jose, CA"}, {"Author": "Michael A.", "ReviewID": "ITNFBzV66MEuolgJBkzwZw", "Overall": "3.0", "Content": "I went to yelp for a fresh perspective on Bun Rieu. Yelpers highly rated this spot. We left the comfort of Grand Century Mall to try this spot. Some might say I grew up in the hood, but I will go almost anywhere for a good meal. My wife had the Bun Bo Hue and I had Bun Rieu. The food was not bad though the menu was limited. The service was good, but the place is definitely a hole in the wall amongst other holes in the wall.  It is not worth the trip from the comfort of Grand Century to Senter road. My wife cooks Bun Rieu so I am probably biased.", "Date": "2009-04-19", "Author_Location": "San Mateo, CA"}, {"Author": "David D.", "ReviewID": "s_BRoiM1L2LWOyjwWkT9RQ", "Overall": "4.0", "Content": "like crack to a crackhead, kids to pedobear, D&D to nerds, BBH #1 is to foodies.  Must order:Bun Bo Hue (Duh winning)Banh BeoBanh ramWhat most people dont know Hue is a city in the mountains of Vietnam and they can Definitely cook!  Living in such harsh climates requires some good sex or good food, they chose the latter.  Overall, dont be confused with the ghetto 80's decor, cause asians dont like nice decor while eating.  But be ready to feast on some good sex food.", "Date": "2011-03-12", "Author_Location": "San Jose, CA"}, {"Author": "Kathy T.", "ReviewID": "4uTvoEM-dJVyuGUAZWf2GA", "Overall": "4.0", "Content": "This place is a little hole in the wall joint. I havent tried anything else on the menu except for the banh beo and other \"appetizers\" listed. I finally got the chance to return to this place over the weekend. When I crave banh beo this is my go to spot. It's cheap eats and oh so satisfying!", "Date": "2011-04-04", "Author_Location": "Milpitas, CA"}, {"Author": "eric w.", "ReviewID": "Tt9qsC6qIs_L6G0PeGz27w", "Overall": "5.0", "Content": "This might be where I got hep B, but the Bun Rieu was delicious.", "Date": "2010-11-29", "Author_Location": "San Francisco, CA"}, {"Author": "Simone V.", "ReviewID": "cRAsOFDI89nhADleg3L6uA", "Overall": "3.0", "Content": "I'm not a San Jose local, but I friend took the hubby and I here when we came in for the weekend.  We ordered the bun bo hue here and I have to say it was ok.  The broth was good, but what killed it for us was the bun.  It was a little undercooked to our taste so the texture was tougher then normal.  If the bun was cooked a little more tender, then it would be a 4 star review in my book.", "Date": "2012-09-25", "Author_Location": "West Covina, CA"}, {"Author": "Lo N.", "ReviewID": "t6QSv6881A91e2XcrQHWlQ", "Overall": "4.0", "Content": "The place looks run down and old.  Not to mention looks dirty I hate going to resturants that looks sooooo run down but I must say their food is GREAT!  I love it there and the prices are low.  The people there are nice too except for the one guy who asked me what I wanted to drink and I said Diet Coke then he said I can tell by looking at you that you wanted a diet coke!  Frickin bastard hope he didnt expect a tip!  Anyhow I love there banh beo bun bo hue and banh canh, but most of there dishes are delicious its juss the enviorment makes it bad if it was kept up I would of givin this place 5 stars :)", "Date": "2007-07-31", "Author_Location": "San Jose, CA"}, {"Author": "H I.", "ReviewID": "4Cy1TobDyhpiLywV4Hx1XA", "Overall": "1.0", "Content": "Wow, this place is just nasty. Don't trust all 4 star Yelp restaurants.", "Date": "2012-06-21", "Author_Location": "San Jose, CA"}, {"Author": "Phaylin S.", "ReviewID": "dqUT4o25YVgeQrFVshzzMw", "Overall": "4.0", "Content": "My good friend Stephanie Tran introduced me to this place. It's located in the hood but I'm used to that environment. We both ordered Banh Beo and it was pretty inexpensive. It was about 3.25 for 5 pieces. It also came with sweet fish sauce w/ jalapenos and pork cracklings. I ate it during my childhood and haven't eaten it since then. I was glad she took me out to this place because it was a wonderful experience. It was like nostalgia in every little bite of Banh Beo. It was kind of like when that food critic in Ratatouille ate that dish at the end of the movie and flashes back to his childhood. Yeah, It was kind of like that. Overall; besides the people always looking at you through the mirror, it was a pretty nice little place to sit down and eat.", "Date": "2012-04-25", "Author_Location": "San Jose, CA"}, {"Author": "T. T.", "ReviewID": "axjr_nnvq-tl6CNJrVCPng", "Overall": "3.0", "Content": "Good banh beo, awesome banh it tran, and one of the best fish sauce! Stars were deducted for lack of cleanliness and friendliness.", "Date": "2011-06-15", "Author_Location": "San Jose, CA"}, {"Author": "Gil A.", "ReviewID": "OfFAGoIQ3CTPxqmBEk1ylA", "Overall": "4.0", "Content": "My first stop had to be here once returning from Hawaii. These magical rice cups can heal all sorts of ailments such as hunger, famine, cotton mouth, drooling, etc. Place is kinda in the cuts but at least you can buy some lottery next door.", "Date": "2010-06-16", "Author_Location": "San Francisco, CA"}, {"Author": "Grace H.", "ReviewID": "t5a2TdC7DnyggZKaoQ8fyw", "Overall": "3.0", "Content": "4 stars for the Bun Bo Hue, -1 for the sanitation of the restaurant and cash only. Its most def a hole in the wall within a sketchy run down Vietnamese shopping plaza. When we first walked in it smelled like someone was making BBH in the back kitchen of a poodle parlor. Smelled like wet dog meets dirty old ketchup bottle -you know those old diner ketchup bottles that never get wiped down and dust collects on its sticky residue (yep smelled like that). We don't usually mind hole in the wall joints but this was pretty bad.. Very turned off by the way the restaurant looked and smelled -so distracted that after they served us drinks we forgot to order! After we ordered, food came out in a flash. Banh Beo wasnt as fresh as I hoped (this was 7pmish that we came so understandable I spose). He ordered a large BBH and I ordered the Mi Quang. I was not at all impressed with the Mi Quang. Looked better than it tasted thats for sure. His BBH however was absolutely delicious! Just like mom's home cooked if not better (psst dont tell the moms). BBH broth was just right with just the right amount of spice, very authentic with the pork hooves and blood! I would come back -only for the BBH, its good stuff I tell ya!", "Date": "2012-01-10", "Author_Location": "Castro Valley, CA"}, {"Author": "Lily L.", "ReviewID": "EBfKhipZzJobk_aUHeVo2A", "Overall": "3.0", "Content": "3.5 stars for their banh beo which is what I came here for.  I've tried the bun bo hue twice and both times it was bad.  The noodles aren't fresh and kinda hard.  Broth almost taste like instant powder soup.  Kinda sad when you're suppose to be famous for Bun Bo Hue.  But I am glad that people frequent this place to stay alive so I can come back for my banh beo. Danny V hits is right on the nail.", "Date": "2007-12-10", "Author_Location": "San Jose, CA"}, {"Author": "Nancy T.", "ReviewID": "lhkVSOidQ77oYjlrQ8EcFg", "Overall": "3.0", "Content": "This place is a total hole-in-the-wall dive.  I suppose it is all about the food.  The servers were very nice too.  I ordered the bun bo hue and it was okay.  I remember having it a long time ago somewhere and thought I didn't like it, but wasn't sure, so I ordered it to see if it was what I thought it was.  It was....and I'm still not a big fan, so it's hard for me to judge.  The broth had a nice flavor, fat noodles, some slices of cha (pork sausage), lots of fatty beef with tendons, one ham hock, and two large cubes of cooked blood.   My fiance had the bun tom thit nuong (big cold noodle bowl with shrimp and grilled pork).  He really liked it a lot.  I had a taste and wanted to trade entrees with him.  The iced coffee with condensed milk he ordered was good.  I should have read yelp reviews a little better and ordered what everyone else was raving about.  Oh well, next time....", "Date": "2009-04-18", "Author_Location": "San Jose, CA"}, {"Author": "Karen L.", "ReviewID": "p_7nezIXyBkLcW1OvBW6dg", "Overall": "1.0", "Content": "I did a yelp search for Banh Beo in Milpitas and this one was rated 4 stars. SOOOOOOO NOT A 4 STAR place....... Ok... I don't mind going into the hood for good food but when we pulled into the driveway there was a swarm (millions!!!!!!! and not exaggerating) of FLIES. It was super gross. The place look like a total hole in the wall. They even had the nice filthy water bucket right next to some food for me to witness when I used their restroom. Don't you just love that??? Ok... So let's Yelp the food... Since it's called \"Bun Bo Hue\" of course I will try the Bun Bo Hue, right? It wasn't very flavorful. I would think if you name a restaurant after a specific type of food it would be good, right? Nope. That's not the case here. The Banh Beo is ok. The only thing is instead of a fried fat that I'm use to, they used basically fried pork rinds. The egg roll was bland and they used the Chinese egg roll wrappers versus the rice paper which I think taste a lot better for Vietnamese egg rolls.I will continue my search for good Banh Beo in Norcal. I had the best one in Southern California called Nem Nuong Ninh Hoa (Rosemead). If you are ever in SoCal and love Banh Beo you should definitely visit this eatery. SOOOOO GOOOD. WHY IS ALL THE GOOD PLACES IN SOCAL?????? UGH....", "Date": "2010-02-20", "Author_Location": "San Francisco, CA"}, {"Author": "niwath c.", "ReviewID": "B4RChJ1DBqqAeBFEXWs8sg", "Overall": "4.0", "Content": "Banh beo, banh beo, banh beo!!! Chu, can I have 4 orders of Banh beo. Cam on!!! Yeah my my Cambodian's rusty, but my Vietnamese is on point. How else am I going to ever get anything to eat in San Jose. Forgo all the fancy places, with their fusion this and overpriced that. I want homestyle delights...and the banh beo is bomb!!! the Bun Bo Hue, Bun Rieu, and Mi Quang are just side dished...maybe if they remodeled, they would get 5 stars...aww who cares, can I get another order please!!!", "Date": "2009-04-13", "Author_Location": "San Jose, CA"}, {"Author": "Huy P.", "ReviewID": "l41meZe-NDBlTjqdlJs0FQ", "Overall": "4.0", "Content": "I always go here for their banh beo and other small dishes, which are great! Also, the mi quang is really good too if you feel like a noodle dish.", "Date": "2010-01-09", "Author_Location": "San Jose, CA"}, {"Author": "Richard R.", "ReviewID": "zQbSE0fdeHpVArXkyhHg8w", "Overall": "4.0", "Content": "I can finally write a review and say that I have been coming to this place since I was little. Around 15-17 years to be exact. The restaurant that opened my eyes to Bun Bo Hue and Banh Beo (No place makes it better). Along with these items, they also have Banh Bot Loc, Banh Nam, Bun Tom, and a lot of other goodies. If you have never been here before, don't be scared. I know it looks sketchy on the inside and out, but if you want to have some good eating, please step inside and experience some really great Hue food.", "Date": "2011-06-05", "Author_Location": "San Jose, CA"}, {"Author": "Nancy L.", "ReviewID": "Q8I1CtOWgZuoN47XXxZ03Q", "Overall": "4.0", "Content": "The 4 stars is for their Banh Beo ONLY!!! Hot and fresh out of the steamer with yummy pork rinds.  Don't come here if you're wanting a super clean and eye friendly restaurant. It's a hole-in-a-wall so be prepared! Their Bun Bo Hue is horrible, go to Ca Mau if that's what you're craving for cause theirs is the best (next to homemade!)", "Date": "2011-09-02", "Author_Location": "San Jose, CA"}, {"Author": "Thai Hien H.", "ReviewID": "NwTuWh1Q11DgcKUx4DikwQ", "Overall": "4.0", "Content": "it's my go-to place for banh beo. it's the best around. but that's all that you should eat at this restaurant. cozy hole-in-the-wall.", "Date": "2010-09-29", "Author_Location": "Los Angeles, CA"}, {"Author": "Christine N.", "ReviewID": "A8wG_2wyRwJ4SRPqKbFIYQ", "Overall": "2.0", "Content": "2.5 Stars  This place is really small and I had to wait a good 15 minutes before getting seated. Parking is horrible because it's located in an Asian plaza and we all know they have the worst parking. Don't expect any sort of nice customer service. I couldn't get one smile out of the lady.    The Banh Beo isn't too bad. They put a piece of pork rind on top. From where I was sitting, I could see they make full use of their microwave, lol. I also ordered the Bun Bo Hue because that's what the restaurant is named after. I expected some delicious Bun Bo Hue...boy, was I disappointed. There was absolutely no color in that bowl. The liquid was a clear broth, no red coloring to make it look appealing at all. It tasted like something my mom would make at home and she's not exactly the best cook.   For a restaurant that's named Bun Bo Hue, at least make your \"specialty\" better or change your name to Banh Beo.", "Date": "2011-03-28", "Author_Location": "San Jose, CA"}, {"Author": "Audrey M.", "ReviewID": "S1_B27BbMPCn-9UPZe5bXg", "Overall": "4.0", "Content": "Came in for lunch with my boyfriend. It was a busy so ordering was a bit difficult since I posses the Vietnamese skills of a 3 year old. I had the banh beo and banh bot loc while my bf ordered the bun bo hue. First off, the banh beo was AWESOME. I only had one order but I didn't expect my bf to eat any since he didn't like it when we ate it at other places. The bang bot loc was alright, but the ones in Sacramento is way better. The bun bo hue was good, but nothing I hadn't had before. By the counter, they have small trays of their banh beo that you can buy to go, which I did. Next time I head to SJ, this place is a must.", "Date": "2011-06-15", "Author_Location": "San Francisco, CA"}, {"Author": "Jennifer T.", "ReviewID": "HdRcj3k_KHMgOTj-p86cxw", "Overall": "3.0", "Content": "The boyfriend and I actually enjoyed the banh it ram more than the banh beo.  The boyfriend even ordered the BBH but despites the restaurant's name, don't deter from the banh beo and banh it ram. Literally a hole in the wall, as the kitchen was just that little space behind the cash register!  Knocked off 1 star because there was a roach climbing the walls while I was waiting to pay; blech!", "Date": "2011-08-26", "Author_Location": "San Jose, CA"}, {"Author": "Laurie L.", "ReviewID": "MZu4P5jO2h1q4g29QhOFNg", "Overall": "4.0", "Content": "This restaurant has been in business for a very long time now. I always drive by there but never attempted to try because it looks old and run down and I assume that it doesn't taste good either. However, my sister took me here and I tried the Bnh Bo. It was really good, I keep on coming back for this dish.", "Date": "2007-09-11", "Author_Location": "San Jose, CA"}, {"Author": "Kristine T.", "ReviewID": "1cedIWsDkI_-4g3_eIU-mg", "Overall": "4.0", "Content": "this place look the same ever since i was a baby...been eating here all my life! i love their banh beo ,cha hue.. yumm and banh ram ut.. sometimes i order banh ram no ut.. lol . this is the only place that i know that makes yummy banh beo.. other places cant even come close to compare. the service here is sometime slow and every time i say that i dont want peppers in that sauce for the banh beo they always put it in anyways.. the waiters seems to favor older customer even if u order your food before them.. uhh u get use to it after times.. haha4 stars for food.. -1 for the service.", "Date": "2008-06-16", "Author_Location": "San Jose, CA"}, {"Author": "Eileen L.", "ReviewID": "9m3bWE1nKCpwV7oeFFu7Rg", "Overall": "3.0", "Content": "I came here just yesterday . i had the banh nam ( chicken and shrimp rice cakes wrapped in banana leaves which tasted okay . I also had the bun bo hue which tasted ok but wasn't spicy enough so I added some hot sauce and it tasted better :) . The decor of this place is not that nice the food is ok . However , I prefer Bun Bo Hue An Nam over this place ...", "Date": "2010-01-15", "Author_Location": "San Francisco, CA"}, {"Author": "Tony D.", "ReviewID": "x50KBIRRHQevImxDEWvMxQ", "Overall": "4.0", "Content": "I've been going here since I was a kid. A must have to get here is the banh beo. I came here recently with a friend and we ordered 4 orders of banh beo and 2 orders oh banh bot loc. A order of banh beo  comes with 5 plates, and same with the banh bot loc.", "Date": "2011-08-16", "Author_Location": "San Jose, CA"}, {"Author": "Anthony N.", "ReviewID": "svrC5pmS3ldIloRkCZgWiA", "Overall": "4.0", "Content": "really good authentic vietnamese food. bun bo hue is extremely rich and flavorful. I usually order my bun bo hue without the pork blood. The broth is quite spicy by itself but delicious!", "Date": "2011-10-10", "Author_Location": "San Jose, CA"}, {"Author": "A A.", "ReviewID": "SrIM6rciBEO_Ua0YR_hcRQ", "Overall": "4.0", "Content": "yes, this place might look a bit rundown.... yes, the parking lots is tight as hell and people can't drive here....but the authentic bun bo hue (with extra mam ruoc) and those delicious fried rice cakes makes me come back here again and again.on top of the good food, the staff are really chilled and friendly unlike the other the Bun Bo Hue places (An Nam..) where they have absolutely horrible service from the wait staff and the cashier.prices are ok also see their menu :  bunbohuesenter.com/bunbo…", "Date": "2009-09-29", "Author_Location": "Saratoga, CA"}, {"Author": "N L.", "ReviewID": "W6LOV4hXLcNOc-GuZWV9Ig", "Overall": "5.0", "Content": "been coming here since I was a kid. Its a hole in the wall place with good food. I usually go for the mi quang, banh ram it and definitely a round of banh beo.", "Date": "2012-03-04", "Author_Location": "San Jose, CA"}, {"Author": "Jenn J.", "ReviewID": "IZuUByzlgvCJDD_6MhEzag", "Overall": "5.0", "Content": "This is my all time favorite place to eat banh beo, I've tried a few other places but no where beats them.  All I can say is you have to try it for yourself.   Even though the restaurant name is Bun Bo Hue, I can tell you this much, I surely don't go there for that. They have other selection on their menu, like mi quang, bun bo hue (obviously) and rices dishes if you don't like banh beo, but trust me you can't go here and just order the noodles or rice or bun bo hue, you have to try their banh beo and their their ram it minus the it,  It's delicious.  I recently took my friend here and shes in loves banh beo, and shes eaten it at numerous other places and thought those places were good, but until she tried this place. NOW she's hooked. All in All  this place is yummy.", "Date": "2012-03-23", "Author_Location": "Union City, CA"}, {"Author": "majia m.", "ReviewID": "VtEn0RN9cVvD5RgRYbK04g", "Overall": "2.0", "Content": "First of all, please go there with someone who speaks Vietnamese.Secondly, they should take the 'Bun Bo Hue' from their menu and name.", "Date": "2012-05-20", "Author_Location": "San Juan Bautista, CA"}, {"Author": "kelly q.", "ReviewID": "ROKJ3rox4vqAVc0jke86Jg", "Overall": "2.0", "Content": "This restaurant was my place to go to in the late 1990's and early 2000's when I craved \"Hue's\" specialties such as Banh Beo, Mi Quang, Bun Bo Hue, Banh Canh, etc.,.  I finally had the chance to visit this place this past weekend after 10years and to my disappointment, the food are not as good as they used to be.  They must have changed ownership since 2001.  The \"Banh Beo\" is definitely different. The nuoc mam for Banh Beo tastes like water.  The \"Bun Bo Hue\" and \"Banh Canh\" are bland.  It's ashamed that they could not retained the taste of their signature dish \"banh beo\".  I Will not come back again.", "Date": "2011-08-31", "Author_Location": "San Jose, CA"}, {"Author": "Anne P.", "ReviewID": "k6MhLiTsgfZbIiBORuRxdQ", "Overall": "4.0", "Content": "i go here all the time. the food is good. service kinda sucks though but i guess the bun bo hue and banh beo makes up for it. i totally love the cha hue here. it is a MUST order kind of thing.", "Date": "2011-01-21", "Author_Location": "San Jose, CA"}, {"Author": "Thuy Tien T.", "ReviewID": "kikUYlF_WRrrVRPh-foHtQ", "Overall": "5.0", "Content": "I had their banh ram it or banh it ram (not sure of the spelling ) for the first time and to be honest it's the best thing ever. It's a lot better than banh beo, banh bot loc. I'm not sure what it's made out of, but whatever it is that they put in there it's amazingly delicious.", "Date": "2009-07-31", "Author_Location": "San Jose, CA"}, {"Author": "Jennifer N.", "ReviewID": "CB-RKO7X6r9upvmUGoD9eA", "Overall": "5.0", "Content": "this is what i consider to be a \"whole-in-the-wall\" type of restaurant, but they serve THE BEST banh beo ever! i ate my very first banh beo here about 20+ years ago. i still come here to this very day, i guess they don't like change.. but the food here sure is like a diamond in the rough!", "Date": "2010-02-25", "Author_Location": "San Jose, CA"}, {"Author": "Ada C.", "ReviewID": "j88CTpnRykXJYLm9MnJmeg", "Overall": "4.0", "Content": "To make this trip worth considered the gas price keeps going up, I decided to explore Viet. Food  since SJ has a huge viet. population.  Sure enough this hole in the wall restaurant situates in a hard to find strip mall which mostly run by Vietnamese community.  The owner is an old couple who hardly speaks English and of course I can't read Vietnamese either.  I just pointed at the other table for what I wanted but the owner still gave me their simple menu to make sure I ordered the right items.  I ordered the banh bot loc and banh beo, both are very fresh.  1 order of banh bot loc comes with 5 dishes, sounds a lot but those are just soy sauce dish.  The tapioca skin for the banh beo is so chewy.  These little guys look simple to make but just like making soft boiled egg, it takes experience to make the batter and control the temp. so that the rice cake/dumplings turn out with the right texture.  Nice, authentic appetizer.", "Date": "2012-10-07", "Author_Location": "Albany, CA"}, {"Author": "Ai T.", "ReviewID": "9AFeWNR35Vj_0wTnnKspMA", "Overall": "5.0", "Content": "banh beo and banh it here are the best !", "Date": "2012-08-11", "Author_Location": "San Jose, CA"}, {"Author": "Mimi C.", "ReviewID": "6Hx3qVQDsbx9ue4iPgvGMA", "Overall": "4.0", "Content": "They have a yelp sticker so you're at the right place =). I was thinking that I will have a hard time finding this restaurant on the site since its just named Bun bo hue but seeing the banh beo pictures, its the right place!!! My bf took me here the first time, and I bugged him to take me back lol since its kinda far from where we live (santa clara)... but the banh beo is worth the drive. Do not be fooled by the tiny size and kinda look like a hole in the wall lol but the banh beo is delish! I also tried the banh ram (i think thats what its called) since I saw someone ordered it, and it was good. It was different, it was soft and chewy with a crunchy texture on top.. it was new, and it was good!  Get the cha lua hue along with your banh beo. hmmm. The bun bo hue is not bad.. pretty good. I normally like mi quang.. but its pretty plain there. I wouldn't order it again. But this place is good for all their appetitizer and decent bun bo hue. I'll be bugging my bf to come back to this place once again when my banh beo craving kicks in =)", "Date": "2010-01-06", "Author_Location": "San Jose, CA"}, {"Author": "Emanuel M.", "ReviewID": "D5pbyt_a4TILIWwq3eT2BQ", "Overall": "4.0", "Content": "went here with a friend because he said he wanted some bun bo hue, i eaten at a lot of bun bo hue places, but the bbh here was just mediocre.  call me spoiled, but i think an nam has the best bbh, anyway i give it 3 stars for food quality, but this place gets an extra star for the banh beo.  i aint viet, but i do have a lot of friends so the culture has become a part of me.  he told me to try it, its like 3 bucks for 5 plates or something along that, anyway when i saw the banh beo, i was like ooo chicharone is on this bad girl.  haha it was pretty good if ur willing to try.  my friend ordered a bun thieu?  i dont remember it came with yellow noodles and shrimp!  looked hella bomb.  i will be back for my banh beo needs, and to try the thing my friend ordered, but as for the bbh, i wouldnt bother =T  well enjoy! ;D", "Date": "2010-08-18", "Author_Location": "San Jose, CA"}, {"Author": "K K.", "ReviewID": "xvuatdOPSH5BY0vvTLySgQ", "Overall": "4.0", "Content": "banh beo was seriously good as recommended by my cousin.  their fish sauce was amazing.", "Date": "2012-05-31", "Author_Location": "Anaheim, CA"}, {"Author": "Andrew Q.", "ReviewID": "8LINVb6c4vZnIL3AKffkuQ", "Overall": "4.0", "Content": "I love this place. I will always come back to here. They make the best banh beos. I've eaten here for years! Quality food. I only wish they come and read their reviews on Yelp. I love this place. the only problem is this place is so small. But nevertheless, i recommend this place to Vietfood lovers. Banh Beos here are the best. And try the banh ram it. That's interesting. Bun bo hue here is good of course. Overall, a very well-doing and accomplishing, successful little restaurant.", "Date": "2011-09-03", "Author_Location": "Milpitas, CA"}, {"Author": "Mimi T.", "ReviewID": "xXE0Gi-RF1_jvVuSO5Ptow", "Overall": "4.0", "Content": "best banh beo place in town! but then again all their other food is good too. banh nam, banh ram, and banh canh are all bomb, they've been around for years, and I still come here with or without my mom. One star off just because its pretty dirty inside, but their food is sooo good, you cant find another place with better hue dishes.", "Date": "2008-10-15", "Author_Location": "San Jose, CA"}, {"Author": "Brenda L.", "ReviewID": "K0wIPdUSTCU3fg_8IDCYxQ", "Overall": "5.0", "Content": "hands down my favorite place in san jose to get banh beo. their banh it banh ram is good too. the place is very small, that's the only down side. and the parking lot is cramped. but the banh beo is great!i crave it all the time!", "Date": "2010-06-15", "Author_Location": "Denver, CO"}, {"Author": "Steven N.", "ReviewID": "9Q8HWQXzRnKHB2IeJfj1sw", "Overall": "4.0", "Content": "great place has the best banh beo!", "Date": "2010-03-13", "Author_Location": "San Jose, CA"}, {"Author": "Khanh N.", "ReviewID": "pHw4fj4bBQqkACvLo4Odzg", "Overall": "4.0", "Content": "Great place for Hue's appetizers, especially Banh Beo. Bun Bo Hue is also excellent. Nem Nuong is OK, not great. A dive, but good food!", "Date": "2011-02-04", "Author_Location": "Cupertino, CA"}, {"Author": "Hk K.", "ReviewID": "IUXjCIISUT2Lj1It5PyYEQ", "Overall": "3.0", "Content": "Ok food. The appetizer is special but they all got similar taste. For their rice and noodle dish, I can find tastier ones nearby. Their tea tastes a bit strange to me. I", "Date": "2011-04-09", "Author_Location": "Milpitas, CA"}, {"Author": "yp l.", "ReviewID": "Pr-J1fobn0PG18heIzOnIg", "Overall": "4.0", "Content": "Hands down the best banh beo ever! If you come in at the right time when the banh beo just came out of the steamer, even better! My husband and I like to come here and order loads of them, then watch the dishes piling up. Yea, the place is old and a little on the dirty side, but if you don't mind the whole in the wall environment, you'll find that they have lots to offer. My other favorite is mi quang.", "Date": "2010-01-08", "Author_Location": "San Jose, CA"}, {"Author": "Tiffany H.", "ReviewID": "EE0w_27gMVsFFFn9QZh_Qw", "Overall": "4.0", "Content": "While waiting for car repair on Monterey Hwy, I walked about 20 mins here to try the Bun Bo Hue. Since its not rush hour, the parking lot was not that full. Easy to find seat and order came quickly. Reasonable price and tasty noodle. The only reason that I give 4 star is that it's too far away from freeway or main street. Would like to come again if pass by.", "Date": "2011-06-06", "Author_Location": "San Diego, CA"}, {"Author": "Billy V.", "ReviewID": "RdvCsAF9SJh8h3YYMDd3Jw", "Overall": "2.0", "Content": "small. packed. not what it used to be.", "Date": "2012-03-14", "Author_Location": "San Jose, CA"}, {"Author": "N V.", "ReviewID": "PwP46-bVFpRIeHORkaC-6Q", "Overall": "1.0", "Content": "Worst Mi Quang, worst Bun Bo Hue, worst banh ran it and nuoc mam EVER!!! If you love Bun Bo Hue An Nam, don't go here. The taste is WEIRD!", "Date": "2012-05-22", "Author_Location": "San Diego, CA"}, {"Author": "Trina D.", "ReviewID": "apFckjchuwGpw_ru2qBkjA", "Overall": "5.0", "Content": "yum! best place for banh beo and other little snacks. i like getting one of each and trying them all and getting full off of that. tried the mi quang before.. wasnt the best but the 5 stars are for the banh beo and yumm fresh squeezed orange juice!", "Date": "2011-07-12", "Author_Location": "Oakland, CA"}, {"Author": "Vu N.", "ReviewID": "jHy4PHSC1VrUMCBe9ohAzQ", "Overall": "4.0", "Content": "the best banh bot loc in town!  hand down!", "Date": "2010-09-16", "Author_Location": "San Jose, CA"}], "RestaurantInfo": {"RestaurantID": "5GD4clahIcMCiH5pA__MZA", "Name": "Bun Bo Hue", "Price": "$", "RestaurantURL": "/biz/bun-bo-hue-san-jose", "Longitude": " -121.839452", "Address": "2871 Senter RdSan Jose, CA 95111", "Latitude": " 37.298686099999998", "ImgURL": "//s3-media1.fl.yelpcdn.com/bphoto/HHkQz9IiBuZSw8y0fcTrSA/90s.jpg"}}