{"Reviews": [{"Author": "Rockne H.", "ReviewID": "jEZPi0i8FAoTEJWwuM9_cQ", "Overall": "4.0", "Content": "After our first happy hour of the 2014 Yelp Spring break, me and my new friends from the Phoenix Yelp community decided to walk to the next bar, so we can have the party continue. We stumbled upon Past Perfect and for many reasons, I'm glad we did.This location was a little drab for me. The avocado green and adobe colored walls seemed to clash. The bar arches and fake vines that lined it made for a sort of outdated place. What I did like was the Lincoln photo and huge American flag that lined the ceiling. It remained consistent to the name of the location. The bathrooms of this location was a complete dump and needs to be deep cleaned. Lastly, another focal point to this joint was the long bar top, which offered lots of bar seating. While we were there, we tried a couple of drinks. For starters, the happy hour included $2 pints of bud light, so you know I just had to get that the whole time. Another  highlight of this place was the fact that they infused their own vodkas. We decided to try their habanero infused vodka and see how hot it really was. It went well in the bloody mary we ordered. WOW, was it hot! This vodka is not for the faint. You'll need to love hot things and have tough skin to enjoy this. For me, I could not handle. After a sip, I tapped out lol!Past Perfect was the right location for a few drinks before our Yelp party. I'm glad that we stumbled upon this place as we had the opportunity to try some great drinks at a low cost. If  you're in the area, you certainly have to come in and check them out!", "Date": "2014-05-25", "Author_Location": "Henderson, NV"}, {"Author": "Mak M.", "ReviewID": "H6d-ddpoNua9RRAQflAhuw", "Overall": "2.0", "Content": "This place claims to be gluten free, we were even recommended to them for their gluten free menu. However, they only have salads and we were told \"you would know better than us.\"  How is it possible for us to know better than THE CHEF as to what ingredients are used in the food? If you're gluten free, don't waste your time. Seems to be a cool spot otherwise.", "Date": "2014-06-03", "Author_Location": "Gettysburg, PA"}, {"Author": "Max R.", "ReviewID": "d8rhPGlNirassbgW6_4fZA", "Overall": "1.0", "Content": "Does the name somehow indicate that at one time in the past, this place was perfect? It appears that the last time this place was cleaned was really far back in the past, either that or they do without the modern conveniences such as vacuum cleaners, soap and water, rags, brooms and mops.The Bloody Marys we had were awful - yes, it's a Mary Bar, so you make your own, but the bloody mix they offer is yuck and the condiments were 6 types of peppers, plain green olives and celery, boring.We had planned on eating there when we walked in, but after seeing the filth covering everything and the putrid bloody mary mix, we opted to head over to The Southern, where we had a nice lunch with good service.", "Date": "2014-05-25", "Author_Location": "Nashville, TN"}, {"Author": "Melanio F.", "ReviewID": "RAP1vIH72gwfy4s878_4fQ", "Overall": "3.0", "Content": "Post YSB event on our way to another event, we found the bar and thought...maybe Happy Hour part deux..  Well to say the least, it was not crowded when we came in but got crowded after.  I guess it was the place to go to before the concert (symphony?).  Mostly older crowd.But we sort of semi-inebriated Yelpers decide we should savor more alcohol before heading to the Welcome to Nashville party.  As will be the running theme of all my reviews for the YSB14 in Nashville, sometimes on your own you find a much more wonderful time with fellow Yelpers.  After all, this is all on our dime now.  The bartender was not exactly ideal, he didn't know what was on their HH, he basically told us it was Ladies night which really meant no bargains for you guys (although he did take off $1 of domestic drafts).  Bartender not withstanding, we all ordered our drinks and one of our Phoenician Yelpers proceeded to introduce himself to a nice couple who was probably as I mentioned before having a nosh before the concert.  It was fun but I am sure the couple was not necessarily impressed.The biggest surprise to me was seeing a large portrait of Lincoln in this bar.  I thought I was in the South...lol!Past Perfect is way way past perfect but it's probably cheaper than Southern Oyster which is next door.", "Date": "2014-05-20", "Author_Location": "San Diego, CA"}, {"Author": "Nikki C.", "ReviewID": "7r-kiQIaRBI_OKOvDFYAbA", "Overall": "3.0", "Content": "Nothing to special about this establishment. It's off the main broadway strip which is nice because it's less crowded, but you give up the live music ambiance. The food was nothing to write home about (although it was my first experience with fried green tomatoes which were amazing).The sandwiches were served with chips, which is fine, but they came in a bag...at least get creative and put them on the plate or make your own.The service was very slow. I expected a slower pace down here, but this was beyond southern laid back pace. It's a problem when you have to stack plates to let your server know to come clear them.Some pros, their house infused vodka selection seemed impressive (if you got past the fact that they ran out of a few or weren't making them even though they were on the list), but I did not try any. It is also the only place near Broadway which took reservations.I would only use this place as a last resort if I ever get a chance to come back to Nashville...I suggest you do the same. There are much better places within walking distance.", "Date": "2014-05-04", "Author_Location": "Norwalk, CT"}, {"Author": "Bill W.", "ReviewID": "3FbL7fh9MgwViXIIadWlFQ", "Overall": "1.0", "Content": "The owner of this place should stay away from the customers at all costs. What a condescending sourpuss. As if he wasn't bad enough, the food is pretty meh. I asked the server about one of the sandwiches and he jokes \"you mean the roach burger?\" And laughed. I didn't think that was funny. Then this wet sandwich of an owner proceeds to act like we are interfering with his empty restaurant and us being there was less than convenient for him.  if he has investors, I'd love to sell them part of the veterans memorial bridge.", "Date": "2014-06-15", "Author_Location": "Nashville, TN"}, {"Author": "Zoraida K.", "ReviewID": "UeE0cwt0jDaYhfBUGeR0Og", "Overall": "4.0", "Content": "YesDinner on Valentine's with RK and #JaniceGarrett", "Date": "2014-02-16", "Author_Location": "Nashville, TN"}, {"Author": "Bridgette C.", "ReviewID": "1wUZkmzpA3ryluDCNsnbBA", "Overall": "4.0", "Content": "Any place that makes their own vodka infusions is on my good list.  Any place that has good sandwiches to soak up that yummy alcohol also makes my good list.  Past Perfect is a great little spot downtown near the pedestrian bridge with great drinks and food and great prices on those items.  It has become a go-to for happy hour or pre-show dinners.  I recommend any of their wraps and their steak sandwich is delicious.  It's part bar/pub, part restaurant, all chill.", "Date": "2014-02-19", "Author_Location": "Nashville, TN"}, {"Author": "Jeff H.", "ReviewID": "lOdy008k6cqeUyRZrCkWyw", "Overall": "4.0", "Content": "Fantastic!Sandwiches are amazing....$2 Bud Light for HH and infused Vodkas are outstanding.Must stop, won't regret it.", "Date": "2013-10-01", "Author_Location": "Hendersonville, TN"}, {"Author": "Jaclyn H.", "ReviewID": "mItWWYZl4xrbQ05g0yLJlw", "Overall": "3.0", "Content": "Eh, it's okay. I wasn't wowed, but it wasn't horrible. Our server was nice, but the overall service was pretty slow.", "Date": "2014-02-15", "Author_Location": "Mount Juliet, TN"}, {"Author": "Megan F.", "ReviewID": "lNDF21HNffxTHwGYHexErA", "Overall": "5.0", "Content": "My bestie and I stumbled upon this little gem while being obnoxious tourists in Nashville. We wandered in from across the street when we realized that the \"Johnny Cash Museum\" is really just a store (so far). So we decided it was time to start drinkin, and they had a sign out front advertising their Happy Hour.Maybe I loved this place because of the myriad house-infused vodkas and the corresponding amazing cocktails. Maybe I loved it because it was the first time in my life that I've been told by a bartender \"I was warned about you two.\" Or maybe I loved it because we ran into a friend of the bartender's and her amigas, and they then let us tag along bar-hopping for a very fun, trashed evening. The events of the rest of the evening are not to be discussed in polite company...In any event, I wish there was a little place like this near me. And FYI, the habanero vodka is hot. Like really hot. And my friend claims her pee smelled like habaneros the next day. So I dare you.", "Date": "2013-02-22", "Author_Location": "Rockville, MD"}, {"Author": "Dylan C.", "ReviewID": "jGAxBbVVr9E0IdcFuHZ32g", "Overall": "4.0", "Content": "In town for CMA Fest and happened upon this place while walking to the pedestrian bridge.The wait was 1/2 hour, but to be expected with the crowd in town.  The menu looked good as far as the burgers went, but I was looking for real food so I went with the Meatloaf and Spaghetti and was quite surprised.  The meatloaf was very moist and mainly meat with very little filler holding it together.  The pasta was cooked great and the sauce seemed freshly made that day.  It filled me up without being too heavy.The wife had one of the open faced steak sandwiches expecting to see cut up steak strips on bread, but as another surprise it was a full steak cooked to order with bread holding it up off the plate.  She says it was great.The only disappointment was that we were not able to sit upstairs because of the crowd.  We will come back to this joint when we visit Nashville again.", "Date": "2013-06-09", "Author_Location": "Charlotte, NC"}, {"Author": "Sherry K.", "ReviewID": "P2dM3MBg0iifPs68TImdBw", "Overall": "1.0", "Content": "We tried to go tonight because it was near our hotel and had good reviews. Unfortunately we never were able to find out because the host informed us that despite the empty tables that they couldn't seat us for 45 min. because the servers were busy with a large party. So they were willing to let a party of 5 go so obviously not consumer-oriented.", "Date": "2014-01-18", "Author_Location": "Auburndale, MA"}, {"Author": "Eric G.", "ReviewID": "_eVEStTzl6-i5TBoo3MsCg", "Overall": "5.0", "Content": "Amazingness! Got the spinach artichoke dip and it was out of sight. Probably the best I've ever had. It's homemade and a little bit more runny than I've had elsewhere, but absolutely superb. Had some infused vodka (the cucumber and grapefruit were off the charts). For my main course I had a bison Jackson burger. You can't go wrong with their burgers. They are known for them and all three burgers at the table looked delicious! THIS IS A MUST DO when in Nashville.", "Date": "2014-01-05", "Author_Location": "Boynton Beach, FL"}, {"Author": "Kaye M.", "ReviewID": "pc1Y3pwEkkYgJwMKQk3y8g", "Overall": "4.0", "Content": "I really enjoyed Past Perfect. This is another one of those instances where I have to break it down...so here goes: GOOD: Service. The server/host who helped me was nice, helpful, friendly and a pleasure to work with. He seemed to really enjoy recommending items he enjoys. GOOD: Vodka! The vodka at this joint is infused at the bar. They do it themselves. (That's what she said!) And they do a great job. The coconut vodka is not sweet, just has a nice, strong essence of coconut and makes a delicious, refreshing straight martini. In fact, I really, really enjoyed the coconut vodka. The ginger was more interesting, more spicy and a more complicated flavor. There were little tiny bits of ginger left over from the infusion process that actually added to the flavor and drinking experience. Now, I am not one to love ginger when it is not subtly utilized, but this is an exception. The ginger taste was strong, but not too sharp and spicy, so a definite success! GOOD: Location. I love the back-alley feel of the joint.  I went there in the middle of the afternoon, but I can imagine the interesting mix of people the place might draw later at night and at lunchtime.OKAY: Soup.  I had the asian chicken soup.  Now, I have to say the concept is interesting.  And from Top Chef, I have learned this: the concept was great: chicken soup with white meat chicken breast and asian inspired vegetable mix and hints of ginger and other Asian Spice.  Unfortunately, the bowl I received was NOT fresh.  It was actually kind of old.  The chicken was so dry and tough.  The vegetables were cooked until they were soggy.  But, it tasted good, does that make sense?I really like Past Perfect, I not only recommend it, I would LOVE to go there again if I were to return to Nashville.", "Date": "2008-12-09", "Author_Location": "Trabuco Canyon, CA"}, {"Author": "Amanda W.", "ReviewID": "tN64abNgurjNVmVTQIFkqA", "Overall": "4.0", "Content": "Upon each visit, it boggles my mind that this place doesn't have more patrons. Then again, it could just be me and my timing. When I'm downtown looking for a post-event dinner or a delicious nightcap after a night on the town, Past Perfect is... well, perfect. And open till 3am on Fridays and Saturdays.There's something about this place that I love. The swanky atmosphere? The daily specials? The creative house-infusions? The brilliant Past Perfect sampler with Beer Cheese, Hummus and Black Olive Tapenade? Forget it... all of the above!Menu-wise, I've only ventured between the Alamo Wrap and the BBQ Ranch Wrap. While they're both solid choices, food typically isn't a factor in my decision to visit this establishment. You feel me?For my fellow liquid dieters, however, hold your horses while I ramble off some recs!Swing by on the weekend for a 10am-2pm brunch featuring a build-your-own Bloody Mary bar! If you're not that adventurous, at least order a diet coke with the cherry infused vodka.Otherwise, you got your $5 Classic Cocktails on Monday, $3 Infused Shots on Tuesday, $5 house wines on Wednesday, $5 Mojitos on Thursday, $5 Margaritas on Friday, $5 Champagne Cocktails on Saturday, and a one-two punch on Sundays with $3 16oz PBRs AND $5 Infused Martinis.Whether you're roaming downtown with a big party or flying solo, Past Perfect has the cure for what ails ya! Seven days a week.", "Date": "2012-01-24", "Author_Location": "Nashville, TN"}, {"Author": "Erin M.", "ReviewID": "j9jycFJXIDRwDgmYInS2Ag", "Overall": "3.0", "Content": "On the surface this is a great establishment. It's off the strip of insanity that is Broadway. It's weird looking. It's not packed with 50 year old women on vacation away from Alabama spilling bud light all over the front of themselves while jiggling everywhere to Taylor Swift covers. There are huge jars of infused vodka. The cocktail list is varied and delicious sounding. In reality it was mediocre. The Tales from the Crypt lookin-ass bartender was inattentive. There were about 5 people at the very long bar and he spent most of his time ignoring us and our empty drinks and desire to order food and instead bullshitted with the other folks. My drink tasted like there was some kind of strange powder mixture in it. While I'd much rather go a couple blocks over to Merchants, where the bartenders are friendly, warm, and unfailingly on point- I'm going to try Past Perfect again. I have this weird yearning to have a better experience there.", "Date": "2010-10-13", "Author_Location": "New York, NY"}, {"Author": "Jennifer P.", "ReviewID": "uFmenyCGaPSFxrk-8u6h6A", "Overall": "4.0", "Content": "I've never tried the food here, but the cocktails were outstanding. With bitters and flavor infused liquor... the drinks were delicious, complex and inventive. A little on the pricey side, but you definitely get a drink that's light years better than your standard cranberry vodka or whiskey sour. We even tried one that had whipped egg whites in it! As weird as it sounds, it was totally delicious.The atmosphere is really great and they also have a really fun trivia night too.If you find yourself on Broadway searching for an option that isn't your typical Broadway experience, I would go to Past Perfect. You won't be disappointed.", "Date": "2012-12-14", "Author_Location": "Nashville, TN"}, {"Author": "Andrew C.", "ReviewID": "jqHRUf26rramoxbCEjhn1A", "Overall": "4.0", "Content": "Past Perfect is a much needed relief from all the acid wash jeans and cowboy hats that swarm through the 2nd street area. The restaurant (part bar, mostly restaurant) is located off a quieter stretch of road by the river. On a weekend night, it's pretty much dead. While there's a full bar and a long list of incredible infused liquors to get anyone well watered, it's traditionally more of a date spot/dinner spot. And that's fine, because it's nearly impossible to find that on the downtown strip and their food is pretty incredible. Especially the flat iron steak sandwiches. It's a darker bar, darker woods, nice bartenders, calm crowd.And they're one of the only places downtown that serves food until 2:30. Not many people seem to know that, so says the bartender.", "Date": "2010-10-17", "Author_Location": "Portland, OR"}, {"Author": "Morgan L.", "ReviewID": "aON0U_9WHzZ7GHA2xJB9dg", "Overall": "4.0", "Content": "I lived in Nashville for way too long before discovering Past Perfect. Don't be like me! Downtown parking and traffic makes it impossible (at least for me) to be a regular here, but if you already work downtown or if you're heading to a hockey game or a concert it's the perfect place to stop before or after. It's definitely one of downtown's hidden gems. Up until today I'd only been to Past Perfect for the drinks. They have a giant list of infused vodkas, a great happy hour and more often than not a sign out front with a drink special for the day. It's speakeasy-meets-lower-Broad - the drinks are so much classier than what you'd get at your average bar on Broadway, but I wouldn't call them artisan. It's a nice in-between. I stopped in today for lunch and was surrounded by people raving about their bloody marys, though I didn't partake. (side note: Sometimes I feel like the only person on earth who can't stomach the idea of drinking tomato juice. C'est la vie.) My friends and I all ordered off the brunch menu, because seriously... Who can resist eggs smothered in hollandaise sauce? I got the Eggs Chesapeake, two halves of an English muffin topped with roasted red peppers, crab cakes, poached eggs and the aforementioned hollandaise. It was delicious. The hash browns that accompanied the meal were nothing to write home about, but who am I to complain about potatoes and cheese? One of my friends ordered a similar dish but with steak instead of the crab cakes, and my other friend ordered the biscuits and gravy. If you never thought of biscuits and gravy as a meal, think again! We all loved our meals. Prices were around $10 for everything on the brunch menu, the regular menu is similar with dishes ranging from $8 (burgers, wraps and sandwiches) to $12 (pasta dishes) to $18 (steak and ahi tuna). Pro tip - There's a putting green upstairs.", "Date": "2011-03-26", "Author_Location": "Nashville, TN"}, {"Author": "Ian R.", "ReviewID": "I3_CKuanm461Zjb4G_-usw", "Overall": "2.0", "Content": "Man, what a disappointment.  Past Perfect is one of those places that seems to have set their sights on a good target, yet missed completely.  From a distance everything looks great, vintage cocktail, infused vodka, speakeasy vibe, big menu, etc.  Only up close you realize that the cocktails are not good, throwing fruit in cheap vodka does not magically make it awesome, a speakeasy vibe can easily cross over into dumpy really quick, and a big menu of stuff that is not that good is a huge letdown.  On my last visit I actually booked the upstairs private room for a social function.  We had 25 people and had pre-ordered food so that we could enjoy ourselves and have some quality drinks.  Firstly the food did not come until we had been there for over an hour.  That would be a long time if you ordered it walking in the door, but if you pre-order it is ridiculous.  Second the cocktails were terrible. I had a sazerac and my friend had a manhattan, very basic cocktails.  They came out watered down (basically clear), bland, and amateurish.  Unfortunately the prices were not far off of other fine bars in Nashville whose cocktails are infinitely better (cough..holland house..cough..308).  Of course when the food finally arrived it was thoroughly unimpressive.  To top it off when I had to use the gentleman's room I saw a kitchen staff member walking out of the bathroom with a large metal mixing bowl.  I walked in to find that he had dumped a huge amount of ice in the urinal.  I have no idea why the hell ice was dumped in the urinal and not a kitchen sink or what that mixing bowl was used for afterwords, but I did not touch the food following that.   It honestly blew my mind as to what scenario that would be appropriate and was one of those things that make you question a whole establishment.  Overall Past Perfect is kind of like that girl that you run into in the back of a bar in downtown Nashville.  Looks good in the low light, seems nice when you can't hear what she is saying, has a nice smile.  Once the harsh light of day hits however you realize that the looks are three inches makeup, the voice is broken glass, and the smile is actually urinal yellow.  Maybe that is why it was filled with Ice.", "Date": "2011-09-02", "Author_Location": "Nashville, TN"}, {"Author": "Z K.", "ReviewID": "NEkhLeEcUCUUoY5T4SalFw", "Overall": "5.0", "Content": "Ok, this place is nothing less that awesome! Whether you are going there for lunch/dinner....have a buffalo burger! They have several infused vodka's so the drinks are the bomb.....not sure which to choose, or what to drink just ask the friendly bartenders and they will mix you up something that tastes fabulous!SUNDAY.....go for the bloody mary bar! Try infused cucumber vodka in yours, then make it however you like it! It's an awesome locals favorite!!!!", "Date": "2013-03-09", "Author_Location": "Longmont, CO"}, {"Author": "Kat J.", "ReviewID": "fpU4GaFYkNUb8dI09KU0LQ", "Overall": "2.0", "Content": "I have been to Past Perfect 5 times now and only once have I had a good experience and I believe one of the owners was serving us that time.  Every other time I have been there the service has been unbelievably slow, the wait staff was obviously having trouble with the bar staff, on two occasions my waiter has been overly snarky with our table, and once I even had a very long hair in my pasta salad.  The waiter did not even apologize when I told him.  I work in the food industry and have been mortified over lesser issues.  I will probably not ever go back.  Too bad.  The food is great.", "Date": "2011-01-31", "Author_Location": "Portland, OR"}, {"Author": "Caitlin D.", "ReviewID": "ecIKTUeVo-52LwVXaFFu-w", "Overall": "5.0", "Content": "I came here to watch the Laker's game the other night, my date wanted to show me this little treasure of a spot. Luckily he has fantastic taste, because I loved the food and drinks! The interior is dark and old fashioned, you feel like you're in a speak easy.  I had a mojito, which was just right... not too sweet, yet still refreshing and tasty. He had some sort of cocktail that had pasteurized egg white, I forget what it was called, but it was great too. We split the steak salad (steak was cooked rare and PERFECT), and also a bbq chicken wrap with pasta salad. It was just the right amount, their portions are generous. The food was very flavorful. I saw on the menu that on weekends, they have brunches with a bloody mary bar. I'll for sure be hitting that up! Also, every night of the week has some sort of special. wednesdays they have $5 spaghetti dinner night, I think it includes salad and roll. Try it!", "Date": "2009-06-09", "Author_Location": "Nashville, TN"}, {"Author": "Joshua B.", "ReviewID": "UtIN1ETdLJQaWXnjmxNjgg", "Overall": "4.0", "Content": "A few weeks ago I went to past perfect after a Predators game.  The goal was to avoid some of the 'post game' traffic.  I mean, I was going to be sitting around waiting for the traffic to thin out ANYWAY - why not enjoy that time and waste less gas in the process?  So, my friend and I walked around downtown for a few, past the hotel, past the Schermerhorn Symphony and we were going to go to the walking bridge to take a look at Nashville at night.  However, beside the bridge we saw 'Past Perfect'- which neither of us had been to in a long time.  And I'd heard about the Vodka infusions from another friend of mine.  So, we thought - lets stop in, have a drink or two and some appetizers.  So, we did...and I have to say - the Vodka infusions were interesting AND tasty!I had a couple myself - the Root Beer vodka and the Bubble Gum vodka.  The Root Beer tasted just like those brown little barrel candies.  The Bubble Gum - well, it tasted like double bubble.  And they were pretty good on their own - no mixers required.  However, I imagine they might be good with a little sprite or seltzer water.  But that's me...Me likey bubbles!For appetizers we ordered the spinach artichoke dip which was REALLY good!  I have had some before that wasn't very good - but, I tend to enjoy sharper flavors for the cheese while others don't.  This was on the sharp side so its was great to me.  They served this with pita bread, which was nice.We also had the chips and salsa.  It was OK.  Not sure how you'd screw it up anyway - so, it was good but nothing special about it really.I can't really comment on dinner or any other 'meal' items as I haven't had dinner there in a while.  But the vodka infusions alone were worth it.  It's made me want to experiment at home with my own ideas.  But, it is worth checking out as they have an extensive list of infusions.  I had a ton of ideas of things I'd like to try in a drink.  To me, the list of vodka infusions resembled the back of a jelly-belly variety pack.  So many flavors!!  And, I was thinking - what if I mixed the infusions?  Like, Banana, Strawberry, Vanilla and then maybe some baileys or some Godiva chocolate liqueur...would that taste like a banana split?  Would the Lemon Vodka and Lime vodka just taste like sprite?  If you added sprite to it - would it taste like anything?  LOL  -  I don't know - but it has my mind thinking of all kinds of tasty, interesting ideas to get me drunk!!  I don't know about the rest of the menu but the infusions were great, the bartender was friendly and the appetizers were tasty.  I don't want to give it a full 5 stars because I haven't been able to have a sit down meal there...and it is primarily a restaurant.  So, once I'm able to go and have dinner there - maybe I can bump it up to 5 stars.  But for now - I'm a fan.", "Date": "2011-02-23", "Author_Location": "Nashville, TN"}, {"Author": "Charles S.", "ReviewID": "tm3R9p8pkaBK8K3xslsl_Q", "Overall": "4.0", "Content": "If I ever find myself downtown and in need of a quality meal at a reasonable price, I usually end up at Past Perfect. There's something you should know about me. I hate waiting in lines. I know that most restaurants don't actually make you wait in line, at least not in the way they did in grade school, where I was initially set upon the path of hating to queue. Nonetheless, if I walk into a restaurant because I am hungry, I want to be able to eat now, or at least be seated and able to place my order. I know this is \"unreasonable\" to some, but, if I am told there is a thirty minute or hour long wait for a table, my mind immediately begins to calculate the driving time to other nearby restaurants where the wait may not be as long. But, I digress...One of the main reasons I love Past Perfect is that no matter what event is happening or whatever time of day, you can usually sit down at a table immediately; I've never personally experienced a wait longer than five minutes. Sure, a couple of times we had to eat at the bar because the restaurant was woefully understaffed, but even while understaffed the bartender provided excellent service and our food was served quickly. Oh, I nearly forgot the food. They have an eclectic assortment of items on the menu; I'd worked my way about halfway down the burger list when one night I decided to listen to my wife's suggestion and try the meatloaf with spaghetti. I know, I know --meatloaf with spaghetti? Don't knock it until you've tried it, ladies and gents. The meatloaf is subtly spicy and incorporates a blend of fresh herbs that I have nearly completely identified and been able to replicate at home. The pasta is always al dente and the dish is covered in Parmesan. I'm nearly salivating just thinking about it as I type. The drinks are yet another reason to come. They have a great deal of liquor infusions with ingredients more varied than you can imagine. The bartenders combine them into classic cocktails that are a little on the pricey side, but I almost always have at least one Sazerac. In short, Past Perfect is great for before or after a downtown event. The menus, both food and drink, are eclectic and reasonably priced. It's my first choice for dinner downtown when I'm making last minute plans; I never have to wait in line because I didn't make a reservation.", "Date": "2012-06-05", "Author_Location": "Nashville, TN"}, {"Author": "Jon S.", "ReviewID": "G8Yyw7pSF5PIvLe1pIOWVw", "Overall": "4.0", "Content": "The bison burgers are a score! So much more flavor than a regular hamburger. It's a whole 1/2 pound of meaty goodness, and probably better for you...maybe?Have to admit, I was a couple of Fireball whiskeys and Coors into the day, so I cannot remember a whole lot more. However, I remember that our server was very pleasant.", "Date": "2011-06-13", "Author_Location": "Nashville, TN"}, {"Author": "Gregory R.", "ReviewID": "5ANwpbAMnz6UcW4zFrsRMg", "Overall": "2.0", "Content": "This restaurant disguised as a bar was a big disappointment. Checked this place out for lunch one day last week and the lunch special of the day was spaghetti. Just noodles and marinara. Maybe it was amazing, but also not something I would ever pay money for when I could make it at home in 8 minutes. I could have been missing something though because there was at least one plate of it on every table around us.The menu is all over the place. Some things sound upscale and others sound like cheap bar food. Just check out the photos. The meals do not match the location. I guess it's one of those rare places where you can go if you like rare ahi and your friend likes pizza hut. There's something for everyone. I prefer a clear concept.Split a burger and a steak sandwich with the lady and we both agreed that the first couple of bites were good, but we didn't really like it by the end. Definitely won't give this place another try.Also, I'm not a big fan of sitting down to a sticky washclothed table and peeling my menu off of it. Kind of random, but this is a big restaurant turnoff.", "Date": "2011-08-09", "Author_Location": "Nashville, TN"}, {"Author": "Alex V.", "ReviewID": "oJX55Nuj2j8W7ZHlTGhiKw", "Overall": "1.0", "Content": "Ok, so we went there with my girl's best friend who raved about this joint. Well, the menu looked interesting and eclectic, right up our alley. Not so fast.... We ordered the Chik quesadillas for appetizer while we waited for our friend to show. Wow, it looked like a 10 year old put this together. Raw onions, the cheese was not melted and the chcken was cold. We then ordered another appetizer that she recommended the app platter. Hummus, pita, some kind of cheese dip, and some other crap. It was not good. Sorry. I did tell the server and he gave us the smirk that says I am sorry but that's what you ordered. OK...I ordered the Hangover burger, which includes a fried egg on top of the bacon. I figured that this one will take care of the other food that we did not agree on. Well, it was good, but not good enough to make me say DAMN... My thoughts, offcourse are based on my palate, which is pretty open minded. I can only pary taht your experience is better...The place did look cool and the decor was clean and not honky tonky...", "Date": "2010-12-10", "Author_Location": "Boca Raton, FL"}, {"Author": "Jamie D.", "ReviewID": "KvL7-BjAe31AnrzdiT5O0w", "Overall": "4.0", "Content": "You might walk past this perfect little spot while downtown. Well, keep it local!Infused vodkas! Infused vodkas! INFUSED VODKAS! Awe shoot - these are amazing. You have to go online and check out their menu on these. The happy hour is the prime time in the current time.  This ain't no Back to the Future. This is my future is looking even better after some mango infused vodka.The prices are a hair high. But, to me, that's good. That keeps the clientele a bit classier too. We all had food this evening and were very happy with our selections. I had one of the 5 oz steak sandwiches and was taken-a-back by the tenderness. Don't you glare at the decision to get the smaller portion sometimes. Yes, I looked at myself with disdain on this one. = Steak sandwiches (should have got the 10oz) are off perfectly cooked, the bread is perfectly toasted and pasta salad was good. The pasta salad seemed homemade and was your common elbow mayonnaise cold pasta. There is a bar to sit at, plenty of high top tables, reg tables and when they open the doors; fresh downtown summer breeze. Park at the Pinnacle and pay the guy. It's just easy after that.", "Date": "2011-03-15", "Author_Location": "Nashville, TN"}, {"Author": "Stacy P.", "ReviewID": "pLFNYKgaA3EscFhD_ARTDw", "Overall": "5.0", "Content": "A nice break from the touristy area!!  Meatloaf & burger was awesome!  The bartender Cooper was way friendly & a pleasure to talk too!!  Right across street from The Johnny Cash Museum.... Also a must see for any Cash fan", "Date": "2013-09-23", "Author_Location": "Alpine, CA"}, {"Author": "Ryan T.", "ReviewID": "qcBYTg8xlgLPIMIQUfaUGQ", "Overall": "1.0", "Content": "My friends from out of town and I stopped in after a Titans game; we were in a good mood and looking forward to some bar food and a couple of beers.  We were greeted by a the grumpy buzzkill of a bartender.  He didn't recommend the food we attempted to order.  When asked if could make us a round of creamsicle or apple pie shots, he said, \"no\" and that he didn't know how.  We then asked what specialty shot he could prepare to which he replied, \"uhhhh, I really don't make any.\"  From our brief and disappointing experience, we gathered that  the bartender doesn't like Past Perfect's food and could care less if anyone drank anything.  Our advice:  if you go to Past Perfect, then stay at least 15 feet away from the grumpster at all costs.", "Date": "2013-11-15", "Author_Location": "Nashville, TN"}, {"Author": "Molly A.", "ReviewID": "10WFY-pG4aeeMN1sCdkaqA", "Overall": "4.0", "Content": "The first amazing thing about this restaurant is the Bloody Mary bar. We went for breakfast/lunch on our last day in town, and because it is slightly off the beaten path, it was NOT crowded, so we had the place to ourself. I also loved all the amazing vodka infusions. I chose the horseradish vodka for my Bloody Mary and mixed a perfect concoction for myself. The food was wonderful too - so many choices! I had a veggie wrap and it was a wonderful choice - hummus, broccoli .. mmmmm! AND they don't have a fryer, so no french fries, but they make their own potato chips! I thought they were delicious and crunchy. Dan's bison burger was unbelievable. He got one that an egg and all other sorts of amazing toppings. As soon as I had a bit of his, I was a bit sorry that I hadn't ordered a burger. One of the other folks we were with had a dish with steak and eggs - it was the first time I'd ever heard anyone complain about \"too much steak.\" Sounds like a good problem to have, if you ask me! This place was a great lasting impression from Nashville!", "Date": "2012-06-15", "Author_Location": "Chicago, IL"}, {"Author": "Jamie A.", "ReviewID": "2fmfTpmhv3cQy2g2x3voxw", "Overall": "5.0", "Content": "I joined a party of 15+ (yep, that many) Saturday night for a pre-bachelorette party dinner.  7pm on a Saturday.  The service could not have been better.  We had one primary server (I believe) and a few that helped out when delivering food, etc.  She was happy to answer any questions and provided excellent drink recommendations.The food and drinks were fantastic.  I had the gorgonzola open faced steak sandwich.  I kind of disassembled it to eat, but every element was spot on.  For drinks I enjoyed a Singapore Sling (very sweet...I'm glad I had this pre-meal) and a Pink Lady.  Both were very well made and tasty.I don't go downtown much, but when I do I will be sure to keep Past Perfect in rotation.", "Date": "2010-03-22", "Author_Location": "Belmont/Hillsboro, Nashville, TN"}, {"Author": "Laura C.", "ReviewID": "ZZvUaPQYS3aF7VnvALNpmg", "Overall": "2.0", "Content": "I was really craving BBQ, which they don't have, so that may have skewed my perception of this place. The service, though, was pretty crappy and the food was nothing special. The quesadilla I had was yummy, but the fried green tomatoes my boyfriend got were not good. It wasn't the worst meal of my life but I won't be coming back next time we're in Nashville.", "Date": "2013-07-07", "Author_Location": "Denver, CO"}, {"Author": "Jeff W.", "ReviewID": "1qlWrNnq8tjS4QFK0nEkGg", "Overall": "1.0", "Content": "I have know of this place for several years and dropped in a few times.  Last month my wife and i were going to a concert downtown and stopped in.  The bartender (some 30 something guy) almost ruined our evening.  How the owner puts up with someone that is as rude and uninterested in the restaurants clients, is a mystery.  The food is pretty good, drink and food are both slightly over priced for what it is, but not crazy expensive.  I realize it may be difficult to find good help, but hiring people that cause you to lose business is not the best way to be successful.  We likely will not be back. What a shame.", "Date": "2013-12-05", "Author_Location": "Nashville, TN"}, {"Author": "Emily H.", "ReviewID": "xjesZLa284yrEfXNQrm9DQ", "Overall": "1.0", "Content": "What a disappointment. We arrived at Past Perfect at the suggestion of one of my best friends, who enjoys their specialty cocktails.  Initially I thought the atmosphere was pretty cool, with the abundance of wood and portrait of Abraham Lincoln and the lighting behind the bar, but the admiration I had for the decorating was soon replaced by surprise over the horrible service and embarrassing food.  Our waiter had NO charisma or manners, and made us feel like we were a burden.  (The sign said the kitchen closed at 11 and it was only 9pm.)  Instead of asking what we'd like he would just say \"Next\" and grimace after each person placed an order.  When we passed our drink glasses or empty food plates to him he would make this \"give it here\" motion repeatedly with his hands, like we were wasting his time.I appreciate they had something vegan on the menu but...they should really think about whether the dish is actually GOOD before they choose to serve it.  Whether vegetarian or not, each dish represents the tone of their restaurant and the talent of their kitchen. We ordered the tofu and vegetable stir fry in hoisin sauce.  The vegetables were overcooked, and the hoison sauce (while having good flavor) was thick in some places and watery in others. The tofu wasn't fried or grilled or marinated, it basically tasted like someone just cut up a block of tofu and heated it up.   There are a lot of great things that can be done with tofu that don't take much time or extra ingredients- preparing the tofu any other way would have been more appetizing.  For $13 I expected more.I don't ask for much from restaurants other than they make you feel welcome and serve you food worth paying for.  Past Perfect failed to deliver on both points.", "Date": "2012-04-10", "Author_Location": "Richmond, VA"}, {"Author": "Megan C.", "ReviewID": "ZsNZMr1aEIhNPYswllJ-ig", "Overall": "3.0", "Content": "It might be because of the somewhat non-conventional 'off the beaten path' sort of location and vibe that has brought my group of friends here for dinner a few times.  It's tucked away on a very poorly lit stretch of third avenue which actually makes it the perfect dinner location when you're trying to get a meal before some sort of downtown event-concert, play, game, etc.  Mainly because all of the other people going to the concert, play, game, etc won't know about it and you'll be able to get a table.  Past Perfect is a vodka infusion bar and has an EXTENSIVE cocktail menu.  They've also infused vodka with nearly every flavor that I could think about going with vodka and even a couple that aren't as easily though about.  The service here has always been friendly, even if times a little slow.  And the food's pretty good too.  I'd recommend any of their bison burgers and recently enjoyed the Ahi tuna wrap.  As typical for downtown, parking is pretty terrible-a spot on the street is about the best you can ask for.", "Date": "2011-01-31", "Author_Location": "Nashville, TN"}, {"Author": "Nickie G.", "ReviewID": "6clS9mGaQ4G5IAyW1zeBNQ", "Overall": "4.0", "Content": "So Past Perfect is a little off the beaten path - down 3rd about a block from Broadway.  Thus, it gets less traffic than other places which is the most perfect thing in the world when you are looking to eat and drink before or after a show at Bridgestone.So the parents and their friends were coming downtown for the Brad Paisley show and we all wanted to meet up and drink and eat.  We got here and the place was pretty dead - perfect!  They seated our party of 6 immediately.  We perused the menu - if you look online the menu seems very extensive and kind of schizophrenic, but they must have narrowed it down some because all those choices weren't on the menu I saw.For dinner I had the steak sandwich with gorgonzola and chips.  Chips were ok - I was expecting kettle chips like the ones you get that are kind of soft, kind of crispy homemade chips.  These were more like from a bag.  But I haven't met too many chips I didn't like so whatevs.  The sandwich was open face on two slices of toast.  The steak was perfect medium rare and while it lacked a little somethin' somethin' it still hit the spot.  Who cares about food anyway when there are vodka infusions on the menu?  Tons of flavors - to the point where you can't make up your mind what to get.  I tried the bubble gum - excellent!  The mango - fruity, think he mixed it with pineapple which wasn't my 100% fave.  The blueberry - ummmm this one hadn't infused long enough and tasted like rancid vodka mixed with soda.  Ew.  Lemon was pretty good mixed with Sprite.  Cherry with diet coke was tasty.  Overall a success!  And happy hour every day until 7pm means you can get your drinks for cheeeeeeaaaap!  Beers were also cheap and came in huge mugs.Our waiter was pleasant as he could be and since he mentioned he hadn't been working there very long I didn't get frustrated (too much anyway) when I had to ask 5 times for a diet coke.  He was killing me with that for a bit though.  Otherwise he didn't forget anything else and seemed fairly on top of things.The space was dark and felt like a speakeasy vibe.  Not understanding the bars with the shrine to Abraham Lincoln though?  Weird.  They have an upstairs too with tables.  We heard there was a Wii and putting green but I never saw that - perhaps we heard wrong!Overall I would put it on your rotation when you don't want to deal with the crowds on lower Broadway or if you want to try some tasty vodka creations.", "Date": "2011-03-02", "Author_Location": "Nashville, TN"}, {"Author": "Justin R.", "ReviewID": "AvlM4WzS8gj8KrRVbHIVHQ", "Overall": "3.0", "Content": "Past Perfect is a very interesting place, to say the least. My girlfriend and I gave it a shot on July 4th, due to its location close to the fireworks and because we had a deal with ScoutMob. The service in this place was pretty awful. We walked in the door where there is a sign that reads, \"Please wait to be seated.\" So we waited, and kept waiting. Since no one was even acknowledging us, we grabbed some empty seats at the bar. Where we again waited. It took the bartender about ten minuted to come over to us and say, \"I'll be with you in just one sec.\" Really? If you're into vodka, you should give this place a shot. They have a lot of different infused vodka flavors. My girlfriend tried the cucumber vodka and soda. Even though it was refreshing, I think it was a lot sweeter than she wanted it to be. And did I mention they have huge ass beers. 24oz mugs. Which I think you can get for $5 during happy hour. The burgers were great. I strongly suggest the Hangover Burger. They make all their burgers with Bison, which is incredibly lean but so tasty. The burger is topped with two types of cheese, two friend eggs, tomato, bacon, and Horseradish Mayo. It was delicious. My only complaint was that the eggs were a little over cooked for my liking (I like them runny) and the burgers were not served with fries (only because they don't have a fryer). They were so good that my girlfriend cleaned her plate, which I have never seen here do. Overall Past Perfect is a good place to grab a huge ass beer and a delicious burger. I can't see making a special trip down there, but if I'm in the area, I will for sure stop by again.", "Date": "2011-07-06", "Author_Location": "Nashville, TN"}, {"Author": "Amanda C.", "ReviewID": "Ah6iIb-CA0IleuV8ipjogA", "Overall": "4.0", "Content": "I am a big fan of Past Perfect.  I went on the day Amanda W. had her ROD there.  I was super excited to try it after reading her review.For lunch downtown, they have solid options.  I had the veggie wrap and it was very tasty.  The flour tortilla was warm and inside of the wrap it was a solid vegetable party.  Lots of carrots, broccoli, lettuce, hummus and peppers.  It was great because it wasn't drenched in dressing and all the veggies had a fresh crunch to them.  My co-worker is more of a carnivore, and he liked his sandwich as well.One of my favorite parts was the decor.  I loved the color and ambiance of the place.  Rich reds, old school art work and exposed brick walls really did transport me to the past.  I am really looking forward to trying this place out for happy hour one day.  The infused vodkas looked really yummy!", "Date": "2012-06-20", "Author_Location": "Brentwood, TN"}, {"Author": "Betsy R.", "ReviewID": "cHzVcZXPz0hYW3EdTNX_Jg", "Overall": "3.0", "Content": "Okay, so the service is bizarrely uncomfortable. We felt like we were in the twilight zone whenever we encountered any of the staff. I don't know if they are all struggling musicians who don't particularly care about their day job of waiting tables, but it was a struggle to get a table, to get a menu, to place an order, etc. The food was okay, and the decor looked like it was trying to be a prohibition-era speakeasy, but it really just came across as a little tired. I'm done with the negativity, though, because not only do they have a classic cocktail menu, but these people OWN these drinks. We all had killer drinks--whether it was a classic martini or a new and inventive concoction, they were strong and smooth. They infuse all of their own vodkas, they make their sour mix with fresh egg whites,  and are seriously just bosses. The drinks redeem this place on every front.", "Date": "2012-11-12", "Author_Location": "Providence, RI"}, {"Author": "Brad T.", "ReviewID": "38BG70vc-cGNqQV6gSSEaw", "Overall": "3.0", "Content": "As of this writing, the overall review was at 3.5 stars, and if I could give this that exact score, I would. We wandered over here for an afternoon drink, and was instantly charmed by the bartender. She was extremely nice and really made the experience for us, especially because in this odd mid-day Monday visit there was absolutely no one in the bar and nothing going on.I tried two of their funkier cocktails, the Perfect Mule (I think!) and the Singapore Sling. I'd never had either before, and the Mule was probably the tastier of the two. Using ginger-infused vodka, lime juice, and root beer, this drink was a really nice surprise. The Sling was also very good, but I think the flavor was more just not my thing, nothing against the way it was made.Since we tried no food and got almost no idea of what the usual atmosphere is, it is tough to give this a higher review. The place was decorated great, it had a fantastic selection of alcohol (including plenty of infused vodkas and homemade mixers), and even a small absynthe tap. It seems like the kind of place I'd really warm up to with time, but time was not on our side. I'd definitely go back next time I'm in Nashville, and I'd at least recommend this place for a fun cocktail.", "Date": "2009-04-13", "Author_Location": "Ann Arbor, MI"}, {"Author": "Geoff T.", "ReviewID": "YUs6dFcAPNvv07GljUlhEw", "Overall": "4.0", "Content": "My 4-Star review is actually a 3.5 rounded up. Though I am not completely in love with Past Perfect, I have found it to be a great place to go when you want a nice drink or a decent meal downtown without a wait list, annoying music or ridiculous prices.Past Perfect is just slightly off the beaten Broadway path. When you walk in the door, the speakeasy theme hits you right away. It's not as upscale or trendy as other cocktail taverns in town (ahem, Patterson House), but that means you pay less for food and drink that comes close in quality. The house-infused vodka selection is immense, and their classic cocktail list has some interesting options. The menu is upscale pub food, with great bison burgers, several salads and pasta options. Their \"Specialties\" menu selections have some great takes on meatloaf, Hawaiian moco and seared tuna plates.My best experiences have been at brunch on a Saturday or Sunday. The Perfect Steak Benedict is an excellent take on Eggs Benedict, and I found the presentation to be better than your typical Nashville brunch spot. The Bloody Mary bar was also a great pick - simply choose a vodka flavor base (I recommend the cucumber) and add your favorite mixes and garnishments. Great hangover food.Past Perfect is best seen as a good choice for food and a drink before a game or concert. It's also a great place to start you recovery the morning after a night out.", "Date": "2012-01-12", "Author_Location": "Nashville, TN"}, {"Author": "Ben M.", "ReviewID": "nP6sMQM1Ip1SK5kWlOsESw", "Overall": "4.0", "Content": "I passed this place as I was driving around downtown Nashville. Despite its proximity to Broadway, I think you would never find this place if there wasn't a sign on the corner directing you. And even then, you would think twice before walking down the street, which isn't as lit up and open as 2nd Street. That said, it's always these types of places that have good food and drink, and good service considering the number of patrons who walk in.A colleague and I walked in a little before 8p during the week for dinner. When you walk in, there's a lot going on. \"Confusing\" is not the word I would use, but you do have to do a double-take. A framed picture of Abraham Lincoln (if memory serves) and a large-screen cabin television showing old short/silent movies can be found in the dining room, along with high-definition TVs showing sports. But, it's not like chain restaurants that hang random crap on the walls, covering them completely.The bar is fully-stocked, including their specialty infused vodkas in jugs behind the bar, and a display of available beers on tap and in bottles/cans. Yes, cans. Pabst Blue Ribbon and Old Style, to be exact. This is the first bar outside of Chicago where I've seen these two served, so that hipster style points (though I later learned that they were out of the latter). In addition, they had Genesee Cream Ale, a.k.a. \"Genny Cream.\" Since I didn't feel like vomiting that night, I opted for a safer beer.The food was good as well. I opted for a 5oz. flat-iron open-faced sandwich (also available in 10oz), while my colleague went with the beef tips. The portion size was surprisingly big, at least as far as the steak tips were concerned.Then we ordered dessert. We had our chance to have separate desserts, but our collective guilt forced us to select only one: The Derby Pie, a tub of pecan pie with brownies and wedges of vanilla ice cream, drizzled with chocolate syrup. It was phenomenal. I have dreams of this dessert, and wonder if I can recreate it at home. So much for guilt.Overall, great food for the money, and a memorable dessert to boot. Definitely worth a visit.", "Date": "2009-04-05", "Author_Location": "Quincy, MA"}, {"Author": "Sheena T.", "ReviewID": "2ZTlaeck77qiUKVnbdr-fA", "Overall": "5.0", "Content": "I freaking love Past Perfect. I have been more times than I can count, and it's always my go to place if I want a nice drink downtown away from a packed bar. I'll divide my review into two parts: Food:They have food specials each night, and I always like the Alamo wrap and the chips and salsa. The bison burgers are also fantastic. On to the good stuff:Drinks:Past Perfect makes their own vodka infusions, and they make my world go round. They have a variety of fruit and veggie flavors and a couple weird ones too (ie: bubblegum-it's good with sprite, give it a try!) And they have a lengthy classic cocktail menu that I go to (the Key Largo!) most of the time. I love taking people here for drinks when I want a place away from Broadway so I can have an actual conversation. I think the service varies sometimes because they get a wide variety of demand depending on what's going on downtown. Most of the time it's great, but you do have those nights where it's super packed from a concert or event and they don't quite have the manpower for the number of patrons. Don't let that deter you from this great bar!", "Date": "2012-07-24", "Author_Location": "Nashville, TN"}, {"Author": "Shelley V.", "ReviewID": "M0gj3021cF-UsH-aGys_Ww", "Overall": "4.0", "Content": "Second trip to Nashville, second visit to Past Perfect.Great place right off the craziness of Broadway - we stumbled into this joint to get out of the humidity and found a nice big bar, appropriately dark and with a variety of home distilled vodkas. They also make a mean ass bloody mary... Prices are reasonable, service is friendly and it is not filled with obnoxious bronco types or tourists.Now go there and have a Bloody Mary with the distilled peppery vodka, will'ya??", "Date": "2009-10-16", "Author_Location": "North Hollywood, CA"}, {"Author": "Shannon M.", "ReviewID": "RqA8wWd6W3XQUrtEZyZ5BQ", "Overall": "3.0", "Content": "Past Perfect definitely worth a visit if your downtown and looking for a nice dinner and/or drinks. Don't be a dolt and go to a chain!Quiet, dark and good service--as other reviewers have written.Tasty food too.  We had meatloaf that was pretty damn good--sauce tasted like it was made in house.  I didn't get to imbibe in the flavored vodkas, but I saw many, many flavors that tempted me!", "Date": "2010-03-10", "Author_Location": "Decatur, GA"}, {"Author": "Nathan W.", "ReviewID": "aXfB3eqAz9JHcXrJhcQxFA", "Overall": "4.0", "Content": "So I found this place totally by accident.  Out one beautiful afternoon, looking for a place to eat that wasnt crowded with tourists and loud people.  Down a quiet side street we stumbled into this place.  I wish it was busier, because the food was fabulous.  I think they are mostly a bar, but I gotta say the Meatloaf was stellar, like some of the best I have had.  Whenever a bar uses a \"demi glaze\" in their food, you know the cook has some chops.  Drinks were great, including a wicked bloody mary bar (sadly I am not a bloody mary fan).  I hope that this place stays busy because in a city of knockoffs this is a gem.Oh, dont be affraid of the entrance.  It seemed a bit like we had accidentally wandered into a strip club, but we didnt.", "Date": "2009-04-24", "Author_Location": "Nashville, TN"}, {"Author": "Lyndi S.", "ReviewID": "rdSOHjnpWmSdt56SDAJJWQ", "Overall": "3.0", "Content": "Did you say BISON? Oh, you did? Okay.I found this place thanks to ScoutMob, and I'm glad I did.  At least, I think I am?I walked in and noticed the setup of restaurant/bar, and immediately felt comfortable.  I saw a giant chalkboard of infused liquor drinks, yuengling on tap, and a pretty cool set-up as far as decor goes.  Not bad.  So, I sat there looking around, and waited just like the sign said: \"Please wait to be seated.\"  And I stood there.  And I waited.  And I stood there.  And I waited.  And then my boyfriend and I got annoyed and just sat at the bar, since 3 waiters walked by and not one person acknowledged us.When we sat down at the bar, it took the bartender about 5-10 minutes to tell us \"just one sec, I'll be right with you.\"  Really?  Okay - I'll wait...again.The staff was friendly, just slower than molasses.  Luckily, our drinks were made fairly quickly, and our burgers were ordered with the drinks.  I ordered a cucumber infused vodka and soda, and I was pretty disappointed.  At a bar where there is a coat of arms, a huge American flag, and old-time style menus and wall decor, I was hoping for a little less sugar in the vodka infusion.  I wanted a stiff drink, and I think I got a rather limp one.  Still, it was enjoyable.When the food came out, I forgot all about my drink, because wow.  I give the food an A+, because the bison burger was cooked to perfection and tasted like a little bit of heaven on a plate.  I got the Mercedes Jones, which is a mess of cheesy, barbeque-y goodness.  My boyfriend said it best: \"I've never seen you finish an entire burger.\"  I walked out of there full and satisfied with my meal.In a nutshell?  I wouldn't fight downtown traffic and/or parking for that bar alone.  Would I go back?  Probably.  But only when I get forced into a downtown venture by out of town guests.", "Date": "2011-07-05", "Author_Location": "Nashville, TN"}, {"Author": "Erin C.", "ReviewID": "4E6Vp01idSYLf5_Tll9lyA", "Overall": "4.0", "Content": "We went here back in November '07 for lunch on my birthday.  It was walking distance from work, so that's why we chose it!  Everyone really liked their food, & it was an enjoyable lunch, except for the fact that there seemed to be just ONE guy working, both as bartender AND server!  So he was stretched a little thin, and our service took a hit, but he was REALLY busy.My work buddies were just mentioning that we should go back sometime soon because it was good.", "Date": "2008-06-06", "Author_Location": "Nashville, TN"}, {"Author": "Paul K.", "ReviewID": "bOzgdaZczXWdIA7E8JrcMg", "Overall": "3.0", "Content": "When it's summer, this place is sweltering, when it's winter this place was cold.  There's no free parking (or I should say there are 2 or 3 spaces out front that you're not going to get) and the prices are high for alcohol.  That said, it's oddly an enjoyable spot.The staff seems to run hot and cold on different days and I never saw any pattern to it. The food is ok, but for vegetarians selection is limited and it's really nothing special and is overpriced for the taste and quantity you get.  The main claim to fame here seems to be a cucumber infused drink of some sort - I think it's a martini, but never did more than sip at someone elses.There's a room upstairs that in the summer 2 window unit air conditioners blow and attempt to cool the entire joint, it's kind of enjoyable up there with the mini putting green.The place is pretty dark, a good solid door and second floor availability may inspire you to think this would be a good place to hole up against the zombie apocalypse, but you would be wrong.  The place offers large tables, but would only slow down your undead attackers and the chairs are a tad on the flimsy side, the bathrooms are also hard to find and have multiple doors (at least the mens do), but were clean last I went.  I'm sure I don't need to tell you that multiple doors on the same wall means additional points of entry for the unholy walkers.Their desserts are pretty good as I recall, the area sort of feels like you're as far as you can safely go in Nashville before you hit total sketch.  I have friends who totally love this place, my experience has been I totally am in like with this place but I don't like like it, not in that way.", "Date": "2010-11-22", "Author_Location": "Nashville, TN"}, {"Author": "Donald D.", "ReviewID": "xrcY_DlZaPya--2Qhb0i2A", "Overall": "5.0", "Content": "Came locally recommended and was great after a 6 hr drive with 2 kids.  Very relaxed, comfortable feel.  Service was very prompt and timely.  We had the spinach and artichoke dip with tortilla chips and it is among the best I have had!!! Waaaaay better than any crapplebees or any place like that can put out.  For dinner I had a 5 is Athenian steak sandwich and it was full of flavor and very savory!   Excellent friendly place!", "Date": "2013-08-27", "Author_Location": "Columbus, OH"}, {"Author": "Elexa B.", "ReviewID": "8YQIFMtoa84Ln7syUh_7ug", "Overall": "4.0", "Content": "Really enjoyed both of our meals here, bison burger and steak open faced sandwich. We both had the pasta salad as sides, nothing special there, I prefer more of an Italian flavored pasta salad, not the mayo filled kind. It has an interesting atmosphere, rando old things like a suit of armor and piano. We used scout mob here which was a random find. The food is already around $10 an under so it was very affordable. Very nice older guy server. The restaurant is off a random road and problably won't have a wait because it's not on the crazy busy music row.", "Date": "2011-08-04", "Author_Location": "Atlanta, GA"}, {"Author": "Bryan R.", "ReviewID": "QkS-LTiVuAteJz__i6l-JQ", "Overall": "3.0", "Content": "We were on a trip to Nashville and were looking for some good food--preferably BBQ--close to the strip.  This place advertised burgers (regular and bison), so we came in (Note:  the door is pretty creepy looking and you feel like they're closed...they're probably not.  give a tug.)  I wasn't in the mood for burgers so I went with the meatloaf dinner, which was actually pretty good.  All the food that came to the table (a few burgers and apps) looked pretty good, and the infused vodkas were interesting but tasted a little watered down when they were in mixed drinks.  Not my first choice for places to eat, but a pretty solid standard one.", "Date": "2013-05-21", "Author_Location": "Seattle, WA"}, {"Author": "DeaconMSA W.", "ReviewID": "CdGWSJTb4zKtlzZsT2pEjg", "Overall": "2.0", "Content": "mediocre food.  OK service.  overpriced drinks for the dive bar feel.  and they dont have french fries.", "Date": "2013-06-15", "Author_Location": "Chicago, IL"}, {"Author": "Aaron P.", "ReviewID": "xcUvOaKT3Z3w2Jn61z0DKA", "Overall": "4.0", "Content": "really decent food. Great service. The infused vodka were a hit. I suggest a habanero gimlet, spicy and delicious! I had the steak sandwich. I think it could have been put together better. The steak did have good flavor though. If you're in the area give this place a try!", "Date": "2013-01-11", "Author_Location": "Bozeman, MT"}, {"Author": "Lauren S.", "ReviewID": "lP5zVRoYuAiA5xefMql_Rg", "Overall": "3.0", "Content": "Overall: Unique flavors for both food & drink.Food/Drink: It's one of the only places in town to get a bison burger. Don't let the name scare you, (it was my first one, too) but it was juicy and toppings (especially the blue cheese & gorgonzola sauce) really compliment the meat. The only side option (aside of paying extra for a salad) is kettle chips. Out of a bag. If you're feeling indulgent, another good dinner option is the gorgonzola chicken pasta. There are a few salad & wrap options if you're looking for something a little more health-minded, but I doubt there's anything on the menu that's uber healthy. The restaurant infuses its own vodka, and being a vodka girl, that makes me happy. My first experience went something like this me: \"can you suggest a flavor?\" bartender: \"bubble gum\" me: *blank stare* \"really?\" *long pause* \"ok.\" But I'm actually glad I went with the recommendation! It tasted exactly like bubble gum without being overwhelming. I suppose the point of my story is this: there are like 100 (ok, maybe 20) flavors so think outside the box.Service/Atmosphere: I've never had to wait for a table and the service is decent. It's hasn't ever taken a super long time to get food, but it isn't especially quick either. As far as atmosphere, it's right off lower Broad but it does do a fairly good job at distancing itself from the honky tonks. It's very exposed-brick-narrow-alley-ish-rustic but I think it kind of works with the menu. Cost: Bison burgers are $12 (which I'll admit is pricy for a burger) and infused vodka drinks I estimate to be about $6. Salads & wraps are in the average price range.", "Date": "2011-02-08", "Author_Location": "Washington, DC"}, {"Author": "Pat G.", "ReviewID": "zZyw9UVjT-zkxWlJiIQ8yw", "Overall": "5.0", "Content": "The burgers were delicious!!! We saw this on Yelp and decided to try it.  Just across from the Johnny Cash museum.", "Date": "2013-11-24", "Author_Location": "Lindenhurst, IL"}, {"Author": "Steph H.", "ReviewID": "8GtkVYQ7YvR9gvd8yfavmQ", "Overall": "3.0", "Content": "I've been waffling about what to write about this place for ages. Perhaps that in and of itself tells you (almost) everything you need to know.In my mind, the best thing Past Perfect does is offer \"Geeks Who Drink\" trivia night on Wednesdays which is super fun and always guarantees that laughs, along with liquor, will flow. If not for this event, I might never have wandered into this establishment, because truth be told, the downtown Nashville area is not my usual stomping grounds. But my love of displaying my abundance of random and often irrelevant knowledge needs occasional showcasing and that is when Past Perfect comes to the rescue. Although the event doesn't start until 8, if you can wait that long, you can get a plate of spaghetti, salad and bread for just $5, which isn't too shabby. (I should mention that the dinner special is available all day... my husband and I just don't turn up until 8 for the trivia!) The thing is, my husband and I never can wait, so we always end up imbibing heavily instead and then ordering various appetizers in a frantic attempt to soak up the alcohol in our system before we try to get home. Based on this, I can say that their spinach-artichoke dip has a really nice zing, and is best eaten with the grilled pita bread.The big downside for me about PP is twofold: First, the service generally isn't great. Often you can go ages without seeing your waitstaff and will have to engage in something akin to Olympics level rhythmic dancing to flag them down. Even though this place seems like more of a bar than a restaurant to me, they always seem slightly perturbed when you indicate you only want to order drinks. Additionally (and secondly), said drinks just aren't really that impressive in my mind. Much has been made of their touted homemade infusions, but I think a bottle of flavored Smirnoff is just as tasty. I had a cucumber vodka & soda and it was fine, but I didn't feel compelled to order another one. And the other mixed drinks I've ordered have had mixed success. You aren't much safer with beer either, unfortunately. One super annoying thing about PP is that they don't list prices for their drinks, so it's kind of a crapshoot about how much you're going to get charged. We found out the hard way that while two small beers = 1 large beer in terms of volume, the actual price is cheaper to order two small bears rather than the 1 large beer! Maybe this was a pricing error, but everyone at our table was shocked by this.This is one of those places that I want to like more than I do. The atmosphere is cool (they have a suit of armor), and the food I've had has been pretty yummy. But the drinks aren't great and definitely seem pricey (though you won't know that until the bill comes). Let's just put it this way: Trivia night is what introduced me to this place, and it's the only reason I keep going back.", "Date": "2011-03-28", "Author_Location": "Toronto, Canada"}, {"Author": "Jennifer C.", "ReviewID": "auos2lmQi7vs6vsZta4LmA", "Overall": "3.0", "Content": "This place is a little disappointing because the infused vodka is amazing and cheap when you go during Happy Hour. The food is really good but the service and atmosphere are just not great. I went once and sat at the bar and the bartender barely said a word. This past time I went the waitress sat and stared at me until I ordered something. I doubt I'd make it a point to go back again when I'm in Nashville unless I want cheap drinks. It's a shame because the restaurant is in a great location downtown and is walking distance to many things.", "Date": "2012-10-24", "Author_Location": "Raleigh, NC"}, {"Author": "Andreas H.", "ReviewID": "0mqgT5VfZjrAf0q7pzyYRA", "Overall": "3.0", "Content": "This place was difficult to read.  We were quickly seated in what felt like a hall in castle.  It was very dark and it felt like they were strictly relying on the light coming in through the front windows.  However, once we were seated we had a very nice server who brought us our lunch specials in a matter of minutes.  The open-faced turkey and meatloaf sandwiches were tasty, a little too salty, but hey it is what it is.  The prices were good, the food was A-OK, and the overall experience was only marred by the bizarre atmosphere.  I would probably hit it for lunch again if I were in the area.", "Date": "2010-10-03", "Author_Location": "San Francisco, CA"}, {"Author": "Stuart W.", "ReviewID": "iWCfSHgbSYFU-71-MjQH8w", "Overall": "5.0", "Content": "We were early arriving for the symphony, so we stopped in Past Perfect for a quick drink or two. We had been there before and remembered that it was nice, but - WOW.I can't comment on their food as we just drank, but again - wow. The bartender pointed out that it was happy hour and we had our choice of some fairly standard beers or Infused Vodka drinks for $3. Sounded pretty good, but then he showed us the list of over 30 infused vodkas they have. We were a bit overwhelmed and asked for retrogradations. Based on what we said we like, he made a lime-infused vodka tonic for me and an olive-infused dirty vodka martini for my wife.I can keep trying to wax poetic or just say that, flat out, that was the absolute best vodka tonic I have ever had - with no close second. The dirty martini was also so delicious it is hard to describe.We had a bit more time and so went for a second round. The second round was good (we foolishly decided to improve on perfection and try other drinks) but how could they compare? It was time to hear Holst, so we paid our ($12) bill and headed out, but we will definitely return, and soon.", "Date": "2011-03-06", "Author_Location": "Hendersonville, TN"}, {"Author": "Nate C.", "ReviewID": "0PgWlmXOHCTG1mBmW_CkyA", "Overall": "3.0", "Content": "past perfect is a downtown getaway w/o having to leave downtown. the decor is as it says, very classic themed. they need some flat screens to attract more people watch some games there b/c they still have old tv that's as bad as the black and white tv's. the food is descent. i tried their steak sandwich and it was ok. the price is high to the portion you receive. however, i do recommend their wraps. they have about 5 differnt wraps and come w/ chip w/ the flavors as you pick.", "Date": "2007-05-07", "Author_Location": "Los Angeles, CA"}, {"Author": "Jasmine S.", "ReviewID": "VWTULRrORvNmUXWXAwdSRw", "Overall": "2.0", "Content": "Was exploring Nashville and we decided to stop in for some food. Very quiet in there (noise and barely an customers). Only saw one employee (waiter and bartender etc). Waiter seemed nice. Took awhile to be waited on though. Food was excellent! Had Green Tomato Burger with Sundried Tomato Mayo and he had a deli type sandwich. Prices are a few bucks more than what is reasonable. Tried some infused vodkas (Horseradish and Habenero) which were good but I don't suggest as shots! I would eat here again, despite the prices. No parking close by!!! Seems dark and dirty in there btw.", "Date": "2013-01-31", "Author_Location": "Milwaukee, WI"}, {"Author": "Cara P.", "ReviewID": "EEZOXmr7X6Qoy_c5shSwLg", "Overall": "2.0", "Content": "Um...nah.  We went for lunch because my husband wanted to try their loco moko.  He liked it, but didn't think it was worth $13.  My grilled cheese was pretty uninteresting, and they forgot the bacon.  Menu seemed contrived and overpriced for what they offered.  And yes, I hold it against them that they do not serve french fries.", "Date": "2010-09-08", "Author_Location": "Mt Juliet, TN"}, {"Author": "Becca H.", "ReviewID": "sYoYJ1jcVwST2VPbfMEf-Q", "Overall": "3.0", "Content": "I was pretty dissappointed, I went here because downtown servers get 20% off but it didn't make a worthwhile difference. Our service was pretty lousy, we felt more like an inconvenience than guests and had to wait awhile to order, get drinks, etc even though the place was dead. Maybe I caught them on a bad day though, because my boss likes them a lot.", "Date": "2010-11-26", "Author_Location": "Nashville, TN"}, {"Author": "K D.", "ReviewID": "K2EJWD23qC9pYGQReuv0bQ", "Overall": "4.0", "Content": "If you're going out for a burger, this is a great choice. We went with a group of 9 and everyone enjoyed their burger. They will adjust any burger to accommodate your needs - and every one can be done angus or bison.It was fun to create your own cocktail from their extensive list of infused vodkas. For a non-sweet cocktail - try grapefruit & soda or cucumber & soda. For something sweeter, pineapple and pineapple juice.  For something more adventurous, there is always jalapeno pepper vodka with coconut vodka and pineapple juice.", "Date": "2013-01-20", "Author_Location": "Saint Louis, MO"}, {"Author": "Dina D.", "ReviewID": "QFEWOeRE6JvcIu2fLDGVLg", "Overall": "3.0", "Content": "This bar is off the main strip in downtown Nashville.  The food is decent, standard pub fare.  It's a cross between a dive bar and pub.  Upstairs are some tables and mini-golf.  Good place to go during the week as it's not crowded and easier to find parking.  Good place for a group.  The staff is friendly.", "Date": "2010-11-17", "Author_Location": "New York, NY"}, {"Author": "Sandy T.", "ReviewID": "pAcmPWvj5EdlCq5XTs0djw", "Overall": "3.0", "Content": "Good comfort food...very tasty...convenient location after going to the symphony or just walking down Shelby bridge....live music!", "Date": "2012-07-04", "Author_Location": "Nashville, TN"}, {"Author": "denise t.", "ReviewID": "ZBNnSiTTpfvp9y1ZrltRQw", "Overall": "4.0", "Content": "Meatloaf is excellent!", "Date": "2012-11-04", "Author_Location": "Raleigh, NC"}, {"Author": "Lauren A.", "ReviewID": "2KnYTmS0HQFJjVcP9xf9mg", "Overall": "4.0", "Content": "I really enjoy this place -  Its never crowded (although, maybe its just never crowded when I've gone - I'm sure game days it fills up - its right next to the pedestrian bridge).  The bar is really cool -  I love big huge bars - this place is kind of dark and cozy feeling.  On Wednesday nights they have spaghetti night - where you get a deal on a spaghetti dinner and get to watch spaghetti westerns!  I think they also have wii tournaments - as there is a wii hooked up at the bar to a nice flatscreen tv.  The drinks are great - they typically have about 20+ homemade infused vodkas/rums and they make their own bitters and aromatics.  They have a huge book of classic old cocktails, so make sure to look through it and pick out something interesting.  The Perfect Mule (I guess their spin on a Moscow Mule) is awesome - tastes like a root beer float! I haven't had many opportunities to eat here, but I've tried an appetizer plate a few years ago, and it was good - but I felt they could've given more pieces of flatbread for the amount of sauces you have on your plate.  They also have a bison burger that's pretty tasty.So I'd say - check this place out - but try to also keep it a secret because my favorite thing about this place is no one seems to know about it.  It's pretty amazing, too, since its only 1 block off the madness of Broadway - so the tourists don't seem to notice it!", "Date": "2009-09-27", "Author_Location": "Nashville, TN"}, {"Author": "Julie A.", "ReviewID": "8NJzXTigY-yo56TOFbd1Rw", "Overall": "4.0", "Content": "I came here late after taking people out for drinks.  Honestly - I really liked it.  I had the steak sandwich which was AWESOME! It literally was the best I have ever had.  My friend had the wrap - and she loved it.  Maybe they have stepped it up a notch with the food since other reviewed it, but really, it was good!", "Date": "2008-06-05", "Author_Location": "Chicago, IL"}, {"Author": "Noelle T.", "ReviewID": "422AJ3Y9uRcMNrEG-lJ6Vw", "Overall": "2.0", "Content": "This place is confusing. The decor is like a soda shop meets Greek garden and I really think it wants to be a bar. We went for lunch and the food wasn't very good. I had the meatloaf which is a \"house speciality\" with a bourbon glaze. It was really horrible. My husband had a Reuben sandwich that had one little piece of lunch meat on it, lol. On the bright side it has a great location and it looks like it could be a cool hang out for drinks. Also, the bloody mary bar was a plus.", "Date": "2009-01-24", "Author_Location": "Nolensville, TN"}, {"Author": "Jennifer P.", "ReviewID": "R_t6g_sWzxFvV_auHG32vg", "Overall": "3.0", "Content": "Can't seem to decide if it wasn't to be a bar or a restaurant.  The night I was there was a very busy night (there was a Pred's game and some other events) -- and they were clearly understaffed.  Our server did her best, but she was being spread waaay too thin to provide a good experience.  Not her fault, but I don't know that I'll go back.", "Date": "2010-05-25", "Author_Location": "Nashville, TN"}, {"Author": "Sam L.", "ReviewID": "8ZY-MXlmhgB7LrOvFLJytQ", "Overall": "4.0", "Content": "Great place to enjoy friends on a Saturday morning, have some bloody marys (build your own), and watch a game or two.  The biscuits and gravy were awesome; it consists of a nice fluffy biscuit, a sausage patty (kinda spicy, delicious!!), and white sausage gravy over it.  On the side is an awesome cheesy potato dish & a cup of fruit.  We all loved our meals, and with INFUSED VODKA for your bloody marys, who can resist!?!?!  My personal favorite was the Tomato Basil vodka!  Delish!!!", "Date": "2011-11-02", "Author_Location": "Nashville, TN"}, {"Author": "Erin D.", "ReviewID": "4tNH6UpsXIv9MQnH12_CgQ", "Overall": "2.0", "Content": "So I went into Past Perfect today after work only to find that my favorite bartender, Chess, has been fired! This guy really made the place, I can't believe they'd let him go, let alone tell him to leave! There goes my chance for a \"Cheers\" experience.", "Date": "2008-12-29", "Author_Location": "Nashville, TN"}, {"Author": "HaileyTIffany M.", "ReviewID": "UCZnnEl9iUHZFqtm6bbZfQ", "Overall": "3.0", "Content": "We went to Past Perfect during CMA Fest ( a music festival that brings about a Bajillion people to town), so our service was kind of crazy. Our first waitress forgot to take our drink order, than another waiter greeted us, then another waitress came and got us drinks, than another waitress finally got us going with drinks. Then she brought out our appetizer and and burger at the same time!That being said, every one of them was so dang friendly, and the appetizer was delicious. The burger was insanely good. Our cocktails were generous, and our bartender was attentive in explaining some key differences in them. I've been in here before and it's usually excellent, so I'm giving them a pass. Most restaurants have to hire new servers for CMA Fest and it gets crazy. The food was so good, I wish I could go back tomorrow. Yummmmm. Nice atmosphere, a classier group of people usually congregates here. Well-dressed and more with the program, so to speak. It's casual, but just a lot more hip. It's definitely not a honky-tonk by any means! I must say, I didn't care for the loud music coming from the Warner Music Bar, I could hear there stupid bass beat over everything. I get that, but I wish PP could force them to put up some noise-canceling foam like they have in the studios.Hear the bass beat really loud over and over was crazy-making. It did make me drink more, though.", "Date": "2012-06-09", "Author_Location": "Nashville, TN"}, {"Author": "John O.", "ReviewID": "2aHhcTAyWkh2e97lHXs0Cg", "Overall": "5.0", "Content": "Love this place!  Just off the touristy strip but pretty well hidden. The bison burgers are great. The staff is friendly and efficient.", "Date": "2009-10-16", "Author_Location": "Callaway, MO"}, {"Author": "Anya K.", "ReviewID": "9n6xOAFE6w79QpiZe2fixg", "Overall": "4.0", "Content": "Great escape from Broadway, great bison burgers, creative cocktails and awesome bloody Mary. This place have variety if infused vodkas from watermelon to olive.", "Date": "2011-04-22", "Author_Location": "Alpharetta, GA"}, {"Author": "Kai O.", "ReviewID": "gLZKNx6uwAwFaKdVb9GmZw", "Overall": "5.0", "Content": "Found this place by accident, was pleasantly surprised. Attentive & charming service, perhaps the best meatballs i had in a long time. Spicy, with lots of homey herbs. The place is a keeper.", "Date": "2008-10-18", "Author_Location": "Berkeley, CA"}, {"Author": "Mike V.", "ReviewID": "dPHA4KLncuIv0aXDRCfkfA", "Overall": "5.0", "Content": "By far one of the best burgers I have ever had!  The service is also outstanding, we sat at the bar and Cooper served us, he was extremely friendly and makes a great bloody mary!", "Date": "2013-06-02", "Author_Location": "Newport Beach, CA"}, {"Author": "Bill M.", "ReviewID": "vOKTTqxlUekXYvaTg_zOdA", "Overall": "5.0", "Content": "We own a new business across the street and the folks at Past Perfect make all of us feel like family. My son and his wife moved to Nashville from California recently and the staff at Past Prefect have  taken them under their wing. Great drinks, food and friends. And, you gotta love Cooper!", "Date": "2013-02-14", "Author_Location": "Palm Springs, CA"}, {"Author": "Liz D.", "ReviewID": "4IRoK5B3PinvdgrGPolISg", "Overall": "3.0", "Content": "Came here for a girls' night out on Wednesday, mostly because I had a Scoutmob, and also because I heard the drinks were great. Both of those were a plus, but other things, not so good. Street parking is hard to find, and parking garages are expensive. We unknowingly came on trivia night, which would have been fine if we wanted to play trivia. But we wanted to just hang out and talk, so the trivia was sort of distracting. There were only a few other people there, maybe 2-3 tables playing trivia. Not a lot of activity. I got the smokehouse bison burger and wanted it to be delicious. But the meat was dry and there was not nearly enough cheese- couldn't taste it. So the burger was overall not too flavorful. The pasta salad was fine, though. The portions were well-sized, just enough food. The desserts are overly sweet. The drink menu was very large, they can basically make whatever you would like. This is a good place to come out for drinks, maybe not for dinner, and check the calendars before you come out.", "Date": "2011-07-16", "Author_Location": "Nashville, TN"}, {"Author": "Kristin G.", "ReviewID": "O_DB-yc7JtnX7C2lnFKIuQ", "Overall": "3.0", "Content": "I've been on the fence about PP for awhile now.  I love martinis, A LOT.  So I was excited when we went and they were known for their martinis.  Well, I ordered and I sent it back.  It tasted terrible.  The bartender made another and I ended up pouring it out in the bathroom.  Maybe it was a bad night.  So you think that would be enough for me but I found myself back for trivia.  First off, I like how they do trivia much better than the turn in your answer after every question.  So annoying!!  I'm here to play trivia and drink, not to get in a mini workout too.  Then my friend ordered a bison burger with a fried egg on top.  I was salivating, I love fried eggs, seriously, it makes everything better, just like bacon.  Plus I ordered a beer and it's impossible to screw that up.  So I was pulled back over into the kind of liking it again.  It is convenient when you are walking to a Preds game from the east side.  So there you have it, the most wishy-washy review ever.", "Date": "2011-10-17", "Author_Location": "Nashville, TN"}, {"Author": "Peter M.", "ReviewID": "oK7ku0AOjVos8L774SSd3A", "Overall": "2.0", "Content": "I'm really torn about this place.  I appreciate it as a bar.  It's dark and well-appointed and feels a little bit like a neighborhood bar in a fancy big-city neighborhood.  It is downtown and provides a nice oasis when I am stuck down there for some stupid party and need to escape the tourists and honky-tonks.  However, the food is truly horrible.  Once ordered a burger which was bland, over cooked, and on a flavorless, small stale roll.  I've tried it more than once and once had out of town guests and was very embarassed.", "Date": "2007-03-22", "Author_Location": "Nashville, TN"}, {"Author": "Melissa M.", "ReviewID": "OjdiWBNY99nTvnGnhhihyA", "Overall": "5.0", "Content": "Had a delicious bloody mary with cucumber infused vodka, the bartender could tailor it however I wanted.", "Date": "2012-08-27", "Author_Location": "Raleigh, NC"}, {"Author": "Sherry O.", "ReviewID": "4eHqx0tF4WvTJZ7YBd4X-w", "Overall": "4.0", "Content": "I recently moved to Downtown Nashville and had a chance to have dinner at Past Perfect with my sister.  We had a great expereince and good food.  The bison burger was great as was the grilled flatiron steak sandwich.  My sister had the pasta salad.  It was good but had too many onions for her taste and mine.  We had great service from our server Lita.  I look forward to returning many times and next time trying the infused vodkas.", "Date": "2011-08-21", "Author_Location": "Nashville, TN"}, {"Author": "lm m.", "ReviewID": "qK33OIiiPTuh18dvVRqOZQ", "Overall": "1.0", "Content": "Service is always slow even if there is only a couple patrons.  It's disgusting to think the waiters and cooks are touching the food because you will always find them out front smoking.  I've actually had food that tasted like smoke.  ICK!  Wouldn't recommend this place at all.", "Date": "2011-03-31", "Author_Location": "Clarksville, TN"}], "RestaurantInfo": {"RestaurantID": "5HHr_3pCw6TQEFOJD6UmfA", "Name": "Past Perfect", "Price": "$$", "RestaurantURL": "/biz/past-perfect-nashville", "Longitude": " -86.77546890000000", "Address": "122 3rd Ave SNashville, TN 37201", "Latitude": " 36.160787300000003", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/r4WJYlktPFcupZiq73NpEw/90s.jpg"}}