{"Reviews": [{"Author": "Terry L.", "ReviewID": "rwknQEoo71HbIIw3FxA-tQ", "Overall": "4.0", "Content": "Once again Jose's does not disappoint.  I ordered the chimichanga with chicken.  It was delicious, crispy and hotttttt!.  The service was awesome, fast and courteous.  We also had the real margarita and they were very good too.  This continues to be one of our favorite places to eat.Food=4 of 5Service=5 of 5Atmosphere=3 of 5Value=4 of 5", "Date": "2014-07-16", "Author_Location": "Honolulu, HI"}, {"Author": "Jackie W.", "ReviewID": "p1GzqM7Juw9hH1HRHvB-uQ", "Overall": "3.0", "Content": "I'm from So Cal and I went to Hawaii to get Mexican food. I realize the irony there. I've had A LOT of Mexican food in my life...some good and some not so good but this really wasn't bad. I had the taquitos which are pretty hard to screw up but they were good, as was the guac and sour cream on the side. We split a pitcher of mango margaritas which were really good too. The staff were all very friendly too. My only complaint would be the price. For what you get, it's just not worth the $10 - $15 average price for everything. But you're in Hawaii, so you have to expect to pay a little more for stuff.Bottom line, if you have a hankering for Mexican food when you're visiting Oahu, this would overall be a good place to start.", "Date": "2014-05-09", "Author_Location": "Orange, CA"}, {"Author": "Dr. L.", "ReviewID": "RkfEBUGFoJ7dJdoQ73fpUQ", "Overall": "1.0", "Content": "It's ,Cinco de Mayo, as an avid and lover of Mexican food, I EXPECT Mexican restaurants to be busy.  But at the same time, if you're a restaurant owner or manager, YOU SHOULD know that on holidays like Cinco de Mayo, you should be prepared!  And I speak as a former server in the restaurant business.  The funny thing was, my friend and I didn't even get there at pique dinner time hours.  We got there about 8:30 pm, there was a wait for a table - even though there were at least 6 tables open.  The hostess and wait staff looked so over whelmed,  to a restaurant that wasn't even fully seated to capacity!.  There was a bit of a line at the bar, which my friend and I went to, to go get drinks...again, the bartenders - I would say there was two but, really they were working like there was only one and a half people behind the bar, it was if the bar was packed into the dining room, when there was really only 4 of us in line and the restaurant still not fully seated.  I was so tempted not to just jump over and pick up our Dos Equis and pop the caps off.  Plus - what Mexican restaurant/bar doesn't have Cinco de Mayo specials on Cinco de Mayo?  You take your normal \"Mexican Beer specials\" off the table because it's Cinco de Mayo???  You should be keeping those specials up and doing dollar tacos like the rest of the world!While we finally got seated, maybe waiting about 15-20 minutes, our server while nice, took forever to get to us.  I had to wave down the hostess to ask where our server was after waiting 10 minutes, not even to be greeted  I asked to start off with chips and guacamole and she did forewarn us to order our second round of beers now even though we still had half way to go because she admittedly said, it will take forever.  She brought the chips and salsa, but no guacamole.  I didn't bother her about it until half way through the chips and asked her, \"We did order guacamole, right?  It's coming?\"  She smiled as if either a) she forgot to put the order in or b)she was giving me the look of \"Look biatch, I'm slammed and I can't get your freakin' guacamole!\"  But she simply said, \"it's coming\"An empty basket of chips and still no guacamole, we get our second round of drinks.  Luckily my friend and I were having a good time that we didn't notice that our meal was taking forever to arrive - the other friends we ran into said it was going to take 45 minutes from the moment we sat down - and they were right.  And sure enough, we got our guacamole with our meal, not as an appetizer as we requested.  I mean don't you have guacamole in the back in buckets - why did it take 45 minutes to get literally a small bowl of guacamole?  That should have come out when the chips and salsa came out.  As I watched our server - I thought how inefficient she was because she was literally catering to a table one at a time, when the simple things she could have grabbed or taken care of, could have been done all at the same time.For example, when she dropped off our dinner she asked if she could get anything else, so I asked her for some Tapatio, Diet Coke and another beer.  I can't eat my dinner without the hot sauce.  All she needed to do was grab a bottle - especially since she walked past our table 4 different times, and not once did she drop off a bottle of Tapatio.  Ten minutes of waiting, I couldn't wait any longer because my food was already getting cold and my friend was almost finished with his dinner - I went up to the hostess and asked for a bottle of Didn't take her more than a minute to grab.  The sad thing was, our server didn't even have a full section - she had four 4 tops at the most and it was no longer busy, the restaurant was winding down - it was almost 10 pm!When our server finally came to check on how our food was, we asked, \"So, is our drinks coming, our diet coke and beer?\"  Do you know what she did, she smiled sheepishly and said, \"Yeah...\" as if to say, \"Yeah...about that...\"  So I had to clarify, \"Yeah are they coming or yeah I forgot to put the order in?\"She then went to check on them and even 10 minutes later still with no drinks, the hostess came by to ask us how we were doing and I said, \"you seem to be able to get things faster than our server.  I know she's checking on our drinks, but the bar isn't even slammed - there's barely anyone in here - how hard is it to get a diet coke and pop off the cap of a corona?\"After the hostess left, 2 minutes later our server brought us our drinks.  Luckily, when she brought us our tab, she took off those last two drinks because of our long wait.  And while the food was good - it was certainly not worth the weight - I am from San Diego and I know what great Mexican food is and how restaurants do it for Cinco de Mayo - this was my worst experience EVER for Cinco de Mayo.  We didn't leave there until 10:30 pm!!", "Date": "2014-05-06", "Author_Location": "Honolulu, HI"}, {"Author": "Manya V.", "ReviewID": "zO43I0iZ6xCO32--h-uBVA", "Overall": "5.0", "Content": "Favorite Mexican restaurant. Always good service and delicious food!", "Date": "2014-07-21", "Author_Location": "Honolulu, HI"}, {"Author": "Dizzy D.", "ReviewID": "qhNpbKiIKpzCcQNjG75-Pg", "Overall": "5.0", "Content": "everything here is great. from the service to the atmosphere. I'm here twice a month. come here for something casual or a first date. food is always on point. salsa tapas is a little spicy so make sure u have plenty water and cerveza to wash it down!!", "Date": "2014-07-06", "Author_Location": "Honolulu, HI"}, {"Author": "Noah P.", "ReviewID": "J9BsD0Azw0q9OgrdZj1Ljw", "Overall": "2.0", "Content": "This restaurant was a complete joke. Our food was clearly all microwaved (The Jalapeño Nachos were a prime example.) I wanted to eat out so I wouldn't have to eat my own garbage cooking at home yet these nachos were something I could have made! More proof that this food was microwaved was the fact that I pulled off all the cheese on my nachos with one hand and just had a whole bunch of burnt chips underneath. (When it says Jalapeños and Cheese on the menu that's literally ALL that was on these chips.) The service was slow, our waitress was clueless and EVERYTHING was overpriced. I ate with 3 other people and we all got ripped off big time. The only reason I didn't rate this restaurant a 1-Star is because I saw a cute Asian chick in the restaurant at the same time I was there. The fact that this restaurant has apparently been around so long is a miracle to me... it must be a drug front or something.", "Date": "2014-07-16", "Author_Location": "Farmington, MI"}, {"Author": "Coreen L.", "ReviewID": "khS1hs0qUye9M91qP82BPg", "Overall": "4.0", "Content": "I can't believe I haven't ever written a review for Jose's!! This has been a \"go to\" spot for good eats, cocktails and hanging out with friends. Tucked away in Kaimuki, its also a good spot to gather when the malls are crazy (like during the holidays).Delicious Mexican food options, that are traditional and yet fit the \"local\" palette. Sure, its not the same as some Mexican food options in San Diego or Los Angeles, but definitely one of my top choices here in the islands. And they have a great many choices of margarita flavors, beers and other festive drinks. This time I had one of their specials - chicken enchiladas with green verde sauce, rice and beans. YUM! I hope they make this a regular option, because I'm a big fan of green sauce. My friend tried the banana margarita - which at first sounded funky, but after I stole a sip, I realize it works!! I'm getting my own next time for sure.", "Date": "2014-04-03", "Author_Location": "Aiea, HI"}, {"Author": "Leone A.", "ReviewID": "cV2_zIFO1DpXyMtBYty3aQ", "Overall": "1.0", "Content": "Late post, came here on Cinco De Mayo. We got seated and were sitting for 10 min with no service at all, and it's not even crowded! No waters, no chips, yet she was still seating other guest. Ended up going to chili's and got seated right away with service! Skip this place, save yourself the trouble!", "Date": "2014-06-21", "Author_Location": "Honolulu, HI"}, {"Author": "ana d.", "ReviewID": "iWVFVzS-KujCvuSA_EpTdQ", "Overall": "4.0", "Content": "Hola!  Hola!  Hola!    everybody!  We  come    with   my      Family   to    Jose,s  --Mexican   food   Cafe      in Kaimuki       many  years  ,  be course  like   Traditional     Good Mexican  Foot  and  best margarita   drink   here     ,   rice   and  bean   just  perfect   Guacamole   and  salsa very tasty and  fresh  ,  nice  friendly   and   fast    staff   ,  services   ,  and  our      keiki    can  eat  some  day  FREE   ! and   have  Toy    present    !Big    Saving      During    the   Holidays  they have special     Cerebration   fun  time  always    for  Everyone    !    Hope you  like  eat  here,like  we  do  !    FELIZ  CINCO  de  MAYO  ! All   Mexican  Chicano  Friends   and   Jose,s  --business   owners   wish     colorful  Fiesta  cerebration  Festive    !Ana Europe", "Date": "2014-04-30", "Author_Location": "Honolulu, HI"}, {"Author": "George S.", "ReviewID": "6OXYWsDtydCw4A7eIztJjg", "Overall": "1.0", "Content": "THANK GOD for YELP!!!  It saved us from getting sick & disappointed & pissed & broke! To everyone that post to Yelp, we thank you!!! Most of us really appreciate the truth, and the convenience of checking out an eatery, before ever going anywhere, good or bad. We trust the reviews to get us to the right place, to enjoy spendIng our money wisely. Mahalo to ALLLL.", "Date": "2014-06-02", "Author_Location": "Aiea, HI"}, {"Author": "Brandi B.", "ReviewID": "XA43ow-ksPXDDY0sb9F_gg", "Overall": "1.0", "Content": "If you are looking for good Mexican food DO NOT eat at Jose's Mexican Cafe and Cantina. I should have went with my first instinct to leave before I was even seated but I guess I am a glutton for punishment. The place has the ambiance of a old, stale, sticky dive bar. I ordered the New Mexican Burrito which was described in the menu as: Stewed beef cooked with mild green chilies, wrapped in a flour tortilla, covered red Chile sauce and melted cheese. Served with sour cream.\"The price for this burrito with beans and rice was somewhere around $15 bucks. What I received was a flour tortilla FULL of onions and peppers covered in a red chili sauce. My first bite was OK, but I noticed as I went for the second bite that there seemed to be a generous amount of onions ( and BY generous I mean ALL of the onions in the entire establishment) In attempt to find the beef that was supposed to be in my burrito sliced the burrito long ways down the center. What I found was 5 pieces of meat that were each the size of a dime....NO EXAGGERATION! After removing all of the onions and peppers from my burrito, I was left with nothing more than a flour tortilla covered in red chili sauce. My order was a \"to go\" order so I had already left and was home before I discovered the quality of the food and even though I was starving, I could not let this go. I got back in my car drove back to Jose's circled the parking lot a half a dozen times to find a parking spot and went back to return my food. There was no manager on duty just a waitress who was the \"acting manager.\"  She didn't even ask me if she could fix the problem or replace the meal. She gladly gave me my money back for my entire order (including the quesadilla that my friend ordered that was FAR LESS than spectacular) She wasn't able to credit my card back because she wasn't a \"manager\" but she did refund me in cash........Cash that I took to another Mexican place around the corner and spent half as much for 100% better food.", "Date": "2014-02-01", "Author_Location": "Honolulu, HI"}, {"Author": "James G.", "ReviewID": "qOMV5omEyWpw5zTGtJBbhg", "Overall": "2.0", "Content": "I don't know why I haven't learned my lesson. I have been disappointed with the food pretty much every time I have been here. If you can survive on chips and salsa and alcohol I would say just get that. I find myself coming here because I work in the Kaimuki area, one of my bosses is addicted to tequila and Jose's  is a sports bar in the area I can catch the game at  whether its baseball, basketball, or football (yes even Thursday Night Football).Service is super friendly but sometimes slow. Food is not good. Carnitas were so disappointing the last time I visited. It's edible though. I scarfed down the food because I was waiting until after 2:30 to eat lunch so I could watch Thursday Night Football.", "Date": "2013-10-12", "Author_Location": "Honolulu, HI"}, {"Author": "Brent H.", "ReviewID": "-i3I4WG2MlBl5efn3NLGOg", "Overall": "4.0", "Content": "Pretty Good Enchilada Suiza!! Salsa was tasty even though it was slightly hott...  Not the best Mexican good I've had but its Good", "Date": "2014-04-28", "Author_Location": "Honolulu, HI"}, {"Author": "Dharma W.", "ReviewID": "za3aAZqu1y2aE94bFE75YA", "Overall": "1.0", "Content": "Ive eaten here before and was never very impressed. This time I simply left dissatisfied and quite frankly, disgusted. Salsa was bland and no taste, as well as the guacamole. After adding some salt and lime juice it was eatable. I ordered taco salad with chicken and ended up getting food poisoning from it. However the bowl was good. Tried my sisters crab enchiladas, best words, not terrible, again, eatable. Ordered Li Hing Mui margaritas, idk what tequila they used but that was pretty horrible tasting. Decor feels extremely old but service was good. Which was pretty much the only good thing about the place. Most likely will never ever return.", "Date": "2014-03-25", "Author_Location": "Honolulu, HI"}, {"Author": "Crash D.", "ReviewID": "tuZ-G8PjFDscHPVdFrMYKw", "Overall": "2.0", "Content": "Below average at best, and honestly 2 stars is generous.  My son and I shared the nachos grande or whatever the hell they call it.  Less than stellar and didn't care to finish them or take them home.No one to greet us or the other customers as we walked in....so we just abided by the tacky 80's sign \"Please Wait To Be Seated\".  Honestly, it was somewhat awkward with nowhere to \"Wait\" by the small entrance.Oh yeah, all of the signs on the front door advertising the ID Card being accepted....umm, yeah...not on the weekends.Honestly, if I was drinking this might be a decent dive bar type place but definitely not anything more.", "Date": "2013-09-19", "Author_Location": "Kailua, HI"}, {"Author": "Rachel B.", "ReviewID": "TixxzPq7VuazWApFjonOVA", "Overall": "2.0", "Content": "Been a few times. Crappy over priced drinks and crappy over priced food. No thanks", "Date": "2014-03-02", "Author_Location": "Honolulu, HI"}, {"Author": "Nicole M.", "ReviewID": "8-0EC-gFYhNdc96kSTS51Q", "Overall": "1.0", "Content": "When I put the fork full of chille relleno into my mouth, thoughts of maggots flashed through my mind. All I could think was, \"What the hell did I just eat?\" Mushy and cold, the chille relleno was the first meal I have eaten at a restaurant that I could not finish eating. I shudder to think of the garbage I let pass through my lips. This is a place you go to have chips and beer, nothing else. Do not eat here, you can make better Mexican food. If you are just unwilling to cook Mexican yourself, eat at Serg's in Manoa.", "Date": "2013-07-26", "Author_Location": "Honolulu, HI"}, {"Author": "Paul H.", "ReviewID": "yKqOUECcMcdfOwdgwSv58g", "Overall": "4.0", "Content": "Grata local neighborhood restaurant serving good basic Mexican food. Been here 40 years.  Family owned and run.", "Date": "2014-03-13", "Author_Location": "Honolulu, HI"}, {"Author": "Lynne S.", "ReviewID": "QMRabJg8reSS6qZcFQfi-Q", "Overall": "4.0", "Content": "Ok, so the food isn't spectacular but its ok and not bad actually at times. The atmosphere is a little tired, well really tired. The restrooms aren't the most inviting (who wants to be invited to a restroom anyway??). The parking lot suckssss (not their fault). Where was I going with this again? Oh yeah, 4 stars--4 legit stars purely for the friendly service--especially at the bar.", "Date": "2014-03-25", "Author_Location": "Honolulu, HI"}, {"Author": "Christy M.", "ReviewID": "7TbMY1WRt3efrsbvP2XeFg", "Overall": "3.0", "Content": "This place is decent if you're looking for a mexican food fix.  Prices are a bit more than some other places around, but the staff is always friendly.Recommendations:- Chili and Rice (good flavor & filling)- Chicken Enchiladas with Green Sauce", "Date": "2013-10-05", "Author_Location": "Costa Mesa, CA"}, {"Author": "Blane N.", "ReviewID": "HaVcHHeBIIt7Q4RurlpzPg", "Overall": "1.0", "Content": "Worst service EVER. Here's how it went. I show up with a friend for lunch around 1130 and there were 3 people in the restaurant (1 guy at the bar and a couple in a booth). The waitress notices us and tells us to sit in a booth and she's obviously irritated that we took her attention away from the one other couple in the restaurant. We were given menus and after a while, the waitress came back to ask if we were ready to order. I ordered the spinach burrito and she asked \"what would you like to drink with that?\". Now, I'm new to this place so I asked, \"it comes with a drink?\" (Some places do give you a small drink with your meal). Her response was awesome! \"Uh...honey, I don't know where you are used to going, but I've never gotten a free drink with a meal ever\" and then she laughs at me. What? How rude. My friend orders her meal as well as the meatball soup dish. After a bit of a wait, our food arrives. Oh but wait...where's the soup? We ask nicely if the soup is still coming and her response was also pretty awesome. \"Look...it's coming. We don't microwave our food.\" LOL. What a joke. We were nothing but polite and she was the rudest waiter I've ever come across. Good luck staying in business with that kind of employee running the restaurant.", "Date": "2014-03-13", "Author_Location": "Honolulu, HI"}, {"Author": "Robert H.", "ReviewID": "XlOu4FFa_UIGlwq36hLRYA", "Overall": "4.0", "Content": "Tuesday is keiki night and our family eats here pretty often on Tuesdays as kids eat free and the kids like it...occasionally we go there on other nights of the week, too.Everything I tried at this place has been good. Good choice of Mexican beers, if that's your thing.Service always good.", "Date": "2014-02-23", "Author_Location": "Honolulu, HI"}, {"Author": "Amanda Z.", "ReviewID": "GD_bjznZf7Q0vdEaqADXlw", "Overall": "2.0", "Content": "I've been making it a point to try more of the restaurants in our neighborhood (Kaimuki, hollaaaaa!), instead of just going to the same places all the time. So last Taco Tuesday I had a hankering for Mexican, and down the hill we went. We tried going to the other Mexican establishment around the corner but it was too busy and we didn't feel like waiting, so we ended up in the 1980's...err, I mean, Jose's. The ambiance is dark with weird old school (not in a good way) kind of decorations, not to mention that it just feels that the lack of light is trying to hide the old/dirtiness. But anyways, I digress. Thumbs up to to the waitress for seating us promptly and for taking our order. The free chips and salsa were decent. Food came out fast, the portions were were pretty large but it was a bit pricey. I got a chile relleno and tamale combo and the husband got the huevos rancheros. Basically the bottom line is that the food was over salted yet had no depth of flavor or spices, some of the food was lukewarm, so pretty much nothing special or worth coming back for. So now I know, and knowing is half the battle!", "Date": "2014-03-18", "Author_Location": "Honolulu, HI"}, {"Author": "Richard M.", "ReviewID": "icCk3dxvg3TgJKnY2lsfWg", "Overall": "1.0", "Content": "No way Jose.  Worst food ever.  Tasteless. As in without taste.  They should use spices.   The tomato sauce on my enchiladas tasted like tomato sauce out of a can.  The guacamole was tasteless.  The salsa was tasteless.  Stay far away if you have taste buds. Otherwise it was awesome.", "Date": "2014-02-16", "Author_Location": "Kaimuki, Honolulu, HI"}, {"Author": "Adrianne H.", "ReviewID": "d1uA8MwJo4lrPqZ335iYXg", "Overall": "1.0", "Content": "I'm with James.  Why oh why oh why??!!  Was in the mood to just chill with a glass of red and it was served to me completely cloudy from residue on the inside of my glass.  Ugh!  Helllooo they charged me $1.50 for a scoop of sour cream half the size of a golf ball. Crazy!   And they\"re so chintzy on the chips.  Omg.  I'm done.  Done done done.  Try Los Chaparros or Azteca!  They rock!!  Proprietors:  Try cleaning your establishment.  Have your wait staff take pride in your food and drinks.  Can tell its just a J-O-B!!!  Zero personality.", "Date": "2013-11-01", "Author_Location": "Honolulu, HI"}, {"Author": "Jacob N.", "ReviewID": "eWm8sCY9QCqZqsudgUM5Xg", "Overall": "3.0", "Content": "Jose's has been around in Kaimuki for longer than I can remember, and for that whole time I don't ever remember it being known for great food.   The one thing that I do remember hearing about here is that the margaritas are pretty good.  I don't remember the last time I had been here before this most recent visit, so it was almost like going to a restaurant for the first time.  We came here for some pupu's and drinks.The food was good, but not spectacular.  We had ordered Macho Nachos and Cheese Quesadilla.  The nachos were actually pretty packed full of toppings.  The quesadilla was pretty basic.  Tortilla and cheese.  There was also some fresh salsa with it.  When we were dining in there was a margarita special going on with fruit flavored margaritas.  Banana, Strawberry, Peach, Pineapple, Mango or Pomegranate.  Can't go wrong with that.  I tried the mango, and the banana.  I wouldn't recommend the banana flavor, but the mango was good.  There were a couple non-fruit flavors, like li-hing and midori that I wouldn't mind trying on another visit.Our waitress was very friendly and attentive.  All of our needs were quickly satisfied.  Granted there weren't too many other customers in the restaurant when we were in there, but I have been to some other restaurants that were also empty yet provided terrible service.  Not the case here!I will definitely come back for a drink and a small bite here, at least.  Especially since they're within stumbling distance from home!***31 Yelps: 28/31***", "Date": "2012-10-29", "Author_Location": "Honolulu, HI"}, {"Author": "Kaukahoku L.", "ReviewID": "5Dau1BLVyW5l8rCg8Td57w", "Overall": "4.0", "Content": "The food here was great. No complaints. The staff are friendly. The only complaint I have is that its a little too dark in their restaurant during the day time. Other than that Im a satisfied customer.", "Date": "2014-02-06", "Author_Location": "Honolulu, HI"}, {"Author": "Mae K.", "ReviewID": "hKuB_ZiH_G2V8gnVft_NAA", "Overall": "1.0", "Content": "father first took me here back in the 70's. just recently started going back b/c i loved their mexican rice, seemed fresh & not microwaved (like some places). go figure, their grilled pork chops were the bomb (go figure, go to a mexican rest. & order pork chops, but hubby did).last time we went about 2months ago. his pork chop was dry & burnt. when they brought it to the table, you could smell that it had been burnt. he told me not to complain. but not in this day & age when we spend hard earned dineros!! so i let it go.this time i went today for my daughter. told the seater 2 adults & one baby (daughter had a baby carrier) & the lady places us on the bar side w/the two seater booths on sunday afternoon football. i know we should've been placed on the restaurant side and in a bigger booth or on the tables in the middle, seriously!!the server if you could call her one, i'm so finished w/this brawd!! i've had her several times & her face, looks like she's in such pain!! like she truly doesn't want and/or like her job, but at her age, she's got no choice. helena is her name!!she just asked if we wanted a drink. don't care, if i've been there a fricken million & one times, \"hi, i'm helena (or i know she recognized me) oh, hello, good to see you again, did you want to start w/drinks or can i tell you about the 2 specials they had as you walk in (which i didn't get to finish reading). none of that.then never noticing we were cramed into the booth & suggesting we move. do i have to do your job.only when we were almost done, w/our appetizers did she ask were we ready to order. isn't that something you do, as you place your appetizer order.  she only 3 other tables & 3 people on the bar.  the other lady was taking care of the people in the restaurant side.i ordered top sirloin fajita's which looked like they had sat in the oven too long!! mexican rice was mushy & the refried been looked like shredded pork b/c it looked like they were dried & smashed w/a fork on the plate. i only had one, she didn't even come around to see how the food was or even ask why i hadn't touched my food. she came soon after my daughter had finished her plate & asked if i wanted a carry out container.i figured if i said anything there, i would've disturbed the entire restaurant b/c this was the straw that broke the camel's back.i am not going back!! i live in aiea & only go there b/c i liked their mexican rice & their food was good!! because in recent there hasn't been any consistency in quality of either food or service!! definately need a \"restaurant stake out!\"sorry for the long review...just really disgusted & pissed...they lost a good customer b/c i drop big $$ when i go there. ****looking for something close to home in aiea***** bye jose'sI SWARE I WOULD'VE DONE BETTER @ TACO BELL. DON'T KNOW IF THEY EVER READ YELP...THEY SHOULD B/C THEY AREN'T STELLAR REVIEWS @ ALL. WILL NOT COME BACK JOSE'S ADIOS", "Date": "2013-09-23", "Author_Location": "Aiea, HI"}, {"Author": "Emily D.", "ReviewID": "UUtjQvvS2oke1c3RLTobiw", "Overall": "2.0", "Content": "Jose's is not bad. But... it's not good either.Ambiance: We went during the day, and the feeling was drab. They had the typical \"mexico flare\" - with not enough pieces to make it quite... eclectic enough. For me, if you're going to go with the themed swag... you gotta go all the way.Service: Standard. +1star?Food: It is bland. This place would do well with a few more spices and handfuls of salt and peppers, maybe some lime as well. I tried the chicken taco, spinach enchilada and cheesy verde sauce covered corn tortillas with rice and beans. Rice was like mush: supremely overcooked with too much liquid. Everything else needed more flavor, cooked OKAY, but nothing special. For about $4 a taco, you can afford some salt. Actually the verde sauce was't bad, it just needed AGAIN some more flavor. I could go on about each component, but it would be reading a broken record.Location: Pretty good, kind of in a back ally of the Kaimuki area. What is great about walking into this place, is that you can turn around and pick from a variety of different restaurants in the area :D okay, that was kind of harsh, but seriously... I dislike wasting my calories on mediocre food.", "Date": "2012-11-01", "Author_Location": "Honolulu, HI"}, {"Author": "Terry K.", "ReviewID": "R1W96Cx2HGPpaTUGRywoxg", "Overall": "3.0", "Content": "Yelp Challenge 365 # 22/365There are very few mexican restaurants in Honolulu you can refer to as \"authentic\". I believe Jose's stands somewhere in the center. It's as authentic as it can be considering= it's in Honolulu. Dining and Jose's leaves no room to my imagination sorry to say; my usual order is the taco salad with ground beef and depending on who I'm dining with we order a pitcher of their top shelf caddy margarita.Okay, their margaritas are good and comes to about $5.00 per glass based on the size of the pitcher.Their salsa and chips appetizer is always the first to be served. If I'm not mistaken, they charge you for the second basket of chips. And their side order guacamole is about $4 for a tiny little scoop. so don't ask for a side order of guacamole.Yet, when I can't decide where to go and hunger for mexican, I usually end up at Jose's. I think its the convenience of where they are located.One caution: if you go on a Sunday and its during football season, be prepared for cheers and noise as quite a few sports fanatics spend their Sundays there", "Date": "2011-08-22", "Author_Location": "Honolulu, HI"}, {"Author": "Stacey K.", "ReviewID": "fvwPuCgkI4n7rqq4x7T9dg", "Overall": "1.0", "Content": "I don't know how people eat here. This place reminds me of somewhere that should be on \"Kitchen Nightmares\".  Everything is mushy... can't tell what you're eating cause it all taste like sog. yeah SOG. i'd rather eat the bark on the stink trees outside. or lick the backs of the bikram yoga people walking around. fo real, it's THAT bad.G.R.O.S.S and service sucks. If you need mexican and you're standing in front of Jose's take a step back. way back. don't wanna drive away? go to azteca if u want mexican, which is okay for hawaii but a hell of a lot betta then jose's.", "Date": "2009-11-30", "Author_Location": "New York, NY"}, {"Author": "Katrina F.", "ReviewID": "ZMePbEGeuouuCiF328lxog", "Overall": "1.0", "Content": "I absolutely LOVE that this place has so many bad reviews. That is soooo bad to say but I cant stand it here! I have always wondered how this restaurant has stayed in business so long. The food is so absolutely crappy. Im not even going to go into details. Just awful. And the people who work here are so snobby! Im not one of those girls that cant be nice to another girl. I enjoy talking to people and being friendly to everyone but the girls who work here are all absolute snob-o-las!!How is this place still alive if everyone dislikes it so much???", "Date": "2010-10-08", "Author_Location": "Honolulu, HI"}, {"Author": "Catherine L.", "ReviewID": "dV07bPiU44bFtX3uCbr9YQ", "Overall": "1.0", "Content": "Shoot, I should have checked Yelp before going there. We were really craving Mexican, and in the Kaimuki area, so we just stopped by for dinner. Starts with five stars because I don't have any preformed opinions, and because I am day dreaming of a burrito right now. Minus one star because the ambiance is more like a crappily fake mexican decorated dive bar (including loud people at the bar) than a cantina. Minus one star because the Mango Margarita is really, REALLY bad tasting. Minus one star because they let us order everything, including a crab quesadilla, before letting us know that they were out of crab. Minus one star because the chicken quesadilla, that's already $7.5, comes with $1 sour cream supplement and $2.5 (yeah, I know!) guacamole supplement.Wait, one star, that's the lowest I can go! I guess I'll stop here, but I can tell you that the 16oz mango margarita, the chicken burrito, and the chicken quesadilla + supplements were NOT worth $37. Once, not twice.", "Date": "2009-10-12", "Author_Location": "Honolulu, HI"}, {"Author": "Mark C.", "ReviewID": "XwsmdewgRdAZhf-pe0qjig", "Overall": "1.0", "Content": "One word sums this place up perfectly - SHITTY. Now, if I were to use two words then I'd say it was TOTAL SHIT or if I were to describe it in three words I would just say SHIT, SHIT, SHIT. I went last night arriving just before 7:00pm. We were seated at the booth, given menus, chips, salsa and water. Sat there for thirty five minutes as more patrons arrived after us, were seated and orders taken. Get a load of this... the waitress walks by, looks at us and goes OMG, I'm so sorry I thought I had taken your orders already. I don't know what would give her that idea since we still had the menus on the table. I ordered the Steak something or other I can't even remember because it tasted like crap, meat was tough and fatty. My friend ordered a bowl of something that tasted like crap as well. Food took an hour to come out from the time we arrived!Now understand I lived in San Jose, CA for years so I know good Mexican food. I have yet to find a decent Mexican restaurant that serves great Mexican food. Does such a place exist in Hawaii?In a nutshell, horrible service, terrible food and sat there a total of an hour and a half before getting out of there and no the place wasn't busy at all.", "Date": "2008-01-07", "Author_Location": "Honolulu, HI"}, {"Author": "Norm G.", "ReviewID": "vSTkRuSVqA9OFPL-gp1fqA", "Overall": "2.0", "Content": "I am a lover of Mexican food, and I am constantly trying to get my family to eat some with me, since they are not all that fond of it.  I convinced them to have lunch at Jose's recently, and I think I lost all credibility with them because of it.  First, the good.  The service was very friendly.  The woman who seated us and the woman who served us were both very nice.  However, our orders took nearly twenty minutes to arrive, and that seems like a pretty long time to wait at lunch time.  There were only four other parties seated there at the time.  When I wait that long, that's normally a set-up for an extraordinary culinary experience, know what I mean?Now, onto the food.  I ordered a a shredded beef taco, which came with beans and rice.  The taco shell was very oily and didn't taste very good.  The beef itself did not seem to have much flavor, thus the marinade must not have been very good.  The beans and rice were both fairly bland; nothing really distinctive about the flavor.  And the price was $11.95 plus tax.My two kids ordered from the keiki menu, which I should know by now is a mistake.  Can you believe they ordered a \"pepperoni pizza\" in a Mexican restaurant?  Well, my son explained that it was a type of \"microwave pizza.\"  Basically, it looked like an over-sized English muffin with cheese, tomato sauce and pepperoni on it.  Both the kids were not happy with their \"pizzas,\" but secretly I thought they got what they deserved for ordering such a thing in a Mexican restaurant.  My wife ordered a vegetable burrito, consisting of broccoli, eggplant, zucchini, and spinach.  She said she tasted mostly broccoli, and hardly any spinach, and that dish was $13.95 plus tax.The interior of the restaurant has some sombrero hats on the ceiling and chili shaped lights strung like Christmas lights, some photos on the wall of local glitterati, and a dirty looking carpet. This was an uninspiring lunch, and I think I shall now let my desire for Mexican food lie dormant until we travel to California again.  Our total lunch bill came to over $50 (including tip), which the CEO's of the family (wife and me) agreed was definitely over budget for a family of modest means.  In the future, I have promised myself that I will heed my family's pleas and stick to Chinese food in Chinatown!", "Date": "2012-02-18", "Author_Location": "Honolulu, HI"}, {"Author": "Jonathan V.", "ReviewID": "im7B4U34-SskJLoca_FYuQ", "Overall": "4.0", "Content": "Environment: 3/5Employees: 5/5Food: 4/5Drinks: 5/5Cost: 3/5Total: 18/25Synopsis:  After I found out I didn't get into my internship, I reluctantly said yes to my friend Matt about going out.  He coaxed that I needed to have a drink....for free.  Ugh, I cannot turn down free alcohol, especially after bad news that fore-casted a break-down followed by tears. The environment instilled a feeling of being in Mexico, albeit, I been there once.  With brick-like walls, you would think your waitress would also be speaking to you in Espanol.  Nope.  Was she high Matt?   Only a drug test would verify our presumptions.  Besides the beans being burnt, and the fish \"over-cooked\" everything else was great.  All-time favorite were the vegetable potato skins encouraged by our waitress.  Nice choice!  At the end of the night, spent almost 30 bucks, but it would have been more if I didn't get a whole pitcher of blended margarita for free.  I felt I could fly afterwards!Environment: With a Mexico-tone to this place, you will find dimmed lights, Spanish-influenced moon shape windows with metal fences in them.  It kind of reminded me of Peru and Renzo as well, for some odd reason.  We sat on comfortable chairs, and when I decided to look around, I felt enclosed.  There was a huge party next to us afterwards, and I swear I eased-dropped every second of it.  They were talking about wrong recommendations about breastfeeding and I wanted to laugh in their faces and scream WRONG!  Another thing that was alarming was the men restroom divider for the poop-can wasn't high enough.Employees: We were never promised free drinks or continual chips and salsa, but in the end that's what ended up happening.  YES!  Wow, talk about a good pick-me-up!  Prior, I disregarded burning a hole in my pocket for solace, but this was a bonus.  My Pre-notions of her included a girl being high or a wannabe local/surfer girl.  She had a raspy-like voice that further suggested she may be a pot-head.  It was fine though, I did not mind her almost pretentious performance, but she became increasingly impressive throughout my experience.  Now recollecting, retrospectively, it could have been due to the amount of alcohol I was consuming at a fast pace. I am not certain if it was due to the alcohol because her table coverage exceeded 5 and she was not panicking. Food: Free Chips and Salsa: So after your first set, you have to pay for additional.  What?  Matt was irate because in a real \"Mexican Restaurant\" they never make you pay extra.  This is a new economy dear, and that is how life is now.  However, in our situation, free, free, free.  The salsa was spicy and delicious.  Even Matt complimented it nicely, even comparing the taste to his mom's salsa.  5/5Soup (Abondigas): Rice and meatballs together.  I never thought this combination would be anything special, but it was delightful.  In your mouth it went from a lightness from the soup to softness from the vegetables and then ending with a heavy beefiness from the balls.  The combinations and layers of texture and flavor was awesome. Mmm...yum.  After Matt said he was done with it, I smiled and scarfed it down for myself.  However, it seemed like something was missing.  An ingredient: spice, acidity?  Not sure. 4/5Potato Skin: This was by far the best dish we had for the late afternoon. Artistically developed with a burst of flavor and multiple textures. It was medium-sized potato cups that contained assorted vegetables topped with melted cheese.  Globs of sour cream and guacamole were made available for dipping.  Mouth-watering experience! 5/5Fish Tacos: This was highly recommended by the same waitress for Matt.  When it came out the texture, without lemon, was dry.  The flavor was masked by the dryness as well.  The fish absorbed all saliva from my mouth and left it dry.  However, after applying drops of lemon, it made it taste like heaven.  What a magical difference!  4/5Taco Salad:  Everything was great until I hit the bottom of the dish.  The refried beans were disgusting, burnt.  I couldn't handle it.  It is amazing that one wrong thing can abruptly ruin an entire dish!  Like the WHOLE thing.  It left burnt taste residue throughout my entire pallet of my tongue.  I had to wash it down with more Margarita.  Is there negative stars on here? 1/5Drinks: A whole pitcher of Margarita for me, and none for you!  Although the price was steep, as I saw it, we got it for free.  YES!  Omg.  Heaven in a glass is awesome.  I think I was inappropriate (but when am I not), as I licked the rim of the glass \"sexually\" in front of Matt.  He looked at me and said, \"Damn boy!  Jesus, calm down!\"  I wanted solace!  Do not judge me, old man! Cost:  30 bucks for everything, including tip.  I think that is correct, from recollection.  I am certain the bill should have been higher, but because we got drinks and rounds of chips/salsa for free, it was nice.  I made sure we tipped 25%. :D.", "Date": "2012-04-22", "Author_Location": "Queens, NY"}, {"Author": "Laurabeth M.", "ReviewID": "7curuBMaF-ZGWjdVUX4UwQ", "Overall": "5.0", "Content": "I do not understand why this place is rated so low. This is my dad's favorite Mexican place and I've been here many, many times and have never had a bad experience.Well, I had a bad experience once, but it was because my sister brought my nephew who threw up everywhere.The wait staff handled it gracefully with smiles and did their absolute best to let us save face.It was truly embarrassing, and they could not have handled the situation better.The price is great, the value of the food I think is well worth it. I've only ever had one bad server experience, and it was only un-spectacular, not something I would go out of my way to complain about.This is a great casual place for a NBD get-together.", "Date": "2012-09-21", "Author_Location": "Honolulu, HI"}, {"Author": "Miriam D.", "ReviewID": "nfHrH90WSyGBpGzXYOCT2w", "Overall": "4.0", "Content": "Last Thursday I had a few hours to kill while in kaimuki I stopped into a dive mexican restaurant and was delighted . The ambiance and friendly service made me feel very at home. The food was great the drinks were awesome and prices were reasonable.  Helena the bartender, and tracy who was my server were super cool and visited there will def ensure my return.", "Date": "2013-10-22", "Author_Location": "Culver City, CA"}, {"Author": "Cynthia A.", "ReviewID": "v4pL5lLMDiI3-rVS5DNJ4A", "Overall": "3.0", "Content": "Weak margaritas, mediocre service half the time (though I've only been here 3 times), and REALLY bad chile relleno.  The batter around the chile was like unsweetened cake.  Too thick.  Blech.  Don't do it.Cheese enchilada and chicken tamale were fine.  Hard to mess those up. Their salsa sucks (is it bottled?), and nothing is remotely spicy.  There is nothing fresh about the taste of their food.  Where's the cilantro?  How come your guac cost more than $5, but it tasted like it was from a Costco container?  This past time I asked for hot sauce and it took about 10 minutes to get it.Cinco de Mayo was fun - there were lots of cool chicks selling booze, wearing blinkie-light necklaces.  We got \"free\" shot glasses (frickin shots were way overpriced).  Ended up drinking too much.  Tequila goes a long way!  Makes me shudder thinking about it!  Blech.If Azteca were too crowded and I had a hankering for Mexican, Jose's would do the trick.  I guess I have low standards for Mexican.", "Date": "2008-05-13", "Author_Location": "Walnut Creek, CA"}, {"Author": "Tai M.", "ReviewID": "3P1Ku4Bux4eLYXeZ-I848w", "Overall": "1.0", "Content": "To qualify myself.  I lived over 35 years in So.Cal eating mexican food at restaurants on daily basis.  First off, they served me a warm budweiser!  I wanted to have them take it back but didn't want to create a scene.  It went unfinished.The waitresses all wore daisy dukes as if the food isn't good enough to stand for itself; the eye candy may be there just to encourage patrons to continue eating once the food is tasted.The food was bland, uninspiring, and unexceptional across the board.  Its seemed to have to come out of a can, into a microwave, and onto our table.  Both of us had a similar reaction to the food.  So why is it still open?.  Don't support mediocrity. As if already understood, when we rejected a take away container, the waitress did not appear surprised when she took the remnants of our dinner.  I don't leave plates full of food when leave a restaurant.  It just doesn't happen, except hereVery disappointed.", "Date": "2013-08-06", "Author_Location": "Honolulu, HI"}, {"Author": "Tai M.", "ReviewID": "3P1Ku4Bux4eLYXeZ-I848w", "Overall": "1.0", "Content": "To qualify myself.  I lived over 35 years in So.Cal eating mexican food at restaurants on daily basis.  First off, they served me a warm budweiser!  I wanted to have them take it back but didn't want to create a scene.  It went unfinished.The waitresses all wore daisy dukes as if the food isn't good enough to stand for itself; the eye candy may be there just to encourage patrons to continue eating once the food is tasted.The food was bland, uninspiring, and unexceptional across the board.  Its seemed to have to come out of a can, into a microwave, and onto our table.  Both of us had a similar reaction to the food.  So why is it still open?.  Don't support mediocrity. As if already understood, when we rejected a take away container, the waitress did not appear surprised when she took the remnants of our dinner.  I don't leave plates full of food when leave a restaurant.  It just doesn't happen, except hereVery disappointed.", "Date": "2013-08-06", "Author_Location": "Honolulu, HI"}, {"Author": "Brian H.", "ReviewID": "yKFTjNp7U9fZUNuFVnZoQg", "Overall": "1.0", "Content": "Even though I am on a quest fo fiond my fav Mexican place on Oahu and have said I will revisit all the restaurants I have eaten at previously, I will NOT go to Jose's. Period.That place has been there for years and has made me disgusted, angry and confused at how such a place can stay in business.Terrible food, terrible prices, just absolute junk. DO NOT GO THERE! But, if you do, don't say I didn't tell you so!", "Date": "2009-01-11", "Author_Location": "Honolulu, HI"}, {"Author": "Anita C.", "ReviewID": "5B8i2wIGP9nGNT7ZPLz4pQ", "Overall": "2.0", "Content": "Free salsa and chips!!However, the salsa is soooo spicy!!  Can't they just tone it down a bit?  My friend told me that they had once told him that that's how real Mexican's have it.  I looked at my friend and said, umm no, sorry, real real Mexican salsa would have burned my tongue with the first whiff (I worked with a lot of Mexicans back in the days).  So as a restaurant serving to non-Mexican's, they need to tone down the hot sauce bcs ppl at the table can always add on hot sauce if they wanted to.We went the other day for lunch because my friend was craving strawberry cheesecake and he suggested Jose's.  Their lunch menu was nothing really special.  You get the choice of either beans or rice, not both.  So my friend was still hungry after he had his lunch plate.  Luckily I ordered a regular plate of chimichanga and I had both rice and beans and shared half of my changa with him since I couldn't really finish it.  I was a little surprised that the changa didn't come with any sauce, the shredded chicken was a little dry and plain, but it was fried nicely.  We shared a li-hing margarita and it was quite tasty. The server was seriously slacking.  By the time our food arrived, there was no one else in the restaurant, but the server failed to check up on us. Since we were in a rush to leave we had to get the cheesecake to go (I mean, that was the real reason we went there).  If he wasn't craving the cheesecake, I would have just left because it seriously took us about 10 mins to get the server to come over - she was in a \"serious\" deep giggly conversation over by the bar. The other time I went to Jose's, I had the pork chops and they were a good size, however, the cut was too thick and they overcooked it, so the meat was tough and a little chewy.", "Date": "2011-04-18", "Author_Location": "Honolulu, HI"}, {"Author": "Jason W.", "ReviewID": "nyfG-od-OyRoKc7XoeQ66w", "Overall": "4.0", "Content": "¡Joses's es muy interesante!  I've eaten here on a few occasions, chatted w/Dog of Bounty Hunter fame outside, but today brought craving for Mexican Coffee.  I was expecting one thing (the chocolate variety) but got something else equally fun (the tequila variety).  I also ate the huevos rancheros which were cool.  Chips & salsa were FTdub as well.The staff was very informative, asking how things were frequently, & very friendly.  Mid-Sunday is perfect for a visit as it's super chill-sauce.  I got a horseshoe shaped booth across from the television to watch: dunna duh, dunna duh Sportscenter.Tequila coffee + groovy food + cool peeps * chill vibe on a Sunday = another Kaimuki classic", "Date": "2011-08-28", "Author_Location": "Honolulu, HI"}, {"Author": "Peter W.", "ReviewID": "ZWI3KaNpFp2CRtbAdIB-Dw", "Overall": "4.0", "Content": "Normally I would give Jose's three stars for politely serving competent semi-Americanized Mexican food in a relaxed atmosphere. But the negative reviews here baffle and amaze me. Jose's deserves better.I've been there twice now and enjoyed the Enchildas Suizas and a Beef Quesadilla. Both were quite tasty and the service was competent and friendly.So what more do you want people? The prices would be too high if this place were in Omaha, and the food would be uninspiring if it were in Los Angeles, but we are on an island in the middle of the Pacific Ocean.I have eaten at Mexican restaurants in many places all across our fine country, and in my opinion, you would be hard-pressed to find better Mexican food at a better price in Honolulu than you get at Jose's.", "Date": "2010-03-05", "Author_Location": "Ann Arbor, MI"}, {"Author": "Lilian S.", "ReviewID": "pLA98P6Fk9LLM6D7XCxHhA", "Overall": "2.0", "Content": "My boyfriend and I have been trying to find an amazing Mexican restaurant to eat on Oahu... no luck. Last night we decided to try Jose's and didn't leave happy customers.We waited at the front of the restaurant for about ten minutes before the hostess noticed our existence and awkwardly sat us in a booth. The waiter came by and brought us water, then came back again and took our drink orders (we ordered the house margarita in a pitcher which came out to almost $12... waste of money), he came back to take our food orders and came back with the food.The chips and salsa (although free) weren't the best. The chips were really hard, almost too stale and the salsa was definitely from a can. I ordered the chicken taco salad (not too bad, but how can you screw up a taco salad) and my boyfriend ordered the three enchilada special (one cheese, one beef, one chicken). The enchiladas weren't too bad, but I've had better. I read about the margaritas online and how they were delicious, but honestly the only part that made them delicious was the overdose of alcohol in them. Don't get me wrong, I enjoy my tequila, but mixed with cheap margarita mix... no bueno. Also, it cost $12 for a pitcher that lasted three and a half tiny cup-fulls. Too expensive, not worth it.So far Los Chaporros is my favorite... maybe I'll be able to find great Mexican food elsewhere on this island.P.S. I judge Mexican restaurants based on their refried beans and Spanish rice... this restaurant scored a 3/5 on their beans and rice... not up to par with my California standards.", "Date": "2012-07-21", "Author_Location": "Honolulu, HI"}, {"Author": "Jill Y.", "ReviewID": "VV8Lo8iuyacOv_LGsRfE2g", "Overall": "2.0", "Content": "Okay, I'm very torn about writing this review because anyone remember the blackout a few years ago?  Well, Jose's was open and even though the service sucked (I doubt that waitress wanted to work that night) and our food was overpriced, I've always kind of felt partial to the restaurant because they were open during that time.  At any rate, I DO NOT go here for dinner ever because I think it's tacky and dirty, but I do on occasion get tacos to-go even though they are way over-priced...something like $4 a taco.  The thing I liked about these tacos are the deep-fried shell, which gave it a nice crunch.  Heaven.  However, one day I didn't eat the tacos right away and the taco shell had gotten really soft so it tasted terrible.  I don't know if this was my fault for not eating it right away or if the shell was just not prepared carefully.  At any rate, I do not go here anymore and I would say do not go here unless there's a blackout.  :D  No, I mean, there's better Mexican food at other restaurants so don't bother with Jose's.", "Date": "2009-11-30", "Author_Location": "Honolulu, HI"}, {"Author": "Michael W.", "ReviewID": "WKuthLGYBcp2GvGhyv2Qrw", "Overall": "2.0", "Content": "Only reason I went here was to go with great friends.  Otherwise, if I craved Mexican, there are other much better choices.Pros:  Good Margaritas, adequate service, nice decor, lots of parking.Cons:  Food tastes bland, sauces taste like canned or bottled, prices way to high for what you get..So, you won't get sick or die from their food, but nothing to get excited about either.  Only will go if friends insist on it.", "Date": "2010-08-17", "Author_Location": "Honolulu, HI"}, {"Author": "Joseph B.", "ReviewID": "O4oP-saN6tXpPNsA1ZZs6Q", "Overall": "1.0", "Content": "I went here after trying many different Mexican restaurants because a friend told me to try it.  I was very disappointed that they even recommended this place.  First off, it is way too pricey for the quality and quantity of what they serve.  We ordered a pitcher of margarita and all we got was a half pitcher, severely over priced for the amount of liquor served.Another thing that got me was the \"prawns\" they advertised in the menu.  The prawns they so called were mere shrimp, almost the size of salad shrimp and were charging $1.50 per piece.  They also charged us for a side of guacamole.  Who charges for guacamole when its suppose to come with your entree?  Plus they will charge you for extra chips and salsa.Horrible experience, the food was mediocre, not much flavor.  I've tasted better from other restaurants with almost half the price.  This restaurant is severely over priced for the quality of food they serve.  Don't go!", "Date": "2008-08-14", "Author_Location": "Honolulu, HI"}, {"Author": "Kendra P.", "ReviewID": "IADEPXltOaus7tCzknER4A", "Overall": "1.0", "Content": "My husband and I went here yesterday on the recommendation of a friend. I had the fish tacos (mahi mahi) and he had a burrito. The service was good and the I liked my tacos. What I didn't like, was the roach that crawled up the wall next to my husband as we ate. I immediately lost my appetite. It scurried away, but came back and was eying up his leftovers on his plate.  I understand we live in the tropics, but I was really skeeved out by seeing a roach in the dining room. I can't say that I'll go back. I was just too grossed out.", "Date": "2008-10-27", "Author_Location": "Burien, WA"}, {"Author": "Larry G.", "ReviewID": "fewGwudHXKCxQhI0fyKGlQ", "Overall": "2.0", "Content": "Not sure why I keep returning to this place; maybe my short-term memory is starting to slip away...Where to start?  Margaritas were horrible; ordered a frozen one and basically got margarita mix over crushed ice; there was nothing frozen about it.  Salsa was ok but had no spice to it and not much flavor.  Not sure if they make it their in the restaurant or not but whoever makes it needs to understand that jalapenos are ok to put in your salsa!Enchiladas were passable (kids were ok with the cheese enchilada) and the rice was ok but stay away from the refried beans; not sure what was causing it but it smelled/tasted off.  Had to be straight out of a can....  The whole menu just lacks in depth of taste and heat; for whatever reason they really hold back on using any spices in their food.  Maybe an island thing...All in all, a \"bleh\" experience.  We won't be coming back.", "Date": "2012-10-29", "Author_Location": "San Antonio, TX"}, {"Author": "Bruno D.", "ReviewID": "R004g7OKxGcKdFsk61za7A", "Overall": "4.0", "Content": "Can't really complain. The bartender was friendly, the food came out quick, and drink was cold and strong. Michelin dining it was not, but hole in the wall it was not either. I'll be back for sure. Could probably use a little background music but that's about it", "Date": "2013-01-12", "Author_Location": "Honolulu, HI"}, {"Author": "Emy R.", "ReviewID": "yT7VaK6WY0VutyW_TdUMtA", "Overall": "2.0", "Content": "Wasn't impressed with Jose's at all and certainly not worth the drive from the westside of the island. Wish I would've thought to check the reviews on Yelp before venturing all the way there, but my date wanted to try it so off we went...The service was great. Our waitress was very friendly and attentive. 2 stars. They do give you a small basket of chips with salsa but the salsa tasted spoiled so we just ate the chips. If you want another basket you have to pay for it so eat the one you got slowly. As many yelpers mentioned, they do charge for any extras like guacamole etc. So be aware. I ordered the crab enchiladas which was smothered in so much cheese I could feel my arteries clogging up. The crab tasted as if it came out of a can and was pretty tasteless. All I tasted was cheese and mush. My date ordered beef enchiladas and he said it tasted as if it was previously frozen. He said it was bland and cold in the middle. We ended up pushing the food around on the plate & didn't finish it. There were only 3 tables when we got there on a Saturday night at 7pm, that should've been our first clue. No other customers came in while we were there. The highlight of my night: there were 4 military men in uniform sitting in the booth behind us. When they asked for the bill, the waitress told them it had been taken care of and pointed to an older couple's table. The older man came over to their table and thanked them for their service and told them it was his pleasure. My date and I both clapped, cheesy I know but, I was so touched by this man's kind gesture. Ok, sorry I got side-tracked. Definitely not a place I want to go back to, Service was great though I know many yelpers complained about the service. Maybe I got lucky that night or perhaps since there were only 4 tables and nobody at the bar the waitress was able to give us her full attention. Still on a mission to find an authentic Mexican restaurant. If anyone knows of one let me know :)", "Date": "2012-03-12", "Author_Location": "Kapolei, HI"}, {"Author": "Lyn U.", "ReviewID": "HWtEKzS8bypqM5SzPU5KSA", "Overall": "3.0", "Content": "We used to come here often many years ago. Then at one point, the ownership changed and the food just tasted different.  We haven't been here for a long time so we went last night to see how it was. The food was ok, though not like I remembered before.  I ordered the New Mexico Burrito (I think the meat chunks used to be larger before), and my husband ordered The Whole Enchilada.  This was the first time we had our daughter with us.  She gobbled up the free chips.  Then I ordered for her off the Keiki menu - Grilled Cheese with Beans and Rice.  For $5.95, you get about a 6\" diameter cheese quesedilla and a LOT of beans and rice.  Her beans and rice portion was larger than ours!    The menu keiki menu says 'beverage included'.  So I asked for milk.   The waitress said, 'It's not included.\"  Note: only juice and softdrinks are 'included'.  Milk is an additional $2.50 more.The food is a bit pricey, but you get a lot.  After we paid our bill and were walking out, I stopped when I saw the sign at the entryway - TUESDAYS: Kids Eat Free with a paid Adult meal.  Wait, it was Tuesday and I got charged for the child meal!  Thought about asking for the adjustment, but did not.    I'll just need to remember to look out for it next time.", "Date": "2013-10-09", "Author_Location": "Honolulu, HI"}, {"Author": "Alan W.", "ReviewID": "fqk9uIxwsypKF-nneF3y3Q", "Overall": "2.0", "Content": "Went for lunch.  Service was excellent!  Food wasn't.  Chile Relleno was more bread than chile.  Should have joined the tequila tasting at the bar with the sales guys.  Shades of Kitchen Nightmares.", "Date": "2013-05-04", "Author_Location": "Honolulu, HI"}, {"Author": "Meg F.", "ReviewID": "0CMXs4uI3Q8Ss7BquYKkSg", "Overall": "4.0", "Content": "I'm not sure what's going on in this review section, but I recently ate at Jose's and I enjoyed myself very much. Sure, it's not the best Mexican food ever but it is tasty! The decor is like many other local spots (Victoria Inn, Zippy's, etc), and I happen to enjoy that type of laid back atmosphere. The service was good - the servers were polite and quick. The prices are good for Hawaii, too. Especially for the Waialae area. If you want a fancy, upscale dinner don't go to Jose's. If you want a casual place to eat good, solid Mexican food and to chill, Jose's is the place for you.", "Date": "2010-03-04", "Author_Location": "Ypsilanti, MI"}, {"Author": "Anjelika J.", "ReviewID": "s8JxPAODX-U0HHFaGmDE-A", "Overall": "1.0", "Content": "I am sorry to say that they have removed a VERY important item from the menu: Flavor. Yes, I know, say it ain't so. It has now been replaced by BLAND. Unfortunately, the world has not made an anecdote to destroy this type of Bland. Until they do, *peace out* Jose's. :(", "Date": "2013-02-11", "Author_Location": "Honolulu, HI"}, {"Author": "Brenna J.", "ReviewID": "Q7DjLaymQP09bKdsvNTmHg", "Overall": "1.0", "Content": "My family and I have been eating here for three years and tonight was the first night we have ate there in about 9 months, and all I can say WHAT HAPPEN?! Where is all that amazing food you guys use to put out on those tables? Sad to say but until this restaurant makes a huge turn around we will never eat there again. This is a huge bummer for us beings we use to look forward to getting in the car and making that drive for those rice and beans but not anymore. if you're going to put this horrible food out on your table you may want adjust your prices and change your menu to \"old\" & \"frozen\" nothing was fresh. Feel horrible putting a bad review but it needs to be done.", "Date": "2013-06-04", "Author_Location": "Jacksonville, NC"}, {"Author": "sky i.", "ReviewID": "wN9KH6DHWKsLn82Eismgqg", "Overall": "2.0", "Content": "Seems like almost everyone had problems with service, something I've never experienced here because I always sat at the bar. Also, not knowing what 'authentic' Mexican is supposed to taste like, I'll probably be more generous in my review compared to someone who grew up in Southern California.Their complimentary chips and salsa, if fresh, are as addictive as crack to me. Sometimes I'll get so full on chips and magaritas, I'll barely have room for entree. My favorite dish here is their chicken fajita. Everything else tastes average or worse.2.5 stars.", "Date": "2008-06-02", "Author_Location": "Honolulu, HI"}, {"Author": "J P.", "ReviewID": "13FFGsagTJKDK4xj7-_6oA", "Overall": "5.0", "Content": "Margaritas, Taco's and the Chili Rellenos are excellent and added bonus the beans are the best I have found in Hawaii also try the Jai Burrito no one else has it except Jose's. Lots of parking, but pay the meters the meter maids work nights up here, The taco's are the best in Hawaii,Must of there staff is fun and cheery, back ground music very's on the bar tenders mood, from Mexican to Rock and Christmas music last night. There are about 6 TV's over all (very low volume in the restaurant section) playing the UH football game and 3 or 4 TV's in the bar area with current sports at any given time.", "Date": "2010-12-01", "Author_Location": "Honolulu, HI"}, {"Author": "Toni M.", "ReviewID": "K1jZ7bd8vXOmDc9AVsP_vA", "Overall": "2.0", "Content": "I wanted Jose's to be my new go-to Mexican restaurant.  But it won't even get another  chance.  The food and the drinks were sub-par.  Very little flavor.  I think very few items are actually house-made.  The salsa could've been Pace.  On the plus side, the decor and staff were great.", "Date": "2012-08-11", "Author_Location": "Honolulu, HI"}, {"Author": "risk E.", "ReviewID": "-1XZIYRfNe6_g7K1czD8Hg", "Overall": "2.0", "Content": "I think this place is better established as a local bar rather than a restaurant. Food is okay but in my opinion not worth if you want real mexican food. Quality is higher then Taco Bell but lower than Azteca.", "Date": "2013-08-16", "Author_Location": "Honolulu, HI"}, {"Author": "Brian M.", "ReviewID": "w3kC2hFcTVaHXCndIfzy7Q", "Overall": "2.0", "Content": "The friendly and supportive wait team makes up a bit for the food. The chips, salsa and drinks are the best part of the deal.  The fish taco has small blocks of mahi and not  with the effort to eat. The beans are bland and rice is okay. Seating  is comfortable and no wait on a Friday - go figure.", "Date": "2013-07-08", "Author_Location": "SKILLMAN, NJ"}, {"Author": "Tanya M.", "ReviewID": "ZH1oSd7F7C4lW_CoV8PIOg", "Overall": "3.0", "Content": "Went today on New Years Day.  Our server was hands down fantastic!!!  Menu was a tad pricey.I had the albondiga soup and taquitos.  The soup was great, almost like mom's...taquitios, left much to be desired, meat wasn't very flavorful but they were served with plenty of guac and sour cream.My husband had the fajitas...they didn't come sizzling but the meat was flavorful, rice was good, beans very bland.I wasn't expecting this place to be horrible based on reviews but it wasn't too bad...1000 times better than El Burrito!", "Date": "2009-01-01", "Author_Location": "Honolulu, HI"}, {"Author": "Kimo S.", "ReviewID": "ovlHutw1ggSWbaRhxwR8QQ", "Overall": "5.0", "Content": "I come here for the enchiladas. the staff is nice and courteous. The waitresses here is hermosa :) i gotta make it here one day during happy hour", "Date": "2013-07-15", "Author_Location": "Honolulu, HI"}, {"Author": "Chris K.", "ReviewID": "sFn9nj5ywe50Tsxgr5r1Mw", "Overall": "4.0", "Content": "Hungry for Mexican food? Jose's will satisfy your craving!My faves include:A pitcher of Blended MargaritasSopa de AbondigasSnow Crab Burrito or Chicken Enchiladas or Pork Chops - all served w/ Refried Beans & Spanish Riceand finally... Jose's SundaeMmmm, dee-lish!! *^_^P.S. They serve their entrees on hot plates, just the way I like it! :)", "Date": "2011-05-17", "Author_Location": "Honolulu, HI"}, {"Author": "Trip M.", "ReviewID": "W-od0oUauJQQFAzwQWNnWA", "Overall": "4.0", "Content": "I moved here from LA four years ago. I miss Mexican food. All my friends go to Jose's in Kaimuki. I decided to check it out. GREAT TACO's...Ground Beef and deep fried..R u kidding me. When I crave Mexican  Food I crave JOSES..How can u go wrong..chips Salsa and a Back Bar Frozen Margarita? I love that place. The people are friendly and the Service is fast. I suggest the TACO's (hard or soft)Slow cooked PORK ROJO BURRITO THE SPINACH ENCHILADA and THE BIG KAHUNA...", "Date": "2013-05-12", "Author_Location": "Los Angeles, CA"}, {"Author": "Ku'ulani M.", "ReviewID": "5mBHjM-3-mUh9h22LIz1kg", "Overall": "4.0", "Content": "After taking a 2 1/2 year hiatus from Yelp (while life kept me busy), I was compelled to come back just to write a review on Jose's. My first time here, I was happily surprised by the number of tables. On a Saturday night, any given restaurant in Honolulu has a wait over 30 minutes. They took a table of 5 walk-ins without problem.We were treated to and a bit taken aback by excellent customer service. Our waitress was quick, attentive, thoughtful and patient. She noted that the kitchen was a bit behind, so encouraged us to put in our orders early. She paid close attention to keep our glasses full. She checked in on us and made small talk with my toddler son each time she came to the table.Here's where I was really impressed: after refilling our drinks, she noticed that my son's sippy cup was empty, and offered to wash it out and refill it with milk, as a courtesy. How's that one? 2 years and many family restaurants patronized as parents, and that's a first! Additionally, because we were dining with my parents who joined us later, she asked if we needed our tab split. Who does that? Waiters are usually reluctant to even handle split checks, let alone offer to do it.On our way out, another staff member thanked us for coming and wished us a good night. The food was pretty good, and we were stuffed to the max (enchiladas and tamales, macho nachos and the complimentary chips -- YUM). We could easily have gone elsewhere, paid twice as much for ambiance or name, and not received the kind of special attention and care that we did here at Jose's. We'll be back!", "Date": "2012-03-25", "Author_Location": "Kaneohe, HI"}, {"Author": "Amanda M.", "ReviewID": "WcMsZlUHElRPPmm-19r1Sw", "Overall": "3.0", "Content": "I'm hooked for three reasons only1. It's conveniently located nearby in Kaimuki2. The margerita's are DELICIOUS3. My daughter loves it and kids eat free on TuesdaysReason's I frequent Joses less often these days1. No happy hour!2. Completely un-child friendly- no crayons and paper.  And! The plates they serve the children are scolding HOT!!3. WAY overpriced", "Date": "2010-03-24", "Author_Location": "Honolulu, HI"}, {"Author": "Cassie C.", "ReviewID": "YLpsjhHs8gxBInCqLKojLg", "Overall": "1.0", "Content": "TERRIBLE!!!!! We arrived at 10:55 on a Sunday morning and waited in front of the door until the 11am opening. The flat, dry, and unauthentic server unlocked the glass door and just walked away - no smile, no welcome, no good morning. We walked in, and she left us standing at the door like the place was packed and we were in her way. Hungrily we proceeded to a table where we were served a basket of cold chips and bland salsa. I should've known then to run out the door.But I was craving Mexican and had already had the flavor of salsa on my tongue. In for a penny, in for a pound, eh? I asked if they could make a California Burrito (carne asada, fries, pico de gallo, and cheese -- all elements clearly displayed in the menu), and the haggard old server smugly replied that they only prepare things seen on the menu. I digressed and chose nachos - since you can't really ruin that classic, right? WRONG!! about 20 minutes later (and I mentioned that we were the FIRST and ONLY customers, right?), I was served a half burned and now cold plate of mess that had ZERO flavor, and even less chicken as I had specified. There were plenty of cold chiles and olives though, even though I had specified none of either. Bottom line?? Go outside and pluck one of the cacti out of the window gardens and eat that. It'll have more flavor and less attitude. If you're still craving Mexican then, I recommend you drive up the street to Toritos. MUUUUCH BETTER!!!", "Date": "2013-04-15", "Author_Location": "Honolulu, HI"}, {"Author": "Modez P.", "ReviewID": "QpitXajKBiKRkHMjga6KUg", "Overall": "2.0", "Content": "First time eating at this joint. I must say that the whole enchilada was delicious. Comes with three enchilada's one beef, one shredded pork and one cheese all smothered in cheese and tomato sauce. The meal also includes beans and rice. The portions were big, but fucking 15 dollars a plate for mexican food?  I was better off buying a frozen enchilada tv dinner from safeway. End up paying one big ass bill for 2 meals (fuck me). I could see maybe nine or ten bucks, but fifteen buck? shit nigga pleeeze. For plop on a plate...fifteen bucks is pretty damn steep. wurd 2 yo mutha.", "Date": "2013-03-16", "Author_Location": "Ewa Beach, HI"}, {"Author": "Michelle M.", "ReviewID": "miFA0SrASr-AWpuHAWpWtw", "Overall": "4.0", "Content": "I was pleasantly surprised by this restaurant. The fajitas were delicious and the prices were reasonable.  Too bad it is so far from home.", "Date": "2013-06-12", "Author_Location": "Kapolei, HI"}, {"Author": "LeaDan Y.", "ReviewID": "_6HeiCaabgDK4qDmAWje8g", "Overall": "2.0", "Content": "If you are in Kaimuki anyway, then go to Azteca's.  Don't waste your time and money on food that has no actual flavor.  I'd rather go to Taco Bell.", "Date": "2012-12-27", "Author_Location": "Honolulu, HI"}, {"Author": "matthew g.", "ReviewID": "CY9lGyRvEAT84rVCHIKgqg", "Overall": "4.0", "Content": "I have never actually ate inside of here so I will only rate the food. I always get it to go since I live down the street. The burritos I had were alright but I feel the tacos are really good especially with some hot sauce but Im not sure if they worth 4 dollars each. I really and I mean really like the snow crab quesadilla. Tons of crab meat in it with a nice taste of butter also. That for sure I am a fan of.", "Date": "2012-12-19", "Author_Location": "Honolulu, HI"}, {"Author": "michelle a.", "ReviewID": "mGeZMLHaQt66434adR-M4w", "Overall": "1.0", "Content": "The food here is garbage. Do not waste ur time. Also, I don't understand how expensive it is bc it's all crap and just a bunch of rice and beans and other crap. me and my husband literally went home and made ourselves vomit after bc it made us feel like ish. he got a soggy quesedilla and it was 16.95!! wtf?! I got a nasty taco salad and it was $12.95 seriously I hate myself for going there and wasting money. I feel robbed and I hope you don't make the mistake of going there bc you will regret it.", "Date": "2012-03-26", "Author_Location": "Oahu, HI"}, {"Author": "Danielle Y.", "ReviewID": "I4R_oBudEp0iHbHFsEpgVg", "Overall": "1.0", "Content": "This was so so so SO BAD. Oh my god. Why did I eat here. First off, the hostess and waitresses were super bitchy. We stood at the front for about five minutes before anyone even acknowledged us. Is it so hard to say \"we'll be with you in a few minutes?\"When we were seated we waited for about ten minutes . . . no one came to our table. I actually waved at a waitress; she looked at me and walked away. WTF. Then I went up to another one and asked for water. Ten more minutes passed until we got water and chips, and another five for the actual server who was assigned to our table to show up.Now, the food. Oh my god. Why did I keep eating this? Idk, I was so hungry and tired by then; I just wanted to eat. It was SOOOOOOO SALTY. I couldn't finish it even though I was still hungry. That's how bad it was. I feel bad for being so harsh but the service was honestly the most awful I've ever received anywhere . . . and the food is right behind it as second worst.What a waste of money. Don't go to this dump. This has made me swear off all Mexican restaurants in Hawaii. I had been on the lookout for a good one . . . but I give up. Mexican food in Hawaii is really, really bad, and this place is the king of shitty food.", "Date": "2010-03-07", "Author_Location": "New York, NY"}, {"Author": "C O.", "ReviewID": "91PCBTe3jq-u9yt9Wo9xSA", "Overall": "1.0", "Content": "The food here is uninspired and is a poor attempt to import Mexican cuisine to Hawaii. I failed to taste any flavors or spices in my enchilada's----it was as if they had simply dumped all the raw ingredients together and microwaved them to get warm. Our server was equally uninspired. She appeared to be more interested in flirting with the rather rough looking characters getting drunk at the bar than in serving her paying guests....Aboslutely not worth going to for any purpose---even if somebody else is paying.", "Date": "2009-03-02", "Author_Location": "Honolulu, HI"}, {"Author": "S Y.", "ReviewID": "jOU_phoRvQSP7lb5DfuG9w", "Overall": "1.0", "Content": "My boyfriend and I decided to grab a late evening dinner and remembered that Jose's stays open late, complete with great food and beer.We walked in and got seated in a booth next to a family that was just about to finish their evening there. we could not decide what to order so we went ahead and ordered a beer from the waitress. she was pleasant and told us that she will be right back to take our order...little did we know at the time that was the cursing words that would bite us in our a** later.we got the beer, free chips and salsa and she quickly whisked away before taking our order.  we just sat there waiting, thinking that she had to drop off some tabs to the other table and such. we waited and drank the beer. okay 5 mins, 10 mins, 15 mins we look at each other and try to catch the attention of our waitress, but to no avail our efforts are fruitless. we look around and try to flag the other waitresses that were just standing around but they were too busy talking story and once again we were \"shut down\".  once again \"our\" waitress went to refill the other tables water and such but did not even bother to make eye contact with us...FYI she did know that we wanted to order food.  after 15-18 min  i told my boyfriend that we should just go and get some taco bell because i know that i would not be able to enjoy my food after this experience. he finished his beer and we asked for our bill, that took another 5 mins so we left $5 for the beer and started to walk out.  at that point the socializing waitress suddenly started to yell out \"wait\" i ignored her just like she had done to us for the past 18 mins.i have been to this establishment 4 times and i would have to say that each time i come here the service gets worse and worse.  the last time i came here with 3 friends and we were so excited to enjoy some yummy food and margaritas.  unfortunately we when we received our complimentary chips and salsa we noticed that they were far beyond stale, so we asked for a new basket. our waitress tells us,\"i got them from the bottom of the barrel so i figured that they might be stale.\" she brings us another basket and they were just the same. why serve something bad when you know that is tastes like sh**.  to top the evening off the same waitress had to re-do my credit card swipe about 3 times, i made sure to keep my receipts until i got home and checked on-line the next day.  i love the food at Jose's but the wait help sucks, they don't seem to care about the food, the customers, their job.  i hope that management can encourage their staff to do a better job!  SERVICE 1 star  FOOD and drinks 4 stars", "Date": "2007-05-27", "Author_Location": "HI, HI"}, {"Author": "Brian H.", "ReviewID": "TSYzPikTQQJ9O2wGCaFEbA", "Overall": "1.0", "Content": "We just left Jose's in Kaimuki.  Los Chaparros (our usual spot) was too crowded so we thought we'd try something new to us.  I wish I had read the reviews first.  Waitress:  Nice and attentive.Surroundings: Dingy ambience and NASTY carpet.  Food:  The salsa was very sweet not very flavorful.  Safeway Salsa is better.  The small side guacamole ($6.95) was absolutely tasteless and Blended to a mush. We shared a three item combo:Chile Relleno: not very cheesy, too much egg, very little chile.Tamale:  Masa very firm almost too firm, beef overcooked, mole way too smoky or something.  We could only take a little of it.Chicken Enchillada:  this was pretty tasty though the tortilla was quite hard.Beans: Pretty tasty, whole beans not mush.Rice: Overcooked very little flavor.Overall we were very disappointed and will never return.", "Date": "2012-11-30", "Author_Location": "Honolulu, HI"}, {"Author": "Kyle W.", "ReviewID": "cyjw-lEI4SpVgVrDIQxmzw", "Overall": "1.0", "Content": "Man.  Very surprised at how bad everything is here. . .  Service is terrible, food is at best worth half the price you pay, and the prices are simply outrageous.  How this place stays in business I don't know. Came here for dinner.  First thing I noticed is the prices are at least 20 percent higher than other Mexican restaurants in the area like Toritos or even Azteca.  Also, they charge extra for pretty much everything you want to add to to your plate . . . like chicken or beef!When you get seated they give you a half  full basket of the \"free\" chips (and salsa).  It's not unlimited though.  We tore through the basket in minutes but don't ask for more cause they'll charge you $2.50 for each additional basket.  To me this is just lame for a Mexican restaurant.  Seems like they are just trying to gouge you.Ordered taquitos and carnitas plate.  When the taquitos arrived, we noticed there was no guacamole . . . which was supposed to be included with the meal.  We asked our server and she said they were out of guac. . HUH?  You guys are out of guac and you didn't tell us when we ordered???  That's terrible!!!She was so casual about not having guac, we asked again if it was included and she said yeah but they were out.  She didn't seemed bothered by this at all.   And made no real attempt to remedy this. No price adjustment, no offer to add something else.She then basically ignored us for the rest of dinner service.  Honestly, I think this place's problem is its management.  Seems like they are just trying to hit you for whatever they can while not offering nothing in return.  It carries down to their staffs attitude as well.  I'm honestly shocked that this place has been open for so long.Needless to say I will NEVER go back here.  If you want Mexican, go somewhere else. . . ANYWHERE else.", "Date": "2009-05-11", "Author_Location": "Honolulu, HI"}, {"Author": "George D.", "ReviewID": "H9WmG14lN5RRZZom4KHODg", "Overall": "2.0", "Content": "NO WAY JOSE !  How do you call this Mexican food????Maybe its because I travel and eat my way through a country that I am a bit critical, but this is like saying you serve Veal Oscar topped with Krab and brown gravy.Interior is sterile white with the charm of a bank waiting area.  I cant describe the food because I cant really tell what it is.  Most is tasteless or salty.  I had the fish tacos that they recommended.  Stringy and dry fish, chewy tacos and not much else.  Margaritas made from a mix and tequila---WoW!  Not exactly knocking the socks off.It appears to appeal to its clients though, mostly drunks that babble and ogle at any woman brave enough to sit next to them.", "Date": "2010-05-01", "Author_Location": "Brentwood, CA"}, {"Author": "David G.", "ReviewID": "9WB_fJyDkJT_UgnpnY2v3g", "Overall": "1.0", "Content": "This place is just terrible and I mean terrible. I understand we are in Hawaii so Mexican food won't taste as good as other places, but this place is just a joke. Unfortunately, I'm not laughing. Jose's has the worst Mexican food on the island, period. Run while you can...", "Date": "2009-03-28", "Author_Location": "Honolulu, HI"}, {"Author": "Marisa R.", "ReviewID": "Ipsj9hj_jEeFmjCU8-6vbA", "Overall": "4.0", "Content": "I like Jose's.  I always eat enchiladas when I come here and they're pretty good.  I don't know why they have such shitty reviews for the food.  They're definitely better than Azetca and BC burrito.  What makes this restaurant crappy is the service.  They charged me 1.75 for sour cream and .75 for extra onions? You've got to be kidding me.  Also, once the waitress didn't card my younger brother and carded me.  And sometimes the food takes FOREVER to come out. Dumb. If Jose's could fix these kinks, it would make their restaurant 100% better.", "Date": "2012-01-22", "Author_Location": "San Francisco, CA"}, {"Author": "Mariah G.", "ReviewID": "haaiUjEz1khGmtMPgLwQEg", "Overall": "4.0", "Content": "I like to come here often with my boyfriend and his family. I always get the bean burrito (which is huge). Pretty good service!", "Date": "2013-03-07", "Author_Location": "Honolulu, HI"}, {"Author": "Michelle L.", "ReviewID": "BH54P_ZR72m3uZ2rWXCXpw", "Overall": "2.0", "Content": "i'm n00b sauce when it comes to mexican food.  i love taco bell and chipotle :X  regardless, i can tell whether or not food is good or not.  each time i come to jose's, something seems to be lacking.  the food is mediocre and overpriced.  this one sauce was pretty good, can't quite remember what it was but it was with the enchiladas.  the service is quite erratic as well.the boy toy loves mexican food but unfortunately, i cringe at the thought of coming here.  bc burritos is right around the corner.  i rather hit that place up any day.", "Date": "2009-07-22", "Author_Location": "Honolulu, HI"}, {"Author": "Tracy M.", "ReviewID": "KIUDQC4G3n2mB9IYTqHqEQ", "Overall": "2.0", "Content": "One night, I was craving Mexican food so I decided to go to BC Burrito, unfortunately they were closed so my room mate and I decided to try out Jose's seeing as we'd never been here before.  We ordered drinks and dinner, but it was not great at ALL!  My room mate's bloody mary was $6 for a TINY little glass, and I had ordered 2 tacos which were somehow like $15!!!  Ridiculous!  I can see if they're like AWESOME tasting, but it was sooooo mediocre.  I had also wanted a side of jalapenos with my tacos (which were $3 and the waitress forgot to bring until i asked TWICE).  I think the best thing about this restaurant is the chips and salsa.  Blegh.  Never again.", "Date": "2010-11-04", "Author_Location": "Honolulu, HI"}, {"Author": "Kevin B.", "ReviewID": "cKpAnl-3VadpYoUldWnnpg", "Overall": "2.0", "Content": "First off, there is no decent Mexican in Honolulu.  With that being said, Jose's isn't good.  Its not great to say because its in my neighborhood and I want to support local restaurants.  But we had some nacho appetizer, it was gross.  The margaritas are super strong, and $7 for a regular sized one.  Really small margs go for $5, but they're like 8 oz at best.  Save your money, head elsewhere.", "Date": "2012-09-21", "Author_Location": "Honolulu, HI"}, {"Author": "Tine H.", "ReviewID": "mHPHvSKfLpKdLl9D1eTJ9Q", "Overall": "1.0", "Content": "The food was dry, it was expensive for what we got and to many limitations. Will not go there again sorry", "Date": "2013-02-15", "Author_Location": "Kalihi, Honolulu, HI"}, {"Author": "Colin B.", "ReviewID": "L8dI6Xpv71_RITEdl58Q0Q", "Overall": "1.0", "Content": "Total crap.  The flavor was very bland and for some bland azz stuff, it was pricey", "Date": "2012-03-18", "Author_Location": "Honolulu, HI"}, {"Author": "Juliann C.", "ReviewID": "B50tfYGCLc4AsckwyYu0HA", "Overall": "2.0", "Content": "Wasn't anything different from any other Mexican restaurant... the service was great though!", "Date": "2011-06-03", "Author_Location": "Honolulu, HI"}, {"Author": "Kathleen A.", "ReviewID": "dmL7KWXOByp0C_8nz-Wz7g", "Overall": "1.0", "Content": "I don't even want to give this place one star because of the HORRIBLE SERVICE from a certain lady with dark black hair. She has to be one of the most rudest waitresses I have EVER encountered. The food was decent, but the service sucked big time! Words can't even express how annoyed I was of her unprofessional attitude. All I wanted was a simple take out order and she gave me no attention. Probably because she knows she's not getting any tip out of it. How sad is that. I'm not going to go on with what happened, but I just know that I will NEVER EVER go back to this place EVER again. She is horrible. I have one simple advice. If you hate your job, then quit lady! No one wants to be served by someone who never smiles, has a terrible attitude, and just obvious your all about the TIP not the service. Thank you. Goodbye. :)", "Date": "2013-11-05", "Author_Location": "Kaimuki, Honolulu, HI"}, {"Author": "Thaila K.", "ReviewID": "t2WthVXWwuqezQW4Zed28Q", "Overall": "3.0", "Content": "I rated it 3-stars because although I'm not a \"regular\" I've been there more quite a few times at different times and days.  The food is okay.  There are some dishes better than others for sure. The place and the patrons of the place is more sporty men ages 18-60, college-crowd and perhaps older couples...people who go there to drink and don't really expect much.  Tonight was a TERRIBLE experience.  I think if our server explained with something like short staffed in the kitchen or short staffed at the bar or something I would have been a little bit more tolerable and understanding but no such thing.  It didn't seem overly busy (I've seen that place extremely busy) nor did it seem like something was going on in the kitchen or anywhere else.  In any event, the service was very slow and felt even \"ignored\" - I went in with the fam bams, which means I had my two daughters with me.  My older daughter was pretty thirsty and drank her drink pretty quickly.   We all munched on the tortilla chips and dip which we finished and by the time the server came and asked us if we needed anything the rest of us finished our drinks and needed refills as well...then again empty glasses, this was during our meal so of course we figured she'd be better about asking us if we needed anything else. It got to the point where I had to ask a busser for a refill.  After we got our refill that was it.  We did not get another glance or anything until she came by to collect the plates...I had to ask her for another refill for my daughter and although the rest of us wanted refills too it was like forget it...Anyway she acknowledged that she was going to get a refill and even took my daughter's cup....and NEVER came back until it was time to pass out the tab.  She never looked at me, just handled the bill to my friend and left.  We were at the restaurant for an hour and 35 minutes, we got our food in within the first 20 minutes and spent the rest of the time waiting...for her.  She never asked if we wanted more chips and salsa, she never asked us if the food was okay, she never asked for refills after that first round and needed to be \"asked\" if we could have refills, never asked if we wanted water (perhaps that would have been easier and faster to refill????) and then we waited to get the bill and then my friend waited to pay.  YIKES!  I've never been treated that poorly there since tonight.  I mean there were a few other times where service was slow but not that bad.  In any event...idk I was just so upset and disappointed.  I don't think I would go there again...If more than 50% of the time I went there the food and/or service was good I would say meh...chalk it up to a \"bad night\" and plan on going back but because the food nor the service is anything that totally blows my hair back...I can do without it.  Maybe if I were 21 and diggin' on the sports and alcohol then this would be the perfect place for me.  Unfortunately, I'm not.", "Date": "2011-04-10", "Author_Location": "Honolulu, HI"}, {"Author": "Jennifer I.", "ReviewID": "bBEuFE6U4Aj60o3d8LL-Jg", "Overall": "4.0", "Content": "I love Jose's which is why I'm surprised it has so many bad reviews.  The service is always good when we go there.  And I love, love their food.  First of all they give free chips and salsa.  I think it should be mandatory that all mexican places give free chips and salsa.  The salsa is spicy but not overpowering.  I've tried a lot of items on the menu but my favorite is their chicken chimichanga.  It's super tasty, and is fried perfectly.  My bf usually gets their carnitas, which he says are amazing.  I also like their burritos, especially the jai.  The portions are pretty large so I can never finish a burrito or chimichanga in 1 sitting.", "Date": "2011-03-24", "Author_Location": "Mililani, HI"}, {"Author": "Dan B.", "ReviewID": "5rSzzRIiJnSxVb9iAwiqTQ", "Overall": "1.0", "Content": "The food wasn't as tasty as I thought. It is overpriced. You can tell by the amount of people on a Friday night, restaurant less than half full. What turned me off completely, when one of the workers coming out of the kitchen going to the bathroom, used the restroom and DID NOT WASH HIS HANDS, GROSS!!! Will never go back again.", "Date": "2013-10-26", "Author_Location": "Honolulu, HI"}, {"Author": "Bill S.", "ReviewID": "nCSDrTJIysgGiROmLi5gUw", "Overall": "4.0", "Content": "Kate our waitress was the best!", "Date": "2010-07-22", "Author_Location": "Honolulu, HI"}, {"Author": "Krysten I.", "ReviewID": "ujHbpGiV_EPI_rx4ii4NNw", "Overall": "2.0", "Content": "$12 for 3 tacos. I loaded them with salsa and salt because they taste like nothing if you don't. Not much else to say...The food is not worth the price and the service is just okay. MEH. I've definitely experienced better.", "Date": "2011-09-27", "Author_Location": "Honolulu, HI"}, {"Author": "J K.", "ReviewID": "qwnO7WQH47q4yQJ8l-TSRA", "Overall": "2.0", "Content": "What the heck happened to this place??  Their menu is totally different now.  My husband and I ordered take out from there since we know how awesome the service is.  His all time fav is the Burrito Del Mar.  They changed the sauce it used to come with and now make it with ranchera sauce.  Tasted weird with the crab!  The sauce was so strong it took away the flavor from the crab. I still love their chips and salsa though, but then again how can you mess up chips and salsa??", "Date": "2011-02-19", "Author_Location": "Honolulu, HI"}, {"Author": "Stephanie H.", "ReviewID": "Od-ZaoS9sV9mlsZgLVSgMA", "Overall": "1.0", "Content": "EPIC FAIL!!! The service was so super slow and terrible, waited for 40 minutes for the food to come out and it wasn't that great...the chips and salsa they brought out initially was stale and definately from a jar, I could've eaten that at home!!!  After waiting over 15 for our bill (which never came) we ended up leaving $20 on the table and walking out...", "Date": "2011-08-27", "Author_Location": "Honolulu, HI"}, {"Author": "Mila S.", "ReviewID": "p9wurBiJgBlDB-mbhqIFdA", "Overall": "5.0", "Content": "I am so surprised at these negative reviews! I really like Jose's. The menu is extensive and has some really unique options, like crab and spinach. The servers are really friendly and service is good. They also give free chips and salsa, and I don't think you can knock them for the salsa being too hot for your taste... they do have a mild version that you can request. Oh, and the margaritas and great, as well! I'll continue to come back.", "Date": "2011-05-26", "Author_Location": "Honolulu, HI"}, {"Author": "London F.", "ReviewID": "FR8A6Od_iO3ejn1h_p4CTA", "Overall": "3.0", "Content": "I have literally grown up eating at Jose's.  I remember being young enough where I was crawling under the tables!  Jose's is a small family owned restaurant.  It was run by two sisters, some brothers? and their father, from what I remember.  I always remember their food was excellent and our favorite thing to order was always the con queso.  At some point, they opened a second location in Restaurant Row.  Not sure if it's still there, but at that point, new cooks and staff were brought into this location and I never saw the family here anymore.  I have seen them at the new location.  Anyway, the food isn't as good as I remember growing up.  It is probably due to new cooks making and preparing the food.  I will probably still eat here once in a blue moon, but I'm never excited to eat here like I used to be.  The food is nothing special.On a positive note, the servers are always friendly.  Keep in mind the parking here is metered parking so bring some quarters!", "Date": "2012-06-23", "Author_Location": "Ewa Beach, HI"}, {"Author": "Marc E.", "ReviewID": "hlyPIyGCw_VxVOyWDEs_dw", "Overall": "1.0", "Content": "Food is good but tryng to find a waitress is tough. We waited for awhile at door until hostesses sitting at their own table finally noticed us. The waitress went back to sitting at the table where she couldn't see customers and they can't see her. Cook came out at end of meal with cigerrette hanging out of his mouth. Too bad the employees are chasing out the customers.", "Date": "2013-06-03", "Author_Location": "Honolulu, HI"}, {"Author": "Tyrone H.", "ReviewID": "wT7yVLXV5cewTT_9UwDscg", "Overall": "4.0", "Content": "I've been a regular for six years. The service is great. The Margarita's are tasty. The place is a long way from Mexico, so the food isn't straight out of mazatlan, neither is the food from any other Mexican restaurant in the islands  but the owners are actually Mexican, so you know the staples are worthy. Good salsa, enchiladas,  and conversation. If there are people at the bar, join them, they love company.", "Date": "2010-07-30", "Author_Location": "Honolulu, HI"}, {"Author": "Badbeans W.", "ReviewID": "Lm3LrJrjxVEU7fJfiNSuaA", "Overall": "2.0", "Content": "As a mainland visitor to Honolulu I was seeking some Mexican food to take a break from traditional food found on the islands. I went to Jose's Cafe and Cantina for lunch. The chips are salsa are free, which is expected at a Mexican restaurant. However, I found the chips to be overcooked and stale. I had the lunch special of a chicken burrito with beans and rice. The food was alright, but it wasn't great. I ate it and was like \"meh\". The beans and rice were also not bad, but not good. The waitress was very nice and helpful. I likely won't return to this restaurant in the future.", "Date": "2011-05-04", "Author_Location": "Seattle, WA"}, {"Author": "David C.", "ReviewID": "X3fqihltZdVQYVZtAeFCcA", "Overall": "2.0", "Content": "Parking can be convenient. That's the best part of Jose's. Everything is dated--the interior, the food, and the bad service. Authentic?  Nope. But does it at least taste good?  Not really. Come here for 80s style microwave fake cheese laden \"food\".  Maybe I spent too much time in LA where there are real choices for authentic (and even regional!) Mexican food.", "Date": "2011-09-25", "Author_Location": "Honolulu, HI"}, {"Author": "Tessa t.", "ReviewID": "e2WrjkiDOVlBXhoU8vcGdw", "Overall": "3.0", "Content": "yelp 365 challenge #26/365chorizo con huevossoooo gooood!!eggs were cooked perfectly!! not runny at all :)chimichanga...good...i didn't like the beef too much...salsa and chips. yum.service...well, she checked up on us every 5 minutes...literally...but maybe it's cuz we were the only table there...", "Date": "2011-09-15", "Author_Location": "Honolulu, HI"}, {"Author": "matt s.", "ReviewID": "m315darutYaTu-qlAjrFXw", "Overall": "3.0", "Content": "I would give Jose's 4 stars if it weren't a bit pricey--about 16 for plate.  Their spinach burrito with chicken are my go meal here, and I love it.  Parking is metered off street.  It's limited, but I've never had a problem finding a spot.  It's funny that the biggest complaint I've read is the service.  The last two times I've gone, I was laughing hysterically about how often the waitresses checked in on us.  It was border-line obsessive.  Maybe they've started to read the reviews on here and adjusting . . .", "Date": "2009-08-01", "Author_Location": "Honolulu, HI"}, {"Author": "Jennie E.", "ReviewID": "ssD47BD3o_eJozj7ostCBQ", "Overall": "4.0", "Content": "Not too shabby. Staff was friendly. Salsa excellently spicy! The beans and enchilada muey born! Loved the cooking of the taco and the meat but there was only one inch of meat! Ugh!!! Tecate is ice cold and there is a full bar which makes me smile!!! Decor is, uh, leaves a Mexican food lover wondering ... overall because of the majority of food and staff a YES!", "Date": "2011-05-16", "Author_Location": "Glendora, CA"}, {"Author": "Chelsea U.", "ReviewID": "0BpM-xJ29FBoI2avoYspOw", "Overall": "3.0", "Content": "Went here on a Wednesday night and was not crowded at all. The service was quick and pleasant and the food was not bad. The chips and salsa were good, salsa is pretty spicy! I ordered the Enchiladas Suizas, chicken enchiladas with ranchero sauce, rice, and beans. Nothing special, but delicious. I also ordered a blended li hing margarita. It melted pretty quickly, but was still good.", "Date": "2012-01-14", "Author_Location": "Honolulu, HI"}, {"Author": "Betsy P.", "ReviewID": "n4DgNE1iH2GX0tFkGsNxgw", "Overall": "4.0", "Content": "I heart Jose's! True, I love pinto beans and only eat tostadas and burritos but I LOVE their beans! And their margaritas kick some serious booty! I get mine with fresh squeezed lime juice not that processed crap. I am from New Mexico and grew up in LA so I know all about Mexican food :) Their beans are authentic and yummy, not bland at all! All these other negative reviewers must have a stick up their butt cuz Jose's rocks!", "Date": "2010-08-24", "Author_Location": "Honolulu, HI"}, {"Author": "Rob T.", "ReviewID": "b89cK06TVfOOnGmTg6YtDA", "Overall": "3.0", "Content": "Met with some friends for pau hana. I love Mexican food and have been to some really good Mexican restaurants, but I just couldn't eat anymore after a few appetizer bites. Decided to stay safe and drink my imported beer instead. If anything good came out of this, it would be its chips and salsa.", "Date": "2010-08-28", "Author_Location": "San Francisco, CA"}, {"Author": "Macy R.", "ReviewID": "5LCVQKoHNLz6d1fyGu_sPA", "Overall": "4.0", "Content": "Haters of this place must have hit Jose's on an off day, or I hit it on a great day! We were gonna go to Azteca, but they are closed on Sundays.  I had a very pleasant experience here.  Our short-haired waitress was oh-so friendly, not to mention, super cute. Our chicken taco salad was perfect for two.  The house chips and salsa, just perfect.  Coming from So Cal, this place made me feel right at home. For me, this is second to Serg's in Manoa. So, don't knock it until you try it.  Hasta luego!", "Date": "2011-05-08", "Author_Location": "San Diego, CA"}, {"Author": "Nicole Z.", "ReviewID": "j3AHoNhfM48NY-Z80hHE9w", "Overall": "4.0", "Content": "My boyfriend and I where driving through Kaimuki trying to decide on where to eat. We saw the 2 Mexican places on Waialae and decided we would go there but when we parked we found ourselves outside of Jose's and decided to try it out.  My boyfriend being for San Diego and part Mexican was a little hesitant.  Well I have to say WE WILL BE BACK!! The prices where a little high but for Mexican in Hawaii they all are.   The sizes of the meals were big enough to bring some home and make a second small meal so this made up for the price.  We did not get to enjoy any drinks but will have to check it out next time.  I had the veggie burrito with chicken added and the add prices where VERY reasonable!! The burrito was a new twist with the variety of veggies in it.  I very much enjoyed it. His choose two with of tamales and chicken tostada was completely cleared before we left and what wasn't was gone the next day quickly!!", "Date": "2010-07-11", "Author_Location": "El Cajon, CA"}, {"Author": "Michael K.", "ReviewID": "nNAcGLw2I1yTHj4AopXKJA", "Overall": "2.0", "Content": "The whole enchilada was filling yet wasn't very tasteful.  I think the best thing this place has to offer are the frozen margaritias.", "Date": "2011-07-03", "Author_Location": "West Chester, PA"}, {"Author": "Sean D.", "ReviewID": "2hPT7yN0IqFeyeRA9mvcZA", "Overall": "4.0", "Content": "Great authentic food!  Great service! Great atmosphere!Ok, so we came in fairly late on a friday night.  I work in the food and bev. industry and I know that is a bad thing to do.  However, I like to try new places with my special girl, we had this place in mind, I got off late, but we went for it.  We were very pleased to be greeted at the door and sat at a huge booth by a very freindly hostess.  She offered the signature margarita, told us how much she loved it, pointed out a few menu items and left us to ponder.The decor was anything you would see in Cabo or San Felipe, typical mexican busy dining atmosphere.  Because we arrived so late, the dining room was fairly empty, but the bar was seemingly the place to be.  Lots of guests having fun.  If we weren't here for a date night, we would have joined the crowd at the bar.The waitress (sorry I forget her name, Tracy?) greeted us with chips and salsa and pointed out her favorites on the menu.  I am not a huge salsa fan (my better half is) but I was eating it up.  Great tomato and cilantro mix with a little spice.  Chips seemed homemade, thick and airy.Margaritas came quick, I had the signature scratch, she had the pomegranate...both were very delicious.We started with sharing the meatball soup.  Holy moly...it was very tasty with large meatballs and a great broth.We ordered the Snow crab enchilada for her and the chicken enchilada for me.  Being somewhat of a foodie, my first test is the plate check.  I always touch the plate first to see if it is hot and will sustain the meal.  I guess I didn't need to as the waitress firmly stressed that the plates were very hot, and she was not joking.  The plates were searingly hot, and I expressed to my better half that this is a great sign to a great meal.Not sure how Jose's stays in business, her Crab enchilada was over stuffed with so much crab she could not believe.  She thought she won the lottery.  The flavor was well balanced with the beans and rice, and so much crab!  She is a crab fiend, and I think Jose took her down...she could not handle and we had to take some home (she enjoyed it twice!)Chicken enchiladas were very flavorful with lots of chicken and a great mix with all of the other flavors.We didn't think we had it in us, but we took a shot at the dessert menu.  We asked the waitress if we were keeping her, but she pointed at the bar and stated she will be there for a while.  We never felt rushed or hurried like she needed to leave.  We tried the flan and it was very tasty.  We thought we might take a few bites and take it home, but it was gone in a few minutes (tasted so good we were fighting for it).  It had a different texture and was thicker than what i am used to, seemed much more home made than what you get at other restaurants.  Perfect end to a great meal...get the flan!I would definately eat here again...the food and service were exceptional...the manager was very present in the dining room and touched our table quite a few times and thanked us as we left.  The bar seems like a happenning place and a great place to go for sports.  Next time I will probably bring some friends for some monday night football and margaritas.Only reason I gave it 4 stars is that we are not in mexico or southern cal...we are in Hawaii...but for being 3000 miles away....Jose's does mexican food well....", "Date": "2011-09-05", "Author_Location": "Waipahu, HI"}, {"Author": "Les Is More M.", "ReviewID": "lElwxhw-qTfx_7TVrm9GZA", "Overall": "4.0", "Content": "this place is well known to have arguably the best mexican food in town... at least until MEXICO restaurant opened up in kalihi.  but either way, good quality and the margaritas here are hard to beat.  I had one of the best margarita pitchers ever here, and even tipped the waitress and bartender, challenging them to make a second as good as the first.  sure enough, awesome.  now they don't offer the li hing margarita like mexico restaurant does, but there's something to be said for the more traditional menu selection.  parking is plentiful, and service has always been satisfactory the many times I've been here.  will definitely be back.  I just wish there was a mariachi band playing, instead of the run-of-the-mill staff that may give you the \"I'm just working my way through college\" vibe.  still, I'd go back again and/or suggest others try it.  I think mexico has an edge over menu selection and quality, but as I mentioned before, jose's has a more traditional menu.", "Date": "2012-12-08", "Author_Location": "Honolulu, HI"}, {"Author": "L K.", "ReviewID": "LgssnN6crQd86D6h0kzRng", "Overall": "1.0", "Content": "My family & I took our Dad/Papa to dinner at Jose's for his 78th birthday & service was the worst I have ever experienced anywhere. It took a long time for someone to take a drink order & forever for us to receive our drinks. And the drink order to was wrong which I had to wait again. The server asked if we wanted chips & the chips came but without salsa & it is normally served with salsa. So, we asked for salsa & the server said, \" oh yes it's in the back.\" Then, we never got it at all. My son ordered an appetizer & when another person delivered it she asked if we wanted plates & we responded yes & never got that until we waited so long that I had to get up & ask someone else for plates. We then ordered our food & waited, waited, waited, & waited with no explanation as to why our food was taking so long. We even ordered more drinks while waiting for food & we waited & waited for our drinks. Our food finally came 45 minutes later & when we started to eat, the server then told us that the kitchen was backed up. Okay, most times they would let us know the status of our food while the delay is happening ....NOT after the fact. Anyway, the restaurant was slow & we would have been fine if we didn't have to wait for our drinks & if the server gave us the status of our food. Just a reminder, we had a 78 year old & a 3 year old that needed to eat. Well, that's not the worst, the server dropped the check & within a minute was back to collect payment & that was the first time the whole night she had moved so quickly & attentively to our table. After looking over the bill an 18% gratuity was added & we did not believe she deserved the tips. My daughter asked to see the manager & told her about the service or should I say the lack of service we received & that the gratuity was not earned & we was not willing to pay that & maybe we would be willing to pay 15%. (Which my daughter should never had said.)Anyway, they took the 18% off & added 15% instead & we still did not agree with that.  It should have been left blank & up to our discretion. We did pay the bill but not without the server giving us her insincere apologies & her bad attitude. My daughter explained to her in a nice way that we would have been okay if she told us what was going on & being attentive instead of waiting to after the fact. The special occasion did not end up very special & the server deserved less than 10%. And my review is not to be demeaning but it is the fact & I have been to Jose's before & service was okay but this time it was terrible. Three of us on the table have been in the service industry for many years & I believe that sometimes people in the service industry forget that they work for TIPS & that is TO INSURE PROPER SERVICE.The one good thing about the restaurant was the food was good.", "Date": "2012-10-06", "Author_Location": "Honolulu, HI"}, {"Author": "Puddytat C.", "ReviewID": "g-9ICC4ywmO9u5YGzs1RIw", "Overall": "2.0", "Content": "It's too Americanized.  Even the salsa isn't good.  Tried it several times to get a clear opinion and it's still the same.  Just not my type of Mexican food.  Lived in California and you really get to know good Mexican food.  This ain't even close.", "Date": "2013-04-02", "Author_Location": "Honolulu, HI"}, {"Author": "Susan F.", "ReviewID": "fqHF_phTCKHOeuLdhfUCXw", "Overall": "2.0", "Content": "so i've been meaning to go here for a while and finally found the time to do so.  bad move.  first off, the PRICES were RIDICULOUS, about 13-15 dollar average per plate, and the size of the portion was the same price a 7 dollar plate would cost anywhere else, just because they have one of the biggest mexican restaurants and the most servers doesnt mean you have to jack the price up.  Also, their drinks were damn expensive too, i think it was like 8 dollars for a margarita, also, you have to pay extra if you want more chips. deal breaker.  I've had worse tasting food,  but the prices just did it for me.", "Date": "2009-06-09", "Author_Location": "Honolulu, HI"}, {"Author": "opqr s.", "ReviewID": "hc0InBys8XqQOnXEXKpvdw", "Overall": "1.0", "Content": "The absolute WORST service I have ever had!  I give the food a 1/2 star out of 5.  There are so many better Mexican restaurants on island to spend your money at.", "Date": "2010-03-11", "Author_Location": "Honolulu, HI"}, {"Author": "Terri Q.", "ReviewID": "NzOd4QoeyscrlbijZl9Hug", "Overall": "1.0", "Content": "My husband and I ate at Jose's last Friday which turned out to be a mistake.  It will be our last time.  When we arrived, the place was very busy and we were seated next to the bar.  Not a good idea, but we tried to make do.  Within a few minutes, a loud drunk looked at us and yelled, \"losers\"! then proceeded to giggle hysterically.  (My husband is a doctor and I am retired from the USAF.  Losers?  Really??)  I told our waitress what had happened and asked if we could be moved to another table.  She spoke to her manager and explained to us that the drunk was a regular, didn't mean what he said, etc.  It sounded like excuses to me and I wanted to leave.  I insisted that we be moved to another seat and she finally did so.  Why we weren't seated away from the bar in the first place didn't make sense to us since there were tables available on the other side.   We were able to have our meal in peace, but this experience has changed our minds about giving our business to Jose's in the future.I can only imagine what the staff from   \"Restaurant Impossible\" would have to say about the dark, dirty interior, the loud drunks, and the mediocre food.  We say \"adios\".", "Date": "2012-09-24", "Author_Location": "Honolulu, HI"}, {"Author": "Alan N.", "ReviewID": "vwnd7Lss1mxqDpMh6cFfjQ", "Overall": "1.0", "Content": "Honestly, I didn't have the food but the margarita was Soooooo BAD there is no way I was going to try the EXTREMELY OVERPRICED Mexican food!  The portions looked HUGE, but who cares.  I sat at the bar and ordered a margarita of my choice which the frantic woman behind the bar said would be the same price as a \"shot\" of the Tequila I selected.  This didn't end up being true.  I ordered the \"1800\" which was listed as $6.50.  It was oddly, $3 more. ????  I wasn't offered chips and salsa which is rude in a truly authentic mexican restaurant.  It is Hawaii, but no bueno on this one.", "Date": "2009-12-29", "Author_Location": "Brooklyn, NY"}, {"Author": "Marcus J.", "ReviewID": "HHUhstSzDTk2Vfeh_EbjvA", "Overall": "3.0", "Content": "Bartenders are super cool if you want a place to chill at and have a beer, watch a little sports or talk about the news. Bartenders talk a little shit with you and you have a pretty good time.  Now the food on the other hand they can keep! Its over priced for the feel and atmosphere it could n should be cheaper. But hey! Don't let me stop you maybe it'll be yo shit.", "Date": "2012-11-02", "Author_Location": "Honolulu, HI"}, {"Author": "Larry R.", "ReviewID": "YOF0nCfmMq4ejWhKRl1d4w", "Overall": "4.0", "Content": "Please people! Are we talking about the same Jose's in Kaimuki. Don't expect Tijuana... remember you live in Hawaii. Some of the bad reviews are just not justified. That being said, my wife and I go to Jose's once or twice a month. In fact we're going there on Cinco De Mayo on Wed. The Crab Enchilada are to kill for. We've tried other restaurants but not even close on these crab enchiladas. The tacos are fine too and so is the salsa. The waitresses are THE best!! ... loads or personality and smart too. Food is always pronto and hot. The atmosphere is not Mexico but charming, always fun and clean place to fix that Mexican feeding frenzi one has. Remember you're in Hawaii and its a bit TexMex but its good food. Parking is not great but timing is everything. I usually let my wife out first to get the table so when I get there she's already seated... no problemanto! Now bring on the cervezas!!!", "Date": "2010-05-01", "Author_Location": "Honolulu, HI"}, {"Author": "Javier C.", "ReviewID": "HggQnHNAqE93y2BwHfJCJg", "Overall": "2.0", "Content": "The place is ok, and the food is ok....", "Date": "2008-03-25", "Author_Location": "Honolulu, HI"}, {"Author": "Lena H.", "ReviewID": "LlTgOs4_eciN2VE8_del1A", "Overall": "2.0", "Content": "my family and i went here on sunday for dinner.  the food took unusually long i would presume.  the rice was too salty and when our chips and salsa ran out she didn't offer to give us anymore (because we wanted some!) like other mexican restaurants would, but she offered us salsa???  oh yes, and i had fish tacos and i would not recommend them.  i could barely eat one and the fish wasn't the greatest.  the fish wasn't marrinated in a tasty sauce and if it was it wasn't good.  on the other hand the people were very nice.  i'd just wish that the food would be too!  i miss LA now thats great mexican food!", "Date": "2008-02-20", "Author_Location": "Honolulu, HI"}, {"Author": "Adamah V.", "ReviewID": "a2Jg_sf5vfCWMeN7PT_dtw", "Overall": "2.0", "Content": "I love mexican food, so much so that I'll even grind some Taco Bell when there's nothing of better quality around. Joses didn't quite make the grade though. I'll give the bartender a pass on the bad service because she seemed to be running the entire place herself with 4 tables and 3 bar patrons. The food was inexcusable though. My spanish rice came out like rice pudding because it was so over-cooked and the beans literally tasted rancid, after one bite it was hard to stomach. My actual Enchilada was decent though. I also ordered a queso dip but it was more like a soup, not really thick enough to dip anything into. So unless you're really desperate for some mexican food or a marharita and the two other mexican restaurants around the corner aren't open I wouldn't waste your time or money.", "Date": "2012-03-09", "Author_Location": "Honolulu, HI"}, {"Author": "Rob E.", "ReviewID": "bkx_dWFLhwmlYLZVDgrXSg", "Overall": "1.0", "Content": "Terrible food and horrible prices.  Friend said his enchilada and taco plate tasted like a TV dinner.  My Taco salad had a bland tasting shredded beef - neither of us finished our meals.  Place came recommended too...won't be returning or recommending.  The bar and drinks must be the focus.", "Date": "2011-11-13", "Author_Location": "Kapolei, HI"}, {"Author": "Jenny S.", "ReviewID": "RfAYLjhWHzYvLlKCf4RjiA", "Overall": "1.0", "Content": "I really wanted to love this place.  I really did. It has cute decor and the server was helpful and sweet..........but the cheese/meat dip (dont remember the name) made me sick.  I never get sick from food.  I was sad.  Such a cute place.  But beware.", "Date": "2012-11-08", "Author_Location": "Honolulu, HI"}, {"Author": "Sara H.", "ReviewID": "b301fNslAeCrdggnLSsisQ", "Overall": "3.0", "Content": "my fam ended up here on a sunday bc our usual mexican spot (aztecas) was closed.  food was decent (i had a veggie burrito but added chicken) but definitely not authentic (come on it's hawaii).  i think it's a little overpriced esp compared to aztecas which is right around the corner.  service was ok, a little slow when we first got there but better toward the end (perhaps bc it was late and they just wanted to get us out of there, since we were the last table...)  all in all, it was an ok experience.  the only reason i'd potentially go back is to try their margaritas!", "Date": "2011-01-10", "Author_Location": "Honolulu, HI"}, {"Author": "Amy A.", "ReviewID": "fq1_TpuyWeMpp6uwQuFSsQ", "Overall": "3.0", "Content": "Fun little spot. The food was ok - I had a taco salad that was decent. The shell it was in was AWESOME, though. Nice and flakey. My friend had the taquitos and she liked them.", "Date": "2011-10-06", "Author_Location": "Berkeley, CA"}, {"Author": "Kanoe M.", "ReviewID": "vzku_IEa0uWHMSd8wfVK8Q", "Overall": "2.0", "Content": "Service was slow poor waitress was by herself. She actually apologized saying the cook was slow on the orders. And it was a pretty slow day.  Food was so-so.  So don't think I'll be back", "Date": "2011-12-31", "Author_Location": "Hilo, HI"}, {"Author": "Ane C.", "ReviewID": "vNqbod_lsYTCD3fTnJ_w7Q", "Overall": "2.0", "Content": "The food was just OK and the prices are HIGH.", "Date": "2011-05-21", "Author_Location": "Honolulu, HI"}, {"Author": "sharleen p.", "ReviewID": "YcSM-t-JrDjSQ-4ImRuofg", "Overall": "1.0", "Content": "i was thoroughly dissapointed with the service last week. I had started to go back there after several years and enjoyed the food however last week I took my daughter and encountered a waitress called Sarah.She took our order, broightnchips and salsa and the guacamole we ordered and did not check in again for one hour. I thought OK they are busy and was patient. She then came over and presented me with a check for my dinner THAT I NEVER GOT!!!!! There were two tables of 5 and 6 that got their dinner befire me that arrived at least15 minutes aftter we did, she told me that 'maybe she got my order in later than the other waitresses!\"Clearly she forgot my order. When My order finally came(after90 minutes) i then ordered dessert without coconut-she brought that after 15 minutes and did it wrong. She again claimed that I did not tell her of the exception. By that time I was really upset. She comped me20% after she told me she would take care of the bill. I was so upset I left. I then called the manager on duty Sophie and she apologized and told me that she should have come over and speak to me but decided not to. She was going to give my name and number to the owner and give me a gcertificate or at least comp my meal. The owner has never returned my calls to this day.  I have never had such a bad experience at a restaurant and will never go there again.", "Date": "2011-07-21", "Author_Location": "Kaneohe, HI"}], "RestaurantInfo": {"RestaurantID": "5HRs6zJJBW4Lf2nWoru8AQ", "Name": "Jose’s Mexican Cafe & Cantina", "Price": "$$", "RestaurantURL": "/biz/joses-mexican-cafe-and-cantina-honolulu", "Longitude": " -157.7986510000000", "Address": "1134 Koko Head AveHonolulu, HI 96816", "Latitude": " 21.281659999999999", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/dln6mvXquIQ9N_cu_hoGrg/90s.jpg"}}