{"Reviews": [{"Author": "Justin R.", "ReviewID": "mX2ttY5vJMfU8ohnCvM79g", "Overall": "5.0", "Content": "Exceptional food. Good service. This kitchen earns my respect by doing one thing exceptionally well: the biscuit. I wasn't raised on biscuits, but I've grown to appreciate their place on breakfast tables across the South. Maple Street Biscuit Company elevates the biscuit and -- artery-clogging breakfasts in general -- to unprecedented satisfaction. Whether you choose to have your biscuit as vehicle for fried chicken or served as a bed for perfectly seasoned gravy, you will not be disappointed. Just remember, it's a Southern kitchen. They're not shy about calories or generous servings. Be careful here if you're prone to the meat sweats, and plan appropriately for your post-meal recovery.", "Date": "2014-07-23", "Author_Location": "San Diego, CA"}, {"Author": "Nunya B.", "ReviewID": "3jq1OtDYZ85-EjJ0EBNUMg", "Overall": "4.0", "Content": "hipster customized southern biscuit breakfast sandwich concept.creative reclaimed vintage material interior and in-house coffee roasting.rather than a number, you are called to pick-up your order based on your answer to their monthly question.", "Date": "2014-07-17", "Author_Location": "Columbus, OH"}, {"Author": "Tasha C.", "ReviewID": "biMijkYAw8HUZ8XG3SmZQQ", "Overall": "4.0", "Content": "Definitely happy I took the 1 mile walk in the Jacksonville heat and ridiculous humidity to eat here.  I had the Five and Dime biscuit sandwich.   Absolutely delicious!  I was greeted by a friendly young man when he saw me looking at the menu that was posted on the wall.  He offered to help with choosing and asked if it was my first time. I declined because I already had something in mind. The young lady taking my order ask the make/model of my first car. It took me a second to respond. .This is how they call you when your order is ready...hahaha!  Pretty cool stuff.  I guess they switch the question every week. The Five and Dime is a biscuit heaven sandwich! . Crispy juicy chicken breast, thick sliced Applewood bacon,  a fried egg, and cheese...to think that wasn't good enough they topped it with a spicy gravy. OMGOODNESS!..At first glance,  you think there's no way you will eat all of it but then at first bite you can't stop eating it until it's all gone.  The flavors compliment each other. The flaky biscuit absorbs the gravy to perfection!  The well seasoned crispy chicken breast is the backbone of the sandwich and adds the perfect texture. This biscuit wouldn't be right without the bacon. I wanted to order one to go so my hubby could try but didn't.  He need to try this fresh. I will definitely be trying this place again.  Many other interesting biscuit sandwiches on the menu.  The place has a nice open atmosphere and a outside eating patio. The staff was excellent and the price will make you wanna go someplace else BUT stay. It's worth it.  I spent $10.60 for my sandwich and drink.  The only reason I didn't give it 5 stars is because the orange juice cup was way too small for the price. It look like a child small.  So I was forced to have a soft drink or sweet tea with my biscuit sandwich. I would recommend upgrading those cups ;)", "Date": "2014-07-10", "Author_Location": "San Diego, CA"}, {"Author": "Tyler B.", "ReviewID": "YTGaFqw9f249fJDHqa_SnA", "Overall": "5.0", "Content": "I created this account just to give them a review.  The food and atmosphere is amazing.  I had, I think it was called, the squawking goat.  Wow, best breakfast of my life.  We all loved this place so much we ate there for lunch the next day before we left.  I had the chicken club equally as great.  All of my trips to Florida will start and end with a stop to Jacksonville and the maple street biscuit company.  I eagerly await my next trip!!!  You Have to eat here! Oh, if there is a line don't be discouraged they are very efficient and it is worth the wait!", "Date": "2014-07-21", "Author_Location": "Hendersonville, TN"}, {"Author": "Ana R.", "ReviewID": "X5KlrtdlLrzOI_sMd9kaTQ", "Overall": "5.0", "Content": "5-star for biscuit creativity and taste. We stopped here on our way back to Miami after spending some days in Savannah. We found a parking spot across the street and on our way we were. There was basically no line for a busy Saturday morning although the place was a packed house. We placed our order and were able to grab a table just as some people were standing up to leave. We ordered the following items: THE FIVE AND DIME. Frank LOVED it! He ate the whole thing and said it was delicious and filing. THE STICKY MAPLE. I had this one. Delicious. I got the maple on the side so I could dunk it at will. THE BLUES BISCUIT. Analis had this one and ate the whole thing as well. SMOKEY MOUNTAIN MAC N CHEESE. Was truly delicious. I love mac n' cheese and this was awesome. The cheese cracker toppings were a nice touch. HASHUPS. Frank loved these cheesy potatoes with all his favorite ingredients. He really enjoyed these. The owner stopped by our table and had a nice chat with us. He lived in Savannah for  some time and offered plenty of suggestions for our next time there. That was very nice of him! We really enjoyed our stop and the food was delicious. We were a party of 3 and spent about $38. The food was delicious and for what you get, I think it is reasonably priced. We may just find ourselves here again on our next road trip that takes us past Jacksonville. Enjoy!", "Date": "2014-06-30", "Author_Location": "Hallandale, FL"}, {"Author": "Tallman F.", "ReviewID": "8bReTwVaZK0Clhz6MmsBKQ", "Overall": "5.0", "Content": "Dayuuuuummmm!This is the spot AND all of that!!!!!I got the five and dime ........SPECIAL - SPECIAL!I'm looking at other peoples plates and I saw someone had grits.After I ate my FIVE & DIME .. I could NOT have eaten grits and I'm a BiiGG guy!!!! It was filling ......You can get a RETRO biscuit with an egg and/or piece of meat .....You can go to Chick Fil A or Burger King for that ...Try any of the special...!!!It's not finger food and it was a chore to eat and drive .....but it it tasty and the bacon was zoo good ... I actually thought it was a slice of ham.The gravy sets it off like Kate Upton & Halle Berry strolling the beach in bikini tops.Stoppppp and go ....Make a detour and gooooo.....Just gooo!!!!Then take a nap!!!!!!!", "Date": "2014-07-01", "Author_Location": "Tallahassee, FL"}, {"Author": "Linda S.", "ReviewID": "DTtLWvSB6xzpTAnWL5ssQw", "Overall": "3.0", "Content": "I feel like this place gets a higher rating than it truly deserves because there is nothing like it in Jacksonville. Is it good? Yeah, I mean it's buttery biscuits, eggs, and bacon and gravy, (how can you go wrong) but it would taste just as good if my mom made it at home. In my opinion, there's not an \"it\" factor. The customer service is good and it is  broadening the palettes of locals, but I'm not sure it's earned almost 5 stars.", "Date": "2014-07-23", "Author_Location": "New York, NY"}, {"Author": "Shawn R.", "ReviewID": "QaQBkR3dxA8IhLDdXozLWw", "Overall": "4.0", "Content": "Very good.  I had the sticky maple.  The chicken is just ok but I think the biscuit with maple syrup part was exceptional.  My husband got the one with the gravy and egg.  The gravy was perfect.  Very busy but they seem too keep the line moving and the food coming out.", "Date": "2014-07-19", "Author_Location": "Los Angeles, CA"}, {"Author": "Brad D.", "ReviewID": "S2jEZIx2lsM5iLykqtgd4w", "Overall": "5.0", "Content": "We are new to the area and went on a recommendation.  I had the Farmhand biscuit and my wife had the one with honey mustard and we split the Hashup.  We immediately loved the place.  It tons of character including the way the announce when your order is ready.  The food was absolutely amazing!  The owner or manager (not sure which) came around to every table to ask how the food was and if anyone needed anything.  When we told her we just moved to the area, she introduced herself and told us more about the place.I definitely recommend this place!  This will certainly be our new brunch spot!", "Date": "2014-07-18", "Author_Location": "Jacksonville, FL"}, {"Author": "Glenn B.", "ReviewID": "MudemyPHh8D0ixSXtDcTFw", "Overall": "5.0", "Content": "My personal account of BISCUIT HEAVEN.So, I walk up to the counter and order me up a FIVE and DIME.  (Cuz that baby is plastered ALL OVER the reviews here on Yelp.)  I order me up some grub, and a coffee (even though the wife and I gave up coffee a week ago.  Evil, EVIL stuff!) Heck, I'm on a business trip. What happens in J-ville STAYS in J-ville, right?The dude taking the order then says, \"So...what's on your bucket list?\"  Huh?  This was odd.  I start thumbing through the bucket list in my mind.  {{{Scarlett Johansson, base jumping,  scooter trip through the best wine regions in Italy...(scratch that, get a chauffer...I'll need it.  *hic*) ...did I mention Scarlett Johansson?}}}I tell him \"Let's say getting a good bizkit at the MSBC is my bucket list item for the day.\"  (I didn't really want him all up in my bizniss. \"SO WHAT if I have 'cosplay at Comicon' on my bucket list??)  He says the Maple Tap is the most popular of their coffees.I fuel up on some of the Maple Tap coffee and go sit down.  When my order is ready, he calls out \"HEY MAPLE STREET, YOUR ORDER'S READY!\"  Yup, instead of your name, they shout out your bucket list item.  Next up after mine I hear \"CLIFF DIVING, YOUR ORDER'S UP\" and I immediately feel waves of inadequacy.  hahaMAPLE TAP COFFEE:Holy GODS OF CAFFEINE, Batman, this coffee is like sex in a MUG. It's SO GOOD.  Deep and flavorful, with a hint of Maple syrup, yet subtle...no bitterness whatsoever.  I've had lots of coffee over the years, but I've never had any like this.  I've paid $7 for coffee that didn't compare. (Did I REALLY just admit that?)FIVE AND DIMELight, fluffy biscuit, complete with a piece of boneless fried chicken, bacon, a fried egg and a slice of american cheese...get this....THEN subtly covered (not frickin' smothered, mind you...) with sausage gravy like what you'd find on biscuits in the South.  OMG, oh.....my.......GOD.  This bad boy had a *hint* of spice...just enough heat to keep it interesting but not enough to make me ask for water.  This biscuit was the MAYOR of Flavortown, baby.  BAM!Because I had shared my enthusiasm with the staff, saying I was from out of town and YELPED the place, they brought me one of their pecan biscuits. Absolutely delicious.  So, a couple of points:  1.) Be prepared with your favorite band, favorite book, favorite TV show, favorite sports team and bucket list. You never know what their list is for the day. 2.) if you're looking for healthy, look elsewhere. (Sometimes you have to say WTF.) 3.) Go for something with gravy...or a sauce. Helps make the biscuit moist!  I highly recommend Maple Street Biscuit company. It's not a street, it's a Highway...........to happiness.  :-)", "Date": "2014-06-06", "Author_Location": "Santa Ana, CA"}, {"Author": "H. T.", "ReviewID": "Bh_tzp7Pfj0phLNYxkQGNA", "Overall": "5.0", "Content": "This place has awesome and amazing fried chicken and biscuits!  The owner is super friendly and sweet.  Can't wait to come back!", "Date": "2014-07-18", "Author_Location": "San Diego, CA"}, {"Author": "Jessica F.", "ReviewID": "qR4k3Saxx_I2wrfZo24L3w", "Overall": "4.0", "Content": "The biscuits at Maple Street are pretty good, although not the best that I've ever had. I usually get an egg and cheese biscuit sandwich and then some extra biscuits to have later. The egg and cheese biscuit is clearly made with fresh eggs and the cheese they use is a mild cheddar. Once again, not the best ever, but a solid rendition. The iced cinnamon raisin biscuit is very sticky and sweet. It was little too sweet for my liking, but ymmv. I've had the coffee once, it was ok. The maple coffee was an interesting novelty but I prefer my coffee to be very strong and dark so it didn't blow my mind or anything. It was pretty good.The service is always courteous and fast.All around, I would say that Maple Street is pretty good. I'm always happy with my order and with the service. I enjoy Maple Street because they have a good concept and they are a convenient option for a weekend breakfast.", "Date": "2014-06-03", "Author_Location": "Jacksonville, FL"}, {"Author": "Renee G.", "ReviewID": "3kAA8a-X_LZL--aQ0FaMiw", "Overall": "5.0", "Content": "Omg best bang for your buck by far for a breakfast joint..handmade biscuit nice consistency on the gravy no line just not a lot of sitting choices but the food totally made me forget about that if your in San Marco just for a stroll go check them out before the close at 4", "Date": "2014-07-21", "Author_Location": "Middleburg, FL"}, {"Author": "Chan V.", "ReviewID": "5_XhFqgwGqjYhjPOEP_yug", "Overall": "5.0", "Content": "What a great concept! The place is clean.  The service is great! I was overwhelmed with the huge menu they offer. The staff helped me pick a fantastic biscuit burger. I had the Five and Dime. Stacked high with all natural chicken breast and delicious gravy, this biscuit has me thinking about it every morning. Come early because they get super busy or expect to wait but the line moves fast.", "Date": "2014-07-08", "Author_Location": "Lawrenceville, GA"}, {"Author": "Jill C.", "ReviewID": "fPp7GpEUGKhr4ujEpebaVQ", "Overall": "5.0", "Content": "This is one of the best soul food breakfasts I've had. We were greeted by a friendly cashier who made like conversation and made us feel right at home. We had a hard time deciding because it all sounded so good. I ended up with the farmer that was delicious. We split a cinnamon roll that was decorated especially for my friends birthday. We will definitely be back.", "Date": "2014-07-02", "Author_Location": "Fruit Cove, FL"}, {"Author": "TexasPossum T.", "ReviewID": "c0IAc_PsjTiyJfmrk70LAQ", "Overall": "4.0", "Content": "The food was really good. Great biscuits. No, fantastic biscuits.We came here while on vacation and really enjoyed the experience. The atmosphere inside the place is rather loud and chaotic, but if you like that sort of thing there was a lot of good people watching.We sat outside to eat. The town of San Marco is cute cute cute.", "Date": "2014-05-25", "Author_Location": "Fort Worth, TX"}, {"Author": "Denise R.", "ReviewID": "8WbAUVNh26pWtPfCCPbZzg", "Overall": "5.0", "Content": "I ordered The Five, biscuit, gravy, bacon, chicken, and a slice of cheese.  Okay - definitely not a combination I would have put together but it was AMAZING!!!  The bacon by itself would have had me slap my firstborn son if he tried to eat mine!!!  If you like code, definitely try the Maple Tsp coffee...You won't be disappointed.I got a side of collards.  Not sure what I was expecting but they weren't it.  Great texture but offered little flavor.  The heat was the only remarkable thing about them.  In fairness, they are typically served ON the biscuit, but loving collards like I do, I had to try them as a side.  They were just ... okay.Service was EXCEPTIONAL!", "Date": "2014-05-12", "Author_Location": "Arlington, VA"}, {"Author": "Amy S.", "ReviewID": "Dcn2F2lO_ctXIwjwc_ooQg", "Overall": "3.0", "Content": "Ok, people, don't hate me, but I just don't get all the hype.  I've now been to Maple Street twice and it just doesn't do it for me.  Unless someone else is buying, it's highly unlikely that I'll be returning in the future.Maybe it's because I'm not a \"foodie?\"  Maybe it's because I eat like a 2 year old and don't like my food all mixed together?  Or, maybe it's the fact I think these biscuits are WAY over-priced and I feel I can get a better deal elsewhere?  I think it's all of the above.Both times, I had The Farmer (minus the cheese).  The biscuit comes with chicken, bacon, and apple butter.  I forego the cheese because I have issues with cheese and apple butter.  Sorry, but in my humble opinion, those two items just DO NOT go together.  it's just plain weird.This particular biscuit is $7.  Yes...  $7.  Wow!  Ok, for $7, it better be one helluva biscuit and it just isn't.  I can get the same size biscuit that tastes just as good (actually the chicken is better) at Chick-Fil-A and it's a whole lot cheaper!  I can also go to Waffle House and get the All American breakfast which comes with everything but the kitchen sink for the same price.  That's just a lot of money for me to spend on a biscuit and still leave the restaurant hungry.Clean restaurant, really friendly employees, clean restroom.  Cute outdoor seating area so you can people watch the people shopping in San Marco.Still, I'm not paying $7 for a biscuit again.  Nope.  I'll leave this place to you foodies who like all that weird stuff on your biscuits.*Crawling back under my rock now*", "Date": "2014-03-28", "Author_Location": "Jacksonville, FL"}, {"Author": "John S.", "ReviewID": "I-g3dfNQ_HCcRq_3GUq3Iw", "Overall": "3.0", "Content": "Amy and I were in the San Marco area today and decided to stop into Maple Street to finally use the $5 gift cards we were given at the event at the beaches location.  As was the case at the other location, the food was okay...I mean it tasted good, but it wasn't mind-altering-delicious...  I didn't change my order from the event- I had the BLT...  And maybe that's the problem I'm having with this place....I don't like all of the stuff that \"foodies\" like...but still, I expect more from a $5 biscuit....I would have no qualms about paying that price if the biscuit weren't so stinking tiny....I'm not asking for a mega huge biscuit, but at $5 I expect something larger than I would get if I went to Chick-fil-a....The size of the biscuit may have been an issue, but the taste wasn't!  Again, it wasn't mind-altering, but it was very good and I would gladly pay $3 or $4 dollars for it any day of the week, but since they are asking $5, I won't be going back in the future...The staff is friendly and helpful... There was plenty of open seating, which isn't surprising considering the place was closing in  thirty minutes or so when we walked in....Even though this place isn't for me, I do suggest if you haven't been yet, give it a go and judge for yourself!!!", "Date": "2014-03-28", "Author_Location": "Jacksonville, FL"}, {"Author": "Vicky E.", "ReviewID": "4roASBDCTRjKvGrBiFq-xw", "Overall": "5.0", "Content": "Review is long over due but I still remember every detail of my visit.  Any kind of biscuit you want,they have. Even if their is a line the staff is fast at taking orders and friendly.  If this is your first time I recommend looking at the  menu beforehand so you can know what you want.  Biscuits chicken cheese everything is to die for.  One of the owners gave us a free cinnamon roll when he found out we where out of towners now that's what you call southern hospitality :)", "Date": "2014-06-13", "Author_Location": "Halethorpe, MD"}, {"Author": "C B.", "ReviewID": "Vwx_rD1V9DBkZJ4HrC7WVA", "Overall": "5.0", "Content": "Great outdoor dog friendly seating", "Date": "2014-06-19", "Author_Location": "Jacksonville, FL"}, {"Author": "Aaron C.", "ReviewID": "zKcOhc7ZvnJFvwxAS2nWrw", "Overall": "5.0", "Content": "This place is fantastic. I've been twice now for brunch, and I've yet to be disappointed. First time I tried the squawking goat, and it was delicious! The goat cheese was seasoned just right to compliment the savory chicken and the sweet and spicy chili sauce. Today I had the Blues biscuit, fantastic! Great pulled pork with cole slaw. My friends and I have been making Saturday brunch here a weekly tradition. My only complaint is that they're not open on Sunday.", "Date": "2014-05-10", "Author_Location": "Jacksonville, FL"}, {"Author": "Don R.", "ReviewID": "x3qr9x9FAYcsge2xsmDOUg", "Overall": "3.0", "Content": "I'm having pretty mixed feelings about this location.  I have now been in many times and have been able to try several things on the menu.  The biscuits are very good, but incredibly dry if you don't order them with some kind of jelly, etc.  You will NOT find butter, honey or anything else to add some moisture to your biscuit unless you want to shell out a buck or two per biscuit.  So, any of their really good biscuits (which are just dressed up biscuit sandwiches made famous by fast food chains) will get you close to $10 prior to any sides or drinks.  The biscuits themselves are not huge, but with everything inside they make for a good breakfast.  However, I can't enough that they think far too highly of their pepper jelly, which will cost an extra $1.50 for a single portion.I wanted to mention their macaroni and cheese.  It's simply awful.  The noodles are mushy and the cheese is terribly gritty.  You would find no worse mac and cheese at Golden Corral or from the freezer section when choosing Stouffer's,  For an additional $4 for a small cup, my expectation is smooth and creamy sauce with properly cooked pasta.  Truly disappointing.Their bathrooms are another thing that border on gas station for maintenance.  The sink have an orange/reddish mold between the sink and the wall, the soap dispensers are grimy where your hand gets close to the wall, and the fixtures are old and worn.  It doesn't fit the otherwise well maintained rest of the restaurant, nor does it match the menu prices.I'm giving this place 3 stars because the biscuits are good, but the pricing is extravagant and the bathrooms sub-par.", "Date": "2014-03-15", "Author_Location": "Jacksonville, FL"}, {"Author": "Dave C.", "ReviewID": "DJ3nFe6YY6umjlAcMFjFvQ", "Overall": "5.0", "Content": "We completely loved this place. The Squawking Goat biscuit with Fried chicken and fried goat cheese with a pleasant sweet pepper jelly was excellent. My girlfriend had the Five with Fried chicken, cheddar cheese, bacon and excellent sausage gravy and we could easily recommend this as well. Ironically the best part of the meal was the simplest - a shared biscuit with their wonderful B^2 jelly which was a combination of blackberry and blueberry. We bought a jar to take home!I very much hope they open a third location in Tampa!", "Date": "2014-03-23", "Author_Location": "Tampa, FL"}, {"Author": "Beverly C.", "ReviewID": "W-AokvinSJB_0RhiZwTDGw", "Overall": "5.0", "Content": "This place is fantastic! The biscuits are perfect and everything is flavorful and fresh. I have had several sandwiches, but my favorite so far is the Squawking Goat (biscuit, fried chicken, fried goat cheese medallion, house-made pepper jelly). Love it. They are also open for dinner on Friday and Saturday nights which is a great time to check it out.", "Date": "2014-06-13", "Author_Location": "Jacksonville, FL"}, {"Author": "Mike G.", "ReviewID": "GYYWHtfady-UXL84yHkJAw", "Overall": "5.0", "Content": "This place taps into your childhood. They call your order by your favorite childhood cartoon.Had to make that the opening line to this review! I have never been a fan of biscuits the way I am now after going to this place. I had to go two days in a row, it was that good.I was in Jacksonville for business and my wife gave me the idea of going here. I was skeptical at first, because biscuits wasn't my thing. I stopped by on a whim and immediately after walking through the door, I noticed the groups of people enjoying this delicacy so I knew it had to be good. The FOOD:The first day I ordered the Five and a Dime. Best thing since sliced bread. It is essentially a biscuit with succulent fried chicken breast, applewood bacon topped with an egg. Can't forget to mention the freshly made gravy that was every bit of perfect (EAT IT HOW IT SHOULD BE ATE, like a sandwich). The second time around, I ordered the sticky maple, which was another good choice. It was  a biscuit with fried chicken breast (JUICY), applewood bacon, and drizzled with maple syrup. I wish I knew who thought of this, but every thing I had was amazing. The iced cinnamon pecan biscuit was like a treat for my palette. It was the icing on the cake. The SERVICEFrom the first time I went to the second time I went, the service was nothing less than awesomeness. My first time going, the young lady at the cash register gave me the run down on how to order and what was a popular item. She was extremely polite and helped me out. She blew my mind when she asked, \"What's your favorite childhood cartoon?\" LOL.. After I got my meal, I began indulging in the goodness. Meanwhile, the manager walks up to me to make sure everything was good. I could barely get the words out to let him know everything was amazing. He then comes back and offers me the iced cinnamon pecan biscuit to try. This place couldn't get any better at this point. Nonetheless, the service is consistently pleasant.HANDS DOWN, THIS PLACE IS HIGHLY RECOMMENDED!! And if you ask me, try the Five and a Dime.", "Date": "2014-02-17", "Author_Location": "Washington, DC"}, {"Author": "Chad B.", "ReviewID": "gq18U0lsmw4IPBe9kjTStA", "Overall": "5.0", "Content": "Absolutely delicious.  We had the Five and the Maple biscuit, with Mac and Cheese and collards. Everything was fresh and tasty! The staff was incredibly nice and the manager even brought us dessert for free since it was our first time eating there.  Highly recommended!", "Date": "2014-05-24", "Author_Location": "Raleigh, NC"}, {"Author": "Alysia J.", "ReviewID": "Sig7-rHqTZNRZpAfyhltIQ", "Overall": "4.0", "Content": "Came here on a visit to Jax with some friends from college, and MAN! I have been missing out on life. It's hard for me to believe that this place has only been open for 2 years, it has such an old school feel. The biscuits were flaky and soft, the sides (mac and cheese, grits and collard greens) were absolutely delicious. The seating was a little intense, as it was busy and seating is first come, first served. I wouldn't suggest large groups try this out if you're super hungry. Overall, I will have to make sure to try it again next time I'm in town.", "Date": "2014-07-06", "Author_Location": "Atlanta, GA"}, {"Author": "Mi M.", "ReviewID": "huy7f3mW2VrCvQmcEG8EQw", "Overall": "5.0", "Content": "This place is stool good.  We arrived in Jacksonville a little before noon on the 4th of July.  I ordered a biscuit with gravy with a friend egg.  My husband the chicken biscuit with chicken, goat cheese and hot pepper jelly.  My breakfast was the best sausage gravy I had ever EVER EVER!!!!! (And I have tried many).  My husband really enjoyed his too. When ordering you don't give your own name, you give the answer to question of the day.  Ours was \"who's your celebrity crush?\"  But when going there be prepared to wait.  Also, there's not much seating inside when crowded, but you can find some outside if you're willing to sit in the heat.", "Date": "2014-07-08", "Author_Location": "Lakeland, FL"}, {"Author": "Ryan L.", "ReviewID": "9d9fqEOf342kSUwQuCPitA", "Overall": "5.0", "Content": "Wow, I just found my new favorite place in Jacksonville. You can't go wrong with the sticky maple sandwich and a cup of the maple tap coffee. There is a cool atmosphere here too, including the most interesting questions at the register with your answer shouted out as your order number when it's ready. Fun place that is also delicious.", "Date": "2014-05-12", "Author_Location": "Fresno, CA"}, {"Author": "Katie E.", "ReviewID": "QuP2-Zrawx3LEvwf0e4rcQ", "Overall": "5.0", "Content": "Omg. I couldn't pick what to order so I went with the loaded goat ! Biscuit and chicken with fried goat cheese and syrup on the side also the mash up ! It was kinda cute that they have a question of the day and your answer is how they call your order out. LEAVE IT TO BEAVER ?! That's my dad ! So I see this biscuit and it's perfect. I take a bite and omg the amount of flavor that the loaded goat ( goat cheese ) has is un imaginably delicious ! I couldn't contain my excitement with how yummy it was ! Don't judge but I totally dipped it in the syrup and it had a rock on flavor !(: mash up got dunked too (; don't know it till you try it !!!Service was amazing and good came pretty quick ! I like the set up kind of. It's very old store chic (: I love it. Nice outside area too when it's gorgeous out like today is ! Manager was amazing. Big guy with a beard and blue shirt. Anyway I highly re come a this place. Only negative is if your in a large part or even four it can get pricy because your mouth says try this and this and this. Don't worry though. It's not scary bad just do your mouth a favor and eat here  breakfast and lunch are epic !!!highly recommended !!", "Date": "2014-02-10", "Author_Location": "Orange Park, FL"}, {"Author": "Darby N.", "ReviewID": "jQmJR-fozdoqNKzneulu7g", "Overall": "3.0", "Content": "It would be great if you couldn't tell the biscuits were frozen. The maple coffee is excellent though.", "Date": "2014-06-06", "Author_Location": "Fernandina Beach, FL"}, {"Author": "Hania A.", "ReviewID": "xKtkeIropJ8VrhqPcaNapw", "Overall": "4.0", "Content": "This place has to have one of the best fried chicken biscuits I have ever had!  Always a busy spot, a nice place to grab breakfast with family or friends.  You can sit inside or outside to enjoy the nice weather.  They have great coffee as well.", "Date": "2014-05-26", "Author_Location": "Charlotte, NC"}, {"Author": "Jill C.", "ReviewID": "zVGACkUCzwAYVFE0Xp0EPw", "Overall": "5.0", "Content": "I love eating breakfast for lunch/dinner, so this was perfect for me. The restaurant is a fast casual concept and they ask you a question when you order. Your answer is what they will call out when your order is ready. The question for us was \"what is your favorite band\". I really wish I would have known about this beforehand so I could think of something funny to make them yell out...like Sex Pistols :)I decided on The Ralphie Deluxe (Flaky biscuit, sausage gravy with a kick and fried egg)  for my meal, with a side of Smokey Mountain Mac-N-Cheese. I started eating my food and didn't realize until I was halfway through that I was missing my egg! They were extremely busy from the Cash Mob group, so I didn't say anything about it. Still, the biscuit was delicious. The gravy has bits of sausage in it and they gave me tons of it. Not one small corner of my biscuit was dry...and that's the way I like it! Unfortunately, I didn't care too much for the mac and cheese. I liked that they used cheese-its for the topping, but the overall flavor was lacking for me.My husband ended up getting something I was eyeballing on the menu, The Sticky Maple (biscuit, all natural fried chicken breast, pecan wood smoked bacon all topped with Bissell Family Farm real maple syrup). He was a little concerned with only getting one biscuit and no side, but as we figured out, he didn't need anything else because that biscuit was huge! He said that it was really good and very filling.Verdit: Loved it!! We have actually been back many times and it is always wonderful!", "Date": "2014-02-16", "Author_Location": "Jacksonville, FL"}, {"Author": "Johnny B.", "ReviewID": "hqklDmKbK9etfcp9m8Qndw", "Overall": "5.0", "Content": "Such a unique idea for biscuits and gravy. I love this place!", "Date": "2014-05-23", "Author_Location": "Jacksonville, FL"}, {"Author": "Andrew H.", "ReviewID": "oBlEMp69zRykQoiAqVqAZQ", "Overall": "4.0", "Content": "Ooff. What a dilemma.  This place is very similar to a place \"back home\" in Portland called \"Pine State Biscuits\".  In some of the photographs of the biscuits here, they look almost identical.However...These sandwiches could really, really be a bit bigger.  I ate one and was still hungry, I probably could've eaten two.I have no complaints about the quality, the quality was great, the coffee options were terrific and the employees were HAPPY (something we don't' have much of in Portland).  I think the coolest thing about eating there was that, instead of asking you for your name, they ask you \"what is your favorite thing about 2014\".  So when I heard \"climbed Mt Rainier\", I knew it was mine.  Also overheard: \"legal weed\".The fried goat cheese medallion is an excellent touch to these sandwiches.  This is something that Pine State does NOT have.  I'm a sucker for all things goat, so it is much appreciated.Make everything 20-30% bigger and I'll throw another star at ya!", "Date": "2014-01-10", "Author_Location": "Portland, OR"}, {"Author": "Kendall N.", "ReviewID": "9Ht5yq4YgDTRJ6l7l5ET8Q", "Overall": "4.0", "Content": "The service was great and the atmosphere was inviting. The food was delicious and the chicken cheese sausage gravy with bacon in a biscuit is a tasty combination.", "Date": "2014-05-24", "Author_Location": "Columbia, SC"}, {"Author": "Lizzy C.", "ReviewID": "f9E-pMQLiMNPManOfI1Mdg", "Overall": "5.0", "Content": "Ohhhh man, leave your diet at the door, Maple Street is a place to splurge! I chose 'The Farmer' on my first trip to Maple Street and loved the combination of the sweet apple butter, salty smoked bacon, sharp cheddar, crispy chicken & flaky biscuit. I practically licked the plate clean! On my second trip I had the 'Squawking Goat' (chicken, goat cheese pepper jelly), and pretty much, anything with pepper jelly automatically gets 5 starts in my book! Both times I shared the hash ups, cheese smothered potatoes with ham, peppers, onions, mushrooms...an absolute must have. The coffee is excellent as well. The San Marco location gets pretty crowded, especially on the weekends, so I suggest having a member of your party stalk a table while someone else orders the food. The service is quick and the quality superior. Great place to bring out-of-towners!", "Date": "2014-02-09", "Author_Location": "Jacksonville, FL"}, {"Author": "Waheed B.", "ReviewID": "g9IDngY1Rnho0ZmMZBkvag", "Overall": "5.0", "Content": "Solid 5* casual breakfast with Southern flare. Pick one of many biscuit sandwich options (listen to your fellow yelper) or create your own. I appreciated the large menu, friendly order taker and casual nature of the setting area. This place is popular and we didn't have to wait long to order unlike everyone that arrived after us. If you want to eat inside, there may be a wait for a table or you can make friends and join a table with empty seats. I really enjoyed the savory biscuit sandwiches with fried chicken and various toppings from goat cheese to pepper jelly. These are just really good and no wrong choice to stress about. On the sweeter side there are pecan biscuits covered in icing. Good and super sweet.I enjoyed this visit and its great with a special someone, a hungry group of friends or bringing the family when they come to visit.", "Date": "2014-01-05", "Author_Location": "Jacksonville, FL"}, {"Author": "DeeDee H.", "ReviewID": "7cW40tN9qjYNdi0kLKO3AQ", "Overall": "5.0", "Content": "Oh good lawd! That biscuit made me wanna slap yo momma!We've been hearing a lot of good things about this place, and couldn't wait to give 'em a try.  While doing some Christmas shopping, I had the great idea to slip in here for some lunch and boy am I glad I did!There is a huge menu on the wall to the left as you walk in.  Now, it all sounds tasty so it may be a tough decision... may as well just throw a dart then come back again and again and again to try the others!  I picked the Squaking Goat.... Fried chicken breat, fried goat cheese on top of a perfectly made biscuit with house made pepper jelly.... Can you say D-licious!?! I think next time I order this one, I'll ask for extra jelly!  My honey ordered the Garden Bird and his was equally as yummi!  and they were HUGE!The seating is set up like community seating.  So don't be afraid to ask someone to scooch over and let you join them!  We did manage to snag a table for two.  When you are done, grab your plates and take them to the door... there is a bin set up as you walk out to put them in.  Takes away the need for table servers!Give 'em a try, you'll be thanking yourself for not passing this one up!  Oh and be creative with your answer when ordering... they ask a question, you come up with something creative and that is how they call you when your order is done.  Our question was... What do you want for Christmas... My honey responds... My two front teeth!  Do it, it's just fun!", "Date": "2013-12-18", "Author_Location": "Macclenny, FL"}, {"Author": "Stacey V.", "ReviewID": "F8dV_GhDC-yk3hmuW42v8A", "Overall": "5.0", "Content": "This place is fabulous! The buttermilk biscuits are truly from the south along with fried chicken that melts in your mouth and let's not even talk about how amazing the maple syrup pairs with the crispy bacon. If you are need a southern fix with a modern twist this is your place! Even though the food could stand alone, the staff was there to compliment the food to a tee. They were very welcoming and full of local advice that we needed as out of towners. We will definitely be stopping again soon!", "Date": "2014-05-15", "Author_Location": "Cincinnati, OH"}, {"Author": "Matt F.", "ReviewID": "J9SDkHWDWp8U_iI_gLKCIg", "Overall": "3.0", "Content": "I ordered the biscuits and gravy with eggs.  Nothing to off the wall, but I have a simple palate.  The ambience is cool for a little breakfast spot.  Very simple, grab your own coffee cup, a few different kinds of coffee and condiments for the coffee.  My table was dirty, and I couldn't find a rag or anything to wipe it down with so i found a napkin on near by table and went up to the soda machine to soak it with water.  I have no problem with that really, I could have sat at a different table, but it would have been cool to have something to wipe it with if they don't do that often.  They called me for my order and I picked it up from the counter.  It was good, you could tell that everything was made fresh.  The gravy was real spicy, I liked it, it was just a little much first thing in the morning and I only ordered coffee, so I stole a togo coffee cup and filled it up with some water!  sorry guys.  It wasn't an experience to write home about, but I will defiantly be back and try some more things.  It is worth it to dine here.  1 tip....Think of what makes you laugh when you go in!Cheers", "Date": "2014-05-20", "Author_Location": "St Marys, GA"}, {"Author": "Katy S.", "ReviewID": "GmwffxSHgrjet7Yq5sssLQ", "Overall": "5.0", "Content": "All I can really say is WOW.  I am not a big breakfast person, but I can say that I loved Maple Street.  We went on a Saturday morning and it was quite crowded, but not to the point where we couldn't get a table. My sister and I sent the guys to go order while we scoped out a spot to sit.I went for the Squawking Goat (Fried chicken, pepper jelly, goat cheese - on a delicious homemade biscuit).  We also split a side of the hash ups.  I can honestly say that this was pretty much the most delicious breakfast sandwich EVER.  I wish that I lived in Jacksonville so that I could visit more often, but you better bet that I will come back on my next trip to Jax!", "Date": "2013-12-23", "Author_Location": "Tampa, FL"}, {"Author": "Kevin O.", "ReviewID": "YHplK92HyP6ua5SkdNg_dw", "Overall": "5.0", "Content": "Man. I think my toung just slapped me silly. I had the nickel and dime and it was so good. Fried chicken , egg,cheese and sausage grave with a biscuit. I loved the gravy, nice and spicy. They keep you on your toes in line by not asking your name but today's question was what do you want for Christmas.  Today I went with my team and everyone loved it. Of course there was not much productivity after eating the comfort food hereI looked being able to see them making the biscuits. I will be back very soon.", "Date": "2013-12-13", "Author_Location": "Jacksonville, FL"}, {"Author": "Lindsay L.", "ReviewID": "NFOxxS--cBpGpiv45l_vKA", "Overall": "3.0", "Content": "Chef Boyfriendardee and I came here last week for lunch. I ordered the Reinhold and he got something I don't remember. It was a big ball of fried delight.The best part was the pickles. They added just the right amount of zing. I also tried the mac n cheese, which was yummy, but I could've done without the cheez-it crackers on top. If you're going to do a crumbly topping on mac and cheese, it really needs to bake with that on top to meld the two together. Otherwise you have crunch on top of mush and that's a weird texture. I may not have the most sophisticated pallet, but I'll be damned if I don't know my mac n cheese. That being said, I would probably order it again just because I can't NOT order mac n cheese.Don't let the 3 star rating stop you, this is a perfectly yummy place to eat. I only took away two stars because the cleanliness was sub par. They ask you to bus your own tables but some people didn't get the memo. Also, you have to put your dirty dishes right by the door, which is not what I want to see when I walk in to eat. It attracts flies and that's not cute. It was only moderately full when we went, so I'd hate to see an even bigger pile of dishes if it were busy. Other than that, I really enjoyed my visit.", "Date": "2013-12-03", "Author_Location": "Jacksonville, FL"}, {"Author": "Rachel L.", "ReviewID": "7m7mTKyCrrxdBKR03f-YDQ", "Overall": "5.0", "Content": "I ordered the squealing goat because I'd seen in mentioned on here so many times, and I will say, it was definitely worth the mention! My friend got the five and dime and it was fantastic!David style hash ups, too!I don't know why I hadn't been here sooner! Totally worth fighting the Saturday morning crowd!", "Date": "2014-02-15", "Author_Location": "Lexington, KY"}, {"Author": "Bill K.", "ReviewID": "waPbCXhHqNR_0zUohSP97Q", "Overall": "5.0", "Content": "Maple Street Biscuit Company has just joined my list of top 3 breakfast places in all of Jacksonville, Florida. The Ralphie is the absolute best biscuit and gravy  breakfast I have ever had and I will be back to get more soon.", "Date": "2014-04-25", "Author_Location": "Jacksonville, FL"}, {"Author": "Danielle S.", "ReviewID": "rm8CGvVISw6dijG8lXJ21w", "Overall": "5.0", "Content": "I'm so upset that they are only open until 2pm during the week and that they are Closed on Sundays. Making that time fit into my schedule is very difficult however probably a very good thing for my cholesterol. Breakfast is hands down my favorite food and a good biscuit can make me swoon. This place has the very best biscuits ever! They are dense yet moist and oh so flavorful, especially with their amazing gravy, maple syrup or glaze on top. Anyway, I opted for the Sticky Maple with a side of Gravy for my second trip to this wonderful establishment. This was my first visit to the San Marco location and I found it very similar to the Beaches in appearance. I love the \"rustic\" appeal.Since we got there close to closing time they came around and gave out free cinnamon glazed biscuits to the remaining patrons, I assume to get rid of the leftovers so they don't sit overnight and go to waste as well as to reward customers and build loyalty... it worked for me. You can buy my loyalty with free cinnamon biscuits any day, even if I didn't already love you!", "Date": "2014-03-12", "Author_Location": "Jacksonville, FL"}, {"Author": "Brentley S.", "ReviewID": "S4qqF8wXmEmuRE2ny-K-tA", "Overall": "4.0", "Content": "Love this place! Perfect spot for breakfast, my favorite is the Loaded Goat but I add a side of sausage gravy because it's a bit dry for my taste. the hash browns are also delicious, but I'm not a huge fan of the sweet cinnamon biscuit because I like gooey cinnamon things! They have two locations this one, and the one on 3rd Street at the beach. There are some individual tables for seating but most of it is communal style long tables. If it's crowded be warned you might have to cozy up to another group!", "Date": "2013-12-12", "Author_Location": "Jacksonville, FL"}, {"Author": "David F.", "ReviewID": "fKJsCnKG1FZKij1inhFUEQ", "Overall": "2.0", "Content": "Ok, I see what all the hype is about and the food is good.  However, all they have done is doctor up a Chic-Fil-A patty in a biscuit and put some toppings on it.  I can do that at home.  The ordering here is a challenge and could be confusing for some.  Seating is first-come-first-served and you may have to wait for a table to open up.    I would say give it a try, if you haven't already.  I am not sure if I will be back.", "Date": "2014-03-20", "Author_Location": "Jacksonville, FL"}, {"Author": "Kevin B.", "ReviewID": "r0_fDEwnd-u9qop4Acv25Q", "Overall": "4.0", "Content": "You want some down-home southern cookin' with a little pizzaz? That's exactly what you'll get when you eat here! Very interesting twist on there meals but beware, this place is NOT for the skinny folks unless you are trying to kick the anorexia. :-)Seriously, good food with good prices. I would frequent the place more often if I lived closer. Well worth the trip!", "Date": "2014-01-20", "Author_Location": "Jacksonville, FL"}, {"Author": "Kylene M.", "ReviewID": "4NtKS5xmXGBn_tUDme_KDg", "Overall": "5.0", "Content": "I'm a sucker for biscuits and gravy! When I walked in the smell of bacon slaps you in the face and then clings to you for dear life! With a greeting like that, what's not to love? And freshly made biscuits! You can make just about any kind of sandwich with biscuits. The possibilities are endless! I love this place not only for those southern biscuit sammies that are cleverly named, the way they call up your order, and the friendly staff.. but because the first time I came to MSBC it was the day my fiance proposed. (not at the restaurant but a park nearby). So every time I eat here I am reminded of all that happened that day, including eating the Five/hashups! It's funny how eating a biscuit, I mean MAPLE STREET biscuits, can take me back to one of the happiest days of my life! =)All I am saying is, this place doesn't disappoint. Now if you're one of those \"health nuts\", do yourself and I a favor and give yourself a cheat day. =P", "Date": "2013-10-09", "Author_Location": "Jacksonville, FL"}, {"Author": "Jamie W.", "ReviewID": "FDfpwOxnxGjgLM0hpiwoGw", "Overall": "5.0", "Content": "Of you love fresh biscuits and unusual combinations with fresh biscuits this is the place to try. Yummy gravy is amazing with a bit of a kick.", "Date": "2014-04-12", "Author_Location": "Orange Park, FL"}, {"Author": "Marc N.", "ReviewID": "EM22gqFGjUvkkfKw3JWRbA", "Overall": "5.0", "Content": "Every once in a while I run across a unique little eatery that just hits it out of the park.  This is the most recent.  There are no waiters.  This is self serve.  Walk up to the counter and order.  It does not matter what you pick.  Anything will blow your mind.  I ordered the squawking goat.  It was a taste sensation.The lovely Christine ordered the five.  I suggest anyone coming for the first time get the five.  It really does set the tone for the whole menu.The coffee is really good.  I love a place that understands the importance of good coffee.  It can make or break a place for me.  The whole vibe of this place is fun. Families, groups of teens, college kids, couples out for a brunch all coming together into this lively \"Good Morning!!\" feel.It was a ton of fun.  By the way, my name was Marc the garbage man.  You'll figure it out.", "Date": "2013-10-02", "Author_Location": "East Brunswick, NJ"}, {"Author": "Anthony N.", "ReviewID": "5eYlvswGIkzCb0AFeW5WUg", "Overall": "5.0", "Content": "2nd time around I tried the Hashups with my biscuit sandwich. Very good, lots of flavor. I love the bits of ham they put in it. Even my two year old son liked it, he could have eaten a whole side by himself. So many good things on the menu. Gonna take me awhile to try it all. But it is totally worth it.", "Date": "2014-03-04", "Author_Location": "Jacksonville, FL"}, {"Author": "Jessie P.", "ReviewID": "4wL-JMFMf98mvlpJ1YPZvg", "Overall": "5.0", "Content": "I visited Maple Street Biscuit Company after hearing rave reviews from friends and acquaintances. I was not disappointed. Very unique, high quality food in a warm, friendly setting. The decor, atmosphere and menu all fit together very nicely to create a relaxed, southern/country (in a stylish way) dining experience. There are a large number of biscuit sandwiches to choose from: I chose a chicken biscuit with bacon and maple syrup, my husband chose a chicken biscuit with honey mustard and thick-sliced pickles--both excellent. We also split a side of hash browns with sausage gravy and chunks of ham that was amazing and very generously portioned. We will definitely be returning. The only caveat I would add is to be sure you check their hours before visiting. When we first tried to visit, the restaurant was just closing (at 2pm) for three hours before reopening for dinner (at 5pm).", "Date": "2014-01-23", "Author_Location": "Jacksonville, FL"}, {"Author": "Kristie C.", "ReviewID": "5MZ0lJxS5Ws0bl-XZbO1UQ", "Overall": "5.0", "Content": "I've been here about 5 times and its always SO GOOD!!  I usually order the loaded goat or five-&-dime. The atmosphere is fun, outdoor seating is great and the staff are all friendly. It's a very popular spot on the weekends so get there early! It's worth waking up for!!", "Date": "2013-09-18", "Author_Location": "Jacksonville, FL"}, {"Author": "James Y.", "ReviewID": "hPg8HDgUVlQm3gmVPpb1Og", "Overall": "5.0", "Content": "The most perfect combination of biscuit, bacon, chicken and syrup.  My only regret is not being able to eat more than one.", "Date": "2014-04-12", "Author_Location": "Jacksonville, FL"}, {"Author": "Chris A.", "ReviewID": "HoNc2eMxxP3HEKcUJKxPoQ", "Overall": "5.0", "Content": "From the moment I walked in, I felt like a regular. Their self serve coffee selection is great and the staff are super friendly The owner, Gus, takes pride in his food and getting to know all of his customers.I found the place here on yelp and couldn't be happier. I chose to try the five and dime which is a biscuit covered in a spicy sausage gravy with fried chicken, bacon and a fried egg.  On a Friday am, treat yourself !", "Date": "2013-10-23", "Author_Location": "Miami, FL"}, {"Author": "Amanda S.", "ReviewID": "AjJ9-xhjLOovwTZJYv-p8Q", "Overall": "5.0", "Content": "Yummy, flaky, flavorful, eat all your calories in one meal kind of place.  The pecan pie biscuit was divine, the Loaded Goat (fried chicken and goat cheese on a biscuit) was more than I could eat and oh so good, the iced pecan biscuit was so good its not just for breakfast.  Coffee was fresh and bold, I'm told its ground fresh at the shop.  Definitely worth a try, I'm sure you will be hooked.Service was excellent as well", "Date": "2013-11-02", "Author_Location": "Jacksonville, FL"}, {"Author": "Daisy D.", "ReviewID": "O7tv2S9J9AgsXoobTSqhDw", "Overall": "4.0", "Content": "Laying in bed & deciding what to do on a Saturday morning can sometimes be difficult. Husband wanted to go to breakfast. I said if we get up & GO, I'm game. If I move from here to the couch, I'm not making it out the door. So glad I made it out the door for Maple Street. Convinced my bro & sister in law to come along for the ride. Found a spot on the roundabout right across the street from the restaurant: SCORE! Walked right in and the cashier was open & ready to take our order: DOUBLE SCORE! But...but...but...OMG...what was I going to get?!?! This was my first time here, after all. My husband and I went for the same thing: the Ralphie Deluxe. My brother had the Ralphie Double Down (my next visit order) and my sister-in-law had the Sticky Maple. Someone will end up with The Sticky Maples as their Fantasy Football team. This is going to happen: TRIPLE SCORE!What is your favorite place in Jacksonville? Riverside Arts MarketThe sausage gravy had just the right kick. Warned my husband to go easy on the hot sauce. Did he listen? Nope. The egg on top was well done, but the yolk was still runny; don't know how they did it. The Sticky Maple looked gorgeous from across the table. Must have been good, because it disappeared quickly. Coffee was hot & flowing and delicious. We sat in the back room. It wasn't hard at all for us to hear our order called (which some reviewers have hinted at) and it cut down on the noise in the rest of the restaurant. When we got up to leave, I wasn't surprised to see a crowd around the coffee station; we were approaching prime brunch hour after all. Holy popped jeans Batman! The line was out the door & all the tables were full, including the outside ones. Oh - almost forgot - and when we asked the manager that was checking on us when the beach location was going to open he said Thursday. (Yes, three days from now) HOME RUN!!!!!  As my brother said, this place is going to redefine the breakfast landscape at the beach.", "Date": "2013-08-12", "Author_Location": "Jacksonville, FL"}, {"Author": "Jon H.", "ReviewID": "On28aOjIkaLDakosQYFVAw", "Overall": "4.0", "Content": "One of the best breakfast meals I've had in a while. That's what I have to say about Maple Street Biscuit Company. And I didn't even have a cinnamon roll (my favorite breakfast choice). I'm not big on biscuits, but this place makes 'em mighty fine. There was also Mac N Cheese involved. Yeah, I had Mac N Cheese for breakfast... no big deal. The Smokey Mountain Mac N Cheese was delicious. The crushed cheese cracker crust adds a nice texture. I would highly recommend trying this cheesey treat. Want some goat cheese to go with that Mac N Cheese? Um... Yes please. When I saw the Loaded Goat (goat cheese paired with fried chicken on a biscuit) there was no keeping me away. It was very good. The chicken was cooked perfectly tender & juicy. The biscuit that surrounds this delightful combination is easily one of the best I've had. The only issue I saw was the seating situation. When we arrived on a Saturday morning, the place was hoppin'. There were no available seats, and seats are first come, first served. Standing in line waiting to order, I watched over the dining room, anxiously hoping some people would leave. Right after we ordered a group got up, and we jumped right into their table.We got lucky, but I could see it being very frustrating if no tables were available. The staff was quick on the draw. We sat down and almost immediately someone came over to collect plates and wipe down the table. Impressive. Have your social shoes on. The table we snagged was made for 8, we were 4, leaving 4 more available seats (that's math baby). We offered up those extra seats to another desperate group. They were very appreciative. It was fun to have breakfast with some new folks, but if you aren't feeling sociable (I'm not always), it could be quite awkward. I scoped out MSBC's website After we visited today, and saw that I missed out on getting an Iced Cinnamon Pecan biscuit... not happy about this, but at least I know what I'm getting next time.", "Date": "2013-08-24", "Author_Location": "Phoenix, AZ"}, {"Author": "Tram V.", "ReviewID": "1bEqXQHUzG4gs2wwXXPHxw", "Overall": "5.0", "Content": "Dude, get The Garden Bird and add a goat cheese medallion. Thank me later.", "Date": "2014-03-27", "Author_Location": "Lawrenceville, GA"}, {"Author": "Christy M.", "ReviewID": "TIJNindioQDNqvqA0CLz-w", "Overall": "5.0", "Content": "Checked out this place today and it was awesome! The menu has a wide variety of biscuit sandwiches, it's so hard to choose! I had the \"iron goat\", which was spinach and goat cheese on a biscuit. Also had \"Robyn's home made pecan pie\" and the cinnamon roll with home made cream cheese icing. Everything was delicious! Would definitely recommend.", "Date": "2014-02-25", "Author_Location": "Jacksonville, FL"}, {"Author": "Kaneil Smith S.", "ReviewID": "ampIY2deNFpCqqZ9Ktp3wg", "Overall": "4.0", "Content": "Maple Street has been in my bookmarks for a while and I'm satisfied now that I have been there. I went on a weekday on lunch and it wasn't super busy I appreciate that there is outdoor seating as well.I ordered the 5 and it was good. It is exactly what I was expecting it to be : the biscuit nice and fluffy the chicken was seasoned and it paired nicely with the bacon and cheese. The gravy poured over the biscuit was good except it had sausage bits in there which I don't like but I guess that can be substituted. I also had a side of sweet potato fries it was done right and are cut large and lightly salted. I'll definitely go back and work my way through a few more items on the menu.", "Date": "2014-03-15", "Author_Location": "Jacksonville, FL"}, {"Author": "King O.", "ReviewID": "o7ezCaeRzWv9--aCDw9mSw", "Overall": "5.0", "Content": "Biscuits! Delicious, delicious biscuits! (good service too)", "Date": "2014-04-12", "Author_Location": "Jacksonville, FL"}, {"Author": "Melissa S.", "ReviewID": "qn3wyoZBcDzxd3DE8HAMAA", "Overall": "5.0", "Content": "We are always looking for \"the\" place. You know the one you can't wait to go back too and would be very willing to drive out of your way for.  I am always surprised how few of these there are in Jacksonville.  I love the city but it lacks really good restaurants, but this is one. A cool spot with a great vibe and even better food. Coffee was excellent, homemade chocolate milk for the kids and every biscuit combo you can think of.  We loved the sticky maple.  Everything is homemade, fresh and original. There is something for everyone in your party and we can't wait to go back.", "Date": "2014-06-05", "Author_Location": "Gainesville, FL"}, {"Author": "Andrew M.", "ReviewID": "Kt1x7sNlC32cD12DsyTKWw", "Overall": "5.0", "Content": "Double-down down the hatch..never a disappointment.. Except for my Mum, she couldn't enjoy a biscuit. She's dairy free.", "Date": "2014-04-01", "Author_Location": "Jacksonville, FL"}, {"Author": "CJ F.", "ReviewID": "KipLvyIuTvgPHHNofCpq9Q", "Overall": "5.0", "Content": "This stuff is GOOD! Be sure to ask for the \"Sam Mitchell Hashups\" if you wan to try something interesting!! I LOVE the 5 & Dime with a side of pork. I don't know. It's just PERFECT.", "Date": "2014-04-10", "Author_Location": "Jacksonville, FL"}, {"Author": "Leslie D.", "ReviewID": "5DZ586cw7tKDh2v09Or_oA", "Overall": "5.0", "Content": "What can I say about Maple Street Biscuit that hasn't been said, but as always I can say more. They have the best biscuits ever! What an original idea of having an eatery that specializes in a southern favorite. My favorite is the Ralphie that has the best sausage gravy other than my Grandmothers! The sweet potato fries are thicker than most and are served with a side of honey maple syrup-yummy. The hashups are also good and are really like home fries with onions, bell pepper, ham and cheese. There are many more biscuits to be conquered and I am willing!", "Date": "2014-03-21", "Author_Location": "Jacksonville, FL"}, {"Author": "Kelly D.", "ReviewID": "RdY31hgNrPk8N-56eHtNZg", "Overall": "5.0", "Content": "So many options so little time! Line is out the door and I can see why. This place is THE BOMB DOT COM. I will be bringing every visitor who visits me in Jacksonville here to enjoy the deliciousness this company offers.", "Date": "2014-02-15", "Author_Location": "Greater Arlington, Jacksonville, FL"}, {"Author": "Ruby A.", "ReviewID": "QyL3LhAIb9Ru4ymbw_r7dQ", "Overall": "5.0", "Content": "Yeeeeeee haaaawwwww!!! Finally tried is place this morning and I'm totally lovin' and diggin' it. My group of 5 were able to hunker down at a table with another group of girls. So here's what we got:- The Five - The Five and Dime- Iced Cinnamon Pecan Biscuits- Redleaf coffee: dark roast and maple tapWowzers!!! The biscuits were flaky and tasty. The fried chicken was juicy and the perfect size on the biscuit. The pecan wood smoked bacon was sinful lol.  The sausage gravy was thick and had the perfect amount of spice and kick. The iced pecan biscuits looked like a cinnamon roll, but you have to remember it's a biscuit or else you'll be upset about how much harder it is. The coffee was delicious and strong just like I like it. The restaurant was big, but EXTREMELY busy. Despite the long line, I think folks were able to get a table once they got their food. If you've never been, you have to order your food first before you can get a table. We were lucky and were able to share at able with another group. Picnic and family style, baby! The ventilation is good. The decor is pleasing. The music made me want to honky-tonk LOL :PThe staff is great!!! Every staff member we encountered was very nice and had that good ol' Southern charm :)", "Date": "2013-07-20", "Author_Location": "Jacksonville, FL"}, {"Author": "Ryan H.", "ReviewID": "bpByCSUAJpyaLOyv4vS-Tg", "Overall": "5.0", "Content": "So many awesome things to say about this place. I was skeptical about everything on a biscuit, but I shouldn't have been and neither should anyone else.Clean, great decor (very vintage/indie/hipster-ish), all self service, awesome food, gravy rocks, and the chicken taste really good!Certainly a must try. I highly recommend the Five and Dime. The hashups are great too.Looking forward to trying everything on the menu in the future.", "Date": "2013-07-12", "Author_Location": "Jacksonville, FL"}, {"Author": "Mark S.", "ReviewID": "FIlhcsV2FTnDbHx9cezgUQ", "Overall": "4.0", "Content": "Great chicken and biscuits.  You should make sure to get one with bacon.  Also, the Hashups are wonderful with big chunks of ham.  I got the pepper jam on my biscuit; it was sweet but not very hot.", "Date": "2014-03-14", "Author_Location": "Venice, FL"}, {"Author": "Jack H.", "ReviewID": "CGooOamgWB8w7mqy8J-6AQ", "Overall": "5.0", "Content": "Somehow the word YUM does not even begin to describe this dining experience. Anything you can imagine stuffed between a biscuit. They customized my choice and it was incredible!  All the employees were quite friendly and they surprised me with dessert - a pecan biscuit with icing. Everything is freshly made there!  Can't wait to go back!!!!!", "Date": "2014-04-02", "Author_Location": "Wayne, NJ"}, {"Author": "Keith H.", "ReviewID": "munSx9TffiF4rbuXxVIDBA", "Overall": "4.0", "Content": "Went for my Father's day brunch.Good biscuits, but a bit thick for my liking. Nothing wrong with the taste and texture, I just prefer \"thin\" biscuits.The fried chicken was good. And the gravy was good too..Now the Pepper Jelly that come on some of the biscuits is \"Da Bomb\"!!!They should bottle that stuff up and sell it........", "Date": "2013-06-30", "Author_Location": "Jacksonville, FL"}, {"Author": "Steven H.", "ReviewID": "77rlf29AwUd41LFvpl6K0A", "Overall": "5.0", "Content": "Great biscuits! My favorites are the five and the squawking goat! The pepper jelly is delicious!", "Date": "2014-03-08", "Author_Location": "Jacksonville, FL"}, {"Author": "Yvonne S.", "ReviewID": "7QFd5aRV0sebVS2j7quxIw", "Overall": "4.0", "Content": "I think the second biggest problem I have with this place is that I always want to order what I ordered during my previous visit. For newcomers, I'd recommend the Sticky Maple, the Reinhold, or the Farmer.The biggest problem I have is that I wish it were open all the time.", "Date": "2013-07-16", "Author_Location": "Oak Harbor, WA"}, {"Author": "Becky H.", "ReviewID": "8nSdp5s_CxXlhKOHLSgDlQ", "Overall": "5.0", "Content": "I love getting breakfast at Maple Street! It gets pretty packed and sometimes it may seem like seating is an issue but in the end everything works out. Every time I go there is a line to just order. (Try the Five & Dime!) When your order is ready, they call it out using the favorite game name, you gave them. I've used Jumanji and Extreme Frisbee. Most popular games I've heard while waiting were candy crush, monopoly, and basketball.Even with the large number of people coming and going, the place stays clean. With their different table sizes, it is easy to just join another group and experience a nice meal in good company (even if they are strangers).", "Date": "2013-07-25", "Author_Location": "Jacksonville, FL"}, {"Author": "Joseph G.", "ReviewID": "7-Qh58rt6aox6xtbLHCzoA", "Overall": "5.0", "Content": "Maple Street is unique and awesome. Great place for breakfast even though I could easily eat there for lunch. My favorite is the Squawking Goat. Its the chicken biscuit with goat cheese and pepper jelly. It tastes exactly and as good as what it seems and sounds My wife orders the Five and Dime (biscuit with gravy, egg, chicken cheese and bacon and we share eachothers. Between the squawking goat and five and dime you have enough variety to get a taste of two of the top items.Its very filling so we usually just get a biscuit sandwich each and share them with no other sides or anything. The coffee (which they have they bring in their own special blends) is very good and smooth as well and love that its self serve. The atmosphere and setup is perfect for what it is. It can get crowded at times (both San Marco & The beach) but thats expected from a quality and delicious place on a weekend morning.", "Date": "2014-02-03", "Author_Location": "Jacksonville, FL"}, {"Author": "Denis S.", "ReviewID": "ntynnS3M0KWYBLWYlnetew", "Overall": "5.0", "Content": "Outstanding. Breakfast is by far my favorite meal of the day and fellow Yelpers struck gold with the Maple Street Biscuit Company. I thank you sincerely for pointing me in the right direction. Virtual high fives.Upon entering, the place has a feel of serenity. The people in line are excited and everyone exudes a vibe of friendliness. Checked out the menu and settled on the Five and Dime. My partner in breakfast crime ordered the Sticky Maple. We both grabbed coffees. We were told fresh biscuits were in the oven and would take approximately 10-15 minutes, which was fine with us. We filled up on caffeine fuel and sat at the community table. As we sat there and took in the experience, we realized just how special this place is. Scott, who we would later find out is one of the owners, was all over the dining room floor, greeting guests, shaking hands and sharing a smile.We received our breakfast, as one of the servers brought it to us rather than calling out our name, which we were surprised by. But eager to partake in this delicacy, we made the first slice and went to a blissful place where endorphins found our pleasure buttons and jammed them like Neal Peart of Rush performing his legendary show. The food was amazing.The Five and Dime is a combination of chicken, biscuit, cheddar, a fried egg and the best sausage gravy I have had in years - and perhaps my life. The Five and Dime had a perfect amount of heat and the right amount of everything. Of course I sampled the Sticky Maple and was also surprised at its flavorful appeal. As we were eating, Scott came by and dropped off an Iced Cinnamon Pecan biscuit because he felt we waited too long. And we came to realize this is simply the person he is. As we drank our coffee (which was a great dark roast and I am a coffee snob), talked to other guests, and were formally introduced to Scott, we realized just how lucky we were. Nine months into business and this place is a masterpiece of genius proportions. What was impressive about Scott was his passion. You could see it in his eyes. He loved what he was doing and found joy in the success. One minute into the conversation, we learned his mission values. He shares it and breathes it in a time that others may say the values but do the converse. A sister store is apparently in the works and I asked him about franchise opportunities. Honestly, I would open one in a second in California - but only if I could run it as Scott and his team do - showing the same passion and fervor for food and life. If you have not made it here, you are missing out.  A return trip? Absolutely. I am booking a trip with the sole purpose of taking my dad here - and I live on the left coast.", "Date": "2013-08-03", "Author_Location": "National City, CA"}, {"Author": "Michael D.", "ReviewID": "DnEIWFGGx_xzk63J5WobSA", "Overall": "4.0", "Content": "I am visiting the Maple Street Biscuit Company after being stranded in Jacksonville an additional day thanks to snowpocalypse 2014 in Atlanta. Tired of hotel food and a bad wireless conncetction I decided to get out.  A friend suggested the San Marco district.  This is a little vintage community with contemporary charm. Looking for breakfast spots on Yelp, I came across this place with great reviews. A $5.00 taxi ride later, here I am.  It does not dissapoint. I am having the The Sticky Maple with a side of Collards. Delicious! The pecan smoked bacon is yummy, thebiscuit is fluffy and the collards are spicy. I highly recommend stopping by when next you are in Jacksonville.", "Date": "2014-01-30", "Author_Location": "Atlanta, GA"}, {"Author": "Kristina K.", "ReviewID": "PuU7MbuBMI586dIWwE047A", "Overall": "5.0", "Content": "Thank God the closest location is a good 40 minutes from my house because if it wasn't, I would be eating these biscuits for every meal. The restaurant itself is casual, clean, and quirky. Great service, fantastic food. My favorite is the BLT.", "Date": "2014-02-02", "Author_Location": "Jacksonville, FL"}, {"Author": "Kenton S.", "ReviewID": "5gfKqTGGODuiD-lIho0Sdg", "Overall": "5.0", "Content": "So, Maple Street Biscuit Company is my go to every other Friday breakfast place.  I love the staff, the surroundings and most of all, I am on quest to try out the whole menu.The five and dime was a delicious choice, what great gravy!  I love gravy, but it has to be like Grandma Benson made.  The coffee is also very tasty.  The second visit, I had the Goat.  It was really great.  I must admit, I ordered a side of gravy, removed the goats hat and a goat with gravy on the side.  It was truly delicious.  I always want to order more but am truly full after the first choice. Hope you all get to try Maple Street.  I think you will go back again and again.", "Date": "2013-06-07", "Author_Location": "Jacksonville, FL"}, {"Author": "Christos L.", "ReviewID": "W5nC7rQI6FZ1e6zKAPPGLg", "Overall": "5.0", "Content": "Amazing food. Five with a dime and the goat cheese biscuit was spectacular. The desert biscuit is equally amazing soul food. Definitely a favorite spot!", "Date": "2014-05-23", "Author_Location": "Jacksonville, FL"}, {"Author": "David K.", "ReviewID": "nts2sClOEZZkypNfFLInrw", "Overall": "5.0", "Content": "Just a great place hands down. I have yet to have something that wasn't great!", "Date": "2014-02-27", "Author_Location": "Jacksonville, FL"}, {"Author": "Samantha M.", "ReviewID": "lr8p5PeNAu2_y6PecHEV6A", "Overall": "5.0", "Content": "This place is so cool! The community tables and open seating is a great way to meet others and promotes a very friendly atmosphere. I ordered \"The Five,\" a huge chicken, bacon and cheddar cheese biscuit with gravy. It was completely delicious! The biscuit was fluffy and all of the flavors in the biscuit melded together nicely. This meal did nothing for my diet, but as \"comfort food,\" they hit the nail on the head.  The service was quick, fast and friendly. I will definitely be back!", "Date": "2014-01-20", "Author_Location": "Jacksonville, FL"}, {"Author": "Lai S.", "ReviewID": "ORv4BDzCqeGM8Te4bqKCtA", "Overall": "5.0", "Content": "Everything is so well situated here, from the time you walk in and place your order to the time you get your food. The wait is never too long the food always comes out perfectly how you ordered it. The biscuits are soft and fluffy, just the right amount of goodness.. The fried chicken on the biscuit.. Yummmm.. I miss this place'", "Date": "2014-02-27", "Author_Location": "Orange Park, FL"}, {"Author": "Ariel T.", "ReviewID": "mnzdlcLGlCsGz2rqiNewlQ", "Overall": "5.0", "Content": "I love this place!The first time I went, I didn't get too crazy. I ordered The Sticky Maple. Perfectly fried chicken breast topped with crispy bacon, between a delicious biscuit and drizzled with maple syrup. Delicious! My boyfriend went all out and ordered The Five and Dime. It was so good! Lots of flavor. The gravy that comes on it is amazing. We also were offered a complimentary Iced Cinnamon Pecan biscuit. I thought that was so nice of them! It tasted like a cinnamon roll. Yum!", "Date": "2013-09-06", "Author_Location": "Ponte Vedra, FL"}, {"Author": "Anna-Marie W.", "ReviewID": "zL0pm0P0UrMUOKpMKImfGQ", "Overall": "4.0", "Content": "When we go out of town for a few days, we do a lot of research online rummaging through  menus and reading reviews of popular places where ever we go.  On a recent trip to Jacksonville, one place kept popping up in all of my research- the Maple Street Biscuit Company.We visited on a mid Thursday morning, just after about 9 in the morning and the place was fairly crowded.  There wasn't a line to order food, just a lot of people kind of lingering.  I liked that.  Banjo music was softly piping through speakers and the smell of freshly baked biscuits drifted through the restaurant.  This seemed to be a comfortable hangout in the heart of the San Marco district where friends met and talked over coffee and biscuits.  I wish we had more places like that in Orlando.  Anyway, on to the food......Though they have a very unique menu, everything revolves around their homemade fresh biscuits.  Not a bad thing unless you are trying to avoid the carbs or really don't care for biscuits.  However, if you are a fan of all things biscuits this is the place for you.  From traditional egg and cheese biscuits to biscuit sandwiches with fried chicken and gravy, there is something for almost any taste.I ordered the Iron Goat- sautéed spinach and goat cheese melted between two biscuits.  They certainly did not skimp on the spinach or the cheese and it was pretty tasty.  They were running as a special but I really hope that it will find a permanent place on the regular menu because the only other biscuit option for a non-meat eater was the Garden Bird (a biscuit with a fried egg, collard greens and hot sauce.)Chad put together his own sandwich with a fried egg, cheese, lettuce and tomato.  He thought it was good if not ordinary.Chad also ordered sweet potato fries with a maple-mustard sauce.  The fries were OK and would have been really plain and boring without the sauce.  There was a prominent maple flavor with a pungent mustard flavor.  I would dip my left toe in that sauce and it would have been so tasty.I had decided to also try their hashups- \"Home fries with chopped smoked ham, red and green peppers, grilled onions, mushrooms, and melted cheese\" only I ordered mine without the ham.  What I got was a big plate of potatoes.  just plain potatoes.  I really had to hunt for any signs of peppers, onions or mushrooms.  I only found tiny little slivers of such vegetables and the cheese was barely sprinkled on.  Very disappointed when it was advertised to have \"toppings.\"Overall, it was a very cozy and inviting breakfast joint and we would certainly go there again if even just to meet some friends and relax over some hot tea.  I am not sure the food itself will lure us back anytime soon but if we are ever craving biscuits again this would certainly be the place.", "Date": "2013-09-01", "Author_Location": "Orlando, FL"}, {"Author": "Brian H.", "ReviewID": "ZYyc9zCYLeIX6D2zOgGfSg", "Overall": "5.0", "Content": "Back the truck up Jack! I have a brand new favoronii... Whoever came up with this place should win the Nobel give me a piece of that prize...You walk in and its clearly marked where to order right next to a huge menu on the wall. My sweetie pie and I studied the menu and I gotta tell you it was hard to pick what to order. It all sounded so delicious. I chose the Garden Bird. A biscuit with fried chicken, collard greens, a fried egg and hot sauce. I do believe that I will add this as my \"what would I eat for my last meal\" on my Yelp profile. The biscuit was perfectly cooked. Not too filling or doughy. The egg was cooked perfectly, I asked for it over well. The greens had great taste definitely not bitter. And the fried chicken was just perfect. It almost made me not want to give my baby a bite! Now thats a good biscuit my friend! I am definitely going back here. I want to try everything on the menu. Oh and the coffee was great. Also... Think of a creative answer to the question they ask because that's how they call out your order. But I'm sure most of you know that as in previous reviews. Today the question was, \"What do you want for Christmas?\" My answer....you guessed it, my 2 front teeth.", "Date": "2013-12-14", "Author_Location": "Jacksonville, FL"}, {"Author": "Barry F.", "ReviewID": "lhBig4X8nllRHqh23J1tqg", "Overall": "5.0", "Content": "Learned about this through the weekly rags. I've been here now half a dozen times. In all, between me and my family/friends that I've brought with me, we've tried:-The Five-The Five and Dime-The Squawk on the Street-The Loaded Goat-The Double Down-The Farmer-The Iced Cinnamon Pecan BiscuitsAnd probably a few more I don't remember.But, truly, an amazing experience with each one of them. Not to mention the amazing coffees.The atmosphere is hip, although I think I would prefer a few more 4-top tables rather than a few large tables. I don't necessarily like sitting with strangers. You're 'call' varies, whether it's your favorite game, your favorite place in Jacksonville, or your favorite celebrity. It's amazing how on-the-spot you feel when they ask you such simple questions.My favorite so far is the Five and Dime, although the apple butter on the farmer is no joke. I do recommend eating your chicken biscuit and then having a cinnamon biscuit to follow. You'll walk away feeling like your stomach loves and hates you, but you'll walk away happy nonetheless.There is always a line, but it never takes more than five or ten minutes to get to the front, and the service is quick. I spent the most time waiting today -- about ten minutes -- but we had five orders. The food came out hot. The owner/manager is often right at the front cashier taking orders, so it's a very hands-on business.For a small diner, it can be pricey. However, for a meal, less than $10 a plate is a perfect. Go, especially if you're a local. Just go. There's something for everyone.", "Date": "2013-08-09", "Author_Location": "Jacksonville, FL"}, {"Author": "JC S.", "ReviewID": "VG1bIgQB91jiNPrQgzh6Tw", "Overall": "4.0", "Content": "If you are like me and had a southern grandmother cook for you as a child.  It probably didn't taste nearly this good.  Quick friendly service too.", "Date": "2014-05-15", "Author_Location": "Jacksonville, FL"}, {"Author": "Jamie I.", "ReviewID": "hAxkRixHtaK2Rb05lFdPsA", "Overall": "4.0", "Content": "I remember when I first read the article announcing Maple Street would be coming to San Marco.  Locally owned?  Awesome.  Specializing in biscuits?  Yes, please!  My first foray at Maple Street was lunch with co-workers.  We piled in a car, drove over the bridge and prayed for positive parking karma.  Upon entering, we all stared at the menu for a number of minutes while the friendly employee explained the offerings.  I think my first order was the sticky maple with a side of mac and cheese.  So, yeah, that was a good lunch order.  The southern biscuit is really good, obviously made from scratch.  The chicken breast is fried to perfection and topped with bacon and maple syrup.  If you're one of those savory/sweet freaks like I am, this is the sandwich for you.  The mac and cheese was cheesy, creamy, and topped with Cheez-Its - pure genius.My next visit was with my mom after I waxed poetic about this place.  We arrived on the weekend - holy cow was it packed!  I tried the loaded goat, mom got the breakfast sandwich and we split some sweet potato fries.  The loaded goat was really good, nice tangy goat cheese.  Commenters suggested adding syrup which I think would be wonderful.  Mom wasn't a fan of the fried egg - she prefers scrambled.  She liked the biscuit but thought it was a little over priced.  The prices are a little more acceptable for lunch when you can get a cheap breakfast biscuit lots of places.  The sweet potato fries are great - crispy outside and soft potato inside.  I'm not a fan of the mustard dipping sauce, but they're good plain.I've been a few more times for lunch with co-workers.  They're big fans of the club and love the hashups plain as a side for lunch.  Maple Street has created a concept that is unique to the area and is executed well. The store is clean, inviting, and comfortable.  I've seen one of the owners almost every time I've visited and he walks around making sure customers are happy.  Service is pretty quick - even when slammed, and it's fun finding answers to their random questions to name your order.  Listen for the question and feel free to steal my answer to what's your favorite childhood TV show - Punky Brewster, of course!", "Date": "2013-08-21", "Author_Location": "Jacksonville, FL"}, {"Author": "Bob S.", "ReviewID": "TaX206R9jNeir5465GlZwA", "Overall": "4.0", "Content": "Thanks, Yelparoonies, for pointing me in this direction.  Took the car in for scheduled servicing earlier this week, and that put me within striking distance of this spot.  When the car was done, I pointed it at San Marco, and went into discovery mode.After some frustrating moments negotiating the construction traffic (did you know that a truck with a 40-foot trailer CANNOT make a U-turn?), I finally found MSBC, despite their signage.  Easy enough to spot them while strolling the sidewalk, but I generally try to drive on designated roadways, not sidewalks, and I didn't see their sign.I was hungry, but didn't have loads of time, so I went with one of the choices I had read about, the Loaded Goat.  It was ready for me in just a couple of minutes, and...Oh.  My.I might have made a different selection, but I don't think I could have made a better choice.  The chicken was crispy AND tender, just the right temperature, and the goat cheese was warm and melty.  I had picked up silverware, pretending to be cultured, but ended up just two-handing the flaky biscuit and not caring about the crumbs fallilng off my chin.This place is worth a stop.  Ignore the perpetual construction in San Marco Square, and get yourself to Maple Street.  You can thank me later.", "Date": "2013-03-21", "Author_Location": "Jacksonville, FL"}, {"Author": "Sean E.", "ReviewID": "CszdQjBFaUR79E1aCYPhSQ", "Overall": "5.0", "Content": "There are restaurants and then there is Maple Street Biscuit Company. All the hype, all the incredible things you've heard about this place? They're true. If you're the type of person that likes to nitpick every little thing about a restaurant? Well, for starters, I'm laughing at you. Because your life is probably a cold, sad and lonely one without many friends. Oh, and secondly, I can't wait for you to pretend like this place has ANY flaws whatsoever. As soon as you walk in, you feel as if you're family. The owner (or a staff member) will greet you with a happy \"Hi! Welcome to Maple Street!\" and give you time to look over the 3-chalkboard menu. Get ready to have a hard time choosing what to eat for breakfast (or lunch...or dinner). I go with the Ralphie Deluxe and a Blues Biscuit if I'm feeling super hungry. I don't especially love eating a million calories and carbohydrates for a meal, but here? I really don't feel bad whatsoever. The sausage gravy is heaven. The biscuits are fluffy and warm like your mother would have wanted. Oh, and the coffee? My god. Their coffee warms you to the core and says, \"Hey, you're going to have a KICK ASS day now because you drank me...enjoy that.\" while you sip on it. They even ask fun questions like, \"What was your favorite teacher's name?\" for your order. So rather than hearing someone yell out, \"ORDER 141...ORDER 141...\" you hear \"Mrs. Cippola!\"The vibe, the food, the environment .... everything. Just perfect. Go to Maple Street, eat incredible food that was made with LOVE and CARE ... and love your life that much more. You'll thank me later. Oh, also, invite me to go with you. I want to see your face EXPLODE WITH AMAZINGNESS when you bite into a biscuit.Yumtown: Population YOU.", "Date": "2013-04-21", "Author_Location": "Chicago, IL"}, {"Author": "Troy W.", "ReviewID": "c2i31KFmEfqlaBdzgFFMAQ", "Overall": "5.0", "Content": "Stunningly good experience. It's a rainy Saturday morning (like the 10th day in a row) and the joint is packed.  The line moved fast and it appeared both partners were roaming the restuarant keeping things in order.I ordered 'the Five,' which you should go there and eat if you truly love yourself. I don't even care about the calories, because I refuse to eat anything else today so as not to sully the memory of this wonderful breakfast. Fried chicken plus bacon plus cheddar plus spicy sausage gravy on a moist, almost chewy biscuit. A+, will eat again.It's also worth mentioning that the owners care enough to tell you about the coffee (try Maple Tap, it's super-rad to the max) and find you seat - even with some new friends to make.Pro tip: there's more dining space past the coffee bar, so don't despair if the front room is full.", "Date": "2013-05-04", "Author_Location": "Jacksonville, FL"}, {"Author": "Mary S.", "ReviewID": "e3QeHY-H2sqTDAhUN4ZERA", "Overall": "4.0", "Content": "Finally made it! After fasting for 2 days for a procedure at St. Vincent's I told the BF he was taking me here. I read the reviews and studied the menu and knew exactly what I wanted when I walked in. I had the Squawking Goat, he had the Five and Dime. Both were YUMMY! The chicken has this delicious coating and the pepper jelly needs to be sold in large jars like their maple syrup is. We also shared a plate of hashups but sadly we were too stuffed to eat most of it. Go for their biscuits, steer clear of the extras. I will surely return!!", "Date": "2013-12-09", "Author_Location": "Jacksonville, FL"}, {"Author": "Alberto C.", "ReviewID": "laKF-rubf_H5w0LOaThUYQ", "Overall": "5.0", "Content": "THIS PLACE alone would want me to move to Florida. Mouthwatering flavors in every bite. You can tell when a restaurant cares about the food they put out. It showed! Come to California please!", "Date": "2014-01-10", "Author_Location": "Fremont, CA"}, {"Author": "Deidra C.", "ReviewID": "Cw0b-esrXu2kGXzIhiMoVA", "Overall": "5.0", "Content": "Sooo, sooo good!! I can't say enough about this place.  Besides bed, this is my favorite place to be on a Saturday morning.  If you haven't tried \"The Five,\" you've done a disservice to not only you, but to the World at large.  Go. Go now!  But don't steal my seat.", "Date": "2014-03-07", "Author_Location": "Saint Johns, FL"}, {"Author": "Minh S.", "ReviewID": "TAyMIDETNMOXz2dkmF_h-A", "Overall": "5.0", "Content": "Not much healthy options here but this place is a worthwhile cheat. I had \"The Five\" and it was delicious. If you are in a hurry, the service is fast! I came at 8am and had my food a few minutes after I ordered it which put up some red flags for me because quick food is usually not good. I was wrong! The bacon was crispy but not too tough. The chicken was tasty and the gravy had a nice little kick.", "Date": "2014-01-17", "Author_Location": "El Monte, CA"}, {"Author": "Helen L.", "ReviewID": "sRGaQxTBHAE6GSMtyYfn5A", "Overall": "4.0", "Content": "I found Maple Street Biscuit Company during my trip at Jacksonville and ditched the hotel breakfast ... immediately. It was in a part of town I have not explored yet but judging by the eateries around there, I will be back.The Biscuits were great and they make them right on the premises. It soft to the touch and nice and flaky. You can add eggs and cheese and of course your Meat choices are bacon, sausage, country ham, or fried chicken. I'm going to have to try the fried chicken next time! I had a side of grits which was a lot more per serving than I expected and it was warm and fluffy. There are some Signature Sandwiches that looks great and a few more sides to choose from. Local coffee, enough said!", "Date": "2013-06-24", "Author_Location": "Tampa, FL"}, {"Author": "Kelly C.", "ReviewID": "cg4ucOikXL-Yb3r_MD1v8Q", "Overall": "5.0", "Content": "I've been dying to try this place out since I first heard it was opening.  Man, it's good.  I had the Sticky Maple the first time and it was fantastic: Fried chicken, bacon, biscuit, and maple syrup... how can you go wrong with that!?  Second time, I got the Loaded Goat.  Although the goat cheese was absolutely delish, I felt it needed some sort of wetness added... like syrup or gravy... cuz it was a bit too dry eating just fried chicken and biscuit.The seating is communal, which is cute.  But during lunch, there's just not enough seating so come before the lunch rush.  But if they do take forever in getting your order out, they'll give you this amazing sweet biscuit complimentary for the wait.I suggest getting something more than just a biscuit.  It's not that big and therefore not too filling.  I hear the mac'c'cheese is yum though I haven't had it yet.  But their sweet potato fries are definitely good.  The OJ is refilled for free which is awesome.  The workers are all super super friendly. Don't forget to bus your own table and clean up after yourself!Oh, and be ready with the model and year of your first car.  Sounds random but that's how they call you when your order is ready!  Cute!  =)", "Date": "2013-03-28", "Author_Location": "Jacksonville, FL"}, {"Author": "Khristopher B.", "ReviewID": "L8D-_VBR7zGI21XjtfWkuA", "Overall": "4.0", "Content": "You must give the owner of Maple Street Biscuit Company grand kudos for his creativity in terms of all the different foods he can smash between a biscuit. Fried chicken. Okra. Sunny-side up egg. Pulled pork. And of course biscuit gravy. This restaurant is for people who are not afraid to eat messy food. The staff piles a lot of food in between the biscuit and, after one bite, the thing falls apart. But that's OK because the subsequent bites are just as fantastic as the first one. I've been to Maple Street more times than I'm willing to admit. I love the sweet potato fries. I love the chicken club. I love how they call your food but answering \"Today's Question.\" The only knock I have is the same knock that most Maple Street regulars have: you're killing us on the hours. Closed at 2 p.m.? The hours are the only reason Maple Street can't get a five-star rating from me. No complaints about the food. No complaints about the service. No complaints about the atmosphere, which is often country or bluegrass music playing softly in the background. Stay open longer.", "Date": "2014-04-03", "Author_Location": "Jacksonville, FL"}, {"Author": "James T.", "ReviewID": "xZ-fDYZEJDL1sexeabBrwQ", "Overall": "2.0", "Content": "Love the food here but paying $25 for two folks to eat biscuits with some home fries seems a bit much.    Friendly staff, clean environment, food was great", "Date": "2013-08-06", "Author_Location": "Jacksonville, FL"}, {"Author": "Christine M.", "ReviewID": "M9kLk5oPYVZyBe17XZ9pkw", "Overall": "5.0", "Content": "Thanks to my fellow Yelpers we decided to try something different for breakfast this morning. We are in the area on vacation and we came here looking for a good breakfast joint where we would get some food we wouldn't normally get at home.We live in the Tampa Bay area and needless to say I am so glad we came! The menu is a bit overwhelming at first glance and line out the door was a little discouraging but everything was well worth the wait! I was a little skeptical at first because I kept thinking that I wouldn't be full on just biscuits but boy was I wrong! Fresh, flavorful and delicious! We will definitely be back  the next time we are in Jacksonville. We got the David Hashups (hashups covered with sausage gravy) to share with two biscuits sandwiches; The Loaded Goat (Flaky biscuit, all natural fried chicken breast, and fried goat cheese medallion) and The Five (Flaky biscuit, all natural fried chicken, pecan wood smoked bacon, cheddar cheese topped with sausage gravy with a little kick) with two cups of coffee. The Loaded Goat was a little on the dry side but for the goat cheese lover in me it was absolutely to die for! The Five was scrumptious because the biscuit reminded me of those my grandmother used to make. Everything melted together perfectly. The coffee tasted ten times better than your regular Starbucks cup joe. Upon discovering it was locally sold coffee it made it better to know you were helping the community thrive.Staff was a pleasure, friendly, and very informative on the history of the restaurant. The next time we are in Jacksonville we will definitely make a stop at Maple Street Biscuit Company either to grab something to go or to sit outside and enjoy.", "Date": "2013-06-22", "Author_Location": "Dunedin, FL"}, {"Author": "Michelle S.", "ReviewID": "lzA2fSuvF2a0iDpMUxR8lQ", "Overall": "5.0", "Content": "I first heard of this place while my husband and I were watching the news morning show.  My first immediate thought was 'I must have one of their biscuits!'  Being that I work nights and the hospital where I work is less than ten minutes away, several coworkers and I were so excited to come here for our monthly breakfast outings.  We were first greeted by the smells of biscuits and bacon.  We had already scoped out the menu on their website, which I was glad I did because I had a hard time deciding what I wanted.  One of my fellow foodies and I split the Five, the Loaded Goat, and the David Hashups.  The Five was lovely---soft, flaky biscuit with chicken, bacon, and their über yummy gravy with a \"kick.\"  The Loaded Goat is basically a chicken biscuit with a slice of fried goat cheese---I really loved the fried goat cheese, next time I want to try the Squawking Goat which is the same thing but with their pepper jelly.  Their David Hashups was excellent especially with their gravy---lots of flavor with a nice balance of ingredients.  The owner even chitchatted with us for a few minutes and was so kind to give us some complimentary iced cinnamon pecan biscuits to try---which was the star of our MSBC experience.  My husband was a little jealous that he was missing out on the biscuit experience so I brought him home the Sticky Maple (essentially a chicken and bacon biscuit with maple syrup) and an order of David Hashups.  He savored every bite!  Chicken biscuits for breakfast, you say????  Never a bad time for this stuff!  You can opt for a more traditional breakfast, if you like, plus they are also open for dinner on Fri and Sat.", "Date": "2013-01-12", "Author_Location": "Orange Park, FL"}, {"Author": "Tracey F.", "ReviewID": "WNIKQWRUP68fuPst7ONXbw", "Overall": "5.0", "Content": "Wow...just wow.  My parents and I walked in to Maple Street Biscuit Company *just* as they were closing. (We didn't realize it at the time!  Sorry again!)  The gentleman at the register was kind enough to let us order anyway, and I proceeded to have the best biscuit sandwich OF. MY. LIFE.  I ordered The Sticky Maple (biscuit, chicken, pecan-smoked bacon and maple syrup) and each individual item was perfect on its own...and bliss in combination.  We'll be back tomorrow when Mom takes me back to Riverside to finish the tourist thing...and Maple Street Biscuits will linger in my memory until I can return again to Jax.Maple Street Biscuits makes me miss being a Southern Girl!", "Date": "2013-03-19", "Author_Location": "Vacaville, CA"}, {"Author": "Rachel M.", "ReviewID": "PH_onvoSe1E98xuITQCL7w", "Overall": "5.0", "Content": "Delicious. Perfect amount of personal attention, but the real clincher for a woman who doesn't eat fried chicken or eggs (they made me a custom sammie with tomatoes and goat cheese) -- I could drink the coffee black. This is how I prefer it, but -- let's face it -- most places can't make coffee for shit. You gotta load it up with dairy and sugar to make it good. The Maple Tap coffee here is some sickness, though. So. Fucking. Good. My boyfriend loved his Loaded Goat. We were in such good spirits after this that we decided to spend the whole day getting high and listening to metal out by the beach. This spot is an excellent start to a totally kick-ass day!", "Date": "2013-05-04", "Author_Location": "Brooklyn, NY"}, {"Author": "Tiffany C.", "ReviewID": "bsbWsppapogJDlGUcZFcFQ", "Overall": "5.0", "Content": "Today my husband & I celebrated 17 years of marriage. When he woke he said, \"Lets go to breakfast.\" I said to him I have just the place! The restaurant is on San Marco Blvd. There is a lot of construction so you will have to go down Hendricks or use Atlantic Blvd. We came from Dunn Ave. so we used Hendricks made a u-turn in front of the construction and parked by Peterbrooke Chocolates. My husband & I had a wonderful experience! This was our first visit so we were a little skeptical. But all of that went out the door...hubby was impressed with the use of technology: The cashier took our order via iPad & I was impressed to. The cashier was so patient, sweet, & courteous. The place opened at 7am and we got there a little after 9am. The place was packed! Patrons outside, inside, in line, & those waiting for a seat! This young lady continued to smile and be pleasant. That impressed me. The owners greeted everyone and they were working: cleaning tables, keeping the coffee station clean, etc. Just a great group of people... the customers were smiling & everyone seemed to enjoy their biscuit selections. Hubby had a Retro Biscuit Sandwich $4 sausage biscuit w/ coffee. I had The Farmer $7 flaky biscuit, fried chicken, pecan wood smoked bacon, cheddar cheesed (I removed the cheese) topped with fresh house made apple butter & OJ. We also ordered Hashups $4 home fries w/ chopped smoke ham, red & green peppers, grilled onions, mushrooms, & melted cheese. The biscuits were so soft, light, & buttery. the bacon was fried perfectly, and the chicken breast was not over fried. There is something on the menu for every age & taste bud. Get there early on Saturday! seating is limited! But you will not be disappointed. They are Jacksonville's best kept secret! SUPPORT MAPLE STREET BISCUIT COMPANY. It's good for the economy & your stomach! This is our new spot! To many more anniversaries at THE MAPLE STREET BISCUIT COMPANY!", "Date": "2013-02-16", "Author_Location": "Jacksonville, FL"}, {"Author": "Van P.", "ReviewID": "zNyiKKyH3Ku-W97q8lSu9Q", "Overall": "4.0", "Content": "Never really liked biscuit and gravy until I came to this place. I have tried \"The Five\" and the \"Squaking Goat.\" The gravy they used in \"The Five\" is a sausage gravy and it is flavorful.", "Date": "2014-01-18", "Author_Location": "Savannah, GA"}, {"Author": "Travis C.", "ReviewID": "719I0gCaGTGmjbj9Vu25BA", "Overall": "5.0", "Content": "Biscuits.  Amazing.  Gus and his staff have found an amazing niche in the Breakfast segment.  Coffee shops are too industrial--diners are too greasy.  Maple Street is in the perfect place to dominate a market most people treat as an afterthought.That said--the biscuits are amazing.  It took them 5 months to perfect the recipe--and it's worth it.  Flaky, not too heavy, and doesn't fall apart under the weight of the other main player--the chicken.There's something on their menu for everyone, the decor is really awesome, and you can't beat the music.  They've only been open two months--and they already have a crowd of regulars who are at home here.You can't go wrong coming in here.", "Date": "2013-01-02", "Author_Location": "Petaluma, CA"}, {"Author": "Jo Ann S.", "ReviewID": "xBcnvhbTVwyFd_gBwv6cwg", "Overall": "5.0", "Content": "After reading great reviews of this place, I had to check it out. It's early Saturday (730) morning Mr. Excitement and I went on a trip to San Marco to figure out what's the fuss is all about regarding this establishment. The parking is curb side but luckily we found one right away in front of the restaurant because it was early in the morning. The restaurant is clean and welcoming. I was greeted by friendly customer service with a smile. The menu is a bit confusing it's placed on the left wall... I researched the reviews on Yelp, and already thought in my head what I wanted until I read the menu on the wall! LoL I ordered The Garden Bird, a side order of Pecan Bacon (a must have), and orange juice (the lady at the register let me know it's free refills on the oj). Mr. Excitement was a bit of a challenge due to his gluten free diet; however, the lady at the register suggested a side order of 2 eggs & order of pecan bacon - awesome! When we finish ordering she asked me we will call your name by answering this: what did you wanted to be when you were little? Without thinking it through I impulsively answered: Hello Kitty. Yes I surprised myself! So when our order was ready - Hello Kitty was called and yelled out in the restaurant - Mr. Excitement went to get our order. LoL Now I know why this place had rave reviews - The food was delicious and well priced! The Garden Bird $6 had fresh hot just made out of the oven flaky biscuit nestled in between was the juicy piping hot fried crispy chicken that makes you want to say to the person next to you, \"shut your face!\" with greens and Louisiana hot sauce sprinkled on top of the yummy greens. The side of pecan bacon came with 4 pieces a must have but it seemed cold - I love bacon so I ate it anyway- omg good! Mr. Excitement saw they had their own coffee line called Maple coffee and got up and ordered. As I was waiting at our table there was a man with an apron walking around the restaurant asking patrons if everything was ok.  He came over to me and asked how it was and told him this was our first time here because it seemed everyone raves about this place and we had to check it out. After we tried their food I was a believer- told him it was great but the bacon was cold. He said he appreciates the feed back. Mr. Excitement came back happily with his coffee and I had to use the restroom. As I was walking towards the hallway towards the restrooms there were newspaper and magazine articles framed on the wall - the same man was talking to me was in this articles . It was Gus Evans one of the two owners - cool! When I got back Mr. Excitement was bagging up two plastic box to go containers of Iced Cinnamon Pecan biscuits. I asked him where did that come from? Mr. Excitement joyfully tells me the guy who I talked to appreciates us checking out the place for the first time :) looks like I will be too a repeated customer - I'm a raving fan!", "Date": "2013-09-28", "Author_Location": "Cleveland, OH"}, {"Author": "Donna R.", "ReviewID": "P_U49N4GmUwY829Rk6yF4A", "Overall": "5.0", "Content": "Wanted to try the new fish biscuit, but opted for \"the usual\" (The Five).  Gus came by and offered two of the iced cinnamon pecan biscuits.  So much for my New Year's Resolution!  They were yummy. Gus checked on us several times.  Great place to hang out and will return again and again", "Date": "2014-01-24", "Author_Location": "Jacksonville, FL"}, {"Author": "Amanda C.", "ReviewID": "KeMVOVLH4Pxu9tji_4XDGA", "Overall": "5.0", "Content": "I came here for breakfast while visiting a friend and I have never had a better hangover meal! I ordered The Five (fried chicken on a biscuit topped with bacon, cheese and gravy) and we shared the Hashups.  The biscuit is dense and flaky and there are so many different options of sandwiches to get.  Besides the fact that the food was phenomenal, my favorite part is that when you order you have to answer a question and your answer is called out when it is your turn to grab your food.  For example, the question was \"What is your favorite scary movie.\"  I heard everything from Texas Chainsaw Massacre to Mary Kate and Ashley, it was amazing.", "Date": "2013-11-02", "Author_Location": "Odessa, FL"}, {"Author": "Katie C.", "ReviewID": "Pk-hKaSJb_dbK8W7c_vpkA", "Overall": "4.0", "Content": "Those who know me well, or at all, know that I am OBSESSED with bread, namely biscuits. Seriously, I OD on carbs at just about every meal, but a biscuit, shut up. I like 'em with butter. I like 'em with syrup. I like 'em stuffed with whatevers on my plate and made into little biscuit sandwiches. Yum! Just give 'em to me. When I heard that a new breakfast spot had popped up with \"biscuit' right there in the name, I had to get over there pronto. Two of my best buds made the trek to San Marco with me this morning to check out Maple Street Biscuit Company, and, after passing the teeny tiny sign a few times, we finally found it and made our way in. First off, great, modern decor. They're going for a rustic, country feel, but how old-school can you be when you're ringing in orders on an iPad!?! Maple Street is a juxtaposition of simple and savvy, and that sentiment carried through the entire meal. After perusing the chalkboard menu, I really wanted my go-to of biscuits and gravy but, with so many cool options, I just couldn't go basic. Instead, I opted for The Garden Bird, a soul-food biscuit sammie comprised of fried chicken, an over easy egg, and collard green splashed with hot sauce. Son of a biscuit eater, that's crazy!! Since it was pre-10 am, which is practically pre-dawn for me, I also opted for a cup of the Dark Bark self-serve coffee. My biscuit came out stuffed and stacked high, with collard greens practically pouring out of it. My first thought was, yum! Followed directly by, how the fluff am I going to bite this thing?! Well, I managed, and it was awesome! Crispy, salty chicken blended beautifully with the juicy, seasoned greens, and the warm, fluffy biscuit held it all together like a comforting, buttery hug. (Which FYI are the best kinds of hugs.) At the suggestion of a few of the employees, we ordered sides of the homemade pepper jelly and apple butter and they were just as good as the sandwiches themselves! Highly recommend. Maple Street isn't the spot you'd go to for flapjacks and eggs benedict, but rather it's an experience all it's own. They specialize in crazy biscuit sandwiches and offer fun sides like Mac N Cheese, Sweet Potato Fries, Black-Eyed Peas, and Bluegrass Grits. Truly a novel, and tasty, breakfast/lunch experience.", "Date": "2012-11-16", "Author_Location": "Orlando, FL"}, {"Author": "Naomi B.", "ReviewID": "NAL0lMGKFRGpvfRYlUBr3w", "Overall": "5.0", "Content": "Amongst my fellow Yeeps, Maple Street Biscuit Company is known for being one of the top breakfast joints in all of Jacksonville. As far as biscuits and everything contained in a biscuit are concerned, Maple Street pretty much has the market cornered in this particular field, and have transformed the everyday breakfast sandwich into a delightful work of art. Sadly, it took me forever to free up the time to get here, but it was SO worth the wait, as I was served up a dish of the best buttery biscuit deliciousness that I've had...EVER. Just Sayin': Being that their menu primarily consists of biscuits with indulgent accompaniments such as fried chicken, bacon, fried eggs, etc....my UBER-health-conscious mother was not with me on this venture, so I was flying solo. This is definitely not \"paleo paradise,\" if you know what I mean. So know that if you've yet to try it out.Eats: I was SO excited just to BE there, that I stood in front of the menu board forever pondering over this and that because frankly...there wasn't ONE thing that I didn't want to try. However, I've heard such good things about the \"Five and Dime\" (Flaky biscuit, all natural fried chicken, pecan wood smoked bacon, cheddar cheese, sausage gravy with a little kick topped with a fried egg), that I couldn't resist choosing it for my first MSBC experience. And disappoint it did NOT. The chicken was not a tad dry, and the crispy texture provided the perfect contrast to the soft, melt-in-your-mouth biscuit. I also liked that the sausage gravy was off to the side of the plate, and not over the top of the sandwich, as it did not drown out the flavors and textures of the other components, and I could dip each bite at my leisure. Opinion?  As a whole, the dish was simply THE BOMB DIGGETY, and I'll never look at another breakfast sandwich the same.Word to the Wise: Your best bet...unless you like eating while standing up, is to be like me and come on a weekday morning. The weekends are jam packed, and parking is a nightmare. I snagged a seat on the patio and enjoyed the fresh morning air, plenty of people watching, and a wonderful meal. This joint is one of the few, in my opinion, that has lived up to the hype, and is a MUST if you cherish breakfast as much as I do. Thank you, MSBC, two thumbs up and I'll be back for those hashups!", "Date": "2013-09-12", "Author_Location": "Orange Park, FL"}, {"Author": "Jessica F.", "ReviewID": "WFGgCqTZlyvQ9bdqWdjQtg", "Overall": "5.0", "Content": "My favorite breakfast spot in San Marco. Their biscuits are AMAZING! Even just the sausage, egg and cheese is the best you'll ever have! I usually come in every Friday morning and get a biscuit to go and everybody is so nice and accommodating.", "Date": "2014-05-02", "Author_Location": "Jacksonville, FL"}, {"Author": "Jake N.", "ReviewID": "Qb3wh5wnBZJybh189NIzQQ", "Overall": "5.0", "Content": "Travelled to Jacksonville for a few days and yelped a good brunch spot to grub up before a 3 bridge run through downtown jax. Ended up driving down san Marco street to this little gem and from tongue to fundus my GI tract was in heaven. Cheap, tasty and simple. get the five and dime. the chicken breast is fried perfectly, its got egg, bacon and cheese ( the holy trinity of breakfast just so you know), and a surreal sausage gravy...mmm that gravy. I might just order a huge pile of that and a few biscuits next time.One ding for the sorry fried green tomatoes. c'mon man! breading a haphazardly sliced green tomato and serving it with ranch dressing doesn't warrant a buck a slice! I hark from south florida and a little place called yardbird taught me a thing or two about a southern rite of passage known as the fried green tomato... Would i go again, absolutely. Would I tell a friend? I think thats what i'm doing now, friend!", "Date": "2013-12-03", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Kim S.", "ReviewID": "X8gMXL7_1sGvNQzp_cShSw", "Overall": "5.0", "Content": "The Maple Street Biscuit Company is the newest addition to the San Marco Restaurant scene. Inhabiting the Moe's/Black Bean space, I really really really hope these guys stick around!I went with 2 other friends and we strategically got 3 different biscuits. The Loaded Goat was my hands down favorite. I found the biscuits to be light and fluffy, but substantial enough to support the giant piece of fried chicken on top. The fried goat cheese medallion was an amazing touch because it was herbed goat cheese, not just plain. YUM!!! We also enjoyed a Sticky Maple Biscuit, with chicken, bacon and delicious maple syrup as well as The Five, with chicken, bacon, cheese, and gravy. The gravy is just about as good as it gets.Hot tip: you can add more toppings to your biscuit. Enjoy your Loaded Goat with the maple syrup, too. You can thank me later.In addition to the mammoth, overstuffed biscuits you can also enjoy sides like \"blue grass grits\" with cream cheese, collard greens (YUM, mine were great) and Mac-N-Cheese topped with, wait for it, crushed Cheez-its. I KNOW! WHY DIDN'T I THINK OF THAT?!? It really added a salty yumminess to the mac-n-cheese, which I personally really enjoy. Also, the Maple Tap Coffee is really great. It's a locally roasted blend which I really enjoyed. The staff is cheerful, and today they were asking for your favorite Band/Artist instead of your name when your order was up. I thought it was a cute touch! It was fun to decide what band each of my friends and I would use. (New Kids on the Block, if you were interested). One of the co-owners stopped clearing tables and cleaning up to ask us how our food was. Its nice to know that your patronage is going to a person who is as nice as his food is great!My only suggestion for MSBC is that they invest in a \"HOT BISCUITS\" sign, a-la Krispy Kreme. Though the traffic accidents would increase, these biscuits just might be worth it!", "Date": "2012-11-19", "Author_Location": "Jacksonville, FL"}, {"Author": "Skye L.", "ReviewID": "2xYko8IfM-fwakE0Huza5A", "Overall": "5.0", "Content": "Best biscuits and gravy you will find in town. Love this place!!!", "Date": "2014-05-05", "Author_Location": "Jacksonville, FL"}, {"Author": "Larry C.", "ReviewID": "gPFKoTmx8krFXLw09FpcWg", "Overall": "5.0", "Content": "After reading several reviews on YELP, my Wife & I decided to eat at Maple Street Biscuit Company and found the Staff, Food & Atmosphere to be excellent.", "Date": "2014-01-08", "Author_Location": "Lufkin, TX"}, {"Author": "Alex D.", "ReviewID": "p9hZl42CsKlm7gR-pEteWQ", "Overall": "5.0", "Content": "My boyfriend and I both agree that this is the best chicken biscuit we have ever had! The biscuits are always perfectly made and moist. The chicken is so tender and juicy, We just can't get enough!  We always get a side of sweet potato fries which makes our brunch perfect! I love that they ask you fun questions when your order instead of your name. It's a really family friendly place that has a great community atmosphere. The owner always comes up to us and asks us how we are and if we enjoyed our food. We haven't yet been to the new location at the beach but we intend to visit.", "Date": "2014-01-04", "Author_Location": "Jacksonville, FL"}, {"Author": "Caron S.", "ReviewID": "jwV00dUiAfv6HRAvlZebOA", "Overall": "4.0", "Content": "Opening day!Upon walking in I felt much more warm and cozy than I felt in the two previous spots (The Black Bean, Moe's). Improvements (the addition of wood panels, an open layout, calming colors, and a self-service coffee area) have been made and the space is more inviting.We quickly agreed upon The Loaded Goat (flaky biscuit with fried chicken breast and a fried goat cheese medallion) and The Sticky Maple (flaky biscuit with fried chicken breast, pecan bacon topped with real maple syrup), and added two sides: grits and the Smoky Mountain Mac-N-Cheese.The signature biscuit sandwiches range from $4-7 and are filling. Sauces and other sides (sweet potato fries, collards, black eyed peas, salad, pepper jelly, butter, cheese, honey, apple butter, maple syrup, etc.) are additional. There are also coffee, sodas and tea.The biscuits themselves were good but not overly fluffy. The chicken was a generous portion, moist and not greasy. The creamy melted goat cheese was our favorite of the two toppings.The grits were good but needed to be stirred. We realized halfway through that there appeared to be cream cheese mixed in. The mac 'n cheese was good but not the best. The breadcrumb crust added a nice contrast to the cheesy noodles.I'd give MSBC a 3.5 out of 5. I want to go back and try some other items. I love that Jacksonville has a biscuit spot and that it's open 6 days a week at 7 a.m. Will be perfect for post-run grub.", "Date": "2012-11-08", "Author_Location": "Jacksonville, FL"}, {"Author": "Terin B.", "ReviewID": "biSSgouuXMwyFQ-P4MANzg", "Overall": "4.0", "Content": "I happened to be in Historic San Marco for a job interview and treated myself to brunch afterward.  San Marco is currently undergoing a lot of road construction, so you'll have to drive through the neighborhoods and enjoy the beautiful yuppie homes :D Maple Street is nestled between lots of businesses that are going out of business: antique shops, tobacco stores, overpriced dishes, overpriced boutiques.  I foresee a lot more younger food and drink popping up around here.Upon walking into Maple Street, I was taken by how well-run and clean the restaurant is, despite a system of self-bussing. I was warmly greeted by Chelsea, who I happened to have a nice conversation with later.  She is a stellar employee- they are lucky to have her! I enjoy the blackboard and modern design aesthetic; it could use some more personal decor- the place feels a bit empty! I particularly love the wall off coffee cups and order names by the pet of your choosing!Now the food: I had the Five and Dime: gravy was delicious, the biscuits were perfect, I would have liked my egg a little runnier, and the pecan bacon was just right.  The fried chicken was a bit hard to cut through, but not bothersome (I did bend my fork though!).  Do yourself a favor and get the sweet potato fries: they were the best I've ever had.  Perfectly crisp with a side of sweet maple (I like my sweet potato more savory, so I covered those bad boys in black pepper and filled the rest of my maple cup with hot sauce).  I vowed to bring my husband back (and I did!) He had Chelsea's recommendation: a combination of two biscuits on the menu. I'm dying to try the mac and cheese.", "Date": "2013-02-15", "Author_Location": "Jacksonville, FL"}, {"Author": "Mike G.", "ReviewID": "CTU-lW8sDd1e30Mx6CsW0g", "Overall": "4.0", "Content": "Went for an early lunch. I got the Chicken Club my daughter got the Sticky Maple and my wife got the Squawking Goat. The Chicken was good and the biscuits are awesome. I think that the Squawking Goat was the best. The combination of flavors from the Goat cheese combined with the chicken and the spicy pepper jelly was flavor explosion in your mouth. I also would recommend a side of their yummy Mac n Cheese. Will definitely go back again.", "Date": "2013-11-13", "Author_Location": "Atlantic Beach, FL"}, {"Author": "Alison W.", "ReviewID": "4xZ2myCU7F52HbMC_Kb16g", "Overall": "5.0", "Content": "Amazing food and very friendly service! My friend and I both had the Ralphie with a side of fried green tomatoes. The clerk/server was sincerely welcoming. To top it all off, the prices are great as well! I'm glad we stopped in on a whim.", "Date": "2013-11-23", "Author_Location": "Inman, SC"}, {"Author": "Philip K.", "ReviewID": "mOSM674yC7gHtClitP5h-w", "Overall": "5.0", "Content": "This was an unexpected find in San Marco.  The combination of the atmosphere and the food had me half expecting to see mountains out the window.  If you like biscuits and gravy, this is the place to eat!", "Date": "2013-10-22", "Author_Location": "Lake City, FL"}, {"Author": "Nate M.", "ReviewID": "LTsZnGXWxFpoBlX0KKEPOg", "Overall": "4.0", "Content": "This place has been on my hit list for awhile now. Dani V. finally gave me the last nudge I needed to get there. I invited my friend and we set out to find the elusive Maple Street Biscuit Company. It was tough because in my head I was thinking Maple or Soul Food Bistro? I've only been to Soul Food once, but I've been feenin those fried wings n things ever since. I fought the cravings...saying to myself: ill walk into maple, if i'm not feeling it, were going to Soul Food. It feels like a \"Country IKEA\" inside. As soon as i walk in, I glance at the plates coming up, I think to myself little biscuit, $7? hmmm overpriced chic-fil-a sammy? I started to study the menu and I guess it drew me in. and my friend looked pretty excited..the menu is pretty intense...bacon? fried egg? house pepper jelly? maple syrup? collard greens? hot sauce? I WANTED IT ALL! My two picks came down to The Farmer vs. The Sticky Maple. I asked the cashier (who I figured out was the owner) which was better? The Farmer (with Apple Butter) or The Sticky Maple (with Maple Syrup)? In my mind, I was swimming in a pool of maple syrup, but unfortunately, he said go with the Apple Butter. I said are you sure? you sure? I decided to trust him and fight my urges. When I came in to Maple, I expected my mind to be blown and blown it was! When the food came out it was like an oasis, it was overflowing with apple butter, the cheese was glistening, and that was a fat ass piece of chicken. The first bite blew my mind, that apple butter is the truth. You hit that flaky, fresh biscuit, that crunchy bacon, the cheese, that juicy chicken, then the apple butter gives you that sweet zing and ties it all together. I was shoveling that apple butter with my fingers hahahhah. Dani V. told me about there special \"Maple Tap\" Coffee. The description reads: Body: Medium As the name implies this has just a hint of maple in the roasting process. A must try. It was everything I thought it would be, thank you Dani! Plain jane coffee with a kick! The coffee is unlimited and you can get some to go!  They stack like 100 mugs on the counter it looks pretty cool and kind of dangerous at the same time. I talked to the owner, I asked him if he cared if I took pictures and he said fire away (i already took 50 pics but I wanted to talk to him) He was really nice, I talked to him about yelp and there new location at the beaches. I told him that we should have a Yelp event there or at the new beaches location. Hint, nudge, Allie, yeah! He gave me his card, I thanked him, and we were on our way. I'll definitely be back ASAP Rocky. Ruby A. talked about Iced Pecan Cinnamon buns in her review, they have house made pecan pie, I still have to try The Sticky Maple, and I could drink that Maple Tap coffee all day!P.S. When you order, they ask you a question? The question of the day was: What's your favorite part of Jacksonville? I said Riverside Arts Market because its awesome and I saw it in Daisy D.'s review hahahah. So when your order is ready they yell out your answer. My friend and I then thought of better answers.....", "Date": "2013-08-16", "Author_Location": "Jacksonville, FL"}, {"Author": "Abbie B.", "ReviewID": "B6Kjt9RZUQOSeULZC_v84w", "Overall": "5.0", "Content": "I'm in love with Maple Street! The Cinnamon Pecan Biscuit is so yummy and the customer service is excellent!", "Date": "2014-01-25", "Author_Location": "Mandarin, Jacksonville, FL"}, {"Author": "David S.", "ReviewID": "DDO_c53T9cIirK89pe7Xtw", "Overall": "5.0", "Content": "I had the five and dime....it was amazing.  My wife doesn't usually like breakfast and loved this place.  She had the loaded goat.", "Date": "2014-01-01", "Author_Location": "Titusville, FL"}, {"Author": "Andy L.", "ReviewID": "ksoeEZSxhzgii_ysrkO2Xw", "Overall": "4.0", "Content": "If I lived in San Marco, I'd probably eat here at least once a week.  Even if I just grabbed some plain biscuits for the road.  This place is legit.  I went for lunch with my wife. The menu is pretty simple; different kinds of chicken sandwiches on a biscuit.  There's some other items, but it looks like the chicken sandwich is their pride and joy.  And it is.All the biscuit sandwiches sound very good.  I had a sandwich with fried chicken and jalapeno jelly.  My five had one called the Five, which had fried chicken, pecan smoked bacon, cheddar cheese and gravy.  We split a biscuit with icing and a veggie side item.    Everything was very good and even the coffee tasted great.These owners are on to something.  I wouldn't be surprised to see a Maple Street Biscuit Company popping up by in favorite college town in the future.", "Date": "2013-03-11", "Author_Location": "Jacksonville, FL"}, {"Author": "Billy D.", "ReviewID": "ZqSousxrbMZs2w9suItd8A", "Overall": "5.0", "Content": "Awesome breakfast spot!  Food was definitely fresh and made on the spot. Would highly recommend it to anyone. I just wish I could eat something like this every morning for breakfast and not worry about my heart stopping!  Fun atmosphere with great service. Definitely going back.", "Date": "2013-10-16", "Author_Location": "Jacksonville, FL"}, {"Author": "Mark B.", "ReviewID": "t6ydq27x0CwitMVieW9HEg", "Overall": "4.0", "Content": "Somehow I have a nack of catching restaurant on or just after they opened. Today's find is Maple Street Biscuit. I have had this place on my short list for awhile now.. The place is huge I mean dance hall huge. They make their biscuits right up front so you can watch. I ordered the Loaded Goat and it was good. The biscuit was a little thin and not real flakey. The fried chicken was maybe half a breast almost to big to get my mouth around. The fried goat cheese was nicely done with a fair crisp. All in all a great biscuit and I will return again", "Date": "2013-08-15", "Author_Location": "Jacksonville, FL"}, {"Author": "Williams P.", "ReviewID": "HE1OVdlV1Y1DCOtM5TvTcg", "Overall": "4.0", "Content": "Nice place in San Marco in Jacksonville. Food is good and they have a selection of ten different teas. Place is clean.", "Date": "2013-09-13", "Author_Location": "Charleston, SC"}, {"Author": "Olivia G.", "ReviewID": "K8hYZeLMsh2-Wt_ewRb7mw", "Overall": "5.0", "Content": "Fantastic little place! The biscuits are perfect- light, fluffy, and not overly greasy. I ate mine plain which is unheard of for this butter-n-honey-lovin-fool.  Definitely freshly made. My hubby got the 5 sandwich (fried chicken,  gravy, cheese) and it was divine! The gravy is peppery and sweet and basically drinkable. ..no doubt the best gravy I've ever tasted. Make it a point to stop here NOW! Sidenote: the line was to the door but it didn't take more than 10-15 minutes.", "Date": "2013-12-21", "Author_Location": "Myrtle Beach, SC"}, {"Author": "Tracy B.", "ReviewID": "xxkhKhTgV1gH-2BoDYA7RQ", "Overall": "4.0", "Content": "Finally made it over to check this place out. We went on a Friday morning, after most people would already be at work and it was still crowded and bustling (to me, that is always a good sign). My husband ordered the Five and I ordered the Farmer. He enjoyed it very much with the exception of the cheese. He said it was just odd. (What's odd? It's cheese! Maybe you're odd! *shrug*) I liked mine as well except I thought that it had just a tad bit too much of the apple butter on it. It was tasty but so sweet that I thought it was throwing off the balance of flavors. I wiped a little off, problem solved and continued to enjoy. We can not wait to go back and try something else on the menu.", "Date": "2013-09-14", "Author_Location": "Jacksonville, FL"}, {"Author": "Lindsay B.", "ReviewID": "x4GD8GuCyCWrhWq01-q8VA", "Overall": "5.0", "Content": "Went for breakfast on 4/19.....loved it so much I went back on 4/20 and ordered the exact same thing. The coffee is absolutely amazing (locally roasted every week), the cinnamon pecan biscuits are smothered in delicious, brings-you-back-to-childhood icing, and the hashups (got mine with an egg over-easy on top) are on point!!This place is just what San Marco (and Jax) needed oh-so-badly! Seriously...what are you waiting for?? Go there! Get the cinnamon pecan biscuits! Get the biscuits with their homemade B2 jam! Relish life while you drink your coffee....this is the breakfast you've been waiting for!", "Date": "2013-04-22", "Author_Location": "Dallas, TX"}, {"Author": "Jordan L.", "ReviewID": "kyfH8rjHR92_QxSJM6ehyg", "Overall": "5.0", "Content": "Great food and wonderful service. We had The five, the five and dime, and the farmer, all of which were excellent!", "Date": "2013-11-24", "Author_Location": "Charlotte, NC"}, {"Author": "Michael C.", "ReviewID": "xwGTPckqoIktMHppcxMLbg", "Overall": "5.0", "Content": "Such a well run operation I assumed it was a franchise or chain. How gladly I was mistaken. We popped in late and found the owner stayed open to take our order and let us eat with out rushing ! (5 stars just for that!!!)Voluminous selection of meat and other combinations, but when it is all boiled down the flavor comes from the biscuits. Delicious, with  the proper hint of butter and the texture is just the right amount of flaky.Cleanliness is out of this world and if every restaurant was this clean, no one would eat at home , since it would be safer , germ wise, to eat at a place such as Maple Street. 5 stars for each category (pricing, service, selection, taste, and decor)Stop reading this review and go now , leave, so you can be in line tomorrow when they reopen!", "Date": "2013-01-27", "Author_Location": "Long Beach, MS"}, {"Author": "Monica C.", "ReviewID": "BCIkXhm0IPg_EF_CI0yimg", "Overall": "5.0", "Content": "Pretty tasty grub! Fun environment. Even thought they were slammed busy on Sunday morning (Memorial weekend) a member of the staff took the time to make sure we were taken care of (i.e., prolonged wait times do to the volume of orders). Biscuits = Yumminess!", "Date": "2013-05-31", "Author_Location": "Jacksonville, FL"}, {"Author": "Ron E.", "ReviewID": "34wtPqMWO2I8CrGegOy35A", "Overall": "5.0", "Content": "For those that love breakfast any time of day this is your spot!  Biscuits with fried chicken, bacon, gravy, cheese, apple butter, icing, honey, etc.  It's all here for you to try.  They serve some local coffee for those looking for the java.  You can even buy their honey by the jar.  Walk in, place your order, get your food, eat, buss your own plates, and get out so others can enjoy the food too!  Serving San Marco and Jacksonville Beach!", "Date": "2013-08-16", "Author_Location": "Jacksonville, FL"}, {"Author": "Sarah G.", "ReviewID": "lxpIpe-_oUex_kErggFf_g", "Overall": "5.0", "Content": "Maple St Biscuit Co. lived up to the hype for me. =) I was worried that one little biscuit sandwich wouldn't be enough, but they're stacked and pretty filling. The hash ups were good and went well with the sandwiches, not to mention the gravy is delicious! This place is one of my new faves in Jax!", "Date": "2013-10-01", "Author_Location": "Miami, FL"}, {"Author": "Heather K.", "ReviewID": "flE_oDA-6a_wfybk9F1F9A", "Overall": "5.0", "Content": "Absolutely the best biscuits and Mac & Cheese in jville. Came here with the Fam and we varied in everything we had, none of it disappointed. The basic Bacon, Egg & Cheese was great with a side of their Maple Syrup. The Ralphie Deluxe, The Sticky Maple, The Loaded Got & Hashup all got rave reviews from the Fam. Try the Maple Tap coffee too, it is amazing!!!", "Date": "2013-08-24", "Author_Location": "Phoenix, AZ"}, {"Author": "Elizabeth M.", "ReviewID": "Cwxg6uSgpMEfg3WV2lwRvg", "Overall": "3.0", "Content": "Five stars for the food.  Minus two for the service and organization.  We stopped in Labor Day morning for breakfast.  I'd read online to expect lines, but I still wasn't prepared.  The line was to the door and the inside was packed with full tables, people waiting to order, and people waiting to pick up their food from the counter.  It's not clear if someone in your group can sit and reserve a table while someone waits in line to place your orders, or if you have to wait until you've ordered and picked up your food to sit down.  But it was so packed that we weren't getting a table anytime soon anyways.  But I don't like stressing about if we're going to have a table once we have our plates.We waited in line over 10 minutes to order.  There are printed menus you can look at as well as a chalkboard wall listing the menu offerings, so you have plenty of time to decide what you want to order.  We placed our order and shifted into the crowd of people waiting for their food.  Ten minutes went by, and the people in front of us were waiting along with us.  Five more minutes passed.  Then another five.  Then we noticed people behind us getting their food before us.  My husband expressed to one of the runners that things seemed to be taking a long time, and he responded that they'd lost a handful of tickets and that ours was probably one.  No announcement was made.  No one approached people in the crowd to ask how long they'd been waiting, and to offer to retake their order.  We were all just standing around waiting because we'd already paid and things seemed so disorganized anyways that it seemed possible it was really taking that long to get our food.  I guess they were just waiting for people to get pissed and complain and then \"ta-da!\", they'd identified their missing tickets. No apology; he just put our order in on the bottom of the pile.  He didn't move it up even though we'd already been waiting, and it took almost ten minutes more to get our food.  We took the food outside to the park across the street, because even though a couple of seats had opened, I wasn't in the mood to sit at communal tables and socialize.  Plus, I was done with the crowds.  It's unfortunate because the food was great.  The mac'n'cheese was flavorful and cheesy.  The chicken was crisp and beautifully seasoned, and the pairings were well thought out.  My husband had the chicken biscuit with goat cheese and pepper jelly, and I had the chicken biscuit with collard greens, a fried egg, and hot sauce.  I'm from out of town, so I won't be back.  But the crowds, lines, and order mishap would keep me from going back just the same.", "Date": "2013-09-15", "Author_Location": "Nashville, TN"}, {"Author": "Rita D.", "ReviewID": "ep3b5BasNoZoOjaCda6kSw", "Overall": "5.0", "Content": "Thanks fellow Yelpers for pointing me to this place! Although the construction traffic is enough to make you want to lay on your car horn, it is most definitely worth the trip. I admittedly was skeptical my first time here. Yes the reviews all sang high praises but I couldn't help but think \"Really? They're just biscuits!\" *sigh* I am now a proud member of the Too Excited Over Some Damn Biscuits club lol        This lil' establishment is nothng fancy...I'm talkin' bout (free refill) OJ in small paper cups, people. You can't get any more simplistic then that. Very cozy interior; not as tightly packed as French Pantry because at least they have outside seating but if you catch it during rush hour, I'm sure you will either be sharing a table or taking your order to go. The staff makes up for the lack of interior design with a kind of playful character. As I'm sure you all have read before this review, MSBC has a cutie way of keeping track of their customers: they ask you a question and call you up based off of your answer. The question for my visit was \"Who was your favorite high school teacher?\" Mine was Coach Mac, my sociology, pscyhology and Western history teacher...he was also the tall, chocolate, extremely charasmatic football coach and oh em gee how I secretly loved him! Off topic? Yea I know...just my way of giving MSBC some major kudos for unintentionally reminding me of my old high school crush :-p My first time here, I kept it simple with The Sticky Maple: all natural fried chicken breast, pecan wood smoked bacon, topped with real maple syrup, sandwiched between 2 biscuits. Being a duty bound Southern Gal, I also ordered the Bluegrass grits as a side item (1 word: flawless). I have a theory whenever eating at a new place that I have intentions of visiting frequently: if they screw up the easy stuff or their signature items, then it's not worth a second attempt. Thank you MSBC for blowing this seemingly simple arrangement of breakfast items smooth out of the park! The biscuits were buttery, warm and flaky. The chicken was lightly fried to perfection i.e. no extra mushy breading, just crispy chicken with bold seasoning all the way through. The bacon was thick cut and very well done, just like I cook at home. Dontcha just hate it when you order bacon in a breakfast joint and there is a corner that is still borderline uncooked or when the bacon overall is browned but still limp? I DO. MSBC read my mind and hit the nail on the head :-) The maple syrup was the icing on the cake...literally. It was sweet but not HFCS sweet and deliciously messy. I found out the hard way how The Sticky Maple earned its name...but I just piled some napkins on my lap/chest and went to work on that lil monster lolNow my 2nd time was the mind blower. I went just a tad above and beyond by ordering The Squawking Goat: fried chicken breast, fried goat cheese medallion and house made pepper jelly, between 2 biscuits. First of all, what in the blue blazes is pepper jelly?! *frown* Oh, and go ahead and get your torches/clubs/pitch forks ready: I never had goat cheese prior to this place. ( I went here long before French Pantry...just wrote the review way late.)Yea, yea, yea....needless to say, this whole order was way out of my comfort zone. Never again will I doubt you, MSBC. The goat cheese was unlike any cheese I ever tasted! Scrumptious, kinda sweet and creamy goodness is the best I can come up with lol And the pepper jelly is nothing like the taste that came to mind...there is no trace of \"pepper\" in it's flavor. It's light and savory with a kind of kick to it...not spicy (to me), but definitely something that made my eyebrows shoot up like \"Wow! Never tasted that before...\". Believe me, it was exactly what the chicken biscuit needed to keep it from being boring after the first couple of bites and I am now a fan. Oh yea, I also had a side of  Smokey Mountain Mac n Cheese. It was pretty dang on tasty and they added a creative twist to it by putting Cheeze-Its on top. Mmm...This place is definitely a must in my book...just be sure to bring a big appetite because this food will absolutely stick to your bones! Don't just take my word for it...", "Date": "2013-06-11", "Author_Location": "Jacksonville, FL"}, {"Author": "Lisa N.", "ReviewID": "BxpB0fsD3Iz9nrEz2pMwWg", "Overall": "5.0", "Content": "Deeelicious biscuits, on par with Portland's Pine State menu, just with more of a southern twist. They're not too dense or too fluffy, perfectly flaky and just the right amount of buttermilk sourness. We spoke with the owner Gus, super nice guy. While we were sitting down he brought out some complimentary pecan/cinnamon-y sweet biscuits that were bomb! Also they serve some great locally roasted coffee (blanking on the name). I only visit family in Jacksonville every so often, but soo glad I found this gem! Biscuits, when done right (and here they are definitely done right) are such an underrated pastry/breakfast food. Would be a regular here if I could. We need a biscuit place like this in SF! Thanks Maple Street!", "Date": "2014-04-01", "Author_Location": "San Francisco, CA"}, {"Author": "Dan D.", "ReviewID": "KQ_6uwjN3PEb7pEbteBXEw", "Overall": "4.0", "Content": "Very good biscuits and a good atmosphere.Tried the loaded goat and was not disappointed!", "Date": "2013-08-16", "Author_Location": "Jacksonville, FL"}, {"Author": "Kathy C.", "ReviewID": "9mk4yhI6S88VgoFVnn_AmQ", "Overall": "5.0", "Content": "We heard about Maple Street Biscuit Company and made a point to go there on a week day morning to try their breakfast to avoid the crowd.  YAY the place was pretty much empty when we walked in.  I ordered the Five and Dime (EVERYTHING tastes better with a fried egg on top) and hubbo ordered the Reinhold.  They were both soooo delicious.  It was so bad for me, I know.  But man oh man, if err..when I get any kind of \"I don't care about what I am eating today\" mood, this would be one of the top contenders....", "Date": "2013-09-20", "Author_Location": "Jacksonville, FL"}, {"Author": "Julie W.", "ReviewID": "tuxYlgXTBPOCMT1Ic_k5-w", "Overall": "5.0", "Content": "I cannot get enough of this place! The Squaking Goat and Sticky Maple are my favorites. Oh and don't get me started on the David Hasups. I'm obsessed!", "Date": "2013-07-26", "Author_Location": "Jacksonville, FL"}, {"Author": "Amanda N.", "ReviewID": "EK6AE-Xjt0ALaOpggOSI_A", "Overall": "4.0", "Content": "I enjoyed this spot. Casual but the food doesn't taste like its casually conceived. I had the loaded goat. Biscuit, fried chicken and goat cheese. Great textures and taste. Only complaint is I'd like a lil sauce of sorts w it. I may add their pepper jelly next time. They have a lil coffee bar that I enjoyed switching it up. The maple kind was comforting and like home. Ill def come back. Staff was super friendly", "Date": "2013-09-17", "Author_Location": "Jacksonville, FL"}, {"Author": "Mandie M.", "ReviewID": "NokrCel-4ISHhkVZUTbSSg", "Overall": "4.0", "Content": "We went on a Saturday about 11:30am, it was packed with people.  We were hoping to miss the rush, but the food was so good, I think it is probably always packed!  We did have to wait 20-25 minutes for our food, which was challenging with preschoolers, but, again, the food was delicious!  I'm hoping to use them to cater a breakfast soon!", "Date": "2013-11-16", "Author_Location": "Jacksonville, FL"}, {"Author": "Jill E.", "ReviewID": "DdX0RTHii2wlT2Zu_CWzqw", "Overall": "5.0", "Content": "Yummy yummy in my tummy. The BLT biscuit was good, but the hashup was even better! The potatoes were tender without being mushy and the ham was a perfect compliment to the dish. The staff was super nice and explained some of the more popular items on the menu. Breakfast for dinner is never a bad idea. :)", "Date": "2013-08-16", "Author_Location": "Jacksonville, FL"}, {"Author": "Kate D.", "ReviewID": "amoSOM15b-ZJnRDMcVdB-w", "Overall": "4.0", "Content": "I wish they had one in Indianapolis! It was worth they hype if you like biscuits. The chicken was really moist, although the gravy a little heavy for me. I can't wait to return to try more the next time I am in town!", "Date": "2013-09-07", "Author_Location": "Mooresville, IN"}, {"Author": "Hanna H.", "ReviewID": "ro_oHOJFUw9Hn4pwyjRWFA", "Overall": "4.0", "Content": "I love the concept of this place. Breakfast biscuits and fried chicken, what is better than that?! Each morning, they post a question on their chalkboard outside, so when you order, you answer the question and that's how they call out your food when it's ready! Super cute and really funny. Then, you get your food and it's all pretty bomb. Tip: if you read the paper menu, there are more options than what they display on the large menu board. We ordered a \"ralphie\" and a \"squawking goat,\" and they were both delicious. I knocked off a star just because it took a little bit of time for what it was, but they were really busy so it's totally understandable. Seating is family style! Everyone is very friendly. I would definitely come back the next time I find myself in Jax!", "Date": "2013-09-14", "Author_Location": "Bay Area, CA"}, {"Author": "Taylor D.", "ReviewID": "KwYnRITd-mtLFetQ-8W_1Q", "Overall": "5.0", "Content": "While visiting jacksonville I yelped msbc and decided to check it out with the fiancé and I am glad we did. I did the biscuit, cheese and egg sandwich and her just a biscuit. Great home made biscuits, lovely wood table and homely interior all around. After ordering they ask your name and ask what you wanted to be growing up so they call out \"your name the astronaut\" or whatever which was really cool. This is a local business that gets it! 5 stars all the way around!", "Date": "2013-09-23", "Author_Location": "Naples, FL"}, {"Author": "Corey M.", "ReviewID": "qm8rRmee-erXcl_U7PHbag", "Overall": "5.0", "Content": "This is my first time into a Maple Street! It just so happens that it was their first day of business too! I got the Five and Dime and it was aaaaaamazing!!! The sausage gravy was delicious and the service was great! They messed up my order by putting cheese on it, but quickly prepared a new sandwich for me! They even brought over an iced cinnamon pecan biscuit on the house! Next time I'm back in the south I'm definitely coming in! Comparable to pine state biscuits in Portland! #loveit", "Date": "2013-08-15", "Author_Location": "Upland, CA"}, {"Author": "Morgan M.", "ReviewID": "XkFnytREEqr-s9EjXknp9Q", "Overall": "5.0", "Content": "Delicious! The Mac n cheese is amazing! And the Maple Tap coffee is awesome. Will be back for sure", "Date": "2013-08-31", "Author_Location": "Jacksonville, FL"}, {"Author": "Rachel N.", "ReviewID": "ACJRahRsXGIlme2d0ErTQQ", "Overall": "5.0", "Content": "Outstanding! I had the five and dime which was delicious and I LOVE their coffee. I definitely will be going back!!!", "Date": "2013-08-24", "Author_Location": "St Augustine, FL"}, {"Author": "M V.", "ReviewID": "3wc_NvKCyJJUKLuMtuEpeQ", "Overall": "5.0", "Content": "So yummy! Probably one of the best breakfasts that we've ever had! The five and dime was HUGE but so worth it!!", "Date": "2014-03-04", "Author_Location": "Decatur, GA"}, {"Author": "Maisha R.", "ReviewID": "U7a_M59aKnIp6Dc934qZHQ", "Overall": "4.0", "Content": "More seating please! I went to check this place out on a Saturday morning and it was packed! Once I sat down to eat my food, I knew exactly why. As I waited in line to order, I was amazed by Maple Street's creativity all in the name of a biscuit!.  I mean, there were chicken biscuits; chicken and cheese biscuits; chicken, cheese and bacon biscuits and biscuits full of goodness topped with gravy. But, being a southern girl, I had to go for the biscuit  with fried chicken topped with collard greens, an egg and hot sauce. I was not disappointed! The biscuit was flaky and tasty and it soaked up just the right amount of juice from the collard greens.  This place has a simple, but great concept with reasonable prices and from the size of the crowd, it looks like the people of Jax agree!", "Date": "2013-02-17", "Author_Location": "Los Angeles, CA"}, {"Author": "Stephen P.", "ReviewID": "nHtBcQsCS0CQAzWKrOnItg", "Overall": "5.0", "Content": "U will wait, but your tongue will slap your lips and u will ask for more!!  FIVE AND DIME with all that gravy makes me want to hurt somebody !!!!", "Date": "2013-08-17", "Author_Location": "Jacksonville, FL"}, {"Author": "Cari B.", "ReviewID": "-C-oDC_nh_ANFeHvfTXpJQ", "Overall": "4.0", "Content": "First off let me say breakfast is not something I take part in but I made an exception one morning so I could see what all the hype was about on this biscuit place . I tried two different types while there . First I had the one with fried chicken cheese bacon and gravy , it was a bit much for me . A bit on the greasy side but would could I expect with all those concoctions on top of it . Next I tried the cinnamon , now this was very tasty by far my favorite . The staff here were all super friendly . How anyone could be in that good  of a mood that early in the morning I will never understand but they all seemed to have mastered it . All bright eyed and bushy tailed and had my biscuits sitting in front of me in less then a couple minutes . Needless to say I was impressed . The place they're in is small but cutely decorated. If I ever find myself craving breakfast for some weird reason I'll surely stop in here and definitely recommend all you strange people that call yourselves morning people to stop in and grab yourself something tasty to start your day of right .", "Date": "2013-10-31", "Author_Location": "Jacksonville, FL"}, {"Author": "Tina C.", "ReviewID": "oM7srno3ENcXBPZV2W3JRw", "Overall": "5.0", "Content": "What a great find! The service & food were outstanding!  We stood there for a moment looking over the menu & the nice young lady at the counter come over to offer suggestions.Menu was simple & straight forward.  My husband decided on \"Nickel & Dime\" and I had \"The Sticky Maple\"....DELICIOUS!!! Biscuits were buttery & flaky, fried chicken breast was mouth watering, bacon was crsipy & sweet!  Coffee was incredibly smooth. One of the owners came over to ask us how things were & I'm sure we were grinning ear to sticky ear. Already planning a  return visit :-)", "Date": "2013-05-13", "Author_Location": "Jacksonville, FL"}, {"Author": "Kerri M.", "ReviewID": "5eGXTWCeeSFVUjsJZJag1A", "Overall": "5.0", "Content": "Absolutely scrumptious! We had The Farmer, the Sticky Maple, Mac n cheese, Pecan cinnamon biscuit and home fries. Every item was over the top good! Heard the Maple coffee was wonderful will try next time. Line to the door but we were sitting and eating within fifteen minutes. Eat here!!", "Date": "2013-09-02", "Author_Location": "Fruit Cove, FL"}, {"Author": "Anne-Marie B.", "ReviewID": "G8fFqsdUbs14nMoRTT3jRw", "Overall": "4.0", "Content": "This one has been a long time coming, however I feel that my integrity as the most reliable source for all things breakfast hinged on several visits in order to give the best possible opinion. You're welcome. I experience a mix of emotions each time I visit MSBC:1) sheer delight over all things related to biscuits being made right before my eyes2) eager anticipation, paitently waiting for some of the best sausage gravy (with a kick, as their menu lists) this side of the Mason-Dixon3) panic and anxiety, trying to decide what answer to give the cashier for whatever question they're using to name my order that day (twice I've gone and they've asked me to identify my order name by my favorite childhood TV show...naturally Ren & Stimpy won)4) impatience standing in the always-long line caused by a less-than-ideal ordering process, yet always ending with5) pure, unfiltered satisfaction upon completion of my meal. Kudos to the owners for first of all, always being in the location on a busy Saturday morning behind the counter in aprons gettin dirty with the rest of the staff, but also for bringing a much-needed-change-of-restaurant concept to my beloved San Marco. I'd say that the perfectly close proximity to my front doorstep gives this place a higher notch on my list of favorites, but in all seriousness, I'd drive quite a ways to enjoy this delightful little Saturday treat. Most everything on the menu incorporates their amazing biscuits. Do not approach intending to eat light or health-conscious. There is bacon. There is fried chicken. Did I mention there was sausage gravy? There's sausage gravy that will make you question how you ever thought your life was complete before. When you visit (and you will), add a cup of self-serve Maple (yes, like syrup) Coffee to your order. You won't regret it.", "Date": "2013-01-08", "Author_Location": "Raleigh, NC"}, {"Author": "Roger W.", "ReviewID": "uqWBDemtcuMBmHCiWDbghQ", "Overall": "4.0", "Content": "Tried The Maple St Biscuit Co and was delightfully surprised.  I had \"The Five\" along with the Hashups and it was great and more than I could eat.  I will definitely be back when I  in Jacksonville.", "Date": "2013-08-30", "Author_Location": "Lake City, FL"}, {"Author": "Rebecca F.", "ReviewID": "MebRDRr11cMmwXm-UAEQiw", "Overall": "4.0", "Content": "I haven't tried a biscuit I don't like! I would recommend the drunken goat, the Five, and the sticky maple.", "Date": "2013-07-03", "Author_Location": "Atlanta, GA"}, {"Author": "Max L.", "ReviewID": "vdDNDZ-znfwMRjWPeYHcOg", "Overall": "5.0", "Content": "First time here and I ordered the Chicken Club Biscuit and Sweet Potato fries. Everything came out exceptionally well, chicken was fantastic, well cooked and juicy. The staff mixed up my order and the owner gave me a desert on the house. Couldn't be more satisfied.", "Date": "2013-08-16", "Author_Location": "Pasadena, Los Angeles, CA"}, {"Author": "Jessica C.", "ReviewID": "-DnztsNhS-eSwySdQuvHGw", "Overall": "4.0", "Content": "yummy biscuits & friendly staff! definitely a cool place to try out.", "Date": "2014-05-09", "Author_Location": "Jacksonville, FL"}, {"Author": "Kaci T.", "ReviewID": "fM0xJdOOvbHxQbtmEKJihw", "Overall": "5.0", "Content": "Visiting Jacksonville from North Carolina and found this place on Yelp. So glad we stopped! The shopping center is packed with hip, local businesses including a juice bar, tea shop and a bunch of boutiques. The food at Maple Street is Super delicious and fresh! I am a vegetarian and had the biscuit with collards. Fried egg was perfectly cooked. Sweet tea was not too sweet, just right, and I'm from North Carolina. My husband had the chicken biscuit with pickles and he said it was the best chicken ever. My mom had sausage gravy biscuit which was perfectly made just like grandma would make it! Spicy pork sausage, cream and flour gravy. Not greasy at all. The best part was the maple, pecan biscuit with homemade icing, seriously, try it!", "Date": "2013-06-28", "Author_Location": "Raleigh, NC"}, {"Author": "Jasmine R.", "ReviewID": "3P_meVvXlNJGv5GdACr4YA", "Overall": "4.0", "Content": "While visiting I decided to check Maple Street out for breakfast based on the reviews. I must say it really lived up to the awesome reviews! I ordered the Loaded Goat with the sweet potato fries and sausage gravy on the side. That biscuit was the best biscuit I have ever had in my life! And I could eat the sausage gravy all by itself!  As far as the sweet potato fries, they obviously aren't a specialty and I wouldn't order them again. Plus you would be too full to even finish them up. It was very busy and all the seats were FULL! It's best to get there early and obtain a seat FIRST! The next time I come to this area I will definitely stop in but make sure I come as soon as they open :)", "Date": "2013-08-25", "Author_Location": "Vero Beach, FL"}, {"Author": "Kimberly S.", "ReviewID": "CL__YrYe-y7hTDaYhCf9YQ", "Overall": "5.0", "Content": "This place is to die for, I had the fried chicken with the homemade pepper jelly and I was in pure heaven!! I love the atmosphere and the owner really takes the time to come and ask for your meal was!! Super sad I do not live in Jacksonville because I would be at this place everyday!!", "Date": "2013-07-13", "Author_Location": "Tempe, AZ"}, {"Author": "Stacey S.", "ReviewID": "xwiHlV7YKyJq8BGrwi4rYg", "Overall": "4.0", "Content": "Sometimes not working downtown really stinks. My bf, Adam, loved his first visit to Maple Street Biscuit Company so much, he was sweet enough to drag me there the following weekend. It wasn't a big surprise (to me, at least) that I was pretty skeptical about a place that serves biscuits. The skepticism was really just the over-pouring jealousy clouding my vision.So that morning we went on our team training run in preparation for the Ragnar Relay and headed to Maple Street to refuel. Believe me, after that bridge run, I needed a biscuit or two or four or six.When we walked in, I was a little overwhelmed with their menu. I knew exactly what I wanted, I just needed to find it on there! Their menu is made up of unique names like The Ralphie or The Reinhold, so it's helpful to read through the entire description of the menu item to figure out what it really is.When we went to order, they actually recognized Adam and remembered that when he was in earlier that week, they were out of what he originally wanted to order, the pepper jelly. They let him know they had it in stock that day. It was just a little gesture, but it really won him over. It really just goes to show how friendly everyone is there.When you go to order, you don't give your first name for them to track your order. The first time we were there, we were asked for our favorite Band Name. The second time I went, they asked our favorite 80s TV show. Be aware, whatever the question of the day is, will be what they'll be calling out for everyone to hear.One tip is to pay attention so you can overhear the register ask the group ahead of you in line the question. This will give you an extra second to think of something so you don't blurt out the first embarrassing thing that comes to mind. I honestly feel this is really awkward because I feel everyone is judging my \"Huey Lewis\" and \"Silver Spoons\" responses. (Adam didn't know what Silver Spoons was?!?) I know I'm totally overreacting though. Also, don't be that jerk that think's it's super funny to get everyone to say the same thing. All this does is make things more difficult as everyone gets hungrier waiting for their food. I actually prefer to hearing them call out the different band names or TV shows rather than someone yell out everyone's first name over and over. I seem to be able to tune out a tv show or a rock band, but hearing \"jessica.... jessica...\" repeated just sticks in the back of my mind and interrupts my focus from my food.I ended up with The Ralphie, which is a fancy term for biscuits and sausage gravy. They also add \"a kick\" to theirs which I, of course, was skeptical of. In fact, \"the kick\" turns their gravy a slight pink color, which is really weird at first. After a few bites though, you totally won't care. It's delicious and \"the kick\" really, REALLY adds some good flavors to the dish. I could eat a whole bucket full of this stuff. (but then again, I'd have to run that bridge a bazillion times if I did that).Adam ordered the Squawk on the Street which is a biscuit, fried chicken breast, and the homemade pepper jelly (that they were out of the first time he went). He proclaimed it as very tasty. The pepper jelly added a sweet, not spicy flavor to the sandwich.The second time (Adam's third visit) we went, Adam was on a mission. He knew what he was ordering before we even stepped in the door! He immediately ordered The Five and Dime which is a biscuit, fried chicken, bacon and cheese topped with choice of gravy and a fried egg. He proclaimed it an epiphany of goodness in his face. His words, not mine. I think that means he liked it.I just got The Five so this was a biscuit, fried chicken, bacon and cheese topped with choice of gravy. aka same epiphany as Adam, but no extra egg. This was good, but I could have left off the chicken. It was flavorful and good, but I could take it or leave it. I think it's just not my thing. You might still think it's fabulous. It really hit the spot though. Seriously delicious after a good weekend long run.When we went the first weekend, we ran into our friends Ron and Tiffany and even Kerry. When we went this past weekend, we ran into Caron. It's definitely a place you'll run into people. They even have a big community table which makes it easy to meet up with a group of people if you'd like.For some reason, we completely missed the coffee hot-bar the first weekend. Caron pointed it out and talked highly of the Maple Tap. I'm not typically a huge fan of maple stuff, but Adam tried a cup.I went right for the Dark Bark. I really like bold coffee, so there was no reason for me to divert from what I typically like. Their Dark Bark was tasty. I tried the Maple Tap as well, and it was surprisingly good. It wasn't too strong on the maple, just right.Oh.. and  they make their biscuits from scratch right in the front for everyone to see. We really enjoy Maple Street Biscuit Company especially after a good weekend long run!", "Date": "2012-12-17", "Author_Location": "Jacksonville, FL"}, {"Author": "Yolanda G.", "ReviewID": "PmOQqO5kIvSufkPdh0aBSg", "Overall": "4.0", "Content": "The Five and Dime is the Bomb and the people are very nice, the place is also very clean. I would have gave 5 stars but the price is a little heavy.", "Date": "2013-08-20", "Author_Location": "Jacksonville, FL"}, {"Author": "Sara L.", "ReviewID": "KAVdf8L1EDMfCWm9ga1y6g", "Overall": "5.0", "Content": "Really amazing. Limited seating though and I don't like the community seating but I understand the concept totally. The Mac and cheese is amazing. I had the dime biscuit, and it was delicious. It's always really busy though - so get there early!", "Date": "2013-03-02", "Author_Location": "Jacksonville, FL"}, {"Author": "Lindsey B.", "ReviewID": "8TNxdN1YQee9bA6H8geWmg", "Overall": "5.0", "Content": "Great breakfast and/or lunch stop. Went with a couple friends and ordered the one with fried chicken and goat cheese and added the pepper jelly to it. Was absolutely delish! They also have great cinnamon raisin biscuits and more. Definitely will go back at lunch and try some other items on the menu!", "Date": "2012-12-05", "Author_Location": "Neptune Beach, FL"}, {"Author": "Susie S.", "ReviewID": "CN1m0_FTzUZnlargpzuyyA", "Overall": "4.0", "Content": "Biscuit and gravy is perfect! Gravy has a black pepper kick. Biscuits are fluffy and homemade. This place is YUMMY!", "Date": "2013-04-30", "Author_Location": "Tampa, FL"}, {"Author": "Craig A.", "ReviewID": "bPkjGyMUEsyfdNxkW5Mztw", "Overall": "4.0", "Content": "Great scratch made biscuits! My wife (tiny) and I (huge) told the lady taking our order that we wanted to try a couple of different ones, and she jokingly said \"well I don't think one is going to fill you up.\" I assumed she was talking to me because I am 6'3\". She got pretty wide eyed when we ordered 3 between us. She realized the mix up when we paid (that I ordered two for myself), and offered to take one off for us. We wanted to try some different ones because we are indecisive, so we just figured we would take one home. Turns out, this place makes pretty incredible fried chicken biscuits... nothing made it home. Highly recommended!", "Date": "2014-01-31", "Author_Location": "Southside, Jacksonville, FL"}, {"Author": "Jacksonville F.", "ReviewID": "hIXBnP6Zin_ER7a07LKTpw", "Overall": "5.0", "Content": "Great place for foodies .Wonderful service . Very fresh food . Even if u are not a biscuit eater ....this place will change your mind .", "Date": "2013-03-16", "Author_Location": "Jacksonville, FL"}, {"Author": "Mitchell M.", "ReviewID": "KW2E-2byzWNXjkt7cZYd7w", "Overall": "4.0", "Content": "I visited this place due to all the reviews posted by my fellow yelpers. The biscuits were great. I got the five and dime which was more than enough food. You don't need a side order unless your starving to death. I rated it a 4 star due to the price. The biscuits are $6 to $8 each plus your drink. So expect to spend $10 a person, which in my case was X 4. I would go again but not frequently due to price.", "Date": "2012-12-24", "Author_Location": "Jacksonville, FL"}, {"Author": "Amanda T.", "ReviewID": "WRN3uSibsGLirzCDWEKctw", "Overall": "5.0", "Content": "I heard about this place on their opening day! I was super excited to hear about it because everything I read about sounded so yummy. I got the Loaded Goat as social media had suggested to me and my boyfriend got the Garden Bird, as suggested from one of the owners. Homemade biscuits, well executed design set up, and everything screams local and another reason to fall in love with Jacksonville. They are a nice addition to San Marco and we can't wait to start bringing our friends. I really want to the Squawk the next time I go back.", "Date": "2012-11-13", "Author_Location": "Jacksonville, FL"}, {"Author": "Shawna N.", "ReviewID": "2fIyf2SH-Wv6SATKCAdDNQ", "Overall": "4.0", "Content": "The only reason it doesn't get five stars is because it's not open on Sundays and they have odd hours the rest of the week!! This place is amazing otherwise. Great food incredible coffee. Check it out!", "Date": "2013-06-30", "Author_Location": "Jacksonville, FL"}, {"Author": "Xavier H.", "ReviewID": "TWzGG7mxmWkDfj81izhA6A", "Overall": "5.0", "Content": "First time and it was excellent i try the five mmm delicious", "Date": "2013-06-14", "Author_Location": "Jacksonville, FL"}, {"Author": "Aldo R.", "ReviewID": "N8ym9eK5J8uu3Pb6SH570g", "Overall": "2.0", "Content": "Maple Street is quaint, it reminds me of a country dinner somewhere in a small town. The service is great, staff is pleasant, and the way they call your order up is pretty unique. I tried the loaded goat and it was pretty good. I really didn't enjoy the fried chicken as I'm a fan of Chik-fil-a chicken biscuits. Maple Street's fried chicken is certainly more \"real\" tasting, nothing wrong with that but not what I like. The biscuits were more soft than flaky and lacked any taste. Nice location and worth a stop if you're in the area.", "Date": "2013-03-30", "Author_Location": "Jacksonville, FL"}, {"Author": "Brian F.", "ReviewID": "6gfyLi4pOTrqg2zd1oCIuw", "Overall": "5.0", "Content": "Love at first bite!  So good.....fried chicken, biscuits, gravy, eggs I mean what could be wrong, it's so right!", "Date": "2013-02-04", "Author_Location": "Richardson, TX"}, {"Author": "Brian S.", "ReviewID": "Zl1jMcF0_Yp3nHeB3Kfexg", "Overall": "3.0", "Content": "My wife and I went to check out the Maple Street Biscuit Company on Saturday morning.  The place was busy and we loved the decor.  Contemporary twist on rustic cabin.  Combine a chalk board menu and iPad for simple meets high tech.  On this visit the name of your favorite childhood TV show was your announcement when the order was ready.  You better like biscuits.  If not stop reading now and go somewhere else.  That is what they are know for and almost everyone orders.  We got the fried chicken with goat cheese and maple syrup covered chicken biscuits.  A side of grits and their hashups a version of potatoes o'brien.The food was great.  Flaky biscuits, tender juicy chicken, creamy grits were very good.  Hashups were okay...they weren't bad just nothing special and someone needs to understand what country ham is...these are billed as having country ham but it is city ham.  If you don't know Google Harpers or Smithfield Country Ham.  We both enjoyed the Maple Tap coffee even though we had to ask if we were supposed to serve our selves. Which leads me to the 3 stars...we waited almost 30 min for two chicken biscuits, grits and potatoes.  For a restaurant that specialized in chicken biscuits that is way too long to wait.   They were busy but not slammed and everyone was waiting a long time so it wasn't just our order.  Hopefully they get their speed up as a counter order type place should not make you wait more than a few min to get served.Couple points if the owners read this....Move the dirty dishes pail and trash can to the back of the store...no one wants to walk in and be greated by an open garbage can and dirty dishes.  You have to stand right next to these to wait in line to order.  Close Monday not Sunday.  You are in walking distance from two churches and will have limited competition for business.  Great chance to capture some new customers.  Don't believe me?  check out Metro Diner on Sunday.Country ham is slightly dry and salty.  The ham in your Hassups is not real country ham.  Not sure if the potatoes are fresh or frozen but they were just average imo.Need to figure out where your bottleneck is in the kitchen.  If you can't bake biscuits fast enough invest in some holding equipment and stock up ahead.  If its the fryer look at a pressure fryer or adding capacity.  You must be able to get someone in and out for a to go order in under 5 min for chicken biscuit.   Yes they are fresh and good but its not a compromise to fresh good AND Fast...nobody will hate you for it.  Nice job on the coffee set up and I loved the honey!  Just make sure your cashier informs people to help them selves after ordering.I think this could really be a great place if a few improvements are made in service as the food was really good.", "Date": "2012-12-01", "Author_Location": "Jacksonville, FL"}, {"Author": "Robyn R.", "ReviewID": "JnWzj2iyb-Vy9PPK6uHBBQ", "Overall": "5.0", "Content": "This is just what San Marco needed! The Maple Street Biscuit Company is a unique concept that plays to the heart of comfort foodies and those looking to build community-- both things appealing to the area. The menu is delicious and features creative meals that are filling. The atmosphere is appealing as well- small touches like a community table to calling out food orders based on your first pet or favorite teacher make this feel good from the get-go! The owner, Gus, is extremely friendly and remembered our names from the first visit (we've been 4 times now). They even had a girl playing guitar and signing on one visit-- she is an employee who also entertains and was fantastic! Highly recommend for date night, an evening with friends or a hearty lunch. Biscuits are no longer just for breakfast and Maple Street proves that!", "Date": "2013-04-29", "Author_Location": "Jacksonville, FL"}, {"Author": "Tracy B.", "ReviewID": "FnDo6uZ6HVTZq7T7NqKGUA", "Overall": "5.0", "Content": "After seeing all the reviews for Maple Street, I had to try it!  TRUST the reviews -- they are spot on!!  My husband and I went on a Saturday and of course parking was a pain, but that was expected for this area.  If you can find a spot in front of the strip center, consider yourself lucky.  Otherwise, you'll eventually find street parking in the neighborhood behind the stores.  This is where we ended up parking, but it did make for a nice stroll.  There was a little bit of a line when we went, but it moved pretty quickly.  I love sausage gravy, so that was a no brainer for what I was going to order.  I got the Five--fried chicken, pecan wood smoked bacon, cheddar cheese, and sausage gravy mounted between a flaky biscuit.  My husband got the Blues Biscuit -- pulled pork, cole slaw and bbq sauce on a biscuit.  When you order they have a quirky system where they ask you a question and your answer is what they call out when your order is up.  Listen to what they're asking other people, so you can think of a good answer.  Ours was, who was your favorite teacher?  There's plenty of places to sit either inside or outside.  They have it set up so there's communal tables.  Also, in the back there's another room full of smaller tables if there's no where to sit in the main area.  This is where we sat.  It was a little more quiet, but the problem with sitting back there was we couldn't hear our order being called.  After sitting for awhile, my husband finally went up to ask about our order.  He came back with our plates, but I was accidentally given the Sticky Maple.  Now don't get me wrong, this looked awesome and savory, but I really wanted to eat what I ordered.  My mission was sausage gravy and dang it, I was going to eat my sausage gravy.  I brought the dish back up and they got me my Five in less then five.  Honest mistake and quick turn around, so it didn't ruin the experience any.  This biscuit sandwich was to die for.  The fried chicken was perfectly crisp and juicy, seasoned to perfection.  The cheese and bacon added extra texture and flavor.  The biscuit was flaky and buttery.  The sausage gravy just took it a step up to oh my god level!  It was creamy, full of sausage and had just a little kick to it that made it more interesting then any other gravy I've had.  They really pile it on and it's a good thing.  Every bite you take is able to have a heaping pile of gravy on it.  My husband said his biscuit was really good.  Pulled pork and coleslaw always make for a delicious combo.  He did take a bite of mine and thought the chicken was so amazing, that he's definitely getting a biscuit with chicken next time.  We both ordered coffee with our meal.  We loved the set up of this.  It was like a coffee bar.  They had a variety of coffees and roasts with all the condiments.  What's great is they have mugs and to go cups.  The to go cups were so needed because their coffee was outstanding.  I think we both drank 3 cups and got a to go cup as well.  My husband enjoyed the Dark Bark, but I thought the clear winner was the Maple Tap.  It wasn't too overpowering and had just a hint of maple.  I think about that coffee all the time ::sigh::  We tried to buy some the other day as they sell bags of whole beans.  They only had decaf....boo!  We did end up buying some Dark Bark and it definitely did not dissapoint.  This place knows what their doing with great quality food and freshly roasted coffee...I'm definitely a fan!", "Date": "2013-08-01", "Author_Location": "Jacksonville, FL"}, {"Author": "Gary P.", "ReviewID": "f6NgZk2JebJR68t736JCbw", "Overall": "4.0", "Content": "Went there for breakfast and had the \"Ralphie Deluxe\" ......delicious! So good i thought about ordering another. Not your typical breakfast place..... It's better! Friendly people, cozy little place. The owner Gus came over and introduced himself when he found out i was an out of towner......Will definitley go back.....", "Date": "2013-11-13", "Author_Location": "Chesapeake, VA"}, {"Author": "Stubbs D.", "ReviewID": "TWpnrjzFkwADxD1uXm_HQg", "Overall": "5.0", "Content": "Gus and his staff are FABULOUS! The food is awesome! What a great idea..Love your style inside. We enjoyed visiting with you! Thank You! for the \"Birthday Biscuits\" you all are too kind! We were just so taken with everything..It is nice to see a place not only with fabulous food, great people but something so unique too..Welcome to San Marco! You know you will be seeing us soon!! Btw, we loved the coffee! Thank You! Thank You! Job Well Done!!!!!!!!!!!!Jan and Greg", "Date": "2013-01-05", "Author_Location": "Austin, TX"}, {"Author": "Jessica R.", "ReviewID": "C9s5V-Lkcfv_2S8knk6x_w", "Overall": "5.0", "Content": "LOVE LOVE LOVE LOVE this place! Biscuit sandwiches, GENIUS! First of all, these biscuits are to die for, even plain! Their farmer sandwich is the first one I tried...described as flaky biscuit, all natural fried chicken, pecan wood smoked bacon, cheddar cheese topped with fresh house made apple butter, but no bacon, it...was...amazing.  But now when I go, just a simple egg and cheese is perfection.  They also have sweet potato fries that they serve with a maple mustard sauce, ALSO perfection! Everyone who works there is so nice and patient with me as I battle with myself over trying new sandwiches or sticking with the one I love so much.  The owner is generally floating around chatting with us all which is also nice, and makes it all the more inviting.  My sister came to town for a visit and I took her here, she insisted I bring her back as often as I could before she had to leave town.  I love this concept and am SO happy that this place exists.", "Date": "2013-08-08", "Author_Location": "Jacksonville, FL"}, {"Author": "Cheryl B.", "ReviewID": "iOdsptj-Qu7YvGVTnjKOww", "Overall": "4.0", "Content": "Several of my friends were talking about this place, so I had to try for myself. I brought a friend along to confirm the tastiness of the biscuits.  We both agreed the biscuits were very good, as well as the chicken. She got The Five and I got the Loaded Goat. I got a little pepper jelly on the side (cause I'm a wuss about spicy food). The jelly was not spicy and it was a welcome addition to the sandwich. I tasted her Five biscuit and I will be getting that next time.  Very filling and satisfied biscuit sandwich.", "Date": "2012-12-06", "Author_Location": "Jacksonville, FL"}, {"Author": "Ashley A.", "ReviewID": "MuQNphiB0sDoUWIpZUKIMw", "Overall": "4.0", "Content": "Delicious biscuits, and a super friendly staff. Even though the service is at a counter, the staff members still circulated around the restaurant to make sure everyone was satisfied. I had the biscuit sandwich with maple bacon and apple butter. So delicious. The coffee was also excellent, and the free refills make it better. Looking forward to them opening up their location on Jax Beach....", "Date": "2013-08-24", "Author_Location": "Jacksonville, FL"}, {"Author": "D R.", "ReviewID": "_LGkA0nSdk4hUPjS_TczJw", "Overall": "2.0", "Content": "The restaurant is organized chaos.  First of all you place your order at the counter and then you must find your own place to sit (which is not a problem);however, if you've been waiting 30 minutes and the person that just walks in grabs the table before you is a little annoying.   I waited for more than a HOUR to receive my order for two people.  I went to the manager after I saw multiples parties eating and they literally just placed their order and I placed my order 45 minutes prior.  The time stamp was on my recipe and I went to the manager and he apologize and told me I have two options - I can refund your money or I can wait because apparently several order tickets have been lost today (and he would get it to me asap). I took an additional 8-10 minutes to receive my order after I complained to the manager. He did not offer complimentary drinks or anything  for my long wait.    It was a little disappointing at the service in the restaurant.  On busy days they should seat individuals as they place their order (first come first seated) and that will help a little when it is crowded.  The food was ok.  It was definitely not worth the wait.  I've been to local establishments and waited for 1 hour and it was definitely worth my time.   I would go back and give it another chance, but it is not a restaurant I am dying to visit again especially during peak time.", "Date": "2013-09-06", "Author_Location": "Jacksonville, FL"}, {"Author": "Lisa S.", "ReviewID": "qVc_7DuISQX88woglOU3Ig", "Overall": "5.0", "Content": "I'm not usually a person who gets excited over breakfast, but I love a good biscuit.  My husband and I decided to try this place this morning, and I panicked a bit when I saw the line to order.  But we got through it quickly and were able to find seats at the bar.  I had the biscuits and gravy while he had the chicken biscuit with bacon and maple syrup.  Both tasted amazing.  We will definitely be going back!", "Date": "2013-08-24", "Author_Location": "Middleburg, FL"}, {"Author": "Nic R.", "ReviewID": "fZ9C4mqCvtNiSKvQq_NK6w", "Overall": "5.0", "Content": "Amazzzzzing. Great service, great food, great atmosphere and great change from the normal mundane breakfast menu!", "Date": "2013-02-17", "Author_Location": "Jacksonville, FL"}, {"Author": "Bridget T.", "ReviewID": "eakkvH_XegYPFrArQzDNfg", "Overall": "5.0", "Content": "Great food, what a great concept.  Will come back again", "Date": "2013-05-19", "Author_Location": "St Augustine, FL"}, {"Author": "Dave W.", "ReviewID": "gim7ArfF7mRghyg60ZPaxQ", "Overall": "5.0", "Content": "Great concept - wish they were open on Sundays.  Pretty simple but delicious biscuit sandwiches.  Hashups are meh.", "Date": "2013-03-10", "Author_Location": "Evanston, IL"}, {"Author": "Kerry J.", "ReviewID": "MFVrKOn28jDAa6Hs7m4pTA", "Overall": "5.0", "Content": "A local told me about this place and it was delicious. Best chicken biscuits ever. You get many choices of other items to put on you biscuit from greens to sausage gravy. The hash ups filled the entire plate.  It was my birthday and the owner brought out some cinnamon biscuits. They were like eating a cinnamon roll, but in biscuit form. I was very satisfied and paid less than $15!", "Date": "2013-06-11", "Author_Location": "Tiffin, OH"}, {"Author": "Angela P.", "ReviewID": "5lRQDrzXb8cJqIEouII0kA", "Overall": "5.0", "Content": "This place is legit! Thanks to fellow Yelpers, I tried Maple St Biscuit Company during my visit to Jacksonville from Denver. This place would hold its own in a bigger city and is a gem in Jacksonville. The biscuits were soft, flaky, and buttery (just about perfect), the sausage gravy was fantastic (though spicy), and the maple bacon, maple coffee, and maple syrup pairings shape the identity of this restaurant. I definitely will be back to try more!", "Date": "2012-12-24", "Author_Location": "Centennial, CO"}, {"Author": "Christine I.", "ReviewID": "S1iec6ylpDO2wHYnoTFfjQ", "Overall": "4.0", "Content": "I am amazed this place could get any better...but it can! During my last trip I had the pleasure of trying their sweet potato fries and apple pie. Their fries hit the spot, their meaty and flavorful and who doesnt love a waffle fry? The dipping sauce is probably the best part. Honey mustard mixed with maple syrup. Sounds weird but its amazing. The apple pie was just what you remember from Thanksgivings and other family gatherings, except its individual sized. Great when you're in the wanna-bite-just-kidding-i-want-to-eat-this-whole-­thing kindof a mood. Both owners made a point to stop by our table to say hi and see how things were going. Definitely a nice touch. What made it even better is on their second time around, they brought us a sample of mac n cheese! Macaroni smothered in 5 melted gourmet cheeses topped with crumbled cheese-its?? Second best thing on the menu besides the loaded goat....which I ordered again.", "Date": "2012-12-05", "Author_Location": "Jacksonville, FL"}, {"Author": "Fifi S.", "ReviewID": "nAxUweuFkZXdB-DNkshtAA", "Overall": "4.0", "Content": "what a great new, fresh and unique concept!", "Date": "2013-02-04", "Author_Location": "St. Augustine, FL"}, {"Author": "T K.", "ReviewID": "HXvoL_6AXQLTcyRBDfVllg", "Overall": "5.0", "Content": "Amazing food. Fast service. Great for brunch. We were about to stand in line for an hour at a more famous brunch place and decided on this. It was delicious.", "Date": "2013-04-18", "Author_Location": "Jacksonville, FL"}, {"Author": "Jimmy A.", "ReviewID": "Mv1N46xl28WZW6XJbMHARA", "Overall": "4.0", "Content": "Really good. My girlfriend said 5/5. Good breakfast spot. Mmmmm mmm love them biscuits.", "Date": "2013-02-18", "Author_Location": "Green Cove Springs, FL"}, {"Author": "Kimber S.", "ReviewID": "KBm7HgpRzTCHnBNN0_QLbA", "Overall": "5.0", "Content": "Amazing!", "Date": "2013-01-12", "Author_Location": "Jacksonville, FL"}, {"Author": "Steve M.", "ReviewID": "98SzTa-fxNe-7yKK6x18cA", "Overall": "4.0", "Content": "Wonderful biscuit sandwiches. I was raised in the South and now I live in Connecticut and crave a buttermilk biscuit now and then. The owner, Scott was very warm and inviting and the Maple coffee was absolutely delicious. I enjoyed my sandwich so much that I went back for seconds before I left Florida. Such a charming environment. I would recommend this absolute delight and would encourge anyone to try it.", "Date": "2012-11-23", "Author_Location": "Jacksonville, FL"}, {"Author": "Hall H.", "ReviewID": "rtAwnxpN2xZbko_BUCUmVA", "Overall": "5.0", "Content": "excellent! my friend tim has gone just about every saturday since they have opened and loves it. even though my family and i all live in orange park we all went this morning. we loved everything and can't wait to go back next weekend! just as a quick rundown: food quality: great. food creativity: great! customer service: great! atmosphere: great! price: very affordable.       if you are familiar with hot doug's in chicago or taco lu on beach this is the same great idea but with delicious biscuits!", "Date": "2013-02-18", "Author_Location": "Orange Park, FL"}], "RestaurantInfo": {"RestaurantID": "5J18LEsp8M3YWAJNSiT-xw", "Name": "Maple Street Biscuit Company", "Price": "$", "RestaurantURL": "/biz/maple-street-biscuit-company-jacksonville", "Longitude": " -81.65390086662040", "Address": "2004 San Marco BlvdJacksonville, FL 32207", "Latitude": " 30.303846378209499", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/TYJiDh0wfAkG3ybPeCLFTw/90s.jpg"}}