{"Reviews": [{"Author": "Eric C.", "ReviewID": "X0X8pa92Eyegmh-UgwDMWw", "Overall": "5.0", "Content": "Fat kids rejoice! Your Mecca is in North Olmsted!First, I love Fat Heads beer.  So why wouldn't I like the place that has the most Fat Heads beer available?  This place has plenty of the namesake beer in so many varieties that it makes me sad my body harms itself whenever it sees a molecule gluten.  But, when I feel like making really bad dietary choices and I want to risk feeling like hell in a few hours after... I head here.But the awesome doesn't just end with the beer.  The food is huge and plentiful.  The menu is actually too big.  There's just way too much that sounds great.  For crying out loud, the menu reads like the perfect choice of seasoning for a sandwich is essentially stuffing it with another sandwich.    I normally find that places with these huge menus of fat-kid-food don't really deliver.  The food at such places is usually bland, of poor quality, and smothered in sugary sauces to cover up the crappiness of the edibles.  That's not the case at Fat Heads!  This is the place to go to break your diet.  Don't feel bad, just unbutton your pants and get to it.  You can cry about it in the morning, but it will be totally worth the harm to your circulatory system.And with great beers and food comes great service.  I always have fun servers who seem to actually enjoy the job.  Not the forced fun you get with a server at Friday's or Applebee's.  No, these are people who like the customers and the job.  It shows in how well they treat everyone, how accurate the checks are (even when split crazy ways), and how eager they are to make sure everything is up to snuff.  These folks have quality of service down!", "Date": "2014-06-30", "Author_Location": "Cleveland, OH"}, {"Author": "Alex K.", "ReviewID": "qupkKv1OIdn7ltQMG7vquA", "Overall": "4.0", "Content": "Being a  huge fan  of craft beer and always looking  for  something new, I knew I'd be  an  absolute  dumb  ass for going  to Cleveland  to see the Tigers  beat the  Indians  without stopping in North  Olmsted to eat and drink at Fat Heads.At  around 4pm on   a  Saturday,  the  place was pretty  packed.  We walked  through the place to  be  escorted  back  outside  where  our  table  was. The place has  a great aesthetic  and is  surprisingly  big,  but would it hurt  to have a little more lighting? It  was  almost like  a  theater   in  there.   Regardless,  I'd  love to  revisit and stay  inside...  just not when  the weather is so  perfect  outside.I wound  up  getting a sample  of  five beers (you can pick as many as  you want, and  the Cuyahoga burger. We  also  split the  Bavarian  pretzels  and the  Frickles. The Frickles were well   received  as the breading  wasn't  a soggy mess  like at  some places, and  the Sriracha  dipping  sauce was  great. The Bavarian  pretzels  are also  really good,  but  some didn't  care for   the  spicy  honey  mustard dipping sauce -- wimps! It  tasted great and had  a nice heaty kick to  it. As  for  the beer (I  mean,  it IS a brewery...), I got  Prohibition Pauly  Porter  with Coffee, Goggle Fogger,  Trail Head,  Angels for  ALS IPA, and Bumbleberry. No, I  didn't   get  their critically acclaimed  Head Hunter   IPA because I bought a  four-pack  to  bring home and  enjoy. As  I figured,  all  the  beers were  good  or  better. I'm  not usually huge   on fruity beers,  but  the  Bumbleberry is the perfect fruity  Summer beer.The  food came out   surprisingly fast  despite  how  busy the place was,  so  the  guys and girls  in the kitchen  know  what  the hell   they're  doing.  I  got my burger cooked  medium   and that's   just how  it  came out.   As  for the  thing   as a    whole,  I've had better  burgers,  but the  value  of   the thing   is  ridiculous, and  it's  still  a  really  enjoyable one.  There's  a good  portion of  pork,  spicy BBQ   sauce,   and  jalapenos.   Really, I  like  really  spicy food,  and   this  made  my nose run  a  little bit. I wasn't expecting it.  Messy, but  not  too  messy  -- the  buns  they  use  really help  with that.I'd be a fat,  fat   person if  I  lived  in the  area. The  menu   is loaded   with   options  that basically all  sound fantastic, and the portions are  absolutely  huge... I  was  one of two at  the  table  to finish our  order,  and I wasn't  exactly comfortable after  finishing  it  either. There are  a bunch  of items   on the   menu  that  I'd like   to try  next   time I'm anywhere   around Cleveland.", "Date": "2014-06-22", "Author_Location": "New Baltimore, MI"}, {"Author": "Cara L.", "ReviewID": "nah058APfD1m7ek0z0UNMw", "Overall": "3.0", "Content": "I'm torn with this one, you guys. It was my first time here, I opted for chicken fingers and a side salad. I know--boring... and probably not the best thing to order to see if a restaurant really shines. Obviously I wasn't \"wowed\" by this selection because really it was just your ordinary ingredients. The chicken fingers were most likely Sysco brand, frozen. Whatever. I did get to try some appetizers--the pretzel sticks were OK and so were the fried pickles. My sister got down on some nachos and I didn't hear any complaints from her. My friends like the smoked chicken wings, but my guy did not. And honestly, I don't think I would have either. The sauces were too sweet for my palette--and the wings were full chicken wings. The whole thing--it was huge! I like crispy flats, vinegary sauces--and smoked anything really isn't my thing. The service was good, but the wait was super-long. I didn't try any beers, but my sister was all about this Zeus Juice? She was a huge fan. It's not that I wouldn't come back, in fact, I probably would just so I could review something more \"signature\" on their menu. But am I in a rush to? Meh... probably not.", "Date": "2014-06-17", "Author_Location": "Cleveland, OH"}, {"Author": "Kim S.", "ReviewID": "qz9x867M550RWQHUDuPO-A", "Overall": "5.0", "Content": "One of our favorite date night spots! Obviously they have an amazing beer selection & we almost always order a few samples of their newly tapped beers so we can try them all. The headwiches certainly live up to their name,  they're giant. We have yet to find anything on the menu that we don't like. They do get really busy though so expect at least an hour wait on Friday & Saturday nights.", "Date": "2014-07-20", "Author_Location": "North Olmsted, OH"}, {"Author": "Mary Lynn J.", "ReviewID": "vx6le6g-IZLvwPD_9Fie_w", "Overall": "5.0", "Content": "Went with my daughter and a friend this past Sunday.  Tried a new brew . . . don't remember the name but it was very good.  The other two stuck to the bumble berry, which is always a great choice.  The shrimp and corn chowder was absolutely perfect.  Served at the right temperature and very tasty with the correct consistency for a chowder.  (Note:  I've had their French onion soup in the past and would have had it again but I also like chowders.  The French onion soup is one of the best I've ever had, made with beer.)I had the taco salad.  It was enough salad to feed my entire family.  I took the leftover home, had some that evening and the rest for my lunch the next day.Any food we have had from Fat Heads has been super fantastic.  The portions are huge.  The food is tasty and, given the portions, well worth the money.Our waitress was fantastic.  Very patient.  We were chit chatting and she would just stop over to check on us occasionally without being obnoxious about it.  We got there at about 11:45 and left at 1:45.  Not because of the service but because we were enjoying ourselves and nibbled away on the food.From a previous visit, my younger daughter has already decided that this is her new favorite place and where she is planning to come for her 21st birthday.", "Date": "2014-07-16", "Author_Location": "North Olmsted, OH"}, {"Author": "Ken H.", "ReviewID": "_bFssIv_yQG7bMuxEP5IaQ", "Overall": "5.0", "Content": "And to think I once believed micro breweries needed to be located in gritty urban neighborhoods or gentrified touristy areas to be considered \"serious\".  I was wrong.  North Olmsted is as suburbia as towns come and this brewpub blew away all my expectations of what a micro brewery could be.  Arrived with a party of 10.  We were split up at two neighboring booths but did not impede conversation and the staff did their best to accommodate us.  Just keep this in mind if you are bringing a large party.  This seems to be a popular place for large parties and I don't think they take reservations.With respect to the food, everything that came to our table was large and awesome.  No one had anything to complain about -- other than fact that maybe appetizers were not necessary after all!!  Waitress recommended a relatively new smoked brisket and cheddar sandwich that was a really nice alternative to a burger.  I had a chance to sample the Southside Slopes and that was a nice surprise as well.  Onion rings and fried mushrooms were nice starters.  Just remember -- the portions at this place are huge!  You will take home enough for next day's lunch.Not familiar with Fathead beer as they do not distribute to my hometown of Chicago.  I stuck with the Head Hunter IPA and would definitely recommend.Great food.  Great beer.  Really friendly service.  Incredible value for what you get.  I will definitely come back next time I am in town.  The only suggestion I have is that they enclose the outdoor seating area with a fence or greenery to make it more inviting.  No one wants to sit alongside a busy road.", "Date": "2014-07-07", "Author_Location": "Chicago, IL"}, {"Author": "Nick H.", "ReviewID": "6EKhx-Bke63trbhnCQ6P4w", "Overall": "5.0", "Content": "One of the best microbreweries in Ohio and easily the best place to grab food/drink in North Olmsted. I was here on Saturday for dinner and drinks and was lucky enough to snag two spots at the bar on a busy night. The decor is modern and the venue is huge. They have giant bottle caps with the iconic Fathead displayed throughout the restaurant. Service was pretty quick for how busy it was and everyone was friendly. They also have an awesome patio outside, and a billiards area great for parties. I started out the night with Zeus Juice, mistakenly not looking at the alcohol percentage before ordering. The Belgian Ale was over 10% alcohol and was served in a snifter. I took my time and enjoyed the great flavor, with hints of banana and clove. My friend and I split some of their full smoked wings. These are AWESOME! We could not even finish 12 between the two of us. Fatheads is known for having \"sandwiches bigger than your head\". Well these are easily the largest wings I have ever encountered. We got the medium and the honey chipotle - both delicious and tender. The honey chipotle had a bit of a kick to it, but I am a fan of spicy. I capped off the night with one of their award winning pale ales - the Trailhead. A great, crisp beer for the summer - and some of the proceeds are donated to the Cleveland Metroparks! They have a wide selection of house craft beers and a few seasonal rotating taps. They also have a great guest tap and bottle selection that changes often. If you order a bud light here, you may be asked to leave. If you have not been to Fatheads, get your butt up there for some award winning craft beer and huge chicken wings!", "Date": "2014-06-05", "Author_Location": "Lakewood, OH"}, {"Author": "Tim B.", "ReviewID": "7DiupBpVLJU-ZdZCDcWcyw", "Overall": "4.0", "Content": "I just had a sampler of their beer.  The bartender was great.  Interesting person to talk with who had an excellent knowledge base of the company, its history and their products.  The beers were all very good.  The blueberry was a surprising hit.  Not wicked sweet and tasted like beer, not fruit.  The place is huge so there's plenty of seating.  That's critical because the place rocks!  Constant turnover which was managed exceptionally well.I'm coming back for the food.  If they can do beer this well the food must be amazing!", "Date": "2014-06-09", "Author_Location": "Stratford, CT"}, {"Author": "Mike E.", "ReviewID": "lJDQan478sSF4dLc2HI5kA", "Overall": "5.0", "Content": "One of my top 3 places to go for a beer. Excellent selection of beers and food. Sandwiches are huge and the price is great. On my last visit we weren't too hungry so we just opted for fried pickles and their nachos (which use potato as chips) the nachos were huge and delicious. Their beer samplers are also a great addition for the ability to sample their craft beer and see which you would like to have. I ended up getting the Trail head pale ale, a great beer with some grapefruit and citrus notes which are perfect for summer! Overall the food I would give a 4 star but the beer made me go with the 5. Watching the world cup was also easy there as they have a lot of TVs and good seating to accommodate you.", "Date": "2014-07-11", "Author_Location": "Cleveland, OH"}, {"Author": "Scott K.", "ReviewID": "5urvjnJ3HFIXfjUjsRD8nQ", "Overall": "5.0", "Content": "This was a fantastic meal.  We ordered the cheddar bacon fries as an appetizer, and they were enough for four people.  I'm not a fan of the kind of oily \"nacho\" cheese you get from a place that sounds like Smaco Yell, but this melted cheddar was was real deal, and piled on with bacon to boot.  The generosity of this plate made me want to call my mother.I ordered the dry rub wings, which had a nice level of spice that grew as you ate them.  They could have perhaps had a little more saltiness overall... but let me tell you, I ordered six wings thinking I'd have to order more later and I was so very mistaken.  These wings are enormous things from albatrosses, with the whole wing-thigh combo.  Check out the picture I posted, I have never ordered wings like this.  Between them and the fries, I took two of six wings home, and I am not a man to leave a wing hanging.I ordered a root beer growler at the end of my meal, and after I got it home I discovered that it is a surprisingly complex root beer - absolutely worth trying, with a strong hint of vanilla and other flavors.  I find myself sneaking into the fridge to take a swig every time I walk by.With beers, growler, appetizer and two meals, it was a little expensive, but we got a hell of a lot for the money.We are moving to this side of town in the next few months, and on the day of our move, we're taking our heavy lifting buddies to Fat Heads.", "Date": "2014-06-02", "Author_Location": "Cleveland, OH"}, {"Author": "Bryan C.", "ReviewID": "tS_XQ6z9UH38NpoOHg4y6g", "Overall": "3.0", "Content": "The beer is awesome!! I can't say the same for the food... So I'm giving it a 3 star. The food was OK. Nothing great. I've eaten much better at different restaurants. Love the beer tho!! I would still recommend giving the place a try, just thinking I may eat a salad or something next time. Keep it cheap... Spend more of my money on the beer :)", "Date": "2014-06-19", "Author_Location": "Girard, OH"}, {"Author": "Jonathan R.", "ReviewID": "6j0Q0FpvuZLdUpaWDysNFA", "Overall": "5.0", "Content": "I'm from out of town and I may come here every day this week..I have so far and I'm not ashamed", "Date": "2014-06-04", "Author_Location": "The Strip, Las Vegas, NV"}, {"Author": "Rob S.", "ReviewID": "yh0nvaDu3ZPnTaLn3JyUaw", "Overall": "4.0", "Content": "Hell yeah, this is a great place. Hungover on a Sunday morning, kinda the last thing on my mind was a burger, but friends suggested this place and I'm not a big enough dick to outright veto a pal's suggestion. I am glad I went along with the crowd, because the food, beer, and service at this restaurant/brewery was fantastic. The \"Triple Bypass Burger\" cured all my ills and then some, complete with an egg on top, which basically made it a breakfast dish. So many places craft great burgers but use shitty buns, but here they used a nice and dense ciabatta bun that left zero of my fingers soaked in burger/cheese/sauce ooze. They will also let you sample up to four of their beers if you're indecisive about their selection (there were almost two dozen Fat Head's own brews on their beer list). All in all, a great place for bar grub to which I will definitely return.", "Date": "2014-06-02", "Author_Location": "Cleveland, OH"}, {"Author": "Gini J.", "ReviewID": "fegGYuI6naciN-dt98Xjag", "Overall": "4.0", "Content": "Let me start with a confession: I can't stand beer. It's an awful thing, I know. Particularly since my entire family are beer snobs. But as hard as I've tried, I simply can't stand the stuff.So the fact that I really like Fat Heads has nothing to do with the brew. Except on the word of my family, who all say the beer is GREAT.For me, Fat Heads is a comfort-food winner. Great sandwiches, great salads, and if you are in an artery-hardening mood you cannot beat their fried mushrooms or their onion rings. The building is HUGE, with a comfy, barnlike atmosphere. The bar is a great place to watch a game, and the restaurant area is filled with cozy booths. If you are looking for hearty sandwiches, this is your spot.", "Date": "2014-04-12", "Author_Location": "Cleveland, OH"}, {"Author": "Jen V.", "ReviewID": "LDWC4ReElov9O9E0A9uT2g", "Overall": "5.0", "Content": "If you want good beer and a really filling meal, this is your place! The beer is top notch and some of my favorites from around Cleveland! I was a server here for a little while when I was going to school so I have tried a LOT of things on the menu and know that the owners really take pride in their beer and the fatheads brand (I like that in a business).Here are just some of my favorites: The smokehouse wings might be my favorite thing on the menu. My husband is from the south and says that they are as close as you get here in Cleveland to some good bbq smoked chicken. The garlic fries, head hunter onion rings (spicy) and the Parma karma are my favorite apps. As far as the sandwiches, the steakout is my favorite although i really like the Bob and Martha too. They have a huge menu so you really can't go wrong. The only issue I have found it that it is difficult to find something healthy. Salads are an option but they are not nearly as good as the rest of the menu!Another plus is their bonus room which is a really fun way to spend the time when you have a long wait. I believe they have started having servers in there on busy nights so you dont have to crawl over people at the bar to get a drink! For sure a place to check out if you haven't already! My husband's family likes it so much, we go there pretty much every time they come in town from Kentucky..", "Date": "2014-04-16", "Author_Location": "Avon Lake, OH"}, {"Author": "Sarah D.", "ReviewID": "NvR-1mgac7tbkH9Vm3a-PA", "Overall": "5.0", "Content": "Went here for Fathers Day and the entire visit was great! Our server Ron was prompt and knowledgeable. He greeted our table immediately and had our drinks to us shortly afterwards. We ordered the nachos and wings as a starter and my husband had the pastrami sandwich and I had the ribs. The food was absolutely delicious! I told my husband it was one of the best meals we have had for less than $100! We will come back and we will recommend this place to our friends! Thanks again Ron!", "Date": "2014-06-16", "Author_Location": "Amarillo, TX"}, {"Author": "Tiffany M.", "ReviewID": "L4v4UGik3uWHdFt3LBpX6w", "Overall": "5.0", "Content": "Discovered this restaurant after moving to the area. The food is so good and the beers are amazing! Haven't had a bad experience. Great place to gather with friends or the family!", "Date": "2014-06-08", "Author_Location": "North Olmsted, OH"}, {"Author": "Punit S.", "ReviewID": "jEv3lTpaTfz3Rg-3A-76lQ", "Overall": "5.0", "Content": "Good beer and food selection! Waited for over an hr for a table on a Friday night...but it was worth it.... I think this is a nice place to go with friends for drinks and dinner. This was my first time here but, yes I would come here again, and be willing to wait again if I had to :) I'm relatively new to Ohio and liked this place. It's pretty big and there's a huge parking lot.Staff is genuinely caring and helpful. Nice place all around.I'm told the head hunter beer is what they're know for and the burgers with regards to food. Had the beer, IPA, it was good - and I'm not a beer person. I got a buffalo chicken sandwich, was good too. Recommend you check it out!", "Date": "2014-03-01", "Author_Location": "Bethlehem, PA"}, {"Author": "Jackie C.", "ReviewID": "7uX_yC_tXZeXSpgMMridsQ", "Overall": "5.0", "Content": "BEST reuben! The portions are HUGE. My friend had the taco salad and had leftovers for a solid 2.5 days.Awesome panini's and cool atmosphere. You seriously cant go wrong with anything on the menu.A+ in my book.", "Date": "2014-03-25", "Author_Location": "Strongsville, OH"}, {"Author": "Teejay B.", "ReviewID": "ujlK9rQTaoeuhQC2dxAWOA", "Overall": "5.0", "Content": "What can I say about Fat Heads that hasn't been said already? It's delicious with an excellent beer selection. They truly take a creative spin on beer flavors and labels. The best advice I could give is come hungry! Sandwiches literally as big as your head. Hence the name...I also recommend the Bumble-berry beer. It's fantastic! Blueberries come standard in every glass and it's so much fun to watch them rise and fall in the beer. I am easily amused if you couldn't tell... The reviews are true! Delicious and probably not nutritious, but who cares about that anyways? Not me, that's for sure. Great for groups and just hanging out while drinking exuberant amounts of unique beer. Responsibly of course!Realistically, any restaurant that puts pierogis on anything is ok in my book!", "Date": "2014-02-17", "Author_Location": "Brunswick, OH"}, {"Author": "Alex W.", "ReviewID": "rC241PknzMmxUUWJ8C9VIQ", "Overall": "3.0", "Content": "Five stars for beer, two stars for everything else.----Let's cut to the chase: the reason to come to Fat Heads is the beer list--they have a nice combination of their own brews and other local craft beers on tap. Their Head Hunter IPA is particularly worthy of trying, but all the Fat Heads beers are good.I'm not sure what the people who think Fat Heads has great burgers are thinking: in my experience, they are average at best. Tremont Tap House, Nano Brew, Hodge's, B Spot, and TownHall all have far better burgers as well as beer that's every bit as good as Fat Heads. On one visit, I was also served a pathetically wilted salad, which there is just no excuse for.Service is average. For being a brewery, many of the servers seem to know astoundingly little about beer. That said, food and drinks were delivered promptly and as ordered.One of my main complaints about Fat Heads is the space. It's huge, and not in a good way. It's awkwardly laid out, there are TVs but you're likely to find yourself sitting in a corner where you can't see one, and some of the park-bench style seats are neither comfortable nor interestingly designed. Before Fat Heads moved in, this place was a grocery store/farmers' market hybrid, and it shows; the atmosphere just can't compete with other brewpubs in Cleveland.Worth it if you're in the area, at least for the beer, but definitely not worth venturing out to suburbia for on its own accord.", "Date": "2014-01-20", "Author_Location": "Cleveland, OH"}, {"Author": "Shawn M.", "ReviewID": "jhaDWqZW88H7RTFvuakkZQ", "Overall": "5.0", "Content": "Amazing beer list. Along with their home brewed beers, they also have a good list of ones that are not in house. Their food is inexpensive and very filling. My only gripe is that they give you chips with most plates and do not allow substitutions. Overall, very good there! Expect a wait though, because they are generally very busy.", "Date": "2014-05-21", "Author_Location": "North Olmsted, OH"}, {"Author": "Chrystal F.", "ReviewID": "UHRU7gnlgs4SLwQdal12iw", "Overall": "1.0", "Content": "An hour and a half wait for an out of towner, that beer better have been touched by jesus... They should open up a second location because this brewery was as packed as a school dance. We ended up going next door.", "Date": "2014-02-09", "Author_Location": "Salt Lake City, UT"}, {"Author": "Candace M.", "ReviewID": "aovV5NKkUKLdDWO2X3rXaQ", "Overall": "3.0", "Content": "Go here hungry. You will not be disappointed by the portions!Fat Heads is about 40 minutes away, but I was promised a delicious hamburger and draft beer, so I was down to try it. I was surprised by how big the location was when we walked inside. It felt like we had to walk 5 minutes to get to a table! Despite that, the place was clearly busy. When the patrons at the table across from us left, the table was cleaned and new people were seated in a matter of maybe 3 minutes. Impressive!Once seated, we had to dive into the enormous menu. I found myself skimming in an effort to read it all; I still think I skipped one whole page. I was overwhelmed by all of the choices!Eventually, we ordered the shrooms appetizer. I'd read about the spicy onion rings and the menu made it seem like the shrooms were as well; the waitress assured me that they had a bite, but weren't spicy. I was shocked when we received this huge, overflowing, overstuffed basket of mushrooms. They were delicious, and we couldn't finish it if we had any hope of eating any of our dinner. I would say, though, that they weren't spicy at all. No complaints here, but good to know.As our drink, we split a Bumbleberry Honey Blueberry Ale. It was pretty good; the fresh blueberries in it were a nice touch!My hamburger (The Parma Sutra) was okay. I ordered it medium rare, and it was almost certainly well done. It was quite dry, and not much different than the dry hamburger I had the day before at the Winking Lizard. I was hoping Fat Heads would be a step up. The fries, on the other hand, were absolutely delicious. I loved their seasoning.I'm not convinced that Fatheads is worth a 45 minute drive. I would, however, be willing to try it again, and I can definitely see the appeal. Hopefully next time is the experience I was expecting!", "Date": "2013-12-17", "Author_Location": "Columbus, OH"}, {"Author": "Rob P.", "ReviewID": "84Ay9sNX_wn3fVxkDg2IuA", "Overall": "4.0", "Content": "I went to the Fat Heads in Pittsburgh a few years back and enjoyed it. And since Head Hunter IPA has gone viral in the craft beer-world, I decided I needed to check out the Cleveland location and see what else they were brewing up.While the Pittsburgh location is in prime real-estate down on the South Side, the Cleveland location is out in a nondescript suburb, next to a Dairy Queen and in front of a strip mall. So minus one star for the lame suburban location with no decent transportation except for driving (a real problem when going to a brewery to drink a lot of beer), but once you get over that, everything else is pretty great.The menu is mostly bar-type food - sandwiches, wings, etc. The Headwiches are excellent. The homemade chips that come with them are OK, though I typically prefer fries. Overall the food is above-average for what it is, but hardly gourmet.Atmosphere inside is OK. The bar area is great and you get clear views of the brewing room and fermentation tanks as you drink; the \"dining room\" area feels a lot less inviting for some reason. The real reason to come to Fat Heads is for the beer. Lots of great stuff on draft. Most of it is way better than your average Rock Bottom or Gordon Biersch type brewpub. They had a cask version of Head Hunter as well, which was a pleasant surprise.", "Date": "2013-11-27", "Author_Location": "Washington, DC"}, {"Author": "John s.", "ReviewID": "QHxN9HwMhdZndQCL2iQipg", "Overall": "5.0", "Content": "Out of town guy here. First off this place was awesome. One of the local recommend to me since I love craft beer. Got here super selection choice of local brewed beer and it was great.  I had the class Ruben sandwhich and went perfect with my beer.  Definitely go during happy hour which ends at 7pm  dollar off of all draft. Oh if you like spicy stuff as for their in house spicy sauce.  A good heat to it. Ps awesome customer services", "Date": "2013-12-18", "Author_Location": "Dallas, TX"}, {"Author": "Alyssa G.", "ReviewID": "AGigRbSiF3sD2RczprOepw", "Overall": "4.0", "Content": "I had friends in from out of town and one of them recommended we all go.  She said it was the most visited bar in Ohio according to BuzzFeed.  So when they got here we decided to go for lunch.  I love craft beer and have had their beers before but I ordered the Goggle Fogger - a german style beer and fell in love! It was really good and perfect for an afternoon.  We ordered their deep fried perogies and fried mushrooms for appetizers and after they arrived I knew we were in the right place for lunch! The deep fried perogies were to die for! I could of ordered them for my meal and been in heaven.  Then the pile of fried mushrooms we got was enough to feed a party of 20.  After 5 of us ate them, it looked like we hadn't even touched them.  If I had to guess we probably got 75 mushrooms.  I ordered a buffalo chicken wrap with the chips for my meal and it was HUGE! Every meal you order from here will be as big as your face if not bigger.  Definitely enough to split if you decide to order appetizers.  I loved my warp - had to get some extra hot sauce and ranch but still was really good.  Their homemade chips were great too - I love them in BBQ sauce! I wouldn't say it was the best I ever had but it was definitely satisfying.  Some of my other friends got a Pulled BBQ Pork Burrito, Philly, Egg Sandwich and Salad and all enjoyed their meals but none of us loved them as much as the perogies or thought it changed our lives.  It was all good though! Our server was fantastic and the environment is perfect for the place.  I would definitely go back again and again and keep trying different dishes.  Definitely come hungry and thirsty and you won't go wrong.", "Date": "2014-01-09", "Author_Location": "Lakewood, OH"}, {"Author": "Brian M.", "ReviewID": "wRAHqNqdicNDJYzRGg8mhA", "Overall": "5.0", "Content": "How have I just realized that I never reviewed this place.  As far as what I ate when I was there over the summer, I honestly don't remember but I do remember it was delicious and I loved the home made chips that came with it.  Our server was good as we had no complaints about that.  The beer.....  Perfect.  I love all of their beers, does this place make even one beer that is not good?????  As I'm a huge hop head, I love all of their IPA's.  They really are the masters of hoppy beers.  Of course, head hunter is always perfect.  My favorite beer I've ever had, and I've had beers from all across the country and the world, and the best is by far hop juju.  It really is the perfect beer.  I can't say enough great things about Fat Heads, and I will be back soon.", "Date": "2014-03-24", "Author_Location": "Cleveland, OH"}, {"Author": "Britney G.", "ReviewID": "wWERFQdd8kW8g1YbJcUovA", "Overall": "2.0", "Content": "Farrrrrrrr from impressed. You can get better food from anywhere. The place was really cool, large, and festive but the food was very mediocre. No one finished their food or took boxes to go. When this happens with my family you know we were farrrrr from impressed. Burger buns were hard and the cheesestake was not impressive. What sucked so much is that we were dying to eat here and left wishing we hadn't wasted our money.", "Date": "2014-04-15", "Author_Location": "Cleveland, OH"}, {"Author": "Andrea Z.", "ReviewID": "nfohS8nufqHHWf9zRhcgcQ", "Overall": "3.0", "Content": "Fatheads is a decent spot out in the west burbs to go if you are looking for a casual spot to meet up for some food and beers. Huge bar area, huge dining area, huge menu, huge portions. Sensing a theme here? This place has an almost annoyingly huge menu. It takes you 15 minutes to even look through all of it, another 10 to decide what to order. Pizzas are huge, sandwiches are huge. Definitely enough to share unless you're a yeti. The food that we've had has been pretty good and it's reasonably priced. Sometimes the service at the bar can be slow. Getting a seat can take forever. They'll give you a little pager thingy but it seems like a year sometimes when it doesn't seem like there are that many people waiting. It can be really really loud in the bar area too so I wouldn't take anyone who's hard of hearing there on a Saturday night. There a few booths in which the air conditioner will drip all over you in the summer. Look up before you sit down. Some of the food is over-spiced. The spicy pulled pork is, as some others have mentioned, SO RIDICULOUSLY hot. Even Sean who generally likes a good forehead sweat and can eat some spicy stuff was not feeling it.The beer is just ok. Usually there are a couple of their house brews that I like. The scotch ale is nasty and Sean who is a beer snob just isn't that impressed. I however, love the Bumbleberry. Call it girly if you want but don't knock it til you try it. It's not a fruity -tasting beer. Just the slightest hint of blueberry and it's fantastic. Overall, this place is decent. It's an easy meetup spot for a lot of my peeps scattered over the west burbs. It's not an awesome spot, but it is A-OK with me.", "Date": "2013-11-12", "Author_Location": "Lakewood, OH"}, {"Author": "Denise C.", "ReviewID": "VAXD9aEZC3QE0YWHBS_o5g", "Overall": "5.0", "Content": "Stopped here on a solo venture to Ohio and knew I had to hit up this place. It is sports bar, brewery, and home to ridiculously large sandwiches - three things with which I can easily fall in love, but be super critical about as well.Fat Heads did not disappoint. Though busy, I got a seat at the bar and was greeted almost immediately. The tap list was extensive, with not just Fat Heads beer but a nice, varied selection of other beers too. I nearly fell out of my seat when I saw they had FFF Gumballhead on tap and, given my irrational fear of kegs kicking before I get to sample, I ordered that first.The menu was just as extensive as the beer list, but I knew I had to go with the special: kielbasa, pierogies, mustard, Swiss, and kraut - all on one hero roll. Given the location just outside Cleveland, I knew it would be done right, and many of the ingredients were locally sourced. The sandwich was a behemoth and I didn't even get through half of it, but it was very good. All the components of the sandwich somehow balanced each other out despite being a total gut bomb. Homemade chips were tasty.My tab with the sandwich and  three or four beers was incredibly cheap - I don't think I paid more than $30. As someone who's used to NY/NJ prices, it felt like highway robbery! I love visiting my friends in Cleveland, but now this will be my excuse to return.When you go, don't forget to get your four-packs of Head Hunter or fill your growler!", "Date": "2013-10-06", "Author_Location": "Jersey City, NJ"}, {"Author": "Jeffery H.", "ReviewID": "vvBVc_SiJ94iFlVTrPu9PQ", "Overall": "4.0", "Content": "Great place for bar food, beers, and socializing.  The staff is very friendly and knowledgeable of their beer selection.Beer selection is top notch, not only with their house beers, but their visiting taps are great too.  Recommend the Head Hunter IPA and the Foggy Goggles (if you like a hint of banana in your beer).  The smokehouse wings are phenomenal and their sandwiches are top notch.  Would definitely frequent if I were a local!", "Date": "2013-11-18", "Author_Location": "Fredericksburg, VA"}, {"Author": "Kaitlin B.", "ReviewID": "CkEHOh3zBQ9SrpUj1J9kLA", "Overall": "3.0", "Content": "I like to come to Fat Heads when I am in town visiting family and friends. The food, honestly, is pretty average. They do have a huge menu though, so if you are looking for a place for a big group with varying food preferences, Fat Head's is a good choice. The menu includes an array of chicken wings, salads, sandwiches, wraps, burgers, and pizzas.  I enjoy Fat Heads more for the beer than the food. They have a daily draft list, along with an extensive list of their own brews. Their local brews include a variety of stouts, IPAS,  porters, pilsners, and wheat beers. I am a fan of the Bumble Berry beer, which despite sounding super girly, is a tasty beer. I also like that their beer list includes different food pairings to go along with the beers.  Service is always great here. The servers are very friendly and efficient.", "Date": "2014-01-04", "Author_Location": "Manhattan, NY"}, {"Author": "Dave M.", "ReviewID": "Pl24yxJz54viRhBgNe7_eA", "Overall": "4.0", "Content": "Maybe it was an anomaly, but the root beer floats are pathetic. The root beer to ice cream ratio was completely off. A tall glass of root beer with a single scoop of ice cream floating on the top. That is not a root beer float, that's an ice cream float. Thumbs down Fatheads. However your buffalo wings a super yummy.", "Date": "2014-04-12", "Author_Location": "Cleveland, OH"}, {"Author": "Megan S.", "ReviewID": "iMK70jknjgsrhbJ_scUkbw", "Overall": "3.0", "Content": "So the only reason this place gets 3 stars is because of the smoked wings. They really are fantastic and not your average wing. The beer selection is very good as well but the wine is something to be desired. I get that this is a brewery though so I can forgive the wine. We tried a grilled cheese that had goat cheese on it, not the worst but absolutely not the best. We also tried some regular wings and they were sub par. I had the sandwich called the 'bob and martha' and it was over cooked. The pastrami was better than the corned beef (which you had to pull just to take a bite) and the peppers were a good touch. It was so dry though that I couldn't even eat half of it. So if you do go here do yourself a favor and get a beer, some homemade chips with sauce, and the smoked wings. Put the sauce that comes with the chips on everything. It has a pretty big kick so watch out but I could eat it off my shoe it was so good.", "Date": "2013-12-17", "Author_Location": "Cuyahoga Falls, OH"}, {"Author": "Winston C.", "ReviewID": "n69gTovXnwMAbculzDYB-Q", "Overall": "5.0", "Content": "Beers are great, food is great. Expect a wait as this place is popular. Parking lot is too small but be patient because the food and drink makes up for any flaws.", "Date": "2014-03-24", "Author_Location": "Cleveland, OH"}, {"Author": "Nic K.", "ReviewID": "vZQqyyZwPrT9Na2K0SiC-Q", "Overall": "4.0", "Content": "We've been here several times and have built a solid feeling for the place. The food portions are HUGE, and is generally really tasty! Wait staff is hit or miss. We've had both very friendly staff and the absolute worst staff you could imagine. Being a beer snob, I have to say their beers are fantastic! They have a very wide variety of styles to suit all drinkers. One negative is they can be VERY expensive! Both beers and food seems to be overpriced in my eyes.", "Date": "2013-10-17", "Author_Location": "Brunswick, OH"}, {"Author": "Steve L.", "ReviewID": "VKnq2JUCT2iDKF3nyss42A", "Overall": "5.0", "Content": "First time here happened to be Friday the 13th. It was a late bday dinner with a good friend and my daughter. She left earlier, then the taste testing started :)Needless to say, beer selections awesome. The Pumpkin seasonal is real real good. Head Hunter is my go to. The food selection is overwhelming, not in a bad way, its just huge. I had a chicken sandwich, it was pretty amazing tasting, cant wait to go back. They definitely give you a bang for your buck. They're no slouches on their portions, that's for sure. The service was excellent, friendly atmosphere and cool environment. Friends, families, co-workers, any situation you'll fit right in. All the merchandise gives it a cool look. It smells very strong like hops when you walk in, I wasn't attracted to that. Not too appealing. Id suggest sitting in the back section, if possible. Awesome place though, definitely do attend, I know ill be back. Its not the last they've seen of this man!!!", "Date": "2013-09-14", "Author_Location": "Cleveland, OH"}, {"Author": "Kathleen M.", "ReviewID": "9tFTag8-hV5sB2V_VE-ZbA", "Overall": "5.0", "Content": "Great food, friendly staff, clean environment and a large variety of food and beer! Enjoy the patio when the weather permits.", "Date": "2014-03-10", "Author_Location": "Rocky River, OH"}, {"Author": "Adrianne S.", "ReviewID": "1TrpJM6SgcUDGIhE4bvvwA", "Overall": "4.0", "Content": "Absolutely love our server Catie. She is a cutie petuttie with a great personality and good service!", "Date": "2014-06-08", "Author_Location": "University, Cleveland, OH"}, {"Author": "Kim T.", "ReviewID": "MyxK3coQQbrNjNh5BWLdmw", "Overall": "3.0", "Content": "The beer selection is 5 stars. The food is...eh. The smoked wings are good but not much else. They really need to step up the menu to include meals that represent quality over quantity. Whenever I browse the menu for something that sounds appetizing, I feel like I'm choosing what kind of heart attack I'd prefer. I mean, I love some fried food but not everything needs pulled pork or buffalo chicken on top. I would love lighter, or even tastier menu options so that I can save room for more Fatheads beer!", "Date": "2014-01-31", "Author_Location": "Cleveland, OH"}, {"Author": "Grant W.", "ReviewID": "CTidZ2jsyHHHzXkF6GPX6w", "Overall": "2.0", "Content": "Heaping portions of really average, somewhat tasteless food -- that was our experience of Fat Heads. If you go for the beer (and we didn't), it may be a different story. Food was really uninspired in all 4 of our meals. Just really MEH.", "Date": "2014-02-25", "Author_Location": "Avon Lake, OH"}, {"Author": "Kristen W.", "ReviewID": "KpHEvn3PctBchECtgUuTBQ", "Overall": "4.0", "Content": "I hate to admit it, but I could write a small book report on things I've tried and snuck off of my friends and families plates here. I'm a Fatheads fan!First of all, if you come on a Friday or Saturday night, expect a wait, like upwards of 45 minutes. But don't let that scare you, this gives you time to hang out at the huge bar/standing area and sample some fine brews! My favorite is the bumbleberry (light and refreshing pale ale--- with blueberries in it!) and I've heard rave reviews about the IPA's.This is a good place for a date night or with a group, either way you need to come here hungry! Okay lets talk FOOD! As an appetizer you should get the fried mushrooms, they come with an amazing horseradish dipping sauce and the portion is huge (as it is for all the food here). If you listen to anything I say, order the smokehouse wings! These are the best smoked wings I have ever had. When you order remember that they are whole wings, so when you order 6 you are getting 12 huge chicken wing pieces! Stick with the Beasty BBQ, they have a serious kick! And you won't have to feel so quilty eating these because they are smoked not fried! Moving on..... the headwiches are huge (no surprise here), the briskett and perogi headwiches are standouts.Minus one star for hit or miss service.... emphasis on the miss.", "Date": "2013-06-13", "Author_Location": "Strongsville, OH"}, {"Author": "Cassandra K.", "ReviewID": "chsM38GBr-lAY9sjcPmFPA", "Overall": "5.0", "Content": "Wonderful house beer selection; as well as beers from other breweries. Onion rings with killer ranch are SPICY and delicious. Hot pretzel sticks with dijon are great. We've eaten almost all of the different sandwiches and they are all fantastic! Favorites are Southside Slopes, any of the ones with pulled pork, Bob & Martha and the Goonie Bird.", "Date": "2014-04-05", "Author_Location": "Lakewood, OH"}, {"Author": "Jason S.", "ReviewID": "JtUBdZ3IckvM3yHkuSY6GQ", "Overall": "3.0", "Content": "It's a perfectly cromulent brewery. That's the best I can say. It's a huge, LOUD space, with seating for a couple hundred, along with a smallish patio outside for a bit more seating. Pros:- There is a large and diverse beer selection. They've got quite a few of their own beers. I tried several, and they were all OK. Nothing special, and nothing to write home about.- The food portions are ridiculously large. Share something with your spouse. Neither will go home hungry.- Service was fine, aside from a lack of knowledge of the beers.Cons:- The menu is so large it's convoluted. They could certain stand with simplifying some things and making it both more streamlined and easier to read. The beer descriptions were hard to make out - and there were some on one sheet and some on another. - The server wasn't willing (or able, perhaps) to tell me much about the beers. I'm a huge beer geek, and he could basically read the menu descriptions to me. That's not enough at a brewery.- I had a bacon onion ring cheeseburger. The onion rings were essentially blackened discs of onion batter - and were far too overcooked. Shouldn't have left the kitchen.- The kids menu was pretty bad. All the basics, but his pizza was a sad little affair that I felt bad for him having to eat. He's 2, so he isn't picky, but have some pride, folks.", "Date": "2013-06-07", "Author_Location": "Cleveland, OH"}, {"Author": "Little King K.", "ReviewID": "FiQ66LJa6-zVJCGymUhKlA", "Overall": "5.0", "Content": "FANTASTIC food and beer. I recommend the beer sampler, and the French onion soup. The sandwiches and wings are delicious. Just beware: they have a very strange potato policy about not allowing substitutions. That's ok, though, because their house made chips are AMAZING. Also, my favorite waitress is a woman named Shelby. I highly recommend you request her for the absolute best service you can ask for. A+", "Date": "2014-02-14", "Author_Location": "Olmsted Falls, OH"}, {"Author": "Dave P.", "ReviewID": "STlbS6HyfQXfbBmx4xGxCA", "Overall": "4.0", "Content": "I love FatHeads! The food comes in large portions, and is always top notch. They have a huge menu with a lot of options. The only catch is you cannot sub fries for chips, which is a bummer. No one wants chips... Would be 5 stars otherwise!None the less, if you need a great place to eat- go to FatHeads.", "Date": "2013-08-04", "Author_Location": "Lakewood, OH"}, {"Author": "Joe Y.", "ReviewID": "GSQSj3Qg88mQuGsrgvahNw", "Overall": "5.0", "Content": "Short and simple...hands down my favorite brewery to visit! Love the beer, so many food choices and great service. Can't find anything to complain about, I don't live in Cleveland and I've visited about 8 times. I really wish we got a Fat Heads in Buffalo!", "Date": "2014-02-22", "Author_Location": "Buffalo, NY"}, {"Author": "Debi S.", "ReviewID": "NGicVoTRQJuxZmynPLXC1A", "Overall": "5.0", "Content": "We went yet again and had the most awesome waitress. Carmella. She was such an upbeat pleasant person. Very engaging and attentive. Thanks to her suggestions she saved me from burning out my taste buds. She was patient and attentive with the little one and an absolute joy. I wish more wait staff were like her. The food was delicious, as always. But she enhanced our dining experience greatly. Thank you Carmella for the awesome service and for saving me from the killer sauce!", "Date": "2014-02-02", "Author_Location": "Vermilion, OH"}, {"Author": "S L.", "ReviewID": "hPeJeqUMJqS4qUPOOvb24A", "Overall": "3.0", "Content": "Food is phenomenal and the beer selection is very good. They brew their own beers. I recommend the bumble berry, which comes with fresh blueberries floating inside the beer. The service however is very slow here. The wait to place an order, get more drinks, and get my check was unbearable. Dinner took about 2 1/2 hours on a Thursday at 7pm. Overall I would check out this place if you have never been, but make sure you schedule yourself a lot of time. You are not going to be in and out of here.", "Date": "2014-01-30", "Author_Location": "Cleveland, OH"}, {"Author": "Erin B.", "ReviewID": "aBVbdsVuZ5Kc_JMY23luDg", "Overall": "4.0", "Content": "Service is good.  Beer is good. Food is good. If you're looking for some creative bar food with a few good beers to wash it down this is a good place to go in the burbs.  The place is pretty big and sat our party of 12 pretty much right away.  Even with a large group our service was fast and server was attentive and friendly.", "Date": "2013-06-10", "Author_Location": "Lakewood, OH"}, {"Author": "Erin R.", "ReviewID": "AQ4IGI81k_s0oE5VMIIk5A", "Overall": "3.0", "Content": "I've heard a lot about this place - mostly from my Pitt friends. Before we moved from CLE, I had to try it out. Disclaimer: I am not a huge beer fan. But, I did really like the blueberry beer. They even had some blueberries floating in it! Cute. :) The Boy and I both ordered burgers. The fries that came with them were perfect. The burgers were just OK.... they should probably focus less on making them HUGE and more on making them have huge flavor. I wasn't the biggest fan.", "Date": "2013-04-22", "Author_Location": "Billings, MT"}, {"Author": "Kyle S.", "ReviewID": "yTwnIXtrygn5Soj2JT1VkA", "Overall": "1.0", "Content": "I must have been here on the wrong day. We were out shopping and decided to stop in for a burger. The place was packed and it was pretty cool inside. I don't know what my burger was called but it was just a basic bacon cheeseburger nothing fancy. It took almost an hour to get our burgers and about an hour after eating it I was sick. After my first bite I said it tasted kinda funky but I kept eating it. That was a big mistake. Several of my friends go here often and love it. They say the food is usually great and they have a huge selection of craft beers. I'm not one to blast a place with one star reviews but after a good 24 hours with my face in a toliet it's pretty tough to give them anymore.", "Date": "2013-03-26", "Author_Location": "Cleveland, OH"}, {"Author": "Julie D.", "ReviewID": "uWKcQBIoWCMLRHaQ4yzFog", "Overall": "5.0", "Content": "Food and beer was phenomenal!!! Been raised in Cleveland majority of my life and just found out about this place from a bartender when I went bowling last night... so glad she suggested this place... Their burgers were big and juicy and full of flavor!!! I am so satisfied at the food, beer, and service given to me tonight... would highly recommend!!!", "Date": "2013-12-18", "Author_Location": "Cleveland, OH"}, {"Author": "Brian B.", "ReviewID": "B1n4Rab4H-NBGPz_ZxvZYA", "Overall": "4.0", "Content": "I'd had their beers around town before but I finally went to the \"saloon\". It was much more open and spacious than I expected. Lots of people and moderately noisy, but I had no trouble moving around or hearing my booth-mates.My girlfriend and I met up with 2 friends who already had a table. Unfortunately they had waited 45 minutes to get it, Thursday ~7pm. They didn't seem too happy about that.However the menu was big, the service was timely, and the beers were great. Actually the menu was almost too big. I finally decided on the cheesesteak sub due to the superlative description. It was surprisingly fresh and non-greasy. However the taste was a bit bland, and honestly with a cheesesteak I was actually hoping for a little bit of grease. For some reason they would only give me potato chips (fries were ~$4.50 more!) even though my buddy got fries with his burger. Thankfully the chips were good, thick-cut and extra-crispy but not burnt at all. Also got the blueberry cheesecake bread pudding, which was awfully good but could have used some actual blueberries instead of just sauce drizzled on top.The highlight is really the beer. They brew a full spectrum from hoppy to sweet, from thick to refreshing. I tried the Milk Stout which was the creamiest beer I've ever tasted, and the Sorcerer was a respectable dark Belgian strong ale. A friend had some kind of summer IPA that was crisp and fruity. All delicious!I might go back if I know I can avoid that long wait for a table. Otherwise I think I'll just buy their beer at a local shop.", "Date": "2014-03-07", "Author_Location": "Cleveland, OH"}, {"Author": "Kristine D.", "ReviewID": "8yDi0jfRvH4OUOa8vpiSdg", "Overall": "4.0", "Content": "Huge portions! You certainly get more than you pay for; I always have leftovers! The menu here is delicious and I have yet to order something I don't like. The beer selections are equally great (the Bumbleberry is outstanding). There is certainly ample seating...the place is huge inside, with most seats having views of the large screen tv's to watch games. I have to say I am slightly disappointed by the patio, as it feels like a slightly neglected space. They could have put some touches like lighting and decor out there and some sturdier tables (with umbrellas), but I guess they spent the bulk of the money decorating the inside. Overall, a great place for dinner and drinks with friends...certainly a better place to go with a group of people, as it's not really a \"date night\" type of place.", "Date": "2013-06-19", "Author_Location": "Cleveland, OH"}, {"Author": "Will S.", "ReviewID": "cyVmYktJxr5KkvmBK1JxYg", "Overall": "5.0", "Content": "Been here weekly on Wednesday nights after my frisbee games with teammates and the service has been stellar. Before our season started, our captain called them to make reservations for 10-15, every Wednesday at 9:00 pm. Among my teammates and I, we've ordered nearly 100 entrees, 100-200 beers: ALL of our orders have come out correctly. Separate checks ? No problem, we've had separate checks for each of us all of us every time, and we've billed correctly every time. Our servers (Kim and there's other I'm forgetting) all have been excellent, bringing water refills without asking, remembering orders, they do a great job. Looking back, it's incredible that they haven't erred even once. The sandwiches - triple bypass, cheesesteak, as well as others I'm forgetting - were all solid, none of the ingredients tasted canned. You also receive a generous size as well as potato chips which aren't greasy. The only related problem was once out of the 6-7 times, we had to wait 20-30 minutes. We'll be back here next year and if I'm around this side of town between then, I'll stop by.", "Date": "2013-08-03", "Author_Location": "Cleveland, OH"}, {"Author": "Brad C.", "ReviewID": "nA5LhdZkvw695OY8DPk2iw", "Overall": "4.0", "Content": "First time at Fat Heads. I went in a large party and they accommodated us well. I stepped outside of my Paleo and Gluten Free diets for this place.For an appetizer we had the Headhunter Onion Rings. Excellent! The breading is made with one of their award winning IPA's and a little spicy-- okay a lot of spice. They are very tasty, with an extra kick from the horseradish dipping sauce.Everybody's entrees were great with no complaints from our 15+ people. I had the Brisket Sandwich which was the size of my head... Literally and figuratively. The lady had the Fat Italian. Both excellent choices. Order the brisket with extra sauce for more enhanced flavor. The sandwiches are accompanied with a heaping portion of really good homemade chips.The beers are definitely award winning. I had the bumbleberry beer and tasted a few samples of the others on the extensive beer menu. I can't wait to try the others.The only downfall is the place is SUPER loud. Almost headache loud.  The Reese's Pieces Bread Pudding wasn't worth writing home about.Definitely a must go if you're in the area. We will be back for sure.", "Date": "2013-02-20", "Author_Location": "Elyria, OH"}, {"Author": "Diana M.", "ReviewID": "oi5lgi4zvi3N4siUGum1vg", "Overall": "4.0", "Content": "I was really surprised at how big their menu is here and at how good the food was!!  Huge portions and lots of beer options.  This was definitely a nice addition to N. Olmsted.It sounds like this place still gets packed on the weekends so be prepared for a wait unless you come in at an off time.", "Date": "2013-07-03", "Author_Location": "Jacksonville, FL"}, {"Author": "Heather B.", "ReviewID": "VtgcG0Yk6a9fDFBG-3jW7g", "Overall": "4.0", "Content": "Great beer. Great atmosphere. The food is amazing. Burgers, headwiches, salads, wings, shrooms. Patio is a great place to enjoy in the warner weather.", "Date": "2014-01-18", "Author_Location": "Avon, OH"}, {"Author": "Greg S.", "ReviewID": "SFyNOKCwvlamoV_7dTYMvw", "Overall": "5.0", "Content": "Just went to Fat Head's for the first time. It was a very pleasurable experience. The atmosphere and design are great. It feels very open. Lots of seating and tons of bar space. I had the DLA sandwich, served hot, and it was delicious!  Holy smokes, the Hop Ju ju is excellent. If you like the head hunter, you'll love that one. Make sure to get a headwich if you're going to be drinking a few of their \"head\"ier beers!", "Date": "2014-02-10", "Author_Location": "Canton, OH"}, {"Author": "French C.", "ReviewID": "du5hP1fp_JA7Ek3CQVAuJA", "Overall": "3.0", "Content": "I came for the fatter version of Peter Griffin's head and stayed for the great beer lineup.Sitting a the bar during happy hours and/or a baseball game is nearly mission impossible.", "Date": "2013-07-03", "Author_Location": "Montreal, Canada"}, {"Author": "Alexis H.", "ReviewID": "4-_Re-dTrnsm8egO23aQ-A", "Overall": "4.0", "Content": "Having limited access to some of their bottles here in Indy, I wasn't sure if I'd like their beer much. An in-person visit sold me though. Noteworthy foods: Onion Soup (Seriously I can't say enough good things about this soup-it was AMAZINGLY yummy!) The Parma Karma was good and a perfect pairing with lots of beer samples. Beer faves: Spooky Tooth, Trail Head and IBUsive IPA. Went home with a growler of Trail Head Pale Ale. Bar seating was loud and crowded, due to the football game, but we had no issues getting seated and our waitress was attentive and nice. Woot!", "Date": "2013-10-24", "Author_Location": "Indianapolis, IN"}, {"Author": "Caleb K.", "ReviewID": "uLfRT68HdvQO2TQPin7RlA", "Overall": "2.0", "Content": "Beer is fantastic but the bartenders couldn't care less about their customers. I'm here from Chicago so rest assured I do not hold a grudge against this establishment... The bar tenders seemed like robots who cared little for human interaction. 4 of our 5 beer orders were taken with no words. At the end of our evening the bartender was eating behind the bar and checking out a fellow employees new prescription. Weird. Never felt like less of a guest than this. BTW, the beer is pretty good. Just don't expect to be tested like you're welcome. Also, bar back guy is awesome.", "Date": "2013-12-30", "Author_Location": "Elmhurst, IL"}, {"Author": "Jay D.", "ReviewID": "F0GdmhuzHyYnOHlyOS4EgA", "Overall": "4.0", "Content": "Good beer...good food!  Go!Big sandwiches", "Date": "2013-02-18", "Author_Location": "Westlake, OH"}, {"Author": "Mason F.", "ReviewID": "Gu9plx8BzbsJwjUx3HJ7oA", "Overall": "3.0", "Content": "As you probably already know I'm kind of a burger kid! Like, I am obsessed with burger I love making them and eating them. I know burgers inside and out. So I decided to order the \"Classic Bacon Cheeseburger\". I was all excited beacuse I love bacon and cheese and other variations of this burger are always good, but this time no way Jóse. This burger was all wrong it was RAW and you know I hate rare burgers so I sent it back after eating half of it and they gave me a medium-rare after asking a medium two times. By then everyone else had finished so they waited for me while I only ate half (took the rest home). Over all I would recommend this place just make sure your food is cooked.", "Date": "2014-01-24", "Author_Location": "Cleveland, OH"}, {"Author": "Carm P.", "ReviewID": "erUSZ6-_DCypH5qYRyjE4Q", "Overall": "4.0", "Content": "Great meal at a great price! Service was fantastic.", "Date": "2014-03-20", "Author_Location": "Rocky River, OH"}, {"Author": "Krystle G.", "ReviewID": "kqblyIW825D7D6iOEdIlwg", "Overall": "4.0", "Content": "When I think of Cleveland, I normally think of the many times I visited Great Lakes Brewery.  However after visiting Fat Heads with a friend to watch the Browns play, I am about to switch loyalties.  The food and service was great, but the beer was even better.  My husband and I ordered the sampler, and we were impressed with the quality of the beers.  Their holiday stout was superior.", "Date": "2014-01-01", "Author_Location": "Falls Church, VA"}, {"Author": "Dave S.", "ReviewID": "Dyjo2QErOuEBgy2meIs5RA", "Overall": "4.0", "Content": "Awesome, awesome sandwiches! This place is quickly becoming one of my favorite places to have dinner in the area. The menu probably has 40+ sandwiches on it so lots of choices. The smoked wings are very good and are large in size. This place is a brewery too so, they have a lot of good beer on hand. Not just Fatheads own brewed beer but, many other craft beers on tap as well. So whether your looking to have dinner and drinks or your just looking for an oversized delicious sandwich, this is a great place to go for lunch or dinner. Most sandwiches range from $8-$11 but they are huge and are worth the money. My favorite sandwich that i've tryed so far is the \"SouthSide Slopes Sandwich\". It was rated by Maxim Magazine as being the 5th best sandwich in America!", "Date": "2012-11-17", "Author_Location": "Denver, CO"}, {"Author": "Sarah F.", "ReviewID": "-7mNMKNJrR-zO44JfqvJAQ", "Overall": "5.0", "Content": "AMAZING beer and food!The hubby and I created our own sampler of beer.  Our waitress was very knowledgeable and was a great help.  They were some of the best craft brews I've ever had.For lunch we had an order of 'shrooms (battered mushrooms), a crock of chicken Parmesan soup, and a meathead pizza.  The shrooms were incredible.  The batter was fried perfectly crunchy and was well seasoned.  The soup sounds strange but it was delightful and not as heavy as it sounds.  The pizza was good but the capicola was surprisingly spicy.  We will definitely be returning!", "Date": "2013-07-07", "Author_Location": "Swartz Creek, MI"}, {"Author": "Joe C.", "ReviewID": "sXOUONMWyQZWpycbXCLreg", "Overall": "5.0", "Content": "I love Fat Head's so, so much.  I avoided coming here for the longest time because based on its proximity to the mall and other chains, I just assumed it was a run of the mill, bro-laden sports bar.  Imagine my surprise when I walked in and found my new favorite beer.  Here's the thing, Cleveland.  My love for you runs deep.  You know that.  So I hope you can forgive this blasphemy: Fat Head's blows Great Lakes clear out of the water.   Don't get me wrong, I love Great Lakes (I'm drinking a Lake Erie Monster right now), but whenever friends from out of town want good beer, this is where we come. I've had just about all of them, and while I may not care for all styles, I've yet to have one that I'd consider \"bad.\"  Their \"guest beer\" draft selection is always top notch as well.  I've had some beers on tap here that I've never seen on tap anywhere else.  Same goes for the food.  The Beauty and the Beast is one of my all time favorite sandwiches, and I could eat the fried mushrooms 'til I pass out.  Considering the portion size (they're called \"headwiches\" for a reason) and that one sandwich turns into multiple meals, the prices are very reasonable.  I've brought friends, family and co-workers here, and everyone's loved it so far.   I also like that there are only 3 locations, so you're not handing money over to a giant chain.  As much as I sound like a rabid fan, I'll admit it's not perfect.  Like others have said, you can't swap out the sides.  At all.  Not just chips-for-fries or vice versa.  There's no swapping out for a side salad or broccoli here either.  That can be a deal breaker for some, and I totally get that.  It's a very, very odd policy (even the wait staff say it's dumb and can't tell you why the policy is there), but the chips are good, so I'm personally willing to overlook it.  You're also in a restaurant named \"Fat Heads\", so don't complain if you find the food greasy or heavy.  Again: Fat. Heads.  Not \"Health Heads.\"  With that being said, I've never found the food overly greasy.  Bottom line: best beer in NE Ohio and delicious, bad-for-you food.  Can't be beat.", "Date": "2012-08-02", "Author_Location": "Lakewood, OH"}, {"Author": "Lilly S.", "ReviewID": "PDzOfgJ6Rh69AoDiRHnZ0g", "Overall": "3.0", "Content": "Great beer, awesome location, hit and miss food. I have yet to be let down by the beer and the vibe inside is awesome. The food is good, depending on what you get, I think. I got a pizza and it was great but the nacho appetizer is so weird because they use potato chips. I've had another app that was weird, too. The staff is also hit and miss. Very rude sometimes, very fun other times. It's a good place to stop in but I don't go often because it's so hard to know if it'll be a good experience.", "Date": "2012-11-30", "Author_Location": "Lakewood, OH"}, {"Author": "Jess F.", "ReviewID": "m97oiDbwPo3C314aq2rRkw", "Overall": "1.0", "Content": "I had been looking forward to coming here for a long time.  They do not take reservations so we attempted to get a seat at the bar on a Friday night and it was successful.  The girl bartender working was extremely rude and wasn't helpful at all.  The moment we sat down she was asking us for a credit card, annoyed that we didn't know they don't serve bottled beer, and was pained over getting us a menu.  They have a lot of beers to choose from but she didn't seem interested in telling us about any of them so we both just got a miller lite draft.  My friend ordered a bacon cheeseburger and the male bartender said \"a miller lite and a bacon cheese burger...really?\"  How rude!  I ordered the Aloha Chicken sandwich.  It was an OK sandwich but very boring and didn't have much flavor. My friend really enjoyed the burger, but it was the lack of service that left a bad taste in both of our mouths.When we finished our beers and our food they never asked us if we wanted anything else and we both couldn't wait to get out of there.", "Date": "2011-12-14", "Author_Location": "Strongsville, OH"}, {"Author": "Alyssa P.", "ReviewID": "Ir71J8cFyahXq12O1hZG6g", "Overall": "3.0", "Content": "I am very torn in this review. I feel like fatheads does some things very well and other things, not so great. We go here for the beer. It's some of our favorite. The food is passable. Not the best, not the worst, at least not from what we've had. I love the atmosphere at the entrance and around the bar but the dining room isn't as interesting or warm for me. My big beef with this place is all of the staff who mill about the entrance area of the establishment. I've yet to have a good experience with a hostess in this place. The last time we were there, the wait time they gave us was wrong by 45 minutes! They are generally rude, have called us up accidentally, and seem to spend more time chatting with other workers who wander into this area than greeting and seating patrons. This area can also be quite crowded on a busy night or a moderately busy time for that matter. I don't really mind that staff are running around up there but I do mind when they are pushing by without as much as an excuse me. We haven't tried the bar on this end, it's just a lot of hassle to get over there to get a drink when it's busy enough to make having one while we wait to be seated worth it. Our waiters have always been great so between that, the beer, and okay food they land solidly at a 3.", "Date": "2014-01-11", "Author_Location": "Lakewood, OH"}, {"Author": "Adi S.", "ReviewID": "JPvDp5Bdqet3hBt9LhBXIg", "Overall": "4.0", "Content": "I've been encountering so many good restaurants in Cleveland lately, that I'm almost now searching for faults so that I can stop doling out so many 4/5 star reviews. Regardless, I found few faults with Fatheads. Great prices, HUGE portion sizes, and delicious food. I had the fun guy burger, as well as tasted some of the barbecue wings and the pizza margherita. I felt that the burger could have used a bit something more to make it stand out, perhaps a bit more spread, another sauce, or another ingredient to break up the texture. Even though I'm not much of a beer drinker, this place has a massive selection of beers on tap and cask ales, which is a big plus for those that are.", "Date": "2013-11-10", "Author_Location": "Cleveland, OH"}, {"Author": "Samantha F.", "ReviewID": "nomy4RQgU8k6vjIUjRq4XA", "Overall": "3.0", "Content": "Fat Head's opened just a few moments ago and I had to be one of the first to give it a try.  Sitting quietly for months and months now, the idea of a new brewery in the 'hood made me thirsty just thinking about it.  I'm not good with being patient, which is why I went today and why I sat at the bar due to the 30 minute wait at 2:30pm on a sunny, Saturday afternoon.Fat Head's offers 10 brews on-tap, made in-house.  You can try a \"sample\" in a cute little glass for about $1.45.  I tried a few, my friend tried a few.  So far the favorite is the Tree Hugger Ale.  My friend liked the blonde.  The stout isn't half-bad either.  All are drinkable with no crazy or overwhelming flavors.Brewmaster Matt was workin' the bar & answering questions about the brews.  Nice guy, next time I'm in, I might buy him a drink.The other beer offered rotates in & out.  A nice variety if you can't find a Fat Head to quench your thirst.Food:Ok, I know I'm not always real sharp, but seriously, couldn't they have one vegetarian option on the menu?  I understand a Brewery is about das Bier first!  (As it should be)  But when offering a menu as large as this, give a girl a vegetable, please!!!  Heck, I'll even take a fish not deep fried.We ordered nachos with pulled pork, French onion soup, and a Reuben. The Soup did not have the usual thick & beautifully melty cheese on top.  I'd say it was beef bouillon w/ a few croutons & onions thrown in on a handful of mozzarella.  Not to be ordered again it was a far cry from good.  The Nachos, while appealing to look at, lacked certain oomph.  They do come on Fat Head's home-made potato chips. (YUM!)  But again, maybe the cheese is a problem for the place.  Yeah, its bar food, but really we can't do better than stadium cheese spread on the chips?  The pulled pork didn't have much flavor either.  I must say though, the toppings were nicely spread throughout the mound of chips and not just thrown on top.  The Rueben came with a mound of those yummy, yummy chips.  Bread was nicely toasted.  The meat was good & the crout not bad.  Overall a decent sandwich.Service:Matt rocked it out.  I like that he worked the bar and is the crafter of the beer.  Our server, well, she was overwhelmed and didn't mind letting us know.  Eh, she could have been better.  The GM did chat with us quickly before we were leaving; checking on the service etc.  I like that.  A good manager needs to know what his customers think.  Service probably could use some tweaking, but I'm hopeful that GM does a good job and it will thereby get better.  As I mentioned, the place us brand spankin' new.Overall I give it an A-OK 3 stars.  They're off to average start.  I'll go back, pray for better service and maybe eat a snack before I go.", "Date": "2009-04-11", "Author_Location": "Berea, OH"}, {"Author": "Penny S.", "ReviewID": "pbIR2WNOpoE6POczx4_Tyw", "Overall": "4.0", "Content": "Let me rephrase, I'm a fan with conditions.The house beers are actually pretty solid. We tried all of them via their inexpensive yet generous 4.75 oz pours and there wasn't a clunker in the bunch. It was nice to give my tastebuds a reminder of the summer to come with their peppy Heffeweiss and the doppelbock was lovely cold weather option. Even my cynical beer snob self was reluctantly won over by the blueberry beer, which I had for dessert. Caveat: If you're on a diet, want to eat healthy, crave a salad and/or don't want to die of a myocardial infarction right there under the dart board, you may want to avoid the menu in its entirety. It's fried, it's enormous, let's face it - it's why we're fat dot com. My fish and chips was pretty solid right down to the house-made tartar. My friend's pot roast sandwich (you read that right) was the size of your six month old baby's head and that is no joke. Service was attentive and friendly, the prices were pretty fair and while the menu is really overwhelming, it's a great spot for groups and beer nerds. Come to think of it, groups of beer nerds.", "Date": "2012-01-26", "Author_Location": "Chicago, IL"}, {"Author": "Rachel B.", "ReviewID": "7jitPVzfpd6WcnAVb6nS6A", "Overall": "4.0", "Content": "Positives:-gall darn ENORMOUS. (no, I don't usually say things like \"gall darn,\" but the cheesiness of this place makes my inner Midwesterner come out.)-really great beer! Especially the Stone Age Imperial Stout, but the Goggle Fogger Hefeweizen (which sounds vaguely dirty) was not bad either.-pretty good food -- GREAT fries.Negatives:-Super saccharine wait staff. This guy was like someone straight out of Tchotchkes' from Office Space: \"Yo duuudes! How about some pizza shooters, jalapeño poppers or extreme fajitas?!\"-the menu is blindingly busy and made me wanna barf it was so childish. It had little lame catch-phrases that didn't make sense, such as the long-winded explanation about why you could only get fries with the burgers and chips with the \"sandos.\" (- much like THIS long-winded sentence.) I used to love menu features like this when I was, like, twelve.both positive and negative:-it's waythefuck out in an area I never go to, ever. This could be annoying, but it's sort of fun to have a destination to go to for good beer.I'd go back for sure, so long as I'm drinkin'.P.S. The \"Damn Straight\" burger is pretty damn good.", "Date": "2011-06-06", "Author_Location": "Lakewood, OH"}, {"Author": "Gerri S.", "ReviewID": "cLRlgIzkHI37Q3D4aLrVlg", "Overall": "1.0", "Content": "Caveat Fudium.  (Let the Foodie Beware.)   Updated from 2/24/12An example of F.F.T.H.  (Fell for the Hype.  Pronounced f-f-t-h;  often a sudden, epiphany-like state.) It hurts me to update---because the manager was understanding and apologetic---but I felt it was my civic duty to inform anyone out there who eats food.  And if you haven't yet tried Fat Heads, don't let this deter you.  Read the other commentaries---you just might miss out on something you'd fall head-over-drunken-heels with.    The food on a recent drop-in---just about 10 days after a 4 star visit---was responsible for 3 stars being \"Chopped\".   Of the three different menu choices, two were unacceptable and one was inedible.  While all eateries can plate up losers once in a while, 3 out of 3 in a single order even made Fat Head blush with embarrassment.   (Red-cheeked image on the new beer OOPS, perhaps ?)*  The beef CHEESEBURGER was so dry that it was nearly indistinguishable as a meat product.  All that could be tasted was bun and cheese.*  The BABY BACK RIBS were also dry, and tasted as if just plain-old-oven-roasted---a preparation anyone with no cooking skills at all, can achieve---and without a hint of  \"char-grilled to perfection\" stated in the menu description. Now, the worst.If something isn't 100%, I won't hold it against a restaurant as long as it passes my Edible Test.  That's generally about 75%---when I'm in a good mood, which I usually am.   I do have higher expectations for the $$$$$, but bend more readily for the $ and $$.  Menu descriptions that simply list ingredients are enough for me---and safer for the food spot.  Any embellishing, however, can backfire for the establishment, as is the case with \"FAT HEAD'S ORIGINAL CHEESE STEAK\".   \"...best...you will ever eat.  Really.  Honest....\" ---even a shamelessly arrogant (but harmless) tongue-in-cheek reference to Philadelphia's Liberty Bell.  I'll admit, that after reading, I couldn't wait to order.   WHERE'S OUR SERVER??!!   If anyone had tried, NO ONE could have convinced me to choose anything other than that Cheese Steak off Fat's extensive menu.Ahhh...  Impressive looking and HUGE---enough for 3 average healthy appetites to share---and it was ALL MINE.  LET'S EAT!   uh.  I can't remember tasting the many extras layered within.  It's a blur.  It was the meat that drew all my attention.  At the very first bite I knew that I'd have my work cut out for me.  Gristle.  I don't like it.  Never did---never will.  I discreetly removed the generous portion, hid it in a napkin, then crunched on a few of their homemade chips (quite good).   No Cheese Steak Bite Number Two for me.   No way.  Working up the courage, I cautiously lifted that top bun.  I'd discovered the mother-lode.  After finger-prospecting through just the top two beef slices for any good parts, I soon knew it was a lost cause.  If I took the time to trim it, I'd be there until closing.  Not just on the edges, but like a topographical map of Minnesota and its thousand lakes, the slices were permeated throughout, assuring chewy inedibleness.   With the manager present, we testified one by one giving accounts of our displeasure, and in summation I presented a slice of cheese steak evidence for him to see with his own eyes.  He'd been apologetic and understanding from the onset---explaining how things are prepared, that's the way it's delivered, etc, and offering to get us something else we might like---but when apprised with visual proof by way of Exhibit G, by then he probably knew we'd pass on any alternates.  We declined his offer, he said (of course) no charge, and we left.  But not before urging him---at the very least---to have their steak meat precision-trimmed before serving (quite honestly?  not possible)---or even better---switching to an edible, fit-for-human-consumption grade.Gristle.  Pretty much a fact of meat life.  Other than the esteemed filet (if prepped properly before cooking), most steaks that are intended to be eaten with a knife and fork will likely have some.  BUT---it can be removed easily enough because IT'S VISIBLE.  Gristle should NEVER be hidden---lying in wait---between buns, rolls, or slices of bread.  That's at the top of my Culinary Sins list.  Unappetizing for the eater, and for anyone who happens to glance over during the Act of Detection and Ejection.  Major disappointment.  Especially since we told a newie about our better-than-average visit just days before, and convinced him to accompany us that second time.   Despite all this, my suggestion is to \"go for it\".  Who knows?  You might luck out just like we did the first time.  And if our experience with management is any indication of Fat's overall commitment to customer satisfaction---they'll make it right if it's wrong..", "Date": "2012-03-13", "Author_Location": "Cleveland, OH"}, {"Author": "Peter S.", "ReviewID": "HeN_9XsCBoVksUl54UUOtA", "Overall": "5.0", "Content": "Get to Fatheads. Order Smokehouse Wings (Extra Medium) and prepare for something completely unexpected.Go ahead. I'll wait.", "Date": "2010-10-10", "Author_Location": "Lakewood, OH"}, {"Author": "Andi C.", "ReviewID": "-k22MlN78tca5kNdnLB2gA", "Overall": "4.0", "Content": "I've been here several times, mostly for the beer but the food is pretty good too.  Everyone in their reviews is correct about the large portions.  Sandwhiches are huge!  I've never had a bad meal here. Definitely not healthy food but always have lunch for the next day.  The beers are great!  Haven't had a bad one yet.  Service- Eh.  It's okay.  They're busy most of the time that I've been there.  None of the servers I've had have been particularly attentive.  If you don't order a drink they definitely treat you a little differently.  My newly pregnant sister-in-law noticed that right away.  Great atmosphere and the patio is wonderful on a nice night.", "Date": "2013-04-29", "Author_Location": "North Olmsted, OH"}, {"Author": "Milton F.", "ReviewID": "nCarCuN69_mSTKID30BOHA", "Overall": "5.0", "Content": "Had a few hours after a conference so decided to stop by this place on the way back to the airport.  Did not disappoint. Large menu featured many different sandwiches and pizzas.  One of the more unique items was the smoked chicken wings.  Menu described it as smoked whole chicken wings grilled then sauced, and lightly pink because of the smoking.  Tempted, but then I was more tempted by their \"Parma Karma\", which was a sausage sampler of Kielbasa, Brats, and Bangers grilled with grilled onions and perogis.  Pretty dang good although I admit I am not an expert in these types of foods.  Large beer list on type, and many types of other brews including an impressive selection of west coast IPAs such as Bear Republic Racer 5 and Green Flash.  I had their Headhunter IPA and Pack a Wallop SPA, both were excellent.  The SPA (an american pale ale) was hoppy enough (more than regular american pale ales like a firestone pale ale or sierra nevada) with excellent malt tones.  Bitter aftertaste reminds you of the hops.  66 IBUs if you're into that sort of thing.  The IPA featured some pretty piney hops, with some sweet undertones.  The best feature of their IPA and SPA is probably their drinkability.  I can go all day drinking these without feeling bloated.  Very light bodied and flavorful.  I also had a guest IPA by Buckeye called the 76 IPA, I guess because it's 76 IBUs.  I didn't enjoy this one as much because the hops was too bare without any other sort of flavoring.  Not much sweetness or malt at all.  Apparantly this place only started brewing about 7 months ago.  I think this one will go far.  Compares favorably with Victory IPAs, in the same region.", "Date": "2009-11-10", "Author_Location": "Chino Hills, CA"}, {"Author": "Brian C.", "ReviewID": "ZP31atb4yEyVHIWz6eB0ug", "Overall": "4.0", "Content": "This place was pretty much what I expected and I would be giving them about three and half stars based on my experience, but the smokehouse wings put them over the top.  I was here with some family for dinner and wanted to try the smokehouse wings as my entree, so I ordered a dozen.  Big mistake.  Actually, a HUGE mistake because these were the largest chicken wings I have ever had... and it wasn't even their size, but the fact that they give you the whole wing (they don't separate the humerus portion from the radius/ulna portion) that really did me in.  I got the honey chipotle wings and only finished about half of them.I don't get wings very often, but I did the \"Lakewood wing crawl\" this summer and I think these wings would have won that contest.", "Date": "2012-02-06", "Author_Location": "Cleveland, OH"}, {"Author": "Corey L.", "ReviewID": "DNeZYqKtkVaTR1BI-nlXjQ", "Overall": "4.0", "Content": "Been there a couple of times when I come back to the Land of Cleve. They've got decent food, a good selection of good beers, and a crapload of room. I like it. Plus, bowling alley across the way and crappy soft serve ice cream next door. What could be better?Pretzel sticks: good, buttery, you get a lot of themSouthside Slopes: huge and FULL of calories, but tasty. Didn't think the pierogie added a huge amount.Enjoyed the blueberry beer. Quite tasty.", "Date": "2013-01-21", "Author_Location": "Salem, MA"}, {"Author": "Mike T.", "ReviewID": "fLdb3uwOJfgPqInU-Zv4vw", "Overall": "5.0", "Content": "I have been going to Fat Head's since they opened, and it is always worth the time. I'm not a fan of their food, in general, but there are some good things on the menu(pizza and wings are ok). What I mainly come here for is the beer, the best in NE Ohio. The guy that said the beer sucks here either thinks Bud is the best beer on earth, is a troll, on crack, or all of the above. The brewer here nails all styles, but the IPAs and IIPAs keep me coming back.This place can get crazy crowded, so come during lunch, or expect to wait. There is a large game area in the back that is worth checking out if it's swamped up front. Also, I will say the service can be slow at times... even when it's not crowded. But all in all, it is usually pretty good. If you like beer, this is the place in Cleveland.", "Date": "2013-01-15", "Author_Location": "Cleveland, OH"}, {"Author": "Peter W.", "ReviewID": "0s6sVX-ab0EcgJc-P7-WBg", "Overall": "4.0", "Content": "I've been meaning to get to Fat Head's since it opened a couple of months ago. I drive by the former Danny Boy's Farmer's Market everyday on the way to work and had been watching with great interest as the renovation progressed over the last couple of years. The doors finally opened to the public recently, but the frequent crowds were pretty good at keeping me from completing my mission.  As it turns out Sunday afternoon was a great time to visit this surprisingly large establishment.I'm not a drinker, so I can't speak to the beer that seems to be the main reason to visit, but I can say the selection was impressive.  Prior to visiting, I had checked out the Pittsburg location's menu online  and was interested to see what changes were in store for the Cleveland one.  Most of the items were carried over, with a few nods to our fair city (the Parma Karma, etc.). The food was great.  Incredibly large sandwiches stuffed full of deliciousness, accompanied by homemade chips (or fries with burgers).  After much deliberation and a lot of hemming and hawing, I settled on the Bay of Pigs Cuban sandwich, and was glad I did.  Lots of pulled pork, ham, cheese, and pickles with honey mustard and a very hot \"killer sauce\".  Not pressed, like your usual Cuban, but delicious none the less.The gf had the Euclid Avenue burger, which was pretty much a standard cheeseburger, but she was really happy with it, remarking on how well the meat was seasoned.  The chips and fries were very good, but nothing you couldn't find at most places.  They do, however, compliment the excellent sandwiches.  We plan on returning, as we barely made a dent in the menu, but it may take a while until the evening crowds subside.  I suggest you make it a point to stop in as well, if you are a sandwich person, I suspect you will not be disappointed.", "Date": "2009-05-17", "Author_Location": "Lakewood, OH"}, {"Author": "Cheri C.", "ReviewID": "rYspcE7ccYV4GSm9k2nIxQ", "Overall": "5.0", "Content": "We stopped by here after a tribe game. It was pretty busy but service was excellent at the bar. Tried the smoked wings and the were awesome. Beer is great. Love the Bumbleberry! Definitely worth the stop.", "Date": "2014-04-09", "Author_Location": "Columbus, OH"}, {"Author": "J. H.", "ReviewID": "jpLa_7ZhEiCll8YiG0_tow", "Overall": "4.0", "Content": "First of all, this place was jammin' on a Thursday night.  Easily near 90% capacity from what I saw...took that as a good sign.Seated at a large circular-style booth in the back which was perfect because I had three small kids with me.  Perfect seating arrangement.Service was outstanding.  Charlie, our server, was very friendly and helpful.Apps - shared some mild buffalo wings and onion rings.  Wings were solid, onion rings were very tasty, and as Charlie warned, very spicy.  Probably ate more of those than I should have.Main - kids meals were big hits.  Triple Bypass Burger and Head Banger for my wife and I.  Burger was very tasty, Head Banger was decent.  Neither could be finished due to how big the sandwiches were.Beer - I had a couple of the Pumpkin Ales, which were very good.  Wife had the pilsner, which was also pretty good.If we lived closer, we'd eat here frequently.  Had a very good meal with happy kids, and the bill was very reasonable.  We'll be back!", "Date": "2012-10-27", "Author_Location": "Cleveland, OH"}, {"Author": "Dan S.", "ReviewID": "lupM32DuXxN970YN31GZGA", "Overall": "4.0", "Content": "AMAZING BEER!  They brew it right on sight.  I love their Headhunter IPA.  I highly suggest you get their sampler on your first visit.  It offers 12 different 4oz samples of their own beers.As other yelpers stated this used to be the old Danny Boy's Farmers Market, and the owners did a wonderful job of remembering that they were there first.  In fact they still sell a crafted root beer from the original recipe from Danny Boy's.The food is pretty good - the wings especially.  They are offered in two varieties.  Smoked (highly suggest), and then the regular deep fried variety.  They have a great selection of sauces to choose from, too.  The sandwiches are not exactly what I consider to be home runs, but it's not for lack of effort.  Fat Head's seems to be following the \"hyper sandwich\" formula by offering more than just burgers, or to use their nomenclature \"Headwiches\".  They have one called the Parma Karma that is loaded with perogies, brats,and bangers among other things.  It's not that I'm against that type of sandwich, but when you visit a place like this often it tends to get too much.  I do recommend their buffalo calamari.  Their take on this has roasted red peppers, blue cheese, and buffalo wing sauce.  Really yummy.Seating should never really be an issue as the place is huge, and they can certainly entertain large groups.  If you're looking to sit at the bar it's a different story as these seats fill up the quickest.  There's also outdoor seating for the summer time,", "Date": "2011-03-01", "Author_Location": "Strongsville, OH"}, {"Author": "Adam D.", "ReviewID": "WL0rr9fdaLTNeBKKkjC33w", "Overall": "4.0", "Content": "My girlfriend and i decided that instead of our usual beer bar options we would try something new, and boy were we glad we did! Fat Heads is located in a huge building in the suburb of north. there was a wait on a friday night, so we decided to grab some beers at the bar while we waited. the bar staff while busy made sure to give me eye contact to let me know that they knew i was there, after i ordered my beers (which were fantastic by the way) and paid with my credit card, they made sure to make note of my name on the card and thank me BY NAME when she gave me the receipt to sign. it really is the little things that make the entire experience better. our waitress also was very personal and eager to make suggestions and opinions on the menu and beers. the food is well priced and HUGE! the sandwiches are gigantic and so are the burgers. the wings, while a little expensive are on the larger size and the sauces are quiet good. We went there because of the good reputation of the beer, but the food really puts it over the top. it's a destination location and i will be back again many times.", "Date": "2010-02-19", "Author_Location": "Seattle, WA"}, {"Author": "Rodney W.", "ReviewID": "5HHkP0i-H66_5SiWqrKBuA", "Overall": "3.0", "Content": "Finally made it out to Fat Head's last night.  The wife and I made the journey based on several recommendations from friends.  Wouldn't you know it, we ran into one of those friends on our way out the door!So I called ahead to see if this place would be extremely busy on a Sunday night and the hostess stated, 'At most, it would be a one-beer wait.\"  So I was like, \"Cool.\"Upon arrival at Fat Head's the place looked pretty packed, so we each imbibed the compulsory one-beer.  Of course we ordered the fresh draft beer made on-site!  I ordered the \"Bean Me Up\" Koffee Stout because it sounded similar to Guinness, which I like.  It turned out to be better than Guinness with a nice coffee finish.  I really liked this beer!  My wife ordered a Goggle Fogger Hefeweizen and it was also pretty good with hints of banana.  Then she tried a Starlight Lager, which was also tasty and in my opinion, better than the Goggle Fogger, but not nearly as good as the Koffee Stout.  I figured all the beers would be the same size, but they're not.  They serve different beers in different sized glasses for some odd reason.On to the menu.  For an appetizer, like we needed it, we ordered the Smoked Wings.  I was hoping for more of a Texas smoked than a charcoal smoked flavor, but at least they tried.  I'm not a huge fan of charcoal flavored wings, but these were okay.  I ate all three of mine without complaining.  The sauce was pretty good and the wings themselves were whole.  They didn't chop the wings in half for us, we had to do it on our plates which required additional smearing of sauce on our hands and faces.  But that's okay.For the main course, I ordered the Philly Cheese Steak Sub, which was huge and really good.  The steak was overcooked, paper thin and tasted like a Steak-um.  It had onions, cheese, lettuce, tomato and mayo on it.  It was served with fresh-made potato chips, which were pretty good.  They had a nice crunch to them, but I'm generally not a fan of these unless they're sweet potato chips.My wife ordered the Buffalo Chicken Pizza, which ended up being a large pizza.  It was enough for both of us to eat, feel full, and have leftovers.  Anyway, it came with celery and carrots on it, which we didn't really care for.  But the flavor was good.  We finished it off for breakfast today.The server was fast and friendly and the atmosphere was great.  There were tons of people and many TVs to watch.  While we were eating, we heard people playing games in the distance.  It sounded like electronic bowling or something.Overall, my favorite menu item here is the beer.  The beer gets five stars.  But if you want an insanely large sandwich, you'll love this place.  Three stars for the food.", "Date": "2011-01-17", "Author_Location": "Parma, OH"}, {"Author": "Jon C.", "ReviewID": "KVtLds9sDNEDb8x6lcpc2A", "Overall": "4.0", "Content": "The goods - Head Hunter IPA, Zeus Juice Golden Strong, The Steak-OutOn an overnight stay in Cleveland, I was jubilated to see that there was a brewpub only 1 mile away serving up award winning beer. We were seated immediately upon arriving on a Thursday evening - however the hostesses sat to many tables in a row for one server so we had a bit of a wait to receive our libations. As a craft beer \"enthusiast\" (my wife tends to use the term obsessed) I had to try the World Beer Cup gold medal winning IPA  and Golden Strong Ale. Both were delicious and well deserving of their accolades. I was disappointed that the other medal winning beer, the imperial IPA, was out. Win some, lose some. Seriously though, big hoppy beers are my thing, and their IPA was one of the better ones I have had. Highly recommended.We split a \"headwich, big as your head sandwich\" and, well, it was nearly as big as stated. This was a steak sandwich with onion rings, roasted red peppers, spicy ranch and delicious cheese all piled high on an enormous bun. The steak was cooked perfectly and seasoned beautifully, the sandwich as a whole was extremely enjoyable and had a nice spicy kick to back it up. It was served with really tasty homemade chips. When it was all said and done we had a great meal and extraordinary beers for a perfectly reasonable price. I would recommend this to any craft beer enthusiast.", "Date": "2012-05-28", "Author_Location": "Hebron, KY"}, {"Author": "Ken K.", "ReviewID": "2gfo5pjpcOnuA46O84lyGA", "Overall": "3.0", "Content": "Fat Head's is a giant restaurant that reminds me of an upscale Applebee's. The rooms are huge, spacious, dimly lit and way overcrowded. Despite the large amount of room, there's still way too many people in this place on a Saturday evening. There wasn't all the crap on the walls that Applebee's usually has, but the atmosphere was the same. Maybe an Outback Steakhouse or Winking Lizard would be a better comparison. Whatever they're going for, I didn't love it.Luckily, the food is way better than Applebee's, even if the atmosphere and décor isn't. The French onion soup was above average and the smoked chicken wings blew me away. Full wings that you have to tear apart yourself, highlighted by a pink smoke ring for authenticity, and topped by a great sauce. Next time I'm in, I'm trying the sandwich Maxim called the fifth best in the country - a giant piece of bread stuffed with sausage and perogi!The beer was decent, but not spectacular. I was slightly intrigued by the fact they have a ton of guest beers on tap to compliment their own. Again, this speaks to the \"commercialized\" feel this place gave me. They featured eight of their own beers, all of which I would describe as being above average to very good. The one that sticks out in my mind, though, is the pilsner. It was very true to form, which is hard to find in a country dominated by American lagers; often mistakenly dubbed pilsners.The service was decent even though they were crazy busy. The one mistake was that I ordered a roasted red pepper soup and got a bowl of French onion instead, but I'm thinking that was the mistake of the people in the back, and I didn't bother to correct her.", "Date": "2010-01-27", "Author_Location": "Chapel Hill, NC"}, {"Author": "Adam G.", "ReviewID": "m3qZLUaXDYEgbpa69OrV1w", "Overall": "2.0", "Content": "I'm currently sitting at the bar.  I just finished a over done burger and I'm drinking a coke because I have a professional engagement.  My meal has been finished for close to 20 minutes.  I mean, plate empty, glass empty, waiting for the check finished.  So where is my server?  I don't know, and if you find him, could you send him over with my check, I got somewhere I need to be.UPDATE: 20 minutes later as my server was leaving for the day, he notoced I was still there.  Amazing.", "Date": "2010-08-30", "Author_Location": "North Ridgeville, OH"}, {"Author": "Tracy B.", "ReviewID": "hvRKBchl8BZ1-CHUdEXTUg", "Overall": "4.0", "Content": "It's one of the sad and unfortunate realities of life for us left coasters....   As you travel east, the quality of food gets better with each passing mile. Fat Head's Brewery & Saloon does not disappoint. This is my first trip to Cleveland. And while I don't have an overwhelming desire to return any time soon (no offense middle America), if I do, Fat Head's will be on my \"must visit\" list. The BeerThis is a microbrewer that's producing some very unique, interesting, and flavorful beers. I had blueberry ale that was complete with fresh blueberries swarming around in the bustle of carbonated bliss. It's not overly fruity, nor does the ale fade into the background when consumed with spicy BBQ. Rave reviews were abundant around our table for several of the other brews.The FoodThis place makes the little fat girl inside of me squeal with delight. Deprive yourself of food for a few days leading up to your visit...and live off of the gross excess for a wee after. All of the portions are HUGE. We started off with a variety of appetizers...wings, onion rings, mushrooms, etc. While I'm not into deep fried slimy things, I did sample the wings and rings. Both are outstanding. The wings are treated to a dry rub, smoked, and then grilled to perfection.I had the Twisted Brisket sandwich, which was the size of a Cadillac. Not a Cadillac of today...but the Boss Hog of Cadillacs. The fresh bun was piled high with crispy onions, perfectly cooked brisket, a fried egg, and cheddar cheese. Your cardiologist will love this! On the side....a heaping pile of homemade chips. The ServiceOur waiter had a great attitude and sense of humor. Drink cups never reached the bottom, sauces were aplenty, a towering pile of napkins were at our disposal, and we never wanted for anything. Good job, Fat Head's crew!My only complaint and suggestion...open one of these in southern California. Please open it just far enough from my home to allow for an occasional visit, but not so close that I'm there nightly. After all, that would require a new (and much larger) wardrobe.", "Date": "2011-10-12", "Author_Location": "Yorba Linda, CA"}, {"Author": "Colleen P.", "ReviewID": "TqJC0n8_k-13RAI9jTZGAQ", "Overall": "4.0", "Content": "Food is still awesome! Went here on a Friday and got their special, the fish and chips..very good especially with my IPA....Long wait, but with the beer it didn't see that long ;)I love all the different choices of beer, they are all really good, and I still recommend the sampler!", "Date": "2011-02-05", "Author_Location": "North Olmsted, OH"}, {"Author": "Meghann T.", "ReviewID": "OGHN0HRYnqpGBoLRwnqxrg", "Overall": "5.0", "Content": "OH MY GODDDDDDDDDDDDDD.I love this freaking place!The smoked BBQ wings are out of this world fantastic! I got the Artery Clogger cheeseburger, and I have lived to share my delicious adventure through Fat Head's menu.Their beer selection is really fun to browse; I ended up choosing a craft Bumble Berry, complete with fresh blueberries in the glass.The brewery is located inside of the restaurant. I think this place is so great, because one of the founders of Great Lakes Brewery (the late Michael Jackson - no, seriously, that's his name!) ventured off and started his own thing, thus being the awesome Fat Head's Brewery & Saloon.The place is huge, there is a big bar with their original 10+ beers on tap.Service is great!Please try this place the next time you're in the area!", "Date": "2011-12-28", "Author_Location": "Reynoldsburg, OH"}, {"Author": "Kate V.", "ReviewID": "7VHCAYV1nZMaC4yPaJMomA", "Overall": "4.0", "Content": "The food is average, but the beer list is amazing.  (Although, I wouldn't recommend their own brews.)  The beer list is the reason that I'm giving it four stars.Also, the too-cool-for-you bartender is no longer there, which improves the experience.", "Date": "2010-10-16", "Author_Location": "Cleveland, OH"}, {"Author": "Shaun Y.", "ReviewID": "xeXGtaGLKDFqpAzjVX3AUQ", "Overall": "5.0", "Content": "Fathead's Brewery is probably the best micro brewery in the Cleveland area and very well in all of Ohio. Their selection in house brewed beers is normally around ten to twelve draft beers. Then there are about 20 more guest beers. All craft and all draft. Except for miller light, which gets a diminutive tap handle and a hilarious description in their ever changing beer list. Seriously, the list changes almost every day. In only seven months of existence, they have entered three beer competitions and walked away with three medals - two of them being golds.The food is just as excellent as the beer. Huge portions no matter what you get. Definitely try any of the Headwhiches or Smokehouse wings.", "Date": "2009-11-11", "Author_Location": "Cleveland, OH"}, {"Author": "B K.", "ReviewID": "4byEPfCX1zbbdh5i4ZZ_vg", "Overall": "4.0", "Content": "PROS: Great beer list, friendly service, good atmosphere, decent foodCONS: certain food can be pretty heavy...they use way too many spices. pulled pork is so hot it's practically inedible", "Date": "2011-10-01", "Author_Location": "Cleveland, OH"}, {"Author": "Deborah P.", "ReviewID": "CfA8pmVi6HJioOuiFFWvwQ", "Overall": "2.0", "Content": "Service was good and the foods that my friends and boyfriend ordered were good (pizza, burger and grilled cheese) but my veggie sandwich was just okay.  The portions are huge so I took half of my sandwich home where I found a hair in it the next morning.  Definitely not happy.  I would give them a higher rating if not for the hair.  I would probably try it again, but would double check my food or just drink beer.", "Date": "2013-06-19", "Author_Location": "Dumfries, VA"}, {"Author": "Michael B.", "ReviewID": "LAz791tFWThjxIfg1hyJuA", "Overall": "4.0", "Content": "Second time going here for lunch and the food was a good as the first. The service wasn't great, but above average. The menu also has a huge variety.", "Date": "2013-10-22", "Author_Location": "Derby, KS"}, {"Author": "Melissa M.", "ReviewID": "hNh3_Xfarzti2YlAV2bj6g", "Overall": "5.0", "Content": "Visited on a recent trip home to CLE. The beer was delish. Sandwiches were insanely large, very creative!  Most impressive were the apps. The basket of mushrooms was enormous and the wings are the WHOLE wing. Not the two separates pieces. Needless to say, we over-ordered. :)", "Date": "2013-08-19", "Author_Location": "Tampa, FL"}, {"Author": "Olga S.", "ReviewID": "2BtAvYT-ueuC5Ptlo37PnA", "Overall": "4.0", "Content": "The place is terribly good. Terribly - because you are eating pure and drinking pure lard - cheeseburgers and beer. Good - because damn, its sooo good. Service was good, they accommodate large groups easily , staff is pleasant. I loved the name of the sandwiches,  so freakishly honest : \" triple bypass\" will guarantee you exactly what it says if you eat it more than once in your lifetime.So if  your New Year's resolution was not to star in the \"Nutcracker\" next  holiday season (like mine), please check this place out and also say\" hi\" to my liver. I think I left it there in the third booth by the window after the last hefty dinner I had there.", "Date": "2012-01-08", "Author_Location": "Charlotte, NC"}, {"Author": "Sean M.", "ReviewID": "86Q0xffqZYC3qVTDlZH3PQ", "Overall": "4.0", "Content": "I can't believe that I've waited so long to try Fat Head's!  I think I was secretly or subconsciously protesting the demise of Danny Boy's market and avoiding going here.  That was clearly a mistake and thankfully, I've corrected it.Our meal started off with a pint of the Blueberry Ale.  Great aroma and subtle blueberry taste.  The fresh berries floating in the beer were a bit strange, but as I bit into one, it totally worked with the beer.  And, they kept rising and sinking in the beer like a lava lamp, so that was pretty cool.  My second pint was the house Hefeweizen and was delicious.  Subtle hints of cloves and banana made this perfect.  My sidekick and I split an order of Smokhouse wings and they were tremendous. Whole wings, drums, the other part, and the tips are all attached.  They were meaty, with a rich, smoky flavor, and a zesty sauce. I decided on one of the sandwiches, appropriately called \"Headwiches\" as they really are the size of your head.  I selected the Paul's Pro Pastrami, a great combo of nice, fatty pastrami with hot sausage, a fried egg, cheese, onions, pickles and a zippy mayo, all on a bun that was reminiscent of a Mexican \"torta.\"  Nice crust, soft inside, but it doesn't fall apart or suffer from \"sloopage\" (a Sniglet for when the food falls out of the bun) as you eat it.  The house-made crisps on the side were crunchy and salty and the perfect side.The bar area is very nice with enough TV's so you can watch the game, but for some reason, there was no audio.  They were playing the \"K-Tel Soft Rock Classics\" collection or something like that...not sure what's up with that.  The dining room is very big, lots of tables, all within viewing distance of TV's as well, but I was surprised at the huge amount of kids running around.  It's a bar, people!  Take your kids to Chuck E. Cheese, for crying out loud!  Fat Head's is a great place!", "Date": "2011-03-14", "Author_Location": "Cleveland, OH"}, {"Author": "Roger B.", "ReviewID": "qUbcaRC02GZi02vNn7UMHg", "Overall": "4.0", "Content": "Can't believe I haven't visited this place before.  They make a nice assortment brews and also offer a nice selection of guest beers as well.  One of their award winning beers is \"Head Hunter\" and you should try it if you are in to a good hoppy beer.  On the food front be warned in that their portions are huge.  Nice assortment of sandwiches and I would suggest the \"melts\".  Great local place and if you are looking for good beer & food you can't go wrong here.", "Date": "2011-05-07", "Author_Location": "Avon, OH"}, {"Author": "Dave K.", "ReviewID": "d5J6pbdxBxGmiVN-hRVKrA", "Overall": "4.0", "Content": "Grabbed dinner with friends while we were dropping off my brother-in-law at the CLE airport.  We went on a Saturday (late afternoon).. it was pretty busy but we had only a two or three minute wait.The burger/sandwich/sub/panini list is huge.. almost overwhelming at first.  I'm sure I could have picked at least a dozen options I'd be more than happy with.  I settled on the Parma Sutra, which laid cheddar, bacon, onions and a pierogi on top of a half pound burger with a side of creamy horseradish.  It's a great concept for a burger, and it was as good as it sounds  We also shared a few appetizers - the spinach artichoke dip w/ fried pita was especially good.I tried the flight of house-brewed samples.  I wouldn't say I was blown away by any of them, though the Bavarian-style was quite good. Their holiday varieties were also commendable.I don't think I can quite dish out five stars on Fatheads.. but I considered it.  Maybe an 8.25-8.50 ish if you're looking for a more specific score.", "Date": "2012-01-17", "Author_Location": "Youngstown, OH"}, {"Author": "Chad A.", "ReviewID": "sfFPFxqiVHDELkset905lQ", "Overall": "5.0", "Content": "I had a killer chicken sandwich, I can tell you it truly was killer.  I don't think I have ever had a sandwich that was so hot (spicy).  Usually when items say they are hot...they don't even come close to making my mouth and body feel like they are on fire.  This sandwich was ridiculous and I loved it.  The place overall is great, only downside is that it was packed and we had to wait an hour before we got called for our table.  Upside was we just drank and ordered food at the bar.  I definitely would recommend this place, the beer was great and I am not the biggest fan of beer, but really enjoyed my Oompa Loompa Stout.", "Date": "2013-04-07", "Author_Location": "Fort Mill, SC"}, {"Author": "Jason S.", "ReviewID": "2JiSuoC69Nt9Su-si73BZg", "Overall": "4.0", "Content": "This place is just awesome!The End", "Date": "2011-09-29", "Author_Location": "Cleveland, OH"}, {"Author": "Jason V.", "ReviewID": "pAE32R-WJ7_J5mQu--EPrw", "Overall": "3.0", "Content": "Had a weekday (Wednesday) dinner at Fat Head's.  The place was fairly full, but we didn't have to wait for a table.  There clearly wasn't enough parking to accommodate such a large and popular eatery, and I can imagine that it would be hell on really busy days.We started out with some appetizers:  Smoky BBQ wings and Deep Fried Pierogies (accompanied with a side of sour cream).  It's hard to miss with appetizers like those, and both of them were really good.  For dinner, I got the South Side Slopes which, as the menu will inform you, was voted the #5 Best Sandwich in America by culinary reporting giant Maxim magazine.  I found this a little surprising because, as a subscriber to this magazine (and ostensibly for articles such as this), I must have somehow missed (or been distracted away from) this piece about best sandwiches in America.  How odd . . . .In all seriousness, the sandwich is pretty good, but I think more so as a spectacle than an actual sandwich.  Biting down on to a double layer of kielbasa topped with American cheese, horsey sauce, and onions is every bit as tasty as it sounds.  I thought, though, that adding the pierogies was a little overboard, and the sandwich is substantially less exciting if you find yourself in the unenviable position of only having left some pierogies in between two pieces of bread.The beers at Fat Head's are quite good.  I first tried the Christmas Ale which, inevitably, has to be compared to Great Lakes Brewing Company's own Christmas Ale.  I personally prefer the GLBC take, primarily due to its stronger (and spiceier, but not in the \"hot\" kind of way) flavor.  The Fat Head's version seemed to me like a dulled version of the popular GLBC beer.  Maybe they should put some cinnamon sugar on the rim of the glasses!  The Bumbleberry Honey Blueberry Ale is excellent.  The taste and aroma made me think of eating blueberry waffles, surely pegging this beer within the top-five breakfast-tasting beers in America.  When is that article coming Maxim?!?", "Date": "2010-12-15", "Author_Location": "Cleveland, OH"}, {"Author": "Leah N.", "ReviewID": "H2G4Uu_VOFLdbsjuAEPR0w", "Overall": "3.0", "Content": "If you have skimmed through any of my reviews you can probably tell I am pretty nice with my stars. If the food is delicious, service is excellent and I like the atmosphere, I'll most likely put you at a 4 or 5 star. I also like to think that because a place had a bad moment once they can certainly redeem it next time around. BUT, something about Fat Head's just didn't really leave me loving this place. Atmosphere: Nice but I'm not sure- maybe it seems to commercial for a local brewery? To me it just feels like there is a hundred other places like Fat Head's out there and it's missing something. Call me picky, I don't know. The bar at this place is awesome though. There is definitely a good amount of sitting and also some high tops and booths. And since we prefer sitting in the bar we were happy we didn't have to wait. Service: Our waiter was a grouch, not going to lie. I just cannot stand when waiters act like they are doing you some kind of favor for taking your order and then giving you a tip. You're in the service industry, it was your choice, cheer the heck up or go sit behind a desk away from human contact. The only time he was happy was when he delivered our beer and didn't have to wait on us anymore. By the way, my food was OK, thanks for asking. Food: Husband had the artery clogger sandwich and loved it and I agree, it was really, really good. I did the basic bacon cheeseburger and ordered it well. It came out maybe medium but since nobody came around to ask, I ate would I could. Fries were delicious though. Also we had the pierogies for an app and those rocked, so good! I might stop back if I am in the area but right now it's just \"meh\" There are plenty other breweries I'd put before Fat Head's.", "Date": "2012-07-07", "Author_Location": "Akron, OH"}, {"Author": "David B.", "ReviewID": "2J_t8jrhINwy4R7IvmKJwg", "Overall": "4.0", "Content": "Holy crap...I went in wondering how bad this was going to be because quite frankly I didn't trust them...So on the menu...Burgers get ff and everything else gets our homemade potato chips and we won't substitute...Really? Didn't think a restaurant was an Oligarchy but I was going to order a burger anyway so pbtppppppppbt....Ordered a Triplebypass medium rare and dang! came out perfect and DELISH!!!!!!!I got picked on cause I was the first one done and had the biggest burger...Yeah so the inmates had to bust my b--ugh--chops about that but it was REALLY good and again....Simple done right....Yeah if we choose to head to the West Side again Fatheads will be in the loop!!", "Date": "2012-07-18", "Author_Location": "Cleveland, OH"}, {"Author": "Erika E.", "ReviewID": "SgyeK15mUl_FYOZ1REOk1w", "Overall": "5.0", "Content": "Wish we didn't live 1100 moles away. If you like anchovies order the Great Carmoni. If you are a beer geek you won't be disappointed and should order a flight of all 8 on tap. Be sure to specifically ask for fresh potato chips.", "Date": "2013-03-13", "Author_Location": "Tampa, FL"}, {"Author": "Bret N.", "ReviewID": "C00XPRqGq762hM0oPyQkbg", "Overall": "3.0", "Content": "Took my wife here on a date. We went on a Friday night and got seated within 20 min. Our server wouldn't stand still long enough to get our whole order, I actually had to stop her from walking away so I could order a beer (I could never get her stationary long enough to order my wife a drink so she stuck with the water that never got refilled).  My wife got the Rubin melt it was OK but she said she wouldn't come back for it. I had the Triple bypass burger and it was one of the best burgers I have had. Their beer (brewed on site) was amazing. The atmosphere was a little loud but hey it was a Friday night I would have given this place 4 stars if the service wasn't so poor.", "Date": "2012-02-18", "Author_Location": "Elyria, OH"}, {"Author": "Jill M.", "ReviewID": "BjiVkXtJPeWkoaD0KtYyBQ", "Overall": "5.0", "Content": "I enjoy good beer, good food and great company, this place has all three! Visited on a Saturday around 8:30pm. We had a 40 min wait, but three spots at the bar opened up and we scooted right into them. I sampled the Blueberry beer an ended up buying a six pack to bring home. Enjoyed the Pils, pizza and the Smokehouse wings. If you enjoy craft beer, this is a great place. Only open for the last 4 years, but a huge success! Now, if only I can find the Blueberry beer in Michigan! Ps. The bartenders are super nice and cute too.", "Date": "2013-08-31", "Author_Location": "East Lansing, MI"}, {"Author": "Scott F.", "ReviewID": "itbLR2bDBQUs_q65S5UZ-A", "Overall": "4.0", "Content": "Eating at Fat Heads leads to a Fat Belly. I enjoyed a nice business luncheon at Fat Heads today, and it was my first visit. I really enjoyed the atmosphere and the staff was very friendly. The beer menu looked great, but I stuck to business for today. The menu was an interesting read unto itself, with all sorts of unique and uniquely described sandwiches (or Headwiches as they call them), burgers and melts. Despite all of the options to choose from, I ended up going with the Prime Rib and Bacon Club melt. The homemade chips were fantastic; although I'd probably only give the sandwich a 3 because the prime rib was a tad fatty and the bacon wasn't as crisp as I like it. But it was still delicious - and the overall experience definitely warrants a 4-star rating. I can't wait to go back (for a non-business occasion)!", "Date": "2013-03-14", "Author_Location": "Westlake, OH"}, {"Author": "Ashley H.", "ReviewID": "AuryebTg6ppoiDOzTFKKtA", "Overall": "5.0", "Content": "I LOVE FATHEAD'S. The BF and I tried to go to Melt at 4 p.m. on a Saturday and there  was a 2 hour wait. Our PLAN B was this place because we loved the original location in Pittsburgh so much. I think we were both secretly hoping that we'd be eating here. Good thing.The inside is huge. Had about a 15 minute wait for a table of  4 at 5 on a Saturday. Loved the bumbleberry beer I got, it was a bit fruity but not overbearing and had blueberries in it. Mom liked it too. She gets pretty giggly so I knew she was loving it.BF had some IPA and he liked it. I don't even  know what that stands for so I can't really elaborate. We both ordered the same thing we had the last time. He got the Beauty and the Beast and I got a chicken philly sub. They both come with homemade chips that are delicious. We ordered wings as an appetizer and I swear they were the biggest wings I have seen. Out Quaker Steak to shame.Although huge, he was able to eat the entire sandwich but I'm guessing he was wishing he had leftovers. Step dad had a burger that came with fries and I stole a few (ok quite a few) and they were great. Sandwiches with chips are between $7-$12. Not shabby. Our waitress was polite and prompt, but not too friendly. Liked her.Love this place, I will use it as a back up plan anytime I  am in Cleveland looking for good  eats. Then I will work out triple hard the next day. It is worth it.", "Date": "2011-02-16", "Author_Location": "Marlborough, MA"}, {"Author": "Robyn L.", "ReviewID": "p6g6j3Bxs8fTdgYR44WZ3Q", "Overall": "3.0", "Content": "Headed in for pre-airport lunch and socializing. This place is huge! They probably seat close to 300! Definitely good for a crowd. I tried the bumbleberry brew due to a clevelander's recommendation. Fresh Blueberries floated in my ice cold beer. Delicious. Me and hubs shared wings, fried perrogies, and a smoked prime rib dip. The portions are ginormous! The fried perrogies were awesome! They were crispy on the outside with fluffy potato cheese filling. Served with sour cream. The prime rib dip was huge! It was good on it's own but the au jus was a cup of liquid salt. It destroyed your palette with a burning salty sensation. It was served with crispy housemade chips  The wings (regular buffalo) were cooked fine but had a strange sweetness we didn't like. My sister had a Burger. Can't remember the title but it had bacon, cheese, and a fried perrogie on top. How can you argue with that?! Really really good burger. My mom was pleased with her \"brewben,\" a Reuben twist. Guess it had a spicy pepper kick. All in all, a great spot for casual family friendly lunch and good beer.", "Date": "2011-05-25", "Author_Location": "Las Vegas, NV"}, {"Author": "Ed P.", "ReviewID": "p1UQsf7__EE-u9vethuEHQ", "Overall": "5.0", "Content": "Another stop on our short trip to Cleveland was to Fat Head's Brewery & Saloon.  I actually planned to check this place out before our trip even started. A friend of mine is a frequent visitor of their Pittsburgh location and I've watched their brewery rise to much fame at the Great American Beer Festival the last couple of years.Fortunately Fat Head's was just a few minutes drive from our hotel in Westlake, Ohio. My parents joined my wife and my son for a nice Friday lunch before a wedding later that evening. We arrived to find the very large restaurant mostly empty, though there was a growing crowd at the bar and a few other tables throughout the spacious dining areas.I forgot to take pictures of the beers we sampled, but they were all delicious. Their Head Hunter IPA has won back to back medals at the previously mentioned GABF and is wonderful. My dad and I both started with a tall glass of this. Altogether we also sampled the Kolsch, Citra Pale Ale, Up In Smoke Porter, and a few others that I cannot remember. I enjoyed everything that I tasted and wish I could enjoy them more regularly.As good as the food was, I was really impressed by the food. Not only are the portions gigantic but everything tastes very good as well. I had the Aloha Chicken sandwich with a grilled chicken breast topped with ham, provolone cheese and grilled pineapple. Finished with a splash of Extra Medium Sauce ($8.95). My wife had the Beauty & The Beasty sandwich with pulled pork in Beasty BBQ Sauce. Topped with creamy cole slaw, pickles and raw onions ($10.95). Both were great sandwiches and the accompanying home-made chips were very good too.We all really enjoyed our lunch here. I definitely want to go back sometime in the future. I just wish it wasn't so far away.", "Date": "2011-11-03", "Author_Location": "Cincinnati, OH"}, {"Author": "Jessica C.", "ReviewID": "c-TFZzBIsaG-cEEQAJZdxA", "Overall": "4.0", "Content": "We planned visiting here during a short trip to the North Olmsted area after reading the great reviews here on Yelp.  We were not disappointed!A group of 5 of us stopped in for a late lunch and were surprised to encounter a wait for a table despite seeing several empty tables in the restaurant.  Boo.  The bar area was quite large and had both booths and high-tops for open seating (the booths were a bit on the smaller side though).  The restaurant itself was quite open and fairly noisy even though not all tables were occupied.  I can only imagine it gets quite loud in here during a peak Friday or Saturday night!Once we were seated, it took our waiter quite some time to come over and take our drink orders (perhaps they were understaffed?).  It took a fair amount of time for him to return, but the beers did not disappoint!  I only wish he had let us know that flights were available if we wanted to sample the various types - we saw other tables ordering them on the way out.  As for the food, the menu was great with plenty of great options.  Most of our group opted for a burger and everyone was quite pleased with their selection.  I ordered on of their salads and was impressed with the large portion.  The vegetables were all very fresh, though I was a little disappointed that the toppings were a bit on the \"skimpy\" side.Prices were reasonable and the only real issue we had was with the service.  We had to flag down our waiter several times and everything took forever to come out.I would definitely recommend this place and would certainly stop back in if we're ever in the area.", "Date": "2012-01-05", "Author_Location": "McKinney, TX"}, {"Author": "Gina C.", "ReviewID": "nbs_s1PYg0ZygEHGc1lxuw", "Overall": "2.0", "Content": "Went at 6:00pm on Friday with a group of 7.  The wait was 1hr 20min, which isn't surprising based on the time and our group size.  The portions are huge, and everyone's food was pretty good, but not great.  I was not very impressed with their house beers.  Again, not bad, but not worth a return trip.  The service was above average.Overall the place is fine.  I didn't come away with any complaints.  But for the calories consumed, I'd much rather have eaten somewhere else.", "Date": "2012-02-06", "Author_Location": "Independence, OH"}, {"Author": "Jessica I.", "ReviewID": "hc6TxjDHhWYm4-5mlzXmyA", "Overall": "4.0", "Content": "Yes, this is an offshoot of a Pittsburgh business, but you'll soon get over it if you're a fan of craft beer and fatty food. The menu is huge and covers just about every category of stuff that goes well with beer. The Headwiches are appropriately named, the smoked wings delectable and enormous, and the pizza just right. Sandwiches come with really nice house-made chips. As for the beers, I'm partial to the Goggle Fogger Hefeweizen and the blueberry ale, but I haven't had a bad one yet. My sole complaint about the place is that service has never really been impressive. Last night, I was the last to join my party, and I waited 10 minutes before someone came by for my beer order. I was about to send up flares to get our server's attention. My evening finished with the to-go portion of my order being incorrect. Not a terrific way to inspire loyalty.So, Fat Head's isn't my first choice for my food and beverage needs due to the lackluster service, but there's a certain group of beer-swilling friends I meet on a regular basis that finds this a convenient meeting place, so I'm willing to keep coming back. I'd give 3.5 stars if I could, but we'll say that the presence of the bar bowling machine bumps it up to 4.", "Date": "2012-02-29", "Author_Location": "Rocky River, OH"}, {"Author": "Derek N.", "ReviewID": "eErfqBFOWsXpH5UCbZSfnQ", "Overall": "3.0", "Content": "The burger was good, I wish they had an apple cider.", "Date": "2013-05-21", "Author_Location": "Grapevine, TX"}, {"Author": "Christopher W.", "ReviewID": "IMlUlI6ayKGYTaDxUuQPcg", "Overall": "5.0", "Content": "I have been to several breweries over the year and I can honestly say this is my favorite, by far. Great beer and equally great food. Way to go Fat Head!", "Date": "2012-09-06", "Author_Location": "Atlanta, GA"}, {"Author": "Raven Anne S.", "ReviewID": "V1DSwlQ5w17SqSmdN0-U2g", "Overall": "4.0", "Content": "Fatheads, you're delicious and your beer is great... but where did you take my Jalapeño Cheddar sauce to? :(Soft Pretzel sticks are a win. The burgers are fantastic - try the ParmaSutra (it has a pierogi on it!) And the chips are great with any dipping sauce or none at all!", "Date": "2011-05-12", "Author_Location": "Westlake, OH"}, {"Author": "Denise Y.", "ReviewID": "ZoQpcEUgxfPMqxWRsKDOYA", "Overall": "4.0", "Content": "There's a reason why Fat Head's is packed on a regular basis. I came with a friend that raves about this place week after week and finally had to come see for myself. The wait for a table of 7 on a Saturday night was supposed to be about 2 hours but the table opened up and we realistically waited a little over an hour. We ordered some appetizers which came relatively quickly - onion rings and nachos. The onion rings looked burnt but they weren't and had a definite kick to them! The nachos were a massive pile of chips with toppings and while not my personal preference (jalapeno smell from across the table) they were gone from the other table mates.I split a \"headwich\" with my bf since the appetizers were so much food. We ordered \"The Fat Italian\" served with a big pile of homemade chips. And it's no joke that the sandwich is roughly the size of your head. I cut into it and all the fillings came sliding out. The sandwich was delicious and for me was the highlight of the meal.Note: I'm not a drinker so I can't vouch for the beer but my beer connoisseur friend certainly can! There's a reason why he's a regular here.", "Date": "2011-03-06", "Author_Location": "Cleveland, OH"}, {"Author": "kris p.", "ReviewID": "GuA_Br6_qnOoRD9o9_hZ6g", "Overall": "2.0", "Content": "This place is not for me.  If you don't like enormous portions of beef between buns, the menu has very little to offer.  I'm not a vegetarian or anything but really the menu appears huge until you realize that it's all variations on a carnivorous theme.  I don't mean to be to harsh, there are a couple of things on the menu that look like they'd be worth a shot if I accidentally find myself there again.   The service was quick, friendly and responsive to my gal's request for ranch dressing.  The beer is good but I can get that at the drug mart down the street from my house.  Pretty disappointing place.", "Date": "2013-03-06", "Author_Location": "Independence, OH"}, {"Author": "John M.", "ReviewID": "TQAEQf50QdtjpAZYDbGFwQ", "Overall": "3.0", "Content": "We have friends in the Cleveland area that brought us to Fat Head's when we were there visiting them last month.  No one was drinking so this review is only for the food and service.There were four of us.  Orders were 1 Twisted Brisket, a Bay of Pigs (mine), Prime Rib Bacon Club and an order of wings with potato chips.  Everyone thought the food was good.  My Bay of Pigs (just lots of porky goodness!) was good.  The seem to make their own potato chips, which we really liked.  The portions were large and no one left hungry.  The ambience was similar to something like a Buffalo Wild Wings - maybe a bit nicer than that.  The dining area was large and they also had a large bar area. The food was good, not great, but overall it is a place we would go to again.", "Date": "2011-12-08", "Author_Location": "Streamwood, IL"}, {"Author": "Bob L.", "ReviewID": "2F0M4aHeTy5PIrIAKaJt3w", "Overall": "4.0", "Content": "While not a Cleveland institution (they're based in Pittsburgh) Fatheads is definitely gaining ground here in a big way. Their line of beers easily rivals those of local favorites Great Lakes and Brew Kettle and the recent opening of their production brewery in Middleburg Heights is a testament to their success. Now I'm not one that's terribly impressed by beer awards, after all, I don't need a bunch of haughty beer judges to tell me what's good,  Fatheads has plenty of them - GABF, World Beer Cup, the list goes on. I guess what I'm tryin' to say is that they know their way around a mash tun and if you want some of the best beer in NE Ohio, nay, the Midwest, you owe it to yourself to pay them a visit. Oh yeah, and I do agree with the other Yelper who said their Christmas Ale rivals GLBC - actually, I think it's better.The restaurant, sorry, brewhouse and saloon, is quite sizable. You enter through the back and you're immediately greeted by shining stainless steel and copper and the smell of boiling hops and malt. One whiff and you know you're in a brewhouse. I love it. Since we don't visit late in the evenings or on weekends (crowds aren't our thing) I can only attest to the atmosphere when we've been there - normally 6ish on a weekday. We're always greeted immediately when we walk in and have never had to wait for a table. We've dined here three times in the last several months so I guess you'd call us regulars. The menu (fatheadscleveland.com/Fa…) is pretty extensive at 7 pages and it has just about everything you can imagine a place like Fatheads would have - salads, pizza, wings, burgers, and headwiches. Yeah, Headwiches. Headwiches are the signature sandwich of Fatheads and they are massive. Easily able to feed two (or one Adam Richman) they come in about a dozen different styles like the Southside Slopes with kielbasa topped with fried pierogies, American cheese, grilled onions and horseradish sauce and the Beauty and the Beasty with pulled pork in their spicy Beasty BBQ Sauce. Topped with creamy cole slaw, pickles and raw onions. Sure it's a kitschy novelty but it's worth getting one just so you can say you did. They are also moderately priced with just about all menu items falling in the $9-$10 range.Overall, Fatheads gets my seal of approval. As others have mentioned the food can range from the ho-hum (I'd pass on the potato chip \"nachos\" and the smoked prime dip) to the holy hell I've gotta have that again (the triple bypass burger is a work of art and the 4-onion honey and ale soup is worth bathing in) and the service is, like every other place, completely dependent upon who you are stuck/blessed with that night. Just keep in mind that your servers are in the \"hospitality\" industry - how happy do you expect them to be? Our experiences have been pleasant and our service good. Your results may vary.P.S.They do have the whole annoying \"fries only come with the burgers\" rule which I don't necessarily get. But it is their place and I suppose their entitled to do whatever the hell they want. As long as they keep the beer flowing I'll look the other way.", "Date": "2012-12-01", "Author_Location": "Cleveland, OH"}, {"Author": "Hannah H.", "ReviewID": "pq026tuWYXoNT_xQ7TXe8g", "Overall": "4.0", "Content": "I love this place. The beer selection is great and so is the service. I ordered food for the first time on Monday and it was so-so. We ordered the margherita pizza (too much goat cheese - which shouldn't be on a margherita pizza to begin with!) and the house salad (nothing special). doubt I'll order anything off the food menu again.I'll keep coming back for the beer though. I love that it's brewed on-site and that the selections change as often as they do.", "Date": "2011-11-17", "Author_Location": "Los Angeles, CA"}, {"Author": "Rieale L.", "ReviewID": "CeqGMH5H1gTqnGxdHSjv_Q", "Overall": "5.0", "Content": "Fatheads again proved why it's my favorite destination.  Amazing service coupled with oustanding food and beer.", "Date": "2014-02-02", "Author_Location": "Olmsted Falls, OH"}, {"Author": "Andrea A.", "ReviewID": "fAD3iQ6DULI4f036DWL6NA", "Overall": "2.0", "Content": "Upon entering and sitting down at a table near the bar area, it took awhile for anyone to come over to us.  When someone finally did, they brought chicken fingers....oops, they weren't ours, since we hadn't even seen a menu yet.  Finally, someone came over with menus....but we had just come for drinks, and didn't try any food.More specifically, we had come for the Bumbleberry Ale, which was a 2010 Midwest winner.....and they were out of it.  I was sad, as it was what I came from out-of-town to try.....  the waitress was unable to tell me when they would have it again.  So, I settled for the Apricot Wheat, which I wasn't too impressed with.  It was a bit malty for my taste.  I sampled and then got a glass of the Summer Haze also, which I did like.  I was going to try another beer (German-like with banana and clove notes), but they were out of that as well.If the waitstaff were more on the ball and their inventory were more in order, I would have rated this higher....but...maybe better luck next time.", "Date": "2010-08-25", "Author_Location": "Taylor, MI"}, {"Author": "Ben M.", "ReviewID": "vf_diHmxKspu3mpAGxp9Iw", "Overall": "4.0", "Content": "My wife and I ate here for lunch.  Overall we enjoyed our visit.  The place is a new renovation of what used to be an old market.  It's nice inside, nothing incredible, basically what you'd expect from a brew pub, but it was clean and tastefully decorated.  There are logos from local breweries painted on the wall, and some Fat Head's artwork around along with some of their beer awards to round on the decor.  Our only complaint was that the high ceilings and large amount of hard surfaces made it kinda noisy inside.  It wasn't bad during lunch when the place wasn't crowded, but with more people it might have been bothersome.As for the food, I ordered a club sandwich and my wife ordered a burger.  Both were good and portion sizes were very (very) large.  I felt like I definitely got my money's worth.  There were also some homages to Cleveland on the menu with dishes featuring brats and pierogi.  Everything tends towards the large size though, even advertising some of the sandwiches on the menu as \"As big as your head\".  So if that's what you're looking for, then you'll love it, but if you like smaller portions you might struggle to find something order.  My advice is just get a takeout box.Now we come to the real reason we went to Fat Heads; the beer.  Fat Head's own brews are award winning stuff.  Their own Head Hunter IPA has won many awards and is considered the best IPA in the country right now.   They also have many high quality micro-brews from other breweries (Bell's, Bear Republic, Great Divide, Founders, etc.) on tap.  If you love good beer and are in the area you owe it to yourself to stop by.All in all we like out visit and will probably go back when we're in town.", "Date": "2010-12-29", "Author_Location": "Cheltenham, United Kingdom"}, {"Author": "Karyn C.", "ReviewID": "-NofiGbG3cCRNd3FrLFESg", "Overall": "5.0", "Content": "I really love this place. Beer selection is excellent. Their beers are usually great, and they always have a great guest beer selection.  Food is very good. My only wish is that they allowed chip/fries substitutions. Getting in there on Friday or Saturday nights nearly impossible. Staff is excellent, and they know their beer.  These folks win many beer awards, and they deserve them.", "Date": "2013-05-18", "Author_Location": "Rocky River, OH"}, {"Author": "Andrew P.", "ReviewID": "SNJ4MKWu1qFwKKZYRm-ocw", "Overall": "4.0", "Content": "Bottom line up front: friendly and original brewpub with outstanding beer and tasty food.  I hope Clevelanders recognize and appreciate the good fortune of having Fat Head's in their 'hood.Passing through the Cleveland area, I visited Fat Head's for dinner on a recent Friday night.   I had two great cask-conditioned, brewed-on-the-premises beers -- a smooth chocolatey porter and a super-hoppy IPA.  Food consisted of a tasty and generously-sized taco salad featuring home-made potato chips.   The service at the bar was friendly and responsive.  Fat Head's is worth visiting.  Along with Bar Cento in the Ohio City neighborhood of Cleveland and Feve's bar in Oberlin, Fat Head's is on my list of NE Ohio food and drink experiences which I would recommend to anyone (especially those old enough to drink the beer).  update: back again for dinner on 10/21/11 on a road trip and visit with friends: Fat Head's is still a major keeper!  The beers were fresh and interesting -- the list is amazing.  Buffalo chicken salad was tasty and ample.  Bravo!", "Date": "2011-02-05", "Author_Location": "Takoma Park, MD"}, {"Author": "Liz S.", "ReviewID": "R_DlB7lxYEWxgEJE8IPqaA", "Overall": "3.0", "Content": "Fat Head's is a chain that takes on the quirks of the city it's in.  The Cleveland one (in suburb, North Olmsted, OH) is in what used to be Danny Boy's, a large produce market.  It was a staple and most in the area were sad to see it go so it's nice that Fat Head's displays some nostalgic items from Danny Boy's past.The place is huge and is well known for its beer selection.  The food might appear to be pricey but the quantities are enormous.  Hence one of the burger names, \"The Artery Clogger\".  Take half home or share - or clog your arteries.  Even the salad I once got was \"as big as my head.\"  Another time I went I got the \"Parma Karma\" which is off the appetizer menu.  It is PLENTY for a meal.  Parma, a suburb of Cleveland is known for its Polish delicacies.  mmmm perogies.I enjoyed the clever meal names, whether they were based on the extreme size of the meal or Cleveland fun facts.", "Date": "2011-07-01", "Author_Location": "Cleveland, OH"}, {"Author": "Nick D.", "ReviewID": "LVOCPkb9aSCmXV1dYUIvWw", "Overall": "5.0", "Content": "I have been to Fat Head's several times and it is my go to place for when I have company in Cleveland from out of town.The building is huge, as well it should be, because it use to be a farmers market and they give tribute to this with a wall of pictures and a small history.Fat Head's is foremost a brewpub. When you work through the front door the first thing that hits you is the smell of the hops and mush from the brew process. The large bar is on the left with plenty of room to sit and have a drink or two, maybe three.This place is great for large parties, as they have massive tables that easily seat 10 or more people with plenty of room. The menu is large as well, with something for everyone. They have their signature  headwich, which is simply a large sandwich that is one of the best I have ever had. If you plan on getting a salad be warned that they are also massive. Everything about this place pays tribute to the name Fat Head's because everything is so large and it will go to head as one of the best places to eat in Cleveland.", "Date": "2011-07-14", "Author_Location": "Lakewood, OH"}, {"Author": "Chas M.", "ReviewID": "2TYlZEXFMU0MknY_I-2mbw", "Overall": "5.0", "Content": "Matt is a kick ass brewer.  Ted is a kick ass restaurant manager.  Derek is a kick ass chef.  They also have some kick ass bartenders.  It still might take a tad bit go get a beer from the bar sometimes.  The drink slingers like to chat a bit much when the bar is 4 deep.  This location is way better than the original one in Shittsburgh and this one has a brewhouse, which the other does not.  The headwiches are frickin huge.  Try the bay of pigs...it will change your life!  If the fried shrooms and wings dont give ya a boner I dont knwo what will.  Hope to see some maltier beers with the Fatheads label on it.  7 different hoppy beers on tap dont do it for me but his place still rocks!", "Date": "2012-09-24", "Author_Location": "Cleveland, OH"}, {"Author": "Frank F.", "ReviewID": "4vgwuHxm3CzXvyxhUwCsEw", "Overall": "2.0", "Content": "We've been here a bunch of times the last few years and although the portions are huge and they have pretty good beer, the service is just always sub par. I could go on for a while why I think this, but I prefer to be a little more constructive about my comments and say the following. TEACH YOUR BARTENDERS HOW TO SERVE A BEER. Don't touch the top of my glass, don't use the bar rag to wipe it off after you over filled the glass cause you were yelling at someone at the end of the bar, and if you dip your arm in my beer (yes this actually happened) don't serve it to me anyway. I understand this may come off as snooty to some, but I don't care. If I'm paying premium prices for a premium beer, it should be served as such. Hire people who care. Our last experience was during a day shift and I was shocked at how careless they acted. There must be a ton of jobs in Cleveland (which I doubt). The end product at Fat Heads is not bad, just the delivery system is.", "Date": "2013-08-29", "Author_Location": "Chicago, IL"}, {"Author": "Sara H.", "ReviewID": "B06eHbnbQoZA2tNSJrKUTA", "Overall": "4.0", "Content": "Love this place! Make sure you are hungry portions are huge! Get there early or very late to avoid the wait", "Date": "2013-01-13", "Author_Location": "Cleveland, OH"}, {"Author": "Alex F.", "ReviewID": "kRBYHiVJpNC213lYSgx8Xw", "Overall": "4.0", "Content": "Miss this place if ever back in Cleveland this will be a must hit! Good food too. I enjoyed filling up my growler there tues it is like 5 bucks. The Tree Hugger is by far my favorite brew they have!", "Date": "2013-01-06", "Author_Location": "Clearwater, FL"}, {"Author": "Tyler H.", "ReviewID": "5gBBdz8pWaXiDzMdDcIV6w", "Overall": "5.0", "Content": "Best beer around, and always have something new on tap to keep things interesting.   Don't worry about the long waits this place has at times, there is a reason so many people want to eat and drink here.  It will give u extra time to sample their extra tasty beverages at the main bar before u r seated", "Date": "2014-01-13", "Author_Location": "Medina, OH"}, {"Author": "Sharon R.", "ReviewID": "yei5Re8D6qd34lABHNwqUA", "Overall": "4.0", "Content": "This place is really cool inside! Love seeing the brewmaking equipment while drinking a local brew. Food was delicious get the chicken wings!", "Date": "2014-01-12", "Author_Location": "Eastlake, OH"}, {"Author": "Daryl G.", "ReviewID": "z2iuSazYfWF4zjqiLbPCCA", "Overall": "5.0", "Content": "This review is not based on a particular dining/drinking experience, but rather a general review based on the combined 20-30 times I've been to Fat Head's since I discovered it a few years ago.  This is without question my favorite place to drink in the Greater Cleveland area.  This place is always crowded, however its very large on the inside, and you rarely have to wait long to get a table or a seat at the bar.  This place is all about the beer - I'm a home brewer and craft beer snob and can honestly say Fat Head's makes the best beer in the world.  No matter how many times you visit, there are always a few new styles on draft.  The food is comparable to Melt - gigantic portions of creative pub food.  I've no particular complaints about the food, but be aware this place is famous for the quality of its beer, not its food.  Highly, highly recommended.", "Date": "2013-06-20", "Author_Location": "Cleveland, OH"}, {"Author": "Diane M.", "ReviewID": "H3Yd_I-4wlOEO1nS2JpLWQ", "Overall": "5.0", "Content": "My husband and I were up on a visit from Florida and had wanted to go to a brewery while in town.  The day before, we had gone to another brewery but I wasnt that jazzed about it.  My dad suggested we go to Fatheads as he and my brother had both been there previously and he had wanted to get a refill on this cute little growler you can buy and refill with the different brews.  OMG I love this place!!!!!  There are so many different brew selections your head will spin!!  Thank goodness they have this sample plan and that's what my dad, my husband and I did.  My mom was quite happy with her pop!  Both my mom and dad ordered sandwiches which looked incredible and huge!  My husband and I split appetizers of wings and, being the good Clevelander I am, pierogies.  Not a peep of disappointment was heard because the food was delish.  And the beer was amazing!!!   I ended up sampling 4 different selections, all very tasty, from pale ale to fruit beers.  I am sad that I missed oompla loompa when I was there but there is always next time, and I will return!  Or even better, Fatheads, come to Florida!!!!!!", "Date": "2013-10-14", "Author_Location": "Melbourne, FL"}, {"Author": "Luke M.", "ReviewID": "h4l3VWfE8Ckdkbwqy0rP7g", "Overall": "4.0", "Content": "Fat Heads is always crowded for dinner.  I've learned this after three attempts to go there and decline a hour or more wait time.  OK, it's a extremely popular place, I get that now.  Finally, I smartened up and visited in the early afternoon.  2pm in the afternoon - Boom!  Immediately seated! The menu is massive and we realized it was going to be awhile before we decided what we wanted to eat so we started off our early dinner with a basket of Shrooms. They're coated in a beer batter, fried, then served with a horseradish sauce.  The basket could barely contain the massive amount of mushrooms.  I suggested they upgrade to a bucket.  Anyways, there was probably enough to feed six for a appetizer.We both ordered 'Headwiches' (You know, sandwiches that are relatively close to the size of your head).  She ordered the Devine Swine, and I got the Fat Italian.  When they arrived they had two very large wooden skewers holding the ginormous sandwiches together.  The chef, taking extra care, stabbed each sandwich with a knife just to be sure they had a safe trip to the table.  My wife agreed to cut our sandwiches in half and go 'halvsies' so we both got to try each - I think that's why I love her.  Her Devine Swine had some of the best pulled pork I've ever had and my Fat Italian was like no other Italian sandwich I've had. On it was your typical Italian sandwich items PLUS crumbled hot sausage and hard-boiled egg.  Amazing!  They have a sandwich called 'Southside Slopes' that I'll be trying next time as it was given the honor of being the the #5 best sandwich in America according to Maxim Magazine.Lets not leave out the fact that Fat Heads is also an award-winning brewery with several different handcrafted beers brewed on-site for you to enjoy.  So wonderful, they will soon be opening up a standalone brewery in Middleburg Heights to increase production and distribution.  Woo-Hoo!My tips: Go early, with a hungry tummy, and check out the menu before you visit!", "Date": "2012-05-02", "Author_Location": "Parma Heights, OH"}, {"Author": "Jamie A.", "ReviewID": "SlGKpWfItyTVvlDS3h8UEQ", "Overall": "5.0", "Content": "This place is amazing.  Everything I have ever had has been delicious, and the portions are huge!  The prices are great as well.  Big fan of the nachos and Bumbleberry beer.", "Date": "2014-01-05", "Author_Location": "Stow, OH"}, {"Author": "Amy T.", "ReviewID": "Z8PGizTJB5ZemuGxSS8A1g", "Overall": "4.0", "Content": "I had a fun time here even though I had to wait a very long time for a table on Saturday night. I wasn't expecting to really like the place, given it is a Pittsburgh transplant and I try to stick with Cleveland local spots. However, they did an awesome job of making the place feel local. Stadium mustard, sausage, and pierogies were everywhere. It was just the sort of food you want to see in a brewpub from Pittsburgh. However, I did get a little depressed about eating the food with the constant reference to \"fat.\" Really? Do I want to get fat?", "Date": "2009-06-09", "Author_Location": "New York, NY"}, {"Author": "PJ N.", "ReviewID": "pRqo61BFKI4GxNE_p3DpOQ", "Overall": "1.0", "Content": "only 1 word describes this place............. yuck!bad food, bad beer, bad service, bad atmosphere...............", "Date": "2012-12-18", "Author_Location": "Cleveland, OH"}, {"Author": "P W.", "ReviewID": "Oh01HK7YIlzct8IurEoS5Q", "Overall": "4.0", "Content": "The beer list is great. I did not try any of the beers they make due to a hangover but the list of micro brews was impressive. I had the pulled pork and my friend had the steak and sausage. He said it was good, mine was alright. The waitress was not good but oh well, it is not like I was in a rush anyway or ever have anything or place to go in a hurry. I don't see why people are always in such a rush. Such as rush hour. You are going to just end up at home 9 times out of 10 and be mad regardless. End up yelling at the wife and hanging out in the garage or whatever married people do.", "Date": "2009-07-30", "Author_Location": "Cleveland, OH"}, {"Author": "Marvin H.", "ReviewID": "DwAW3kdXBwXPUA8_IE_5JQ", "Overall": "4.0", "Content": "I will tell anybody the craft beers here are off the chain and they have the real deal NYC hard apple cider.The portions here will give you a heart attack and high blood pressue.I know the place is decent because the saturday night we came the place had atleast 500 to 1000 people in here eating and the bathrooms were clean.I will say give FATHEADS A try.", "Date": "2012-03-03", "Author_Location": "Sandusky, OH"}, {"Author": "Colin G.", "ReviewID": "YsTVlL1cYRbiwKFkFOHjSA", "Overall": "5.0", "Content": "I'm a brewpub lover so, when I randomly drove by this place on my first night in Cleveland, I decided to try it, even though I had other stuff to do.This place is very large, apparently inside of an old market. You're greeted by the brewing facilities behind glass and a very long bar, which leads to the table seating in a raised area.I sat at the bar and was quickly greeted and gave my requisite shpiel: water, your food menu and do you do a tasting a tray? They had eight of their own beers on tap, and that's what came in the tray. I think it ran about $9.50, which is good relative to other brewpubs.While he poured, I looked over and saw their guest taps. Wow! It's like a who's who of regional micros and, not being regional, I had never tried the majority of them. They also had an Avalanche and a Stone (a very good Stone) on tap, which was a total surprise. Altogether, the guest taps numbered at least 15, putting the total at about 25. But wait, there's more: They had two more cask taps, featuring two more guest micros. Wow, again!When the bartender returned (he poured quickly), I got the skinny on the place. Fat Head's is a relatively famous Pittsburgh restaurant on that city's south side. Strangely enough, I had walked by the place the previous night but didn't go in because it was packed (this was during a Penguins' Eastern Conference playoff game). That location and this were their only two though, and this was the only one that brewed beer.The food menu yielded a plethora of fabulousness. Something that says \"brewpub\" to me is a reuben, and they had two, including what I can only call \"a reuben on steroids\" called the \"brewben\" (cute).A lot of the menu was Pittsburgh-related, with lots of sausage, a couple of perogi dishes, and lots of burgers and pizza. It was really quite extensive, but all looked really good.But they also had a definite Cleveland twist on things. For instance, the \"brewben\" (which I ordered because it looked too damn good) came with Cleveland's famous Stadium mustard and hot peppers. Sounded weird, but, I have to say that it was one of the best reubens I've ever had. None of the various ingredients were overwhelming, the meat was nice, and the bread was just awesome. The sandwich was served with a side of \"fries,\" which were actually thick, lightly fried potato pieces (chips, essentially). This all ran about $9, and I had about half a sandwich to take home (a lot of food).Per the beer, I can't say that it's the greatest I've ever had. I did like a few. The lager was really nice (even though I don't usually like lagers) and the heff was smooth and very drinkable (even though I don't usually like heffs, although this was definitely filtered).The bartender was really, really nice and quick, my food came out very quickly (5-10 minutes after the order was placed) and it's kind of a fun place. Weird location, but I couldn't help but share the bartender's enthusiasm, as he optimistically discussed potential plans to extend to Columbus and ship the beer brewed there down to their Pittsburgh location.", "Date": "2009-05-29", "Author_Location": "Marina, CA"}, {"Author": "Dustin T.", "ReviewID": "nClsHJ1IIo1QsRriEJh8nQ", "Overall": "4.0", "Content": "They have some good home brews and some not so good, but they carry other micro and macrobrews too. The smoke house wings are amazing, but the regular wings always taste frozen and mushy. Other food portions are gigantic, and decent tasting... I didn't try the burger yet, but the pizza is good. Don't let the constantly packed parking lot fool you, the place is huge and the wait isn't too long.", "Date": "2010-03-18", "Author_Location": "Cleveland, OH"}, {"Author": "Marissa K.", "ReviewID": "nHBPQurdE-_FR-_6zOum2g", "Overall": "3.0", "Content": "Do not go here if you want halfway decent service.  Have been here twice.  The first time was so bad, they did not reduce the bill, but gave us a gift card. Service was just as bad the second time.  The good thing is the food. Their burgers were tasty and the onion rings were wonderful and spicy.", "Date": "2013-04-23", "Author_Location": "Cleveland, OH"}, {"Author": "Craig L.", "ReviewID": "qsbCJKSaSGNm7aTgNjgNaQ", "Overall": "5.0", "Content": "Great beers....Gogglefogger is one of the best.  They describe it as a banana bubblegum taste but dont let that scare you.  Ask for a sample and try it.  Huge portions.  Sandwiches are called Headwiches because they are the size of your head.  One great perk is ALL appetizers are half off after 9pm everyday.", "Date": "2011-01-05", "Author_Location": "Cleveland, OH"}, {"Author": "Jason B.", "ReviewID": "KERr3B-xHET1O3IxCVSM0g", "Overall": "4.0", "Content": "Fat Head's Saloon opened recently in North Olmsted and is seriously 5 minutes from our house so we thought we would finally give it a try.  Yes it is a chain.  Yes it started in Pittsburgh (boooooooooo!), but it's actually pretty damn good.  The restaurant itself is huge.  It used to be Danny Boy's Farm Market which I really miss.  It used to be such a great local market.  Now it's a nice giant brewery.  The bar stretches for what seems to be a mile, and there is ample seating in the bar, the main dining area and a patio.  The money they must have put into this place was well spent because it looks incredible.  However I will say one thing when it is not packed it looks very empty.  I didn't have any beer.  I just wasn't in the beer mood.  We just came to have lunch and catch the end of the Tribe game.The portions are huge.  Seriously an appetizer could easily be considered a meal in itself.  We started with the Parma Karma.  This $9.95 beast of an appetizer came with a char-grilled brat, a banger, and kielbasa.  On the side you get three sauteed pierogies served on top of a mountain of onions.  They come with a very mild horsey dipping sauce and Bertman's Stadium mustard.  The sausage trio was very good.  It was hard to distinguish the brat from the banger.  Oh, hell I have no idea what a banger is and I am trying hard to not throw in some sort of banger your mom joke here so let me just get that out of the way.  All I know was the kielbasa was very flavorful, and one of the gray tubers was incredible while the other was a little mealy.  I couldn't tell you which was which though.  The pierogies were stuffed with potato and perfectly done.As if I didn't eat enough already I moved on to an enormous sandwich called the Cuyahoga.  This was one of those we are going to give you a bun just to mess with you because there is no way in hell you can pick it up with your hands burger served with fries and a ranch dipping sauce.  So what is on the Cuyahoga you ask?  It is a giant burger smothered in pulled pork swimming in their Beasty BBQ Sauce.  But wait there's more!  It is topped with melted Swiss and covered in what seemed to be 500 jalapenos.  I am accustomed to ordering something \"spicy\" or \"hot\" and being disappointed.  This Beasty BBQ sauce is hot. It's burn your mouth hot, but not wipe your brow sweating hot.  There is a sweet tangy flavor to the sauce that is still there one bite then an ass kicking smack in your face burst of heat in another.  It is definitely a knife and fork burger unless you want to look and act like a complete hillbilly which they give you extra napkins for just in case.  I think Fat Heads is worth a try, a little pricey but the portions are ridiculous.", "Date": "2010-07-16", "Author_Location": "Westlake, OH"}, {"Author": "Rob V.", "ReviewID": "1-F7j-8CYlNpMIT3nHOnbw", "Overall": "2.0", "Content": "This place feels like Budwieser bought an Applebees.  UGH!", "Date": "2010-07-10", "Author_Location": "Beaverton, OR"}, {"Author": "Matt W.", "ReviewID": "lxkQWcIsCciQR3wogpILBg", "Overall": "4.0", "Content": "Good HUGE WHOLE wings! Half off Monday nights! Great garlic fries and awesome ranch!", "Date": "2013-01-01", "Author_Location": "Wilmington, NC"}, {"Author": "Karen H.", "ReviewID": "r2CHOp0nYDFY0q4YJB1cYA", "Overall": "1.0", "Content": "this is a terrible place for mushrooms that i was looking for to eating & enjoying. they were expensive $8.95 for a basket of them that our friends didn't even want to eat they were that bad. the paper was greasy also & i called the MANAGEMENT to complain about this & they said that they would send me a gift card i haven't received it yet & I do not live that far away from this place that it takes them 2-3 weeks to just send a card or a complimentary card out to me. I wouldn't recommend this restaurant to anyone. the only reason is we were with friends from work & they said for us to meet them there. don't waste your money by going here.", "Date": "2014-03-18", "Author_Location": "Medina, OH"}, {"Author": "Michael S.", "ReviewID": "oviV3MkTPAK4XRlvwP5yqA", "Overall": "4.0", "Content": "Their Head Hunter IPA rocks. Piney, with a grapefruity finish.  Their guest beer list is awesome, and it changes every time I visit. The smokehouse wings are superb, and the Fatwiches are great.  I've been there 5 times and the food gets better each time.", "Date": "2009-12-27", "Author_Location": "Cleveland, OH"}, {"Author": "Bob P.", "ReviewID": "ZdhlmXVa79-1RMHdgrv4sQ", "Overall": "4.0", "Content": "Love the beer at this place. Matt Cole, head brewer, is in my opinion one of the absolute best brewers around, if not the best. His award winning Head Hunter IPA is a must try, even if your not an IPA person. It is AMAZING! Food is good, portions are good size that should fill almost anyone. Only thing I don't like is \"no substitutions\" can be made. So if your choice includes potato chips, your stuck. You either eat them or you don't. Try this place and the beer. You will like it.", "Date": "2011-05-13", "Author_Location": "Cleveland, OH"}, {"Author": "Sarah L.", "ReviewID": "S1a2D2Ph4tfQ_THVcjrfug", "Overall": "5.0", "Content": "My boyfriend and I have been going to Fatheads now for about 2 years.  Since we live right down the street we are able to go there quite often, which is both a blessing and a curse.  I absolutely love it! It is easily one of my favorite places.  I've had almost everything on the menu and I have never been disappointed.  You can't go wrong with any of the Headwiches or the pizzas.  They have these smoke house wings that are gigantic and this beastly BBQ sauce to smother them in that's out of this world.  I'm addicted to their chips and this sandwich called the Breuben (it's like a Reuben, but better).  There's defiantly a lot to choose from.Fatheads isn't just about delicious food though.  They also have some of the greatest local beers.  I especially like their Headhunter IPA and I think that their Christmas ale rivals Great Lakes.  They have a kind of beer for everyone, from Belgians to stouts, even some Iambics.  The atmosphere is cool, unless you go in there on a weekend night and it's madhouse with a two hour wait for a table.  Their only downfall is the parking lot.  It's way too small for the capacity of the place.  On a busy night you'll end up trekking from the Drug Mart parking lot.I'd recommend this place to anyone.", "Date": "2012-09-30", "Author_Location": "North Olmsted, OH"}, {"Author": "Lindsey W.", "ReviewID": "Axm2zV_QKqgtLmJP8Df_iQ", "Overall": "4.0", "Content": "My husband and I stopped into Fat Head's on a recent trip to Cleveland and were definitely impressed! We tried pretty much every beer on tap (over 10 of their own brews at that time) and liked almost every one. The Headhunter IPA was definitely among our faves, which doesn't surprise me seeing how many awards it's won.For food, we started with the Smokehouse wings (delicious) and each enjoyed our sandwich as well. The pub chips are excellent. And it also helped to have a very attentive, friendly and well-spoken bartender. His name was Kevin - great guy. So long story short, I would for sure check this place out if you're going to be in/around the Cleveland area.", "Date": "2010-02-11", "Author_Location": "Chicago, IL"}, {"Author": "Rich N.", "ReviewID": "CsuUWeOqG2vQPCs-bnlEZg", "Overall": "2.0", "Content": "I'm confused. I'm sitting here in bed after having drinks and dinner there tonight. While the bumbleberry beer was good and the server was friendly, I probably wouldn't go back.The food just wasn't good, and I'm generally put off by large portions. It's not funny or appetizing watching 300 lb people gorge themselves on sandwiches the size of their heads made of subpar ingredients. With amazing markets and options for purchasing meat in this city, maybe I just expect better.The smokehouse wings had very little meat on them and were cold by the time I got through 3 of them. My friend's hamburger looked like prison meat. We all ended up bloated and none of us actually even came close to finishing our meals.The atmosphere reminded me of the Walmart of breweries. Get some character or something.Sigh. I really wanted to like this place.", "Date": "2013-02-22", "Author_Location": "Lakewood, OH"}, {"Author": "jen g.", "ReviewID": "LnBLEB2T59D06DUS-AWUvA", "Overall": "3.0", "Content": "Go to Fat Head's for wings and beers (bumbleberry, starlight varieties are my faves). I wouldn't recommend any of the sandwiches because besides the meat portion of it, the rest is carbs-and greasy ones at that. They serve them with potato chips that are made in-house but are not tasty. Service today was good, and we sat on the patio. I'd definitely look to try more of their appetizers but not the main entrees.", "Date": "2011-07-01", "Author_Location": "RIDGEWOOD, NY"}, {"Author": "Christa T.", "ReviewID": "fCS9LcZ8UckSSHkZJR8HAA", "Overall": "4.0", "Content": "I had the pleasure of joining 5 others at a fairly new restaurant in the Cleveland area, Fat Head's Saloon located at 24581 Lorain Road in North Olmsted, OH. I tend to like restaurants like this, a good mixture of food and beer with a lively atmosphere.My first impression of Fat Head's was it was extremely crowded! It was a Friday night at dinner time, but just finding a parking spot was difficult. Most of my group had to park in the Drug Mart Plaza parking lot located next store to the restaurant. Walking into the restaurant you are hit by the crowd as well. The bar was packed full with the 25-40 crowd. We had a 20 minute wait for a table and once we got there, I will admit it was difficult to hear each other with 6 people at the table as the atmosphere was continuously loud with conversation and televisions. This is not a place you want to go to have an intimate conversation, more of a restaurant to hang out with a group of friends. For those wondering how \"kid-friendly\" it is, remember, this is a brewery, so there is a lot of alcohol themed decorations and displays. However, there were three children at three different tables around our group, so it would be at your discretion. Most of the patrons were adults.The menu for Fat Head's consists of wings, wraps, subs, melt sandwiches, chicken sandwiches, burgers, pizza's and a few salads. They have a select few vegetarian-friendly dishes such as the Friday special of the day, the Black Bean Burger. The beer list is rotating, meaning they have different beers on different days. They had 10 rotating beers and 19 beers that are always on the menu. Prices ranged from $1.25 to $2.00 for a sample size and $4.25 - $6.50 for the regular sized pint. The samples were quite large for the price in my opinion.The meal I chose was the Gooney Bird, which was a char-grilled chicken sandwich covered with hot sauce topped with cheddar cheese, bacon and ranch dressing. It was served with homemade chips. For those wondering about French fries, fries are served with burgers, chips with the sandwiches, wraps and \"headwiches\". The chicken on the sandwich was cooked well, though the sauce was a bit spicy, so not for everyone. The cheese and dressing seemed to help cool it down. The chips were average. Though they were large and thick, they were very plain. There were also several that were burned and dark.The rest of my party ordered Fish and Chips, Black Bean Burger, both specials of the day, Divine Swine, a pulled pork \"headwich\" (sandwich as large as your head!), a Philly cheese steak sub and a Euclid Beach Burger. All of us finished our meals except the \"headwich\" patron. It truly is a meal you can take home for lunch the next day. Though we did not have dessert, Fat Head's offered Chocolate Stout Cake, Maple Pumpkin Pudding and Pumpkin Cheesecake. All members of my party enjoyed their meals.The women's restroom was quite messy, which was a disappointment. There was a lot of paper on the floor and a lot of water around the sink, counter and on the floor. It also took awhile for us to get our check. For my meal of a sample of beer and the Gooney Bird, it was $10.98.All in all, Fat Head's is a great atmosphere, fun and has an ample choice of menu selections. It is food that you can find at other restaurants, so lacking in originality, but quality and taste-wise, I was pleased with my visit. I would certainly recommend Fat Head's and plan to go again.", "Date": "2011-01-27", "Author_Location": "Lakewood, OH"}, {"Author": "Katie H.", "ReviewID": "aPCUFA73O-AUAo6tSkCvAw", "Overall": "5.0", "Content": "Wow the beers are great (gogle fogger was the big winner of the night).  And the food was great too, loved the fresh cut frys. Lots of parking.", "Date": "2012-11-12", "Author_Location": "Lansing, MI"}, {"Author": "Adam J.", "ReviewID": "eG9KJwy_ShHgYhJdjJotiw", "Overall": "3.0", "Content": "The food here is pretty good although not too many healthy options. Lots of beers to choose from including a good selection of in-house ones. The Christmas seasonal rivals Great Lakes. My biggest complaint has been with the game / party room which is pretty good, but we've been kicked out many times for private parties. I suppose they get more money for these, but it's frustrating when four people just drop $16 in the Golden Tee machine and then get kicked out for a party.", "Date": "2012-02-18", "Author_Location": "Westlake, OH"}, {"Author": "Lisa W.", "ReviewID": "7YvMEGdUtzXOKXyrNN2o6Q", "Overall": "4.0", "Content": "Great food.  We had buffalo calamari - yum!  Good service!  The bumbleberry beer was refreshing and the IPA was rich and flavorful.  The one negative was the acoustics - maybe some alteration to the ceiling would allow for conversation.  We will return with the whole family as the kids will like it too!", "Date": "2011-08-11", "Author_Location": "Olmsted Falls, OH"}, {"Author": "Chad C.", "ReviewID": "9FpNv19Jss0OUWl_8gP50Q", "Overall": "3.0", "Content": "Cool place, very popular - at least on the weekends - so be ready to wait a bit if you're heading there.  Tons of beer and the menu is just huge.  We had the onion rings which were fried in a darker beer batter.  They were good but nothing too special taste-wise.  We also tried the wings which were good but a lot of work because they weren't seperated into flat/drummie.  Didn't think it was worth the work to consume those, but they did taste good.  The buffalo chicken pizza was very good and I would get that again.  Good food and a good atmosphere.  If there's one thing to remember about this place it's that portions are HUGE.  Go there hungry.", "Date": "2011-09-13", "Author_Location": "Milwaukee, WI"}, {"Author": "Tam V.", "ReviewID": "lIZ6rvGfeZn-NIFDe5ycmQ", "Overall": "3.0", "Content": "I found this place hit or miss. The beer is always excelling but the food is just eh most of the time. I would recommend getting the sampler of the beer and to find one item that you really know that you are going to enjoy and stick with it. I've had two food items here before, their Black Bean burger (I'm trying my best to be a vegetarian, or at least eat less meat) and their Triple Bypass burger. The black bean burger is forgettable and it is probably one of the worst \"burger\" I have had in a long time. I know, I should've known this from the get-go that I should get a real burger made from beef but I wanted to give it a shot. The Triple Bypass burger on the other hand was delicious when I had it. Though the burger itself wasn't the best, it was cooked to perfection and I really enjoyed it when I ate it.", "Date": "2012-03-08", "Author_Location": "Little Rock, AR"}, {"Author": "Brian C.", "ReviewID": "obSVR7yHtnOxIDUFU8WoOA", "Overall": "5.0", "Content": "Stopped here while visiting the area and loved it! I wish there was a Fat Head near us in Dayton, it's awesome! The beer selection was first rate, kind of a no brainer here since the place brews its own and serves lots of other fantastic beers, something for everyone. The food is crazy huge and has a flavor to match! I ordered a sandwich that was about as big as an infants head, hence the name I think! My wife and ordered the pretzels with a some sort of mustard that was amazing, the pretzels were the best we've ever had. If you find yourself near a Fat Head, check them out! You may want to fast for 24 hours prior to eating here though, bring your appetite!!", "Date": "2012-05-02", "Author_Location": "Dayton, OH"}, {"Author": "Sara B.", "ReviewID": "egaFDa-ZhFlhGy7v7qQ9ig", "Overall": "3.0", "Content": "Fat Heads is officially A-okay. I had a great burger there, and everyone else at my table were really happy with their food too. The wait is still stupid and the place is still crazy loud, and the beer just okay for me. So 3 stars it is.", "Date": "2012-05-03", "Author_Location": "Cleveland, OH"}, {"Author": "Amy Z.", "ReviewID": "ULCUwgnZyb6vO-EAQY_W7g", "Overall": "2.0", "Content": "Oatmeal stout was very good, but ruined by the pompousness of the bartender who served it to me.  He was slow, not very knowledgeable and kind of a general douche unfortunately. Experience would have been better if the service was. Rocket Man Red Ale was good as well, but not as good as the stout.  Got an appetizer with kielbasa, bratwurst, banger and pierogies. Pierogies were delicious, sausages were just grilled sausages...nothing exceptional.  The portion was great though for below $10.  I could only finish half.  Looking around me, all of the potions are enormous.  Odd menu note though, pompous must be a theme at this place because there was a whole diatribe on their menu about not substituting chips for fries.  Anyway, I was a bot confused, didn't feel particularly welcome, and was very surprised by this from a small local chain in Cleveland of all places...Plenty of other brew pubs to spend your $ at in the area...skip this one.", "Date": "2012-05-31", "Author_Location": "Tampa, FL"}, {"Author": "Seed M.", "ReviewID": "72C7ksNJM1XIsnnnEaSgeg", "Overall": "5.0", "Content": "Killer wings. Killer Sandwiches all over the board. Italian by far my favorite. Chips are perfect. This place is so top dawg. I don't drink beer but it supposedly the beer is rippy. I can't emphasize more how much this place means to me. Fatheads Vs. Lizard. FATHEADS", "Date": "2012-08-20", "Author_Location": "Cleveland, OH"}, {"Author": "Kimberly C.", "ReviewID": "xJ6MxRrpI083JMFG8EizQQ", "Overall": "3.0", "Content": "True to my word I brought my boyfriend back last week.  This time the food was jusk OK.  Not bad...but not great  I hope this visit was just a fluke.  I'll give it a 3rd try to find out!", "Date": "2010-08-09", "Author_Location": "Avon, OH"}, {"Author": "Niki F.", "ReviewID": "g-qGL0iY4boOBtIjp2Ydkg", "Overall": "4.0", "Content": "The only down fall to this place is the wait. It is that popular that every time we go we have to wait for an hour and half. They are plenty of beers to sample while you wait. They brew their own beer at Fat Head's and it is quite tasty. Plenty of room of large parties and the parking is made for the busy restaurant. I recommend really any burger on their menu! Great place for a burger and a beer!", "Date": "2012-06-27", "Author_Location": "Cleveland, OH"}, {"Author": "Tim P.", "ReviewID": "dsV6bFlgYUyl-gNLD7La0g", "Overall": "4.0", "Content": "Great restaurant.  Laughed when I found out that this is part of a Pittsburg, PA chain.  So...Pittsburg owns former National City Bank (now PNC), Fat Heads and...Cleveland BROWNS????", "Date": "2011-02-05", "Author_Location": "Cincinnati, OH"}, {"Author": "Shannon O.", "ReviewID": "d6i1GxDK-L1-tMjIzxLFdQ", "Overall": "4.0", "Content": "LOVE the beer and cheese soup here, love the beer, the sandwiches are great...but the fries or chips (depending on whether you get a burger or a sandwich) aren't so fantastic. The chips are almost always overdone and undersalted -- no thank you. One of these days I'm going to learn my lesson and just order two of the four-onion + cheese soups for dinner instead of having a sandwich! The only reason this gets 4 stars instead of 5 is that it's ALWAYS miserably crowded, and often tough to get a table.", "Date": "2011-12-19", "Author_Location": "Cleveland, OH"}, {"Author": "Todd H.", "ReviewID": "JGvsEIzL3XlFBa33DXSZqw", "Overall": "5.0", "Content": "Visited Fat Heads for the first time on a Saturday night right before Christmas.  We had a mediocre wait, which I expected.  What I didn't expect was that this place is HUGE!  I had no idea how big this place was inside.  I started out with Christmas Ale from the bar.  I have to say I enjoyed it much more than the offering from the other place in Cleveland.The boy and I shared an order of fresh baked pretzel sticks that were serves with a Wasabi/beer/mustard that was amazing.  I never would have thought of that combination, but they hit the nail on the head with that one.I got a huge and tasty perch sandwich with their chips and the boy got the triple by-pass burger with fries.  Both delicious and we got out of there for around $30.Highly recomend", "Date": "2010-12-28", "Author_Location": "Milan, OH"}, {"Author": "Darin S.", "ReviewID": "H1OevKHSa0lVZG8TvxA0Qw", "Overall": "3.0", "Content": "The menu had many interesting bar food items to pick from.  We had wings, sandwiches, and the calamari that were all good.  We asked the server to bring us their highest rated house brew and were served the Head Hunter IPA.  Do not, I repeat do not try this stuff unless you really like eating pine scented air fresheners.  It was almost undrinkable.  I know it has won awards and many people rave about it, but unless you have some idea what you are dealing with, stay clear.  The atmosphere was very good and the place was packed.  Just don't venture into the exotic beer selection without serious guidance.", "Date": "2012-10-13", "Author_Location": "Joplin, MO"}, {"Author": "melanie l.", "ReviewID": "K-so0FJgZdEbODk1i1rFug", "Overall": "4.0", "Content": "Reasonably priced and friendly. Wish they would take reservations. It's a great place, but not wait 2 hours for a table great...Updated March 2012- The more I go, the more I like this place. The Cleveland Club is a favorite and the house made chips are great.", "Date": "2012-01-01", "Author_Location": "Cleveland, OH"}, {"Author": "Linda H.", "ReviewID": "XLUE5ya-EUmOyfJGXoQmfA", "Overall": "4.0", "Content": "I've been coming here since it opened.  Great bar grub and beer selection.  As a gal from Pittsburgh, it's only natural that I would love Fat Heats.", "Date": "2011-11-14", "Author_Location": "North Olmsted, OH"}, {"Author": "Kyle M.", "ReviewID": "jaD4Oqf_Q8staM0JXGKyjg", "Overall": "5.0", "Content": "Fun atmosphere, enormous craft beer selection, gigantic servings of food, and a fun lively atmosphere. Highly recommended restaurant but be sure to sit the appetizers amongst several people!", "Date": "2011-12-30", "Author_Location": "Berea, OH"}, {"Author": "Kevin C.", "ReviewID": "ecT985Q4wVZzUVD1ZWUOHA", "Overall": "5.0", "Content": "Awesome smoked wings. The Headwhiches are all phenomenal, especially the brisket and the South Side Slopes. The beers are fresh and top notch, worthy of every award they win. Even more amazing is how they transformed the old Danny Boys Market into a brew pub, keeping the style and memories of Danny Boys in tact. I recommend to anyone looking for a great eatery and pub.", "Date": "2012-03-06", "Author_Location": "Katy, TX"}, {"Author": "Dee S.", "ReviewID": "t07-v1RDyyImEcj5Wc6lBw", "Overall": "5.0", "Content": "LOVE Fat Head's! This is my go-to place to take visitors from out of town. Their beer is excellent! They change the beer menu daily and there is always an excellent variety for dark and light beer lovers. My favorite is the Bumbleberry which they put actual blueberries in :) Their appetizers are huge, my friends like the onion rings (which have at least 2 inches of spicy breading) and the nachos are massive. I've loved the salads and sandwiches I've tried. Mondays they have $1 off beer till 9 and M-W you can get growler refills for $3 off. Service has always been good everytime I've been here. Another plus, they always play the Tribe games and have TVs throughout the restaurant. Definitely worth a try for a relaxing night out with friends for good food and beer.", "Date": "2013-07-06", "Author_Location": "North Olmsted, OH"}, {"Author": "Jim B.", "ReviewID": "D-Txf5tKhgZBFekYTikO-A", "Overall": "3.0", "Content": "average bar food but when your're drunk who cares.", "Date": "2014-02-14", "Author_Location": "Westlake, OH"}, {"Author": "Roy K.", "ReviewID": "DONpoeS1ohdhnzFvro_Zcw", "Overall": "5.0", "Content": "Best place ever!", "Date": "2010-05-25", "Author_Location": "Olmsted Falls, OH"}, {"Author": "Steven S.", "ReviewID": "AN_gpRiUKb_UbpongmqyBg", "Overall": "4.0", "Content": "If you're a Beer Snob, this place is for you;With around 30 micro brews on draft you really can't go wrong.  Fatheads own brews are always very interesting the Apenglow Weisenbach has been one of my favorites (Do not let the description of this beer scare you), several of their seasonal brews are also great (Spooky Tooth in particular)Fatheads, being in a old Farmers Market  and with the brewery on location really add to the experience; The aromas of hops, yeast and so on just hit you when you walk in. The food is very heavy, but good.  Those who complain about the heat obviously are not reading the entrees complete description before they order.  Be prepared to take home some leftovers,  in addition to the food being dense the portions are comically huge.  The only thing I haven't really been a fan of is the Pizza, its ok but not great I would not order it again.The only reason I gave Fatheads 4/5 Stars is because the service is sometimes lacking, I know its probably because the place is packed with an Hour plus wait when I'm usually there (Fri & Sat nights) but sometime its ridiculous.  On several occasions I have had to waive down other servers to get a check, etc.  With that being said I keep on coming back to this place because it is just so much fun.", "Date": "2011-11-12", "Author_Location": "North Olmsted, OH"}, {"Author": "Benjamin N.", "ReviewID": "RDdw5mjJEPo-JpzKAqmoJQ", "Overall": "4.0", "Content": "Great place if you have a big appetite, very good selection of some excellent craft beers and the food is served in huge portions - even the salads.", "Date": "2012-04-07", "Author_Location": "North Olmsted, OH"}, {"Author": "Tina G.", "ReviewID": "LWaWuFYS3uVOZb21xBiTpw", "Overall": "4.0", "Content": "Wish I had tried this place sooner!! Went last night, and we tried #1, imperial head hunter, and the bumbleberry honey blueberry ale. ALL excellent! The food was amazing too. Typical bar food, but done right! Also, surprised that the GM was running food-- seemed like a super nice guy. Only disappointment was, I had noticed something on the beer menu about double chocolate stout cake, and when I asked about dessert, I was told \"we're not known for our desserts.\" So I didn't bother. But I shall return for awesome beers and good food.", "Date": "2011-04-05", "Author_Location": "Richfield, OH"}, {"Author": "Stephen S.", "ReviewID": "VkKi5u5NOeDjspbk-ObJMg", "Overall": "3.0", "Content": "Beer was ok, food was ok. Nothing bad, just not the best", "Date": "2011-04-12", "Author_Location": "Avon Lake, OH"}, {"Author": "Howard D.", "ReviewID": "Wg6Wn0tJQldFV1kqm8gkHA", "Overall": "5.0", "Content": "One of our go-to spots. The Headhunter IPA and Beauty and the Beasty, are the bomb!", "Date": "2012-07-09", "Author_Location": "Lakewood, OH"}, {"Author": "Christie M.", "ReviewID": "_VLivjvvsH6G3zfwuy45qQ", "Overall": "2.0", "Content": "Went here for the first time on the 4th of July. We didnt have to wait to be seated. Took a few minutes for our server to arrive and take our drink orders. She was apparently not happy to be working on the 4th and it showed! We ordered the  sampler of 8 different beers. They were ok, nothing great. My husband ordered a sandwich. It was giant, but he said it wasnt anything great. I ordred the black bean veggie burger and it had no taste at all. Overall we were disappointed. The service was not very good and the food was mediocre. Wont be going back.", "Date": "2013-07-07", "Author_Location": "Crestline, OH"}, {"Author": "Colleen O.", "ReviewID": "YLRPdYLxvfk4hT51LRPaiw", "Overall": "2.0", "Content": "Just finished having dinner at this brewery.  I was not impressed - at all!  I guess I should have known when walking in at 7pm on St. Patrick's Day and immediately being seated that this wasn't going to be a great experience.  The atmosphere was rather dull and did absolutely nothing to add to the experience.  Boooorrrriinnngggg.The food was average at best....and certain items were just plain bad.  One member of our party ordered the onion rings which were delivered to our table a nice shade of...hmmmm....what's the best word??  BURNT!  I guess that wasn't too bad because at least it gave them some flavor (which was missing in any other form.)  Another member had grilled cheese.  Fat Head's tries to make this pretty basic sandwich \"adult\" by slapping on some goat cheese.  It doesn't work...back to the drawing board chef!  The sandwich was average.  The potato chips as well.  They didn't have any sort of distinguishing characteristic.  Just boring.  The \"kid\" of the group ordered a pepperoni pizza.  This should at least be decent, right?  I mean, it's a simple pizza!  WRONG!!  As someone said, it tasted like frozen pizza.  But, not DiGiorno (hat tip to Joe Tate).  No, this was Tony's.  Most of it was taken home to the dogs.  I can't really comment on the beer since I stuck to Guiness on this glorious St. Patty's Day.  Other members of my party said it was decent.  The service was good.  The one good part of the evening.All in all, I will not go back...even if you pay me.  My belly hurts just thinking about it.  With all of the wonderful dining choices in the Cleveland area, this is a definite waste of space in my opinion.  If you are looking for a fun brewery with good food stick with Great Lakes!", "Date": "2010-03-17", "Author_Location": "Cleveland, OH"}, {"Author": "Babes S.", "ReviewID": "vQrJ04KuEbyXMShH4VXqLw", "Overall": "2.0", "Content": "Well we first went to this place when it first opened and got poor service and terrible food. We thought we would give it the benefit of the doubt for it being new and busy. Tried it again and it's still a bummer. We'll start with 5 stars.-1 for being Pittsburgh based.(yes it's silly, but that's how I feel, I like to support CLE)+0.5 for the \"Head Hunter IPA\" ----Wasn't amazing, but yes, it truly is a well made beer.+0.5 for \"Bumble Berry\"-----Clean and refreshing with fresh blueberries swimming  in it-1 for the spinach dip which we were told by the server \"excellent choice\" the pita chips appeared to be fried in old fry oil(dark and very oily tasting) and the spinach dip tasted like they poured bacon grease in it (perhaps this place is really made for fat heads)-2 Ordered Medium Rare Burger which came just about over Medium Well. I faced the facts that they clearly just don't have capable cooks in the back for being second failed attempt food-wise. So I ate with a sad face.-1 for sirloin sandwich(like I said, seems to be made for the fat people of Cleveland, everything was way too greasy)-0.5 for slow service.... All in all, if you like bad food and wash it down with decent brew from Pittsburgh then maybe this is the place for you, but not for us. That 2nd trip was our last.", "Date": "2013-04-12", "Author_Location": "Westlake, OH"}, {"Author": "Richard R.", "ReviewID": "VmQ73O2jZuKvgr5mEuG5Lg", "Overall": "5.0", "Content": "As always, a great place to go", "Date": "2013-05-03", "Author_Location": "North Ridgeville, OH"}, {"Author": "Linda W.", "ReviewID": "7gzmXjkxpOYuBUC0qlxbhQ", "Overall": "5.0", "Content": "So just how does a Pittsburgher who languishes on the sidewalk waiting to get into Fathead's get in quickly?  Go to Fathead's in CLEVELAND!  Fathead's is in Cleveland, you say?!  Yeppers.  Okay, so it doesn't have that gritty, hip vibe that the original has, but I'll gladly sacrifice authenticity for their fabulous food....equally wonderful in Cleveland!  BUT!  Why, oh why isn't the steak salad with fried pepperoni, hot peppers, fries, cheese, etc., etc. on the menu in Ohio?!  It isn't like Clevelanders have an aversion to over-the-top cholesterol any more than Pittsburghers!  Then again, Pittsburgh doesn't have those succulent smoked wings....almost worth going to Fathead's Cleveland for alone!  No matter which one I go to, Fathead's never fails to make me a happy woman.   Oh...and the Hubby fell in love with the inhouse brewed beers as I did the well-spiced Bloody Mary. GREAT atmosphere and surprisingly attentive service. Fun! Go!  Pittsburgh OR Cleveland!", "Date": "2010-05-26", "Author_Location": "Pittsburgh, PA"}, {"Author": "Tim Paul W.", "ReviewID": "CtfEqQ2JV_DwsnTI7kTe5A", "Overall": "4.0", "Content": "Came here with a regular who had been telling me for months how awesome it was. The menu alone is a dream come true for a foodie who's  into pub food like myself . An incredibly inspired and creative, deviation from standard bar/brewpub food. The \"headwiches\" which are described as \"a sandwich roughly the size of your head\" are a knockout! I got the Italian one, sorry I can't remember the name, but it was the best sandwich I've had in recent memory. I shared it, and my half was plenty of food. Overall the menu was very reasonably priced, and the portions are extremely generous, and indulgent. I also got to try the pierogi app which was 6 potato and cheese, deep-fried pierogies and a ramekin of sour cream. Very delicious and filling. Back to the Italian sarnie: if i can remember correctly, it had ham, capricolla, and salami, crumbled Italian sausage, hard boiled eggs, hot peppers, lettuce, tomato, and a sundried tomato mayo. The bun was beautiful and the textures and flavors were a perfect match.  We also had the \"artery clogger\", which was a melt of sorts with ham and bacon and was another home run. Both sandwiches came with thick sliced housemade potato chips which were crunchy and delicious. I was excited to try the beer as I'm into local brews, and am a big IPA drinker. The IPA was not very complex. I'm a big hops fan and the beer nose was 100% big, piney hops, which I was happy about, but to me the beer was like hops flavored sparkling water. I finished it but opted for a Sierra Nevada the second time around. I also got to try the Christmas ale and the blueberry something or other that someone got. Ok, not great, but the beer list was pretty amazing. I'd totally keep trying their other beers when I return, but the food will keep me coming back.", "Date": "2011-01-07", "Author_Location": "Boston, MA"}, {"Author": "Rachis C.", "ReviewID": "RCOTmQZZaE7GhtMc5uOxyw", "Overall": "3.0", "Content": "Noisy, very noisy.  Could not have a conversation.  Love the bumble berry ale.  Just do not love screaming across the bar, ugh.  Female bartender sucked, rushed and rude.  The wings were great.", "Date": "2012-12-18", "Author_Location": "Cleveland, OH"}, {"Author": "Xela N.", "ReviewID": "3_8KuBGMWbSuwm7CmKm_yg", "Overall": "1.0", "Content": "I've lived in several states in my lifetime, and my visit to Fat Head's was easily one of the WORST restaurant experiences i've ever had!  Where to start?!  Our server was extremely unfriendly and un-enthusiastic from the get-go.  We were missing silverware, and she acted as if I told her someone had died when I asked her to please brings us some!  In addition, I simply did not like the taste of their root beer, and she kept trying to sell me on it's taste and unique-ness, implying that I was crazy!  On that day, they had a salmon sandwich 'special', which was brought to me uncooked and raw in the middle.  When I asked the server to please have it cooked, she was frowning and literally grabbed the plate from me!  I could NOT BELIEVE the attitude that she copped, and I had my sister-in-law and 4 year old child with me to witness her shenanigans!  One would think that the presence of a 4 year old 'supercutie' would have had a positive effect on this lousy server's disposition!  What really 'blew my top' was when I repeatedly asked for the check, and it arrived 20 minutes later!  Clearly, this psycho server was playing infantile mind games with me by this time, so when I finally got the check, I left the bill amount on the table, but did not want to leave a tip.  ANY tip!  I've NEVER done this before in all my 48 years alive (at the time)!  I stormed out of there so visibly upset that I told one of the managers that I will NEVER return, and I meant it.  For me anyway, this place is a JOKE!  What an insult dining there!", "Date": "2012-09-19", "Author_Location": "North Olmsted, OH"}, {"Author": "D D.", "ReviewID": "pj2rv5NBBDx72tZsggKFJg", "Overall": "5.0", "Content": "Our Waiter took orders for 7 people and wrote NOTHING down yet got everything write including drinks. Food cooked as we asked, even split the bill correctly. VERY impressive for a casual restauraunt. This man is a huge asset and i would hire him in a minute to work for me. Customer service.... simple.", "Date": "2012-10-09", "Author_Location": "Perry, OH"}, {"Author": "Mike T.", "ReviewID": "XLF8U6nw8-OSsTQKfx9m3Q", "Overall": "4.0", "Content": "Good food, great service, incredible beer. The kitchen sometimes misses out on special requests, so if you make one, be sure to check your food carefully before digging in!", "Date": "2011-11-13", "Author_Location": "Cleveland, OH"}, {"Author": "Amber R.", "ReviewID": "ETrVAIC02Sh1mXWH4waJCw", "Overall": "5.0", "Content": "Fat Head's is a great place to grab a really good beer and a ton of food. Chef Derek is an old coworker and we've always loved his food! My fiance and I are both bartenders so we tend to sit at the bar and the bartenders at Fat Head's were friendly and fun. On several occasions the bar is full so we'll grab a table. We always start with a cold refreshing beer. We usually shoot for the honey blueberry ale, the headhunter IPA, or the sampler which offers smaller portions of 8 great beers they brew. Next we move onto a few appetizers and I highly recommend the smoked chicken, spinach, and artichoke dip. We usually ask for more flat bread to make sure we get every bite of the dip...it's that good! On separate visits we've also had the deep fried pierogies and smokehouse wings, which are both amazing! After appetizers and wings we're pretty full but order \"headwiches\" anyway, you can't go to Fat Heads and not try one! They are extremely large but are a great late night snack so get one. My fiance's favorite is \"The Bob and Martha\" and I actually prefer a sandwich by the name of \"Artery Clogger\". We've also tried the pizza and they are also very delicious. All in all, with a large menu to choose from and an amazing beer selection, you simply can not go wrong at Fat Heads!", "Date": "2011-02-12", "Author_Location": "Lyndhurst, OH"}, {"Author": "Angela M.", "ReviewID": "X6PSfkmUY5DGgTFJW_KOiA", "Overall": "4.0", "Content": "We stopped here on a whim just passing through Greater Cleavland. The menu was impressive, the fries were fantastic, the burger was flavorful and perfectly cooked. I loved how spacious the restaurant portion was. It was so nice not to have tables practically stacked on top of each other. My husband loved his giant pork sandwich. Our server was pleasant and attentive. Fat Head's will be a regular stop for us when we are in the Cleavland area!", "Date": "2011-04-20", "Author_Location": "Huntertown, IN"}, {"Author": "Rob S.", "ReviewID": "HqC4ugvqz96uE6_-HyPltA", "Overall": "4.0", "Content": "great food, large sandwiches and lots of beer", "Date": "2011-11-15", "Author_Location": "Wellington, OH"}], "RestaurantInfo": {"RestaurantID": "5JcGHCt_JBmL85ZRqezLdA", "Name": "Fat Heads Brewery and Saloon", "Price": "$$", "RestaurantURL": "/biz/fat-heads-brewery-and-saloon-north-olmsted", "Longitude": " -81.89416300000000", "Address": "24581 Lorain RdNorth Olmsted, OH 44070", "Latitude": " 41.426344", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/u29Idk6uWmw1iYPurPqoJA/90s.jpg"}}