{"Reviews": [{"Author": "Jonathan S.", "ReviewID": "igad8TVxACaiHSQ948kPfQ", "Overall": "5.0", "Content": "Z Cucina is one of the best spots in town!  It is my wife and I's go-to place when we want a great meal out.  As others have mentioned, Rick is a wonderful host.  He always makes sure we get a great table, and when she is there, he makes sure we have Ally as our server.  She is awesome and always remembers our appetizer order...the risotto fritters!The risotto fritters are the best and are a must order!  As far as entrees go, I've never had anything bad. Their homemade pastas are delicious, as are all of the seafood and beef dishes that I've ever had.  The sausage tortelloni that is currently on the menu is amazing.  The menu changes seasonally and I try to try new things because the chef always does such a great job with everything.They always have some tasty local beers on tap and my wife always finds a seasonal cocktail that she raves about.  Happy hour is a great deal as well...you can make a meal out of some of the appetizers at the bar and a few drinks.We sat on the new patio a couple of weeks ago...it's so nice.  Very well done!  Z never disappoints and I can't wait to go back soon!", "Date": "2014-07-07", "Author_Location": "Dublin, OH"}, {"Author": "Joseph B.", "ReviewID": "XKmlNvSyLNVjaz9JvxtI2A", "Overall": "5.0", "Content": "While more and more restaurants pop up and go away, Z Cucina continues to be at the top of its game after nearly a decade. The owner, Rick, and Chef, Jamie, proudly display their names on the menu and do so with reason and that pride can be seen in all aspects of the experience. Rick continues to be the best host in Columbus, and is most certain to check on your table to confirm that they have hit the mark. The kitchen  always provide a meal and experience that pleases your tastebuds. The wait staff is always attentive, courteous and knowledgeable regardless of whether it is busy or slow. The bartenders are always friendly and mix excellent drinks. Tonight I had the Wine Wednesay Prix Fixe and it did not disappoint. The lentil meatballs were amazing, and I hate lentils. The watermelon salad, was the perfect starter on a summer day. As someone with a sweet tooth, it is nearly impossible not to indulge in a dessert after dinner. It is hard to pick a favorite or even one as they all are excellent, but the tiramisu and pistachio gelato are a good place to start. If you are in the mood for seafood the scallops will not disappoint. Some nights I lay awake dreaming of the steak, or lamb. When I over order, which is not hard to do with a menu stacked so full of goodness, I have to worry that my wife will eat my leftovers. For salad lovers the beet salad and Caesar are must haves. You cannot go wrong selecting a pasta or pizza. Whether you eat inside or on the patio Z continues to improve upon its ambience, and has a classic look that is well maintained.  I also highly recommend having them cater or host a special event or business meeting as the owner will make it stress free.", "Date": "2014-06-11", "Author_Location": "Columbus, OH"}, {"Author": "Tim G.", "ReviewID": "B4DGWPpNI2ug9yN43qnyvA", "Overall": "5.0", "Content": "We visit Z as often as possible the food, atmosphere and service is awesome!Rick Ziliak , the owner is a true gentleman and excellent restauranteur!", "Date": "2014-06-11", "Author_Location": "Columbus, OH"}, {"Author": "Tony B.", "ReviewID": "CJkP7FLcsq69x1Nl3hIsug", "Overall": "5.0", "Content": "My wife and I have been eating at Z regularly since it opened - I met Rick when he was at the North Market.  In the 8 years since it opened, we have observed Z mature from a nice local restaurant to Best in Class! Rick has continued to refine the quality of ingredients, the diversity of the menu and the ambience to the point that Z is now a regional gem, capable of favorable comparison with restaurants in much larger cities. We recently enjoyed a vegan ravioli and a grilled salmon with a tomato risotto (Mother's Day specials); both were fresh, uniquely flavored, and delicious. Staying in the restaurant business for 8 years is quite an accomplishment in itself; attaining excellence, particularly in a city with as many great places to eat as Columbus has, is truly notable.", "Date": "2014-07-21", "Author_Location": "Columbus, OH"}, {"Author": "Brian H.", "ReviewID": "asSAA8gKaoiryXSJcuonkg", "Overall": "5.0", "Content": "Rick and his crew do an excellent job providing an intimate setting and outstanding courses. I went with my family for my wife's birthday on a Wednesday night. There is a promotion on Wednesday nights that around 50 restaurants in the Columbus area participate in to keep business up during the week. I had a three course meal with paired wine for each course that was wonderful and priced right at $40. The lamb main course was so tender and flavorful that I wish the portion was bigger. We will be going back.", "Date": "2014-07-19", "Author_Location": "Columbus, OH"}, {"Author": "Susan D.", "ReviewID": "bzEimnQqbRk7fvbsibd2mA", "Overall": "5.0", "Content": "My husband and I were just at Z this past Monday night.  You cannot beat this place!  The food is always top notch, the service is always good and the owner, Rick Ziliak, might just be one of the best in the city as far as making you feel welcome and making sure your Z experience is a good one!  Dress up or dress down... everyone seems to be welcome at Z!", "Date": "2014-07-16", "Author_Location": "Columbus, OH"}, {"Author": "Marcia E.", "ReviewID": "My0puQXFCrC8gORzx5lkow", "Overall": "5.0", "Content": "Awesome dinner as usual!  Definitely my favorite Columbus restaurant. From the valet parking, to the greeting entering the space, the details of the menu explained by the professional server, to the execution of the combination of creative house made ingredients, it is all amazing!  And tonight we sat on the patio with perfect weather and people watching.  And then a random experience, good friends sat at the table next to us.", "Date": "2014-07-12", "Author_Location": "Dublin, OH"}, {"Author": "A L.", "ReviewID": "mHIOh_NjZZHJ8oX8vaQYIw", "Overall": "4.0", "Content": "Update -- consistency has slipped a bit but still delish. The winter menu wasn't as strong as in past years. Hoping for a good spring menu. Still a great meal, regardless.", "Date": "2014-05-16", "Author_Location": "Columbus, OH"}, {"Author": "Vin R.", "ReviewID": "N8lhz1yC0yHS5WUzh_w3IA", "Overall": "4.0", "Content": "We've been here twice and loved both visits.  Great service and awesome food.  It's nice that we received fast service on our first visit when we were trying to squeeze in dinner and a movie on a date night while we were allowed to linger over dinner and drinks on our second visit.The crispy eggplant parmigiano, the hummus trio (which changes week to week, per our server) and the stuffed parmigiano risotto fritters are our favorites.  The wine list is impressive, but both times we went with cocktails.  I recommend the Barrel Aged Manhattan.  I haven't tried the Crown Royal Manhattan yet due to a bad experience with Crown Royal as a teenager.  No matter, the Barrel Aged Manhattan is perfect and shouldn't be missed.  My wife prefers the Paradiso or the Pomegranate Cosmo.", "Date": "2014-01-25", "Author_Location": "Columbus, OH"}, {"Author": "Bill K.", "ReviewID": "JxpuNn9ZcNbjamHBQtc8TQ", "Overall": "5.0", "Content": "Had my first experience at Z Cucina recently and loved the entire experience. Met the owner - Rick - upon entering the restaurant and received a very friendly welcome. When I said this was my first time visiting the restaurant, he spent some time providing background and even made some food suggestions.The drinks, wine and food were outstanding. Everything was made from scratch in their kitchen and I had the Roasted Amish Chicken Braciole which was amazing. Even the pistachio sorbet far exceeded my expectations.From the time I entered the restaurant to the time I left, I was thoroughly impressed with the food, service and ambiance. I will certainly be back and highly recommend this restaurant.", "Date": "2013-11-25", "Author_Location": "Westerville, OH"}, {"Author": "Cody F.", "ReviewID": "IiqD701GT_M_OAT4KSxYWw", "Overall": "5.0", "Content": "An absolutely extraordinary meal. I've been meaning to come here and finally found time. I've had four remarkable meals in my life - and this is one of them. The pasta is 100% fresh made in the kitchen. Try it with the duck. Don't leave without trying the espressotini. Hands down - best restaurant in Columbus.", "Date": "2014-03-24", "Author_Location": "Columbus, OH"}, {"Author": "John S.", "ReviewID": "Aa3F3AayqJfW6kI16v8TMQ", "Overall": "4.0", "Content": "Z Cucina has been a favorite date-night / celebratory restaurant for us for many years. We usually start off with a bottle of red wine and a tasty appetizer. Their entrees are usually very well prepared and the presentation is top of the tree. +Make sure to save room for Desert. They offer several available options and are not to be missed! *Complimentary Valet parking is very much appreciated.", "Date": "2013-06-26", "Author_Location": "Columbus, OH"}, {"Author": "Larry B.", "ReviewID": "UybSJOaSklpnpB-QYptpWA", "Overall": "5.0", "Content": "We come with some regularity and always have a top rate experience , but tonight was beyond description . Wine Wednesday , fixed menu and three paired wines for $40. Three new and wonderful dishes. Blistered peas. Lemon garlic shrimp with shaved fennel and chicken saltimbocca on sweet pea mash. And house made limoncello!  Ten out of ten !", "Date": "2014-04-23", "Author_Location": "Columbus, OH"}, {"Author": "Angela R.", "ReviewID": "t8PoPdxM6FVm5Fszo3ZRmg", "Overall": "3.0", "Content": "Not as super as I'd hoped. Came here with some girlfriends for dinner one Saturday evening.  The place was strangely empty. I ordered a special entree that centered around mushrooms and orecchiette. The taste was good, but the orecchiette stuck together in huge clumps. I'm normally not too picky, but it wasn't quite what I expected for the price and the reputation. I also thought it was strange that our waiter didn't seem to want to recommend a dish for my friend. She asked what he liked, he danced around the question for an awkward few minutes, and she finally just chose. At least pretend you've eaten something here.....I will say, the desserts and wine were quite good.All in all, not bad by any means, but not up to the quality and experience I thought I would get.", "Date": "2013-06-24", "Author_Location": "Akron, OH"}, {"Author": "Shea H.", "ReviewID": "9AZhfhZHgvx3RIhS2k2r2w", "Overall": "3.0", "Content": "I've been to Z probably a total of four times throughout the 7-8 years I've lived in Columbus.  It's usually not that memorable of an experience for me for some reason.  One thing I cannot forget is their beet salad...mmmmmmmm.Beyond that salad, I think I there are better Italian restaurants in town.We recently had a little drama here with a reservation.  Everyone was really kind but I think there was a lack of communication between some staff members there, which impacted us a bit.  We still went to the restaurant and sat at the bar for dinner.  The bartender, although nice, was a smidgen inattentive and we kept having to wave him down to get items for us (and there weren't that many people at the bar).Our food was okay.  I ordered some vegan pasta and the eggplant parm without cheese.  It was really good--- although the eggplant pieces were really small and only four came with the dish.  The vegan pasta (just pasta--no sauce) and eggplant came to me on two separate plates, which I thought was weird but it was okay. I just asked for a side of sauce and put my dish together myself.  I suppose I should just be grateful that they even had vegan pasta. I think the people I was with enjoyed their dishes a lot.  So maybe it was just me.", "Date": "2013-04-20", "Author_Location": "Columbus, OH"}, {"Author": "Anand M.", "ReviewID": "ysu91VxyDjsuYqfSW5eVRQ", "Overall": "4.0", "Content": "High Profile Italian Place.Good food.Nice Ambiance.", "Date": "2014-02-07", "Author_Location": "Dublin, OH"}, {"Author": "Christina C.", "ReviewID": "p8IRlzlLK8N6leEEy8RGLQ", "Overall": "4.0", "Content": "Thank you Z Cucina for providing such a delightful and romantic backdrop for the fella and I's monthly date night.The service was impeccable (thanks, Doug!), the patio (at sunset) complete with table-top candles was amorous, and the food - oh the food - was titillating. Especially the mouthwatering red snapper with guacamole salad and basil-tossed rice. So. So. Good!Next time I'll try the goat cheese ravioli... you know how I love my goat cheese.", "Date": "2010-09-19", "Author_Location": "Columbus, OH"}, {"Author": "Lana G.", "ReviewID": "PMUaqRBr-WP26GFAC6sgmg", "Overall": "3.0", "Content": "It's very 'ok'. If this is truly the best Italian restaurant in town, then I have to move. The menu is limited and the food....ahhh...not the best at all. The chicken was red at the bone. Sorry, I don't like raw chicken. And it was way too salty.The service was good but I thought our waitress would leave me deaf. I don't know why she decided that people at my table were hard of hearing. No really, there's was no need to scream, it didn't count for 'friendly service' :) Still I have to say she was attentive and sweet, so I didn't mind the yelling as much. I was hoping the dessert would make up for the raw chicken but it didn't. It was not great either.To top it all off, I was given a dirty cup for my tea. They did give me another one when I requested of course, but it'd be nice if they actually checked before putting it in front of me. No one at my table was impressed with their food. And while service is something secondary to me, the food is always important. I won't be coming back to Z Cucina. If you do, hope you have a better experience.", "Date": "2008-06-14", "Author_Location": "Columbus, OH"}, {"Author": "Matthew H.", "ReviewID": "FPRfHygGe9FL0lvqhdqSCw", "Overall": "4.0", "Content": "My girlfriend and I met another couple for dinner here during a recent trip to Ohio.  Generally, when I'm dining in Ohio I lower my expectations - the honest truth is that most Ohio restaurants don't live up to the quality one would expect from a restaurant in New York or California.  There are, of course, several very notable exceptions.  Z Cucina is most definitely one of those exceptions.  Our food was exceptional, and the wine was delicious.  I had the shrimp, prosciutto and asparagus pasta and my girlfriend had the trout with pomegranate sauce - both dishes were fantastic.  The sauce paired up with the trout was simply delicious: sweet, but not overwhelming.  The shrimp and prosciutto were cooked perfectly, and the cream sauce was excellent and.  Also, we ordered some Jenni's ice cream (also available at Jenni's down the street) which was absolutely fantastic.  Our server was helpful, attentive, unobtrusive, and knowledgeable.  The interior decor is warm, well-lit, and comfortable.  Z is absolutely recommended!", "Date": "2007-08-06", "Author_Location": "San Francisco, CA"}, {"Author": "Dawn S.", "ReviewID": "NWQ4QtptUiZAXbkpEVpHmg", "Overall": "4.0", "Content": "Before I begin, a note: just because someone gives a good review (aka \"5 stars\"), doesn't mean that they have no basis for comparison. It also does not mean that their palates can only handle the endless salad and breadsticks from Ye Garden of Olives.As I digress... :)Hubby and I went back to Columbus for the Buckeyes homecoming game (booooo Nittany Lions) at the end of October, and we dined here with his family the night before the game. To begin our meal, we ordered the sampler platter and a bottle of the Guenoc Claret. The sampler platter included three \"regulars\" (calamari fritti, house-made mozzarella, and ricotta balls) and three \"chef's specials\" (swordfish, roasted red pepper cheese dip, and squash salad). I was a fan of the ricotta balls and the roasted red pepper dip!After the appetizers, the \"riserva\" salad and the potato leek soup (the daily soup special). The riserva salad had great flavor - the chianti vinaigrette defined the greens. The potato leek soup was also delicious - smooth and creamy.For the main courses, we ordered: the daily ravioli special, the short ribs, the duck legs and house-made gnocchi. Like I said, I should have written this review right (or shortly) after our meal, but I didn't...*sigh*. All I remember is that my daily ravioli special was one of the big hits of the table. The duck legs were another hit - although, they weren't shared! :) The house-made gnocchi were also delish - I actually don't think any of us had a bad dish that night.For dessert, we ordered two dishes: (1) Z Cucina's signature dessert, the Butterscotch Pannacotta, which was surprisingly delish (I say that, because I'm not sure I would have ordered it based on the description alone)! Note that the menu does not denote this dessert as its \"signature\" dish - we wouldn't have known if we hadn't been told beforehand.(2) Bread Pudding - I would be more descriptive (i.e., the type of bread pudding appears to be updated periodically), but I cannot remember what type of bread pudding we had. I will say that it could have been warmer (it was about room temperature), but it was tasty!And don't forget, you can sign up to receive their email specials - including invitations to their special tasting dinners!When I go back to The Shoe, I'd return to Z Cucina!4 shakas!", "Date": "2008-11-14", "Author_Location": "Woodland Hills, CA"}, {"Author": "Nicole B.", "ReviewID": "Kg5XTStlArLqN_V59NHPgw", "Overall": "5.0", "Content": "Z's is the first place my boyfriend took me for a romantic date [awww, how sweet]. But in all honesty, this place is perfect for a date. I have eaten here a few times since, and each time was just as good as the first. The dining room has a wonderful atmosphere with subdued lighting and a cream color palette. The staff has always been more than helpful and knowledgeable. If you have any questions about the wine list or specials, they will happy to answer you in detail.That being said, the italian fare is to die for. I have had the roasted lamb [a special] and the duck legs the two times I was there. For appetizers, the house mozzarella is to die for. I've also tried the tiramisu for dessert....a perfect blend of espresso and creaminess that makes the confection above par.My advice is to call ahead with reservations. Regardless if it is a busy night or not, you don't want to have to wait  for this food- your mouth will be watering as soon as you get there. Parking is also across the street, but the lot can fill up fast. Otherwise, you'll have to find parking on a nearby side street.", "Date": "2008-07-13", "Author_Location": "South Windsor, CT"}, {"Author": "Keith B.", "ReviewID": "UjK4JM4CuAXUFbIHGU3hkw", "Overall": "3.0", "Content": "The service at Z Cucina was stellar. The waiter was attentive, patient, and very helpful. The food on the other hand was really hit or miss. For appetizers we ordered the ricotta mozzarella fritters. They were phenomenal. Fried to perfection, served with a delightful arrabiata. The highlight of the evening for me. For entrees we got the prosciutto ravioli and the house made meat balls con spaghetti. The ravioli was just incredibly salty and not tasteful at all. A real disaster IMO. The meatballs were built up by the waiter, and failed to deliver. They weren't bad by any means, but just nothing too special. My biggest complaint was that there was an overwhelming taste of sausage, and no veal or beef.", "Date": "2010-01-03", "Author_Location": "New York, NY"}, {"Author": "Christina K.", "ReviewID": "nbIMuSV-MwOOhjV3uQd3mg", "Overall": "2.0", "Content": "AHH! My friend and I were looking for a place to eat after going to the gym today and we were going to Vino Vino across the street (b/c of yelp reviews). When we arrived, we were curious about Z Cucina, which was across the street. We walked over to Z to check out the menu, which was annoying pasted on the wall at about waist height. While I was bent over reading, the owner popped out and asked if we'd like to come in. Why not, we thought? So we did.Our waiter was bright and cheery and got us bread and oil and water right away. Sigh, but that's where the good all ends. We ordered the walnut/gorgonzola/grape salad, the soup, the mozzarella over zucchini and almonds WITH 3 yr old aged balsamic vinegar, and the vegetarian special to split - a mushroom rosti, which was like a potato patty, over a squash puree, and topped with a fried local egg, truffle oil, and frisee.So all the food was just \"meh\" to not very good. I wasn't too impressed with the bread, especially since it had salt baked into the crust. Nice touch, but it was too salty and the crust wasn't that great. It was however, soft, and warm. It was served with a plate of oil and aged balsamic (you could tell from its syrupy consistency) which was the best part of the dinner. My friend said the soup was good, and the salad was ooookay. Nothing special - I could have made it myself. The gorgonzola really didn't taste like much and the walnuts were overtoasted. The homemade mozzarella dish I really wanted to like. But the mozzarella didn't taste like anything! It wasn't that great milky flavor you get from good fresh mozz. And it was over zucchini and slivered almonds, which was a strange combination. Additionally, the aged balsamic we paid extra to have on top just got diluted in the zucchini juices so it wasn't even anything special!Finally, the entree - the squash puree tasted salty, but totally watery (couldn't taste the squash really) the rosti, which was a mushroom/potato patty, was very salty also and slightly bitter. Nothing spectacular at all about it. My coworker took one bite and totally didn't want anymore. I didn't think it was that bad, but it certainly wasn't very good. I rarely ever say food doesn't taste good.Sadly, the owner who had enticed us in came over to ask how it was and I didn't have the heart to say.Overall, everything was flavorless, but salty. COLUMBUS!! Get your food together! I can't handle eating here anymore.", "Date": "2011-03-03", "Author_Location": "Lake Forest, CA"}, {"Author": "Samantha M.", "ReviewID": "XXrgrPu2VvuB1FiPewks_g", "Overall": "2.0", "Content": "I remember a meal, maybe 2 years ago, at Z Cucina that took my breath away.  The best Puttanesca I'd ever had.  A house-made mozzarella melty balsamic reduction dream.  Attentive, friendly service.  Maybe it was just a dream.  My latest experience at Z Cucina was nothing like that.  Perhaps I'm not being fair.  The first time, we sat in the dining room and ordered full meals.  This time, we sat at the bar and ordered and appetizer and 2 drinks.  Nah, that shouldn't matterThe appetizer, the House-made mozzarella 2 ways, was not 2-bad.  One side had a stack mozzarella layered with balsamic and tomatoes.  Boring, but you know....I ordered it knowing what it was.  The second 'way' was essentially prosciutto-stuffed mozzarella.  It was topped with pesto and 'crispy capers.'  Honestly, I just ate the capers off of the top, they were incredible.  The rest was so-so.  I really remember their mozzarella being better.  The lack-luster nature of the food was really set off by the absolutely horrible service.  The bartender did not actually speak to us.  The host had given us menus and maybe once every 3 or 4 minutes he stopped in front of us with an expectant look on his face until we ordered. Nor did he make eye contact.  Not once. (did I have snakes on my head??)  He did grunt, however, when he gathered the menus.  I figured he was just going for 'mysterious' until I saw the jovial, gregarious way he handled the other patrons at the bar.  We were not offered refills.  We had to ask for the check, and then watch him wash and put away glasses before he felt like bringing it over.  I can't say that I will not go back for another try, however.  If Joe is bartending, though, I'll stay in the dining room.  I desperately want to recapture that first wonderful experience that still teases the edges of my memory....", "Date": "2010-04-27", "Author_Location": "Columbus, OH"}, {"Author": "Will K.", "ReviewID": "z_n_NIeoffcN4AaD0b47Zg", "Overall": "5.0", "Content": "One thing I appreciate is personal service, so I love the fact that they remember me and my family when we come to eat here.The food has been consistently interesting and well-prepared.  On our last visit there, I had a cola (yes, soda) braised lamb shank over risotto.  It's easy for either the lamb or risotto be be over- or under-done but both we precisely right.The wine list is not huge, but it's thoughtfully done and very reasonably priced.", "Date": "2009-09-07", "Author_Location": "Chicago, IL"}, {"Author": "Big Baby Jesus C.", "ReviewID": "IfvsPJhlOG-v8z4XyDo6PQ", "Overall": "3.0", "Content": "Restaurant week review!I had the cola glazed pork belly with fontina polenta and apple celery relish.  Was much better than it sounded, lol.  It was really good, 4/5.  The polenta was flat out freakin decadent.  I wish the pork belly was crispier on the outside.  That's what I like about it, the contrast, the crispy outside and juicy/tender/fatty center.Caesar salad was solid too, probably give it 4/5 again.The arborio crusted mahi mahi with fingerling potatoes, and crimini mushrooms, pancetta, and spinach in a grain mustard butter sauce is where things headed South a bit.  Just wasn't as good as the other courses.  The fingerling potatoes were all smashed, like they were seeing if they were done yet.  They tasted strongly of potato skin, and could've cooked a bit longer for my taste.  The spinach would've been good, but I didn't like all the flaccid pancetta in my greens.  I don't know if adding mushrooms (which I freaking love in general, don't get me wrong) to the mix was necessarily a good idea since they give off a ton of water when cooked, just like spinach.  The mahi mahi itself was good, but I'd give the dish overall something like a 2/5.The server was great.  He was nice, welcoming, and handled everything quickly without bugging me unnecessarily 5/5.", "Date": "2011-03-15", "Author_Location": "Harbor City, CA"}, {"Author": "Virginia A.", "ReviewID": "g-XxXp3B-gdFvSYoLLB2iQ", "Overall": "5.0", "Content": "One of my favorite places to happy hour and dine.The owner is always around.  For him service is King. They have a new menu this fall and I love it! I had the Chicken Parm.  The chicken was juicy, the sauce one of the best, and the pasta was was homemade and cooked to perfection.The atmosphere is romantic and hip, and the bar is a comfortable place to hang out of an hour or so...", "Date": "2011-10-12", "Author_Location": "Granville, OH"}, {"Author": "Alex F.", "ReviewID": "SyiqPnuYZS4VAsWAGoiwuA", "Overall": "5.0", "Content": "A Grandview favorite. True to its origins and a great little bar!  Always a good nite out.", "Date": "2013-11-16", "Author_Location": "Columbus, OH"}, {"Author": "Chuck k.", "ReviewID": "4Q9Q8h3riHjoaAqn41mmgA", "Overall": "4.0", "Content": "Very good food, great location and space. I ate here three times during my stay in Columbus, and I was pleased with every dish I tried.  They were also nice enough to create a dish from scratch to meet my GF's dietary restrictions. They also make good drinks and have a wonderful waitstaff. Rick, the owner, is a fantastic host.---------------On a repeat visit about two years later, the food and service are still very good. The drinks are a little pricey but tasty. I had the sausage brushetta which I really liked. And the lasagna, which was good, but a little salty for my tastes. Rick is still a great host, and the space is so nice.", "Date": "2007-01-16", "Author_Location": "Mountain View, CA"}, {"Author": "Molly B.", "ReviewID": "looclSBsEx5jSsLlB2UvhA", "Overall": "2.0", "Content": "Where to start? Hmmm. When I arrived in the \"Z\" (as I like to call it), I found the place to be a bit pretentious, but that can be overlooked. My friend and I were seated on the patio, which was nice. I was ready for a party in my mouth. I was ready for the food to knock me out cold. Ugh. But unfortunately, my experience was anti-climatic. My food was edible, but not great. On top of that, my waiter was seriously annoying. I hate to be mean, but my experience there was tainted by him. He was honestly just trying way too hard, involving himself in my conversations, etc. With all that said, I do think the \"Z\" has room for improvement. With some small changes, it could be a great restaurant. Unfortunately, with all the other great restaurants on Grandview Ave, I don't think I'll be back.", "Date": "2010-09-30", "Author_Location": "San Diego, CA"}, {"Author": "Frances A.", "ReviewID": "DLnGzv8U0e_bSmmo7Go8ag", "Overall": "3.0", "Content": "We went here for Dine Originals week and I ordered the 3-course menu consisting of Tuscan Barbecued Shrimp, Spinach salad with fried capers, and the Parmesan-crusted Salmon with Mushroom risotto.  Everything was great except the long wait for the food, and the salmon.  The flavors on the salmon were conflicting, overcooked, and instead of risotto, I think they just made it with regular short grain rice. Blech!The actual restaurant is well-designed, well-lit, has a patio and makes for a fun night with friends who live close by.   The bar looks barren and uninviting and the seats are uncomfortable so don't plan to stay too long.  I haven't been here too many times and honestly, my food tastes are hard to please.  I'd come again and order something different but I wouldn't expect much.  Sad, but true.", "Date": "2010-03-11", "Author_Location": "Columbus, OH"}, {"Author": "Andrew M.", "ReviewID": "viuLT5uzq6v8-yCRT9nmoQ", "Overall": "4.0", "Content": "I made my first visit to Z Cucina last Fall and I must say I am an idiot for not having tried this place sooner.  Our meal was fantastic (especially the Strip Steak that was a special), and our server was very good.  The ambience was warm and relaxing and despite the fire that occurred just a month prior you never would have known.I have been back numerous times over the last few months, and every time our experience has been pleasantly consistent.  Service has always been good and helped leave us w/ great memories of this place.  If you are looking for good Italian food but not the traditional heavy cream fare, I strongly suggest Z Cucina.  They also offer valet parking which is very convenient", "Date": "2009-07-10", "Author_Location": "Columbus, OH"}, {"Author": "Gina D.", "ReviewID": "z9yLPfxUrU6dzyVPiwuANQ", "Overall": "2.0", "Content": "I walked in and was greeted in a friendly manner and quickly seated.  The waitress right away took our drink orders.  From that point on everything went downhill.  I ordered the Veal Lemoncello and a Caesar Salad and my husband ordered Gazpacho soup and Chicken Parmesan.  The bread had a salt crust and was too salty for my taste.  The salad was underdressed and the cheese added was too salty.  My Veal had too much lemon which made the dish too tart and parts of the veal were fatty!?!  I'm not sure what kind of side veggies came with the meal, but they looked like dandelions.My husband enjoyed his soup, and his chicken was fine.  Needless to say, I did not care to order dessert or coffee at this point.  Based on previous reviews I was really looking forward to a great meal, and I was disappointed. The service was great, I can't find fault with that, just the food.", "Date": "2012-06-12", "Author_Location": "Beverly Hills, MI"}, {"Author": "Laura H.", "ReviewID": "RRm26OMC8mKki7Q6oJTuwA", "Overall": "4.0", "Content": "Stumbled across Z on accident.  Truthfully, we were on our way to another establishment but it wasn't sparking our interest once we arrived.  Z had amazing ambiance. Quiet for two but just enough liveliness at the bar to keep things interesting.  Bartender makes excellent martins. Good food. Fair prices and fabulous environment.  Def returning!", "Date": "2013-06-21", "Author_Location": "Columbus, OH"}, {"Author": "Christiana C.", "ReviewID": "4PJbTxAQ-UjYw9HD357zBQ", "Overall": "4.0", "Content": "Bad days sometimes deserve martinis.  Suffice it to say Z Cucina was able to take the bad out of the day.  It was like I had a snake bite and it did that thing where it sucked on my leg and spit the blood out because it wanted to help me NOW.I called beforehand to check hours and the guy was my kind of Italian (\"ehh, I don't know, we close when everyone's done.  What time do you want to come?  Psh, we'll still be hanging out then, come on over\").  When we came in the door, I told the host that we wanted to sit at the bar.  A guy comes over and says \"you came!\"  I said, \"how did you know it was me?\" and he was like, \"I just know\".  Yeah, it was a little like hanging out with la famiglia.  The interior is cute and Tuscan.  The walls and interior are bright, but the lighting is soft.  The bartender was also pretty awesome.  Once he knew I was a little (ok, a lot) fanatical about local ingredients, he told me about how they patronize as many local distilleries and wineries as possible and pointed them out on the menu for me.  He also told me he would tell me about the local foods, but the chef would do a better job and loves to talk about it.  I love that kind of attitude.So let's get to the drinks, shall we?  My sister was crazing some martinis, so we went the mixed drink route: Madre Spirito (guys! They called it \"The Godmother\".  HOW COULD I NOT GET IT??!!) for me, pomegranate cosmos for Sister.  They were just what we wanted!  We had the hummus and pita appetizer too, which was pretty exceptional.  I dug it.  Since we were at the bar, the service was the type where the bartender would talk to us when we felt like it, but when it seemed like we just wanted to talk to each other he left us alone.  That did lead to some empty water glasses, we kind of did it to ourselves, so I couldn't be too mad.Next time I go back, I'll have to look into the actual entrees.  For now, I'm just glad it took the sting out of the bad day.", "Date": "2011-03-11", "Author_Location": "Columbus, OH"}, {"Author": "Samantha B.", "ReviewID": "8gBcz8J5E2iw60t5iWlypQ", "Overall": "4.0", "Content": "A week after moving to Grandview, I was rearing to check out the local food and wine fare for date night. Strolling up and down high street, we checked out each eatery's menu to make a decision.  Deciding on Z Cucina, we were greeted by who we later found out was the owner of the restaurant. He saw us looking around and seemed more than gracious that we decided upon his place. From there it seemed like we got the star treatment.Out waiter (and even our busser) was chatting us up like old friends. The place seems stuffy on the outside, but is comfortable and friendly, with lovely ambiance on the inside, particularly the patio. It helped our waiter was a stunner and extremely sweet. Our meal was really good, with decently affordable drinks being that it was peak Friday night. You can get flat bread pizza for ~$12 and appetizers under $10. Their happy hours until 7p M-F allow for $3 drafts and $5 wines and cocktails.The owner who greeted us before our meal made sure we had a great time while leaving and gave us his card. He was just dripping with passion for his business and just made the experience great. We will definitely be back.", "Date": "2012-06-10", "Author_Location": "Columbus, OH"}, {"Author": "Melanie O.", "ReviewID": "kdVob4LNtQeHIWSXCxPttQ", "Overall": "5.0", "Content": "We were in Columbus for the Quarter Horse Congress and wanted some good local food. The food and the service were amazing. The home made cheese and meat they cure is some of the best I've ever had. The owner is on site and did come by to check on us a few times...very nice man who loves what he does and takes time to talk about it. The down side...we only got a chance to eat there once.", "Date": "2013-10-20", "Author_Location": "University District, Columbus, OH"}, {"Author": "Amanda G.", "ReviewID": "PUsLJcbR1ctTsmtITC8CJQ", "Overall": "4.0", "Content": "While living in Columbus, I ate here about three times, and was very pleased every time. There are very few outstanding restaurants in Columbus, but this is def one of them. It's a nice space, has amazing service, and great food. The owner is very friendly, and will make substitutions if you have food restrictions. This is a place that could even make it in a tougher market!***UPDATE***Went back for dinner last weekend while visiting Columbus.We had dinner with about 8 people.Everyone loved their food and drinks. Service was great, and the owner was friendly as well.This was by far the best meal I had during my visit.I would definitely go back whenever I visit, (which luckily isn't often!)", "Date": "2007-01-16", "Author_Location": "Menlo Park, CA"}, {"Author": "Jess G.", "ReviewID": "wJ1B9k3Il3bwywtvesIb0Q", "Overall": "4.0", "Content": "One word: yum! My boyfriend and I tried Z Cucina out for a belated Valentine's Day dinner and were not disappointed. The ambience, service, and delicious food were exactly what we were looking for. What a lovely, modern yet cozy atmosphere!We shared the stuffed mozzarella appetizer. Let's just say I will take a giant bowl of that roasted tomato jam to dip into all day long. The basil pesto, perfectly grilled crostini, and house made mozzarella really was a perfect starter. We also ordered salads, which were well portioned and tasty.For entrees, I ended up getting the pan seared diver scallops special with creamy shrimp risotto. This was super rich (and at this point I was getting full!) but I ate all the seafood and loved it. My boyfriend decided on the house made sausage tortelloni, which was also fantastic. How can you go wrong with house made sausage, complete with fennel seed? (That's what makes Italian sausage, well, Italian sausage.)At this point I was feeling quite good--belly happy, a glass of wine in my hand--but we couldn't pass up dessert. The trio sampler was perfectly portioned after my evening of indulgences!Two other things about Z Cucina that I'll mention: the service is on par with a much more expensive/high end restaurant (which is a great thing!) and the wine list is very reasonably priced, given the quality. Oh, and I like that they also offer a coat check. We'll definitely be back here again!", "Date": "2012-02-28", "Author_Location": "Columbus, OH"}, {"Author": "Katherine R.", "ReviewID": "HDh9TUera_kXrPwVXgwItg", "Overall": "5.0", "Content": "Awesome happy hour! $5 Appetizers, which are decently portioned (enough for two to share), $5 wines (great selection, unlike most other happy hours) & $3 beers. Definitely worth a try! Dinner entrees here are delicious as well!", "Date": "2013-03-13", "Author_Location": "Grandview Heights, Columbus, OH"}, {"Author": "David L.", "ReviewID": "FU2qoegFQ1S2ufWuZVrSMA", "Overall": "3.0", "Content": "My experience was actually really good here. The service was awesome, the company was even better. But I have to say the food I had was not worthy of much more than the three stars I am giving it. I had the Blue Crab Raviolis that night.  I am not going to bash it on here, but it just wasn't doing it for me. My dates fish was better than my dish. The fish tasted as fresh as one could get seafood in OHIO, but really lacked something. Honestly, it wasn't much more than a pan fried fillet with a fancy side to go along with it. (Maybe the chef forgot to add something....) It appears others have had better meals here. And I believe they probably have some awesome food. But my experience was just not what I expected when I walked through the front doors of this place. I want to go back and try something else on the menu. Does anyone have any recommendations?", "Date": "2010-09-20", "Author_Location": "Columbus, OH"}, {"Author": "Emily K.", "ReviewID": "B3RBR7OqNixoW7mBLACByA", "Overall": "5.0", "Content": "I don't care what anyone says.. I love this place! They have great happy hour specials with $5 calamari that is too good.  Also, they have $5 martinis which are made especially well by the resident bartender.  The owner has been there every time I have gone and he is always friendly and comes over to our table.  He let me know that the happy hour is going to soon expand to include new THREE DOLLAR appetizers... heck yeah! Also, sometimes it gets busy during happy hour and if you can't find a seat at the bar let the host (who is also usually the owner) know and he will get you a table and let you do happy hour there.", "Date": "2011-07-07", "Author_Location": "Columbus, OH"}, {"Author": "Ken L.", "ReviewID": "qnDhFvIzA2KAzzb4di_rNw", "Overall": "5.0", "Content": "4.5 stars.  Z Cucina is currently our favorite restaurant in Columbus.  Smart, inventive and creative menu done well, hip decor, short but well chosen wine list, friendly and very well-trained waitstaff.  One of my biggest pet peeves in other \"upscale\" Columbus restaurants is servers who know zero about the wine list, much less are able to tell you anything about the menu items.  Not at Z Cucina, we've found the staff to be friendly, charming, and very knowledgeable, albeit young.  Honestly, Z is one of the very few Columbus restaurants which, if you transplanted straight to downtown Chicago, would fit right in.  Can be a little loud when full (weekends).Highlights include risotto fritters, lasagna, and olive oil braised duck.  If you like a little port after dinner they serve Dows 96 vintage port by the glass, which is a treat.In Chicago or SF Z would rate 4 stars.  In Columbus, 5 stars (deducting 0.5 to 4.5 overall because the food is Really Good but not quite Mind Blowing).  Highly recommended.", "Date": "2008-06-11", "Author_Location": "Worthington, OH"}, {"Author": "Nicholas J.", "ReviewID": "gYZE97GG5mwXrQq6XsAETA", "Overall": "4.0", "Content": "The girlfriend and I went here to celebrate her starting a new job, and we were not disappointed by the food or the service. This has some very well made Italian food in the Grandview area that can easily compete with the multitude of other great restaurants nearby.My chicken Parmesan was great. The pasta and sauce were tasty and the chicken itself was great. The Amish chicken also was well worth it. Probably my favorite part of the Amish chicken was the grilled asparagus. Not many places do asparagus well, and it can be incredible when done right. Z Cucina was spot on with their asparagus. Desserts were incredible. I definitely recommend the tiramisu as an all around favorite, and if you are a fan of butterscotch, then the panna cotta is fantastic.The service was fast and friendly. The food was great. Hands down someplace that you have to eat at if you're in Grandview.", "Date": "2011-09-07", "Author_Location": "Columbus, OH"}, {"Author": "Sandy W.", "ReviewID": "Hrsqh22wRqoLmCkPVaLhCQ", "Overall": "5.0", "Content": "This is a review for its happy hour, which was delightful and inexpensive. The stars are for the romantic atmosphere, and the cheap food and drink.  My boyfriend and I came here for the first time on a Tuesday night. He ordered the Mojitalian and I had a glass of Savignon Blanc that was organic, each $5. The Mojitalian was tasty but not very alcoholic, and the wine was refreshing (but this is coming from someone who is not a wine connoisseur, and is usually satisfied with most wines). We also ordered small plates of pancetta, caprese, risotto fritters, and a flatbread with house-made sausage. Each of the small plates was $5, and the flatbread was $9. The pancetta was almost paper thin and crispy, sitting atop a small bed of shredded romaine, sliced cherry tomatoes, and a gorgonzola aioli that we mistook for mayo. It was tasty, but I'm not the biggest bacon fan and this dish didn't knock my socks off, so I don't think I'd order it again. I thought the caprese was the star of the meal. I have never seen so much mozzarella on a caprese app before. We had 3, or maybe 4 (my memory is a little fuzzy since we nom'ed so quickly on everything) hunks of fresh mozzarella that resembled little scoops of vanilla ice cream. Mmmm... I love fresh mozzarella with tomatoes and basil, so that plate alone made my night. My boyfriend enjoyed the fritters the best. It was hot when it got to the table and had an ooey gooey cheesy center when we broke into them. They were also topped with shredded parm and accompanied with a small side of tomato sauce. I thought the pizza was okay. It tasted too sweet, but my boyfriend enjoyed it. To each, his/her own.Service was quick, but they may be because there weren't too many customers when we were there. We'll be back for sure.Happy hours are M-F 5-7pm. You can find the menu on the home page of the restaurant's website (you might need to scroll down) or click here: zcucina.com/files/PDFs/h….", "Date": "2013-01-15", "Author_Location": "Urbana, IL"}, {"Author": "Aaron A.", "ReviewID": "RTHzJaWoiXDdRpV_HXekSw", "Overall": "5.0", "Content": "Absolutely LOVE this place. Came in a few weeks ago right before the summer menu rolled out. Luckily the crispy pan seared duck breast was a special. One of my favorite dishes they have. Our server was extremely nice and personable. I can't say enough about how welcoming Rick is every time I come here no matter the day of the week. The ambiance is great for conversation and is always a solid start to any night out. Easily my favorite place in Grandview.", "Date": "2013-07-09", "Author_Location": "Columbus, OH"}, {"Author": "Jeff H.", "ReviewID": "FFgjc38NWPOFoK_RD6tv7A", "Overall": "4.0", "Content": "My wife and I stopped in for the first time in April of 2012. The patio was open for the season as the restaurant transitioned into the summer season. The friendly host, warm open atmosphere and a super friendly and attentive waiter, was a great start to the night.Our appetizers came out on time as did the bread. There was a longer than normal wait for the entrées, however the owner was able to resolve the issue. This is a nice upscale restaurant that compliments the Grandview scene. Parking is easy, Atmosphere is great and the owner is almost always in attendance during normal business hours. Price and portions are more than appropriate for this scale of restaurant.", "Date": "2012-06-19", "Author_Location": "Columbus, OH"}, {"Author": "Morgan M.", "ReviewID": "PEVnWXGOzuNlrkVBlpy4IQ", "Overall": "5.0", "Content": "The service was great and the food was even better! Couldn't get enough of the Roasted Chicken Braciole and the beet salad. Can't wait to try their winter menu!", "Date": "2013-12-09", "Author_Location": "Columbus, OH"}, {"Author": "Kristen R.", "ReviewID": "sWccAbhI_cAoWfE9vEQFQA", "Overall": "4.0", "Content": "My inaugural visit to Z Cucina was courtesy of a Columbus Underground meetup. I immediately noted the great food, tasty beverages and the pleasant atmosphere. There was a huge food spread for the event that featured a lot of basics on the menu and plenty of drink specials. I thoroughly enjoyed everything I tried.  Most of my love for Z Cucina comes from one particular experience there. Story time - I was asked by a friend to be in her bridal party. Of course, I agreed and was thrilled to be a part of such a special occasion. Fast forward several months later and it's time for the bachelorette party. The maid of honor had what was thought to be a perfect plan for the evening out. Enter the bride: disapproved!! Oh no! So, here I am, frantically trying (on a Friday afternoon!) to find a restaurant in Columbus that can accommodate 6 people the next day. WHAT?! I accepted this impossible challenge and began calling places in the Short North. I was shot down by three restaurants before deciding to shift my neighborhood preference to Grandview. I had enjoyed previous visits to Z Cucina but still thought there wasn't a chance in hell they could help me. Sometimes (well, maybe just this once) it's great to be wrong. The owner Rick answered the phone. Once I explained the direness of my situation he was happy to make some rearrangements to table placement and fit us in. Excuse me? Did you just say you can help me? WIN!! So, the next day we arrived promptly as I was instructed since they were bending over backward for us and needed us to be there on time. That is the kind of service that just blows me away. The restaurant didn't have to help me, they didn't have to do anything nice and they didn't owe me any favors, but managed to offer up one of the nicest things any restaurant has ever done for me...so, you had me at \"of course we can help you.\" It was as if nothing dramatic ever happened; it was truly a pleasant time. Lots of drinking, laughing and excellent food. That night I tried the scallop special and really liked it, although some others in the group tried it and thought it was just ok. It seemed we all could agree on the Parmigiano Risotto Fritters. Oh my, they are little balls of cheesy heaven. I enjoyed the food that night but really think the way we were treated had everything to do with how pleased I was with the service and experienceAlso, I visited recently for a dessert and wine evening where I tried moscato for the first time. IN LOVE! I opted for the dessert trio and couldn't have been more satisfied. I was having one of those avoid-the-gym-and-eat-as-many-sweet-treats-as-­possible weeks and was thrilled with the mousse, tiramisu and bread pudding. Such a great treat!", "Date": "2011-07-02", "Author_Location": "Columbus, OH"}, {"Author": "Jackie C.", "ReviewID": "wIjJk0-D2toHoQ_HKLocDw", "Overall": "4.0", "Content": "My wife and another couple decided to give Z Cucina our New Years Eve dinner business. It's well within walking distances of both of our houses and we had all wanted to try it for quite some time. The service was excellent; our server was knowledgeable of everything on the menu and was able to answer our numerous questions about some of the wines on the list with ease. We were sat on the enclosed patio, which at first worried us, but later caught ourselves complaining about how warm it was out there. I did however catch the mysterious water filler that Michael U. so accurately described. Thankfully the table across from us drank like they just walked through the Mojave, so I think he was a bit off his game and having serious carpel tunnel, but I digress. I ordered the braised beef short ribs, the taste was excellent, and my mouth is watering now just thinking about it. My only complaint would be to not put as much sauce on the dish, other than that, wonderful. All of the \"Moderno\" dishes on the menu were Gluten-Free, which my wife was delighted to have so many options. She ordered the beef tenderloin, was cooked perfectly to order and came with a really delicious brussels' sprout risotto. Our friends ordered the crab cakes and a pasta dish on the menu; both were left unimpressed and did not ever finish their meals. In Z's defense they are self-proclaimed \"worlds pickiest crab cake eaters\". As for the Italian dish that was ordered, it just did not taste very good, not terrible, but certainly not as great as it should have from a better restaurant. Since we went 2/2 on dishes, we love this place, the other couple will go back and steer clear from those dishes. I recommend this place for a great night out in Grandview!", "Date": "2009-01-11", "Author_Location": "Columbus, OH"}, {"Author": "Dorothy B.", "ReviewID": "YZNlY1i3nurx3WAOCqceiQ", "Overall": "5.0", "Content": "Great food, nice atmosphere. I didn't like the drink I ordered and they kindly took it back. The menu had a ton of vegetarian options that all looked fabulous! I had the special which was way better than it sounded. The only downside is that the tables seem pretty close together so my friend was getting bumped over and over by the other table's waiter (no apologies, either).Will definitely go back many many times :)", "Date": "2012-11-09", "Author_Location": "Columbus, OH"}, {"Author": "Cherie R.", "ReviewID": "bRPfJKK0CsjRVLw6tfsdug", "Overall": "4.0", "Content": "Z Cucina is my favorite restaurant of all the Grandview restaurants - it's always been a great experience each time I go.  The ambiance is pleasant - clean, not incredibly loud, very comfortable and not pretentious.  The waiters are knowledgeable and helpful (for someone who has allergies!) and attentive.  Food is very consistently good - I like consistency.  :-)", "Date": "2012-02-14", "Author_Location": "Columbus, OH"}, {"Author": "Christina G.", "ReviewID": "Gd9n9T2FAxrrAuSyAHsPbg", "Overall": "4.0", "Content": "After my review of Z Cucina, the owner contacted me apologizing for my experience and asking if I would be interested in coming in again with a friend and making up for it - what a GREAT decision that was. First off, the ownership of the restaurant is amazing.  Being raised in the restaurant business, I was extremely impressed that the owner reached out to me and wanted to make up for a not-so-fantastic first round. We were greeted very pleasantly and I felt a little like Julia Robert's in the opening scene of My Best Friends wedding when she is a food critic and everyone wants her to be impressed. We chose a variety of food items - I had the Elderflower Martini, Insalata di Casa, and Oven Roasted Local Chicken.  I was thoroughly impressed by everything I tried, as was the friend that joined me.  The wait staff was very accomodating, explaining some of the items I was chosing between - very patient and helpful.  Everything paired nicely and was fresh and delicious. The chicken came on a bed of risotto with spinach and fingerling potatoes. It may have been one of the best meals I have ever tasted. I'm not sure what the sauce was, but it tasted like a 5-star verison of teryaki, just amazing.  I had to stop myself from devouring the entire plate, and enjoyed the rest as a meal the next day.  For dessert we had the cheesecake. I'm not a dessert person but my friend wanted to try it. I told myself I would have one bite, but I ended up devouring a large portion. Again, very impressed.Overall, I am really glad that I was given the opportunity to visit Z Cucina again.  It completely made up for the first visit and opened the door to me wanting to come back again for happy hour, dinner, and even just drinks (although I doubt I could be there without eating something now).  Very thankful for the generosity of the owner and will absolutely be back again!", "Date": "2012-04-03", "Author_Location": "Columbus, OH"}, {"Author": "Michael U.", "ReviewID": "UXbuojLid5kuVVS6c253cQ", "Overall": "3.0", "Content": "Quite frankly, the raw number of 5/5 reviews of this place speaks to two facts:  #1)  Too many people think of Olive Garden and Buca as 'good Italian' and simply haven't been to enough quality Italian restaurants and #2) the Columbus Italian scene is severely lacking.  With that said, Z Cucina is a good restaurant with some standout items, but the whole experience can be summed up in a single word:  \"Uneven.\"Valet parking was a deal at $4 and we were seated promptly, yet unforunately half underneath a vent blowing cold air quite briskly...being that Z Cucina is actually an old fish store (the fantastic Byerley's...RIP) there is a lot of unevenness to the room, ventilation, and layout.  Water was served promptly and refilled rapidly....almost annoyingly, as the juvenile water boy bobbed and weaved around me like a young boxer...I eventually moved my glass to my non-dominant side to avoid this annoyance.  Equally rapid and more annoying was our server, Chris, whose pseudo-Italianisms and meth-like delivery of the specials was akin to the micro-machine man moreso than to an experienced waiter.  Certainly he knew the menu, but pace is the trick.  Those issues aside, the food was pretty good....but once again suffered from unevenness. First off, the bread, although served in 5 varieties from olive to rosemary to white to wheat was good but suffered from too much surface area (crisp) and not enough center (soft,) while the garlic butter was overpowering.  Next up, the Z Tasting Plate with Bluefin Crudo, Ricotta Spinach Spread, Orange-Arugala-Fennel Salad, Calamari Fritti, Parmigiano Risotta Fritters, House Made Mozzarella.  A ton of options for a mere $19, no item was bad, but the only one that truly stood out was the incredibly fresh crudo with melt-in-your-mouth bluefin tuna as fine as any high end sushi shop....the rest were relatively standard fare and the squid was tough/gummy.For mains we selected:1) Garganelle con Langostina with artisanal pasta, langoustines, sundried tomatoes, spinach, and seafood cream sauce -- Decent with well done al dente pasta and great tomatoes, but notably shredded langoustine clearly from the body and not the claw.  The cream sauce, noted to be light, was significantly briney and actually hindered the dish even for a seafood lover like myself.2) Tortellini Gamberi with cheese, jumbo shrimp, asparagus, prosciutto di parma, lemon and butter -- Great shirmp, delicious sauce, but poorly cooked Tortellini that was simply too tough for my palate, though my mother enjoyed it.3)  Cappesante al Forno Roasted scallops, grilled corn polenta, pickled pear tomatoes, red onions, and fennel -- Incredible Scallops, well seared, and a deliciously creamy yet textured Polenta....yet completely offset by sour and acidic pickled tomatoes.  This dish could have been amazing were it not for the tomatoes which unbalanced all aspects of the dish.4) House Made Gnocchi with Pesto, shrimp, sweet tomatoes -- The pesto was stellar, the shrimp plump, and the tomatoes delicious (the kind of tomatoes that could have made the Cappesante)....but as I've noted in the past, gnocchi is either done right or done wrong and this was UNEVENNESS at the max.  Some pieces soft and perfect, others tough and gummy...and considering the griddle marks on the noodles I get the idea the chef was aware (grilling to firm up overcooked gnocchi gone soft is a 'technique' of sorts.)  Disappointing.For dessert, like many other Columbus staples, Jeni made an appearance in nearly every dish.  Selections included:1) Lavender Peach Tarte Tatin with Salty Caramel Ice Cream -- Delicious and large with wonderful peaches and a crispy crust yet a perfect air of Lavender that greeted both the tastebuds and nostrils, this dish was further complemented by the wonderful dip of salty caramel at its center.  A standout for sure amongst the choices, but not as good as that at Rigsby's the night before.2) Chocolate Crespelle with Black Currant Syrup, Hazelnuts, Basil --Interesting, like a baked crepe with 72% dark cocoa in the middle, but nothing special and neither the syrup nor basil were notable over the dominant chocolate tones.3) Panettone Bread Pudding with Cherry Lambic Sorbetto --Undoubtedly better than the poor versions served at Lindey's and Deepwood, this dessert was actually quite tasty.  Then again, when you take a world famous bread, douse it in cream, and top it with award winning icecream, how can you go wrong?4) Butterscotch Panna Cotta with Chocolate Hazelnut Biscotti --Their trademark dessert, this one was a glimpse of flawless evenness and wonderful taste.  A thick top layer of butterscotch flan over a base of gooey caramel, the only thing that could have made this dish better was some beignets for dunking a la Michael Mina.See profile site for full review with formatted pics.", "Date": "2008-08-03", "Author_Location": "Las Vegas, NV"}, {"Author": "Edy D.", "ReviewID": "W42H4h6IWK6S99Oz6z30SA", "Overall": "4.0", "Content": "We gathered at Z's for Happy Hour and Appies. We ladies gladly sat at the bar and were thoroughly pleased with the friendly, knowledgeable and good looking bartender. Drinks were explained, made and served w/ a smile. I had a flatbread that was delightful. I look forward to enjoying a dinner date at this charming establishment!", "Date": "2012-08-16", "Author_Location": "Worthington, Columbus, OH"}, {"Author": "Karen F.", "ReviewID": "iNRz7Ef67gdEjWx4dAq2Lw", "Overall": "4.0", "Content": "I've been there on two occasions and it couldn't have been more different.  Last year, I had a very nice, relaxed, and quiet meal whereas the noise level was deafening a couple weeks ago.  I loved the food but the spillover from the bar to my table was annoying.  I couldn't wait to escape.", "Date": "2012-09-30", "Author_Location": "Ballwin, MO"}, {"Author": "Caryn K.", "ReviewID": "Q7_ewinRN1RS1M-CCIiDDw", "Overall": "5.0", "Content": "Z Cucina can always be counted on for a delicious meal, great atmosphere and fantastic service.  I just wish it was closer to my house!", "Date": "2013-10-07", "Author_Location": "Cornelius, NC"}, {"Author": "Kara K.", "ReviewID": "iooNjog3m32H3xiN8ZfSUw", "Overall": "4.0", "Content": "My boyfriend took me here this weekend for my birthday dinner. Food selection was a limited, but both of our dishes were delicious. I had the farfalle alfredo and he had the pork tenderloin. Portions were a little smaller than I expected, but still not bad for the price. You will pay more at  other Columbus-area restaurants for less quality.", "Date": "2008-03-30", "Author_Location": "Columbus, OH"}, {"Author": "Cheryl H.", "ReviewID": "YdeVHzdo8jKbCy5PSAILUQ", "Overall": "4.0", "Content": "I've enjoyed two delicious dinners here now - one being the bachelorette party that Kristen R mentioned in her review (MY bachelorette party), during which they were exceptionally accommodating to a large party on short notice, and the other being a date with the husband (a few months after the bachelorette party, obviously.) Both times I enjoyed great food and even better service, and I can't wait to come back to do it again! Though I should have took the waiters advice and skipped the quattro formagio flatbread, it fell... well... flat.", "Date": "2011-12-14", "Author_Location": "Columbus, OH"}, {"Author": "Pete C.", "ReviewID": "TowNmYKb3ymkJcziJ8wPfw", "Overall": "5.0", "Content": "Just when I thought Cameron Mitchell had hit a grand slam with his Martini, a friend introduced me to the neo-Italian stylings of this Grandview bistro. If you've spent your entire life eating what places like Olive Garden and Buca di Bepo have conned you in to thinking was Italian food, you owe it to yourself to check this place out. Everything comes together perfectly here- the staff, the beautifully understated dining room, the adventurous yet incredibly accessible menu- to create an almost unbeatable dining experience that will linger in your memory for years.I had my first taste of Z about three years ago when a friend of mine took me here to check out their Monday night happy hour special, which boasted half off drinks at the bar and a small yet amply supplied buffet setup. The idea of having a buffet in what's supposed to be a classy Italian bistro may seem crass at first, but they pulled it off rather well and in a tasteful manner. The first item I sampled was the risotto, a dish I was completely unfamiliar with until that point. I ended up loving it- the texture was firm and moist, and the sauce had a very gourmet wine taste to it that was exciting and new to me. Why Chef Boyardee hasn't tried risotto is beyond me. Anyways, the buffet also included a parmesan ravioli and marinara penne dishes, both of which were basic but done to absolute perfection. I could only imagine how incredible they would've tasted when served as entrees as opposed to large buffet-style steamer trays. The one dish that keeps me going back to Z Cucina is the chicken parmesan. Besides being absolutely huge, the texture of the chicken that's hiding somewhere under all of that silky cheese and tangy sauce is an enigma that has kept me coming back for the past two years. How they pack that much flavor in to a simple slab of breaded chicken will remain a mystery to me, and it's certainly worth your educated guess. The dining room is perfectly lit and decorated, the food is amazing, and the price is just right. Z truly is as good as it gets.", "Date": "2008-08-02", "Author_Location": "Portland, OR"}, {"Author": "KM F.", "ReviewID": "ZccSOTZZg3vKORax3cqqtA", "Overall": "2.0", "Content": "I had forgotten why I have not been here in so long. After tonight's experience it has all come back to me. Our server was very busy when we first were seated, but we were in no hurry so we didn't stress. After a while though, we realized he just wasn't a great server. The focaccia was so hard I requested a fresh basket. The second try was hard and dry also. I ordered peas from the Crave menu. It could have been a good dish but was drenched in oil- when I would pick up a pod with my fork, the oil dripped from it.  The pecorino cheese added a nice salty element to the dish. My friend order the mushroom flatbread. The mushrooms were the best bite of the night. Big chunks, seasoned and cooked perfectly. Simply delicious. My Caesar salad was bleh. The grilled chicken I ordered to go on it was overlooked to the thready stage. And two pieces of sliced cheese laid across the top just wasn't a pleasing bite. I like that Z has complimentary valet parking. In a town that has perfected the valet parking rip-off, a very classy touch.", "Date": "2013-08-17", "Author_Location": "Columbus, OH"}, {"Author": "Jon T.", "ReviewID": "BArwSfbo_p0E_dHmyPEbtw", "Overall": "2.0", "Content": "Went here last tuesday with my girlfriend.  Staff was friendly and attentative, but overall not a great culinary experience for the money.  We ordered the 3 meatball appetizer which was ok.  My gf's entree consisted of a cheese ravioli with sausage.  It was ok.  I had the porchetta which was very sub-par.  It was very salty, overcooked, and tough.  It was served with a type of scallopped potatoes that were undercooked.I wouldn't go back here again.", "Date": "2010-02-06", "Author_Location": "Columbus, OH"}, {"Author": "Andy S.", "ReviewID": "PUjQb-00Yo9h-SWnmtOdSg", "Overall": "4.0", "Content": "This is a really nice place to go for dinner. The bread is fresh and served warm, and the menu has a lot of great options. We sat outside on a really nice night. One downside is it is a little spendy. I think it's one of the best Italian places in the area.", "Date": "2013-09-20", "Author_Location": "Hyde Park, Chicago, IL"}, {"Author": "K T.", "ReviewID": "K95Q1KrRUdkMbRM7gvhtwg", "Overall": "4.0", "Content": "My partner and I really liked this place the first time that we went... and continued to like it on our latest visit.  What we didn't like ---- the negativity of the owner and his PALPABLE jealousy of the business that Figlio's gets across the street.  Note to owner - perhaps stop putting out that negative energy and put some positive energy back into your own restaurant.  It isn't as busy as its across the street neighbor even though we think the food and and service are just as good!  And it has a great patio that the owner was happy to seat us on -- and give us the happy hour special there... but only after he made sure to tell us we need to tip the server the same as if it were not the happy hour menu.  Seriously? No bueno.  The waiter was EXCELLENT and we were happy to tip him but DID NOT need the etiquette lesson.  So my owner... put that energy back into your place of biz which is a WONDERFUL restaurant!  And if the prob isn't the location or the food then...........Lastly - please lighten the area by the bathrooms!  It's SO DARK and I feel like I'm gonna fall on the way in!  Thanks :)", "Date": "2012-08-31", "Author_Location": "Columbus, OH"}, {"Author": "Jodi S.", "ReviewID": "j5RgDaIRk6xbkpWugMmJKA", "Overall": "5.0", "Content": "I had a wonderful meal at Z Cucina on Saturday night. The waiter was personable and funny, the food was delicious and sophisticated, and the price was right. The atmosphere is well done, making it feel more intimate than it is. I work in Grandview so am mostly just in the area for lunch. I asked the waiter why they aren't open for lunch. He said that the restaurant is all \"fresh,\" meaning that they prep everything that day. So, they need the afternoon to get ready for dinner. That's my kind of restaurant.This was my first visit to Z Cucina and I'll definitely be going back.", "Date": "2012-02-20", "Author_Location": "Columbus, OH"}, {"Author": "Lori B.", "ReviewID": "tNm_oVWLju_ql7c4O7kTrA", "Overall": "5.0", "Content": "Fabu food, atmosphere, and service where they always know your name. must try the tasting platter!", "Date": "2010-09-21", "Author_Location": "Coconino, AZ"}, {"Author": "Greg L.", "ReviewID": "h3OkWgrCj7QXZZOjG4GtfA", "Overall": "5.0", "Content": "The experience was terrific and Rick was very accommodating. Homemade pastas and diverse wine selection. Everything was well explained and the food was outstanding. Eggplant and ricotta shell worth the trip. Tiramisu added caramel, a first for us, and good.", "Date": "2013-08-17", "Author_Location": "Chicago, IL"}, {"Author": "Carly C.", "ReviewID": "njyRV-7OuWRWOrUngxR7jg", "Overall": "4.0", "Content": "This was my first time here, and I really enjoyed it. The Caprese salad was incredible, especially with the balsamic (which costs more but is worth it). For entrees, we ordered the sausage flatbread, lasagna, and linguine and clams. I didn't get a chance to try to pizza, but it looked great. The lasagna was the awesome though! Our server described it as very meaty and cheesy, and it was. The lasagna was great for leftovers too. I don't know if I'd order the linguine and clams again, but it was still good. I'd want to try some of the other options.  We sat outside, and it was a perfect night. The inside seemed very nice too, and I loved the ambiance of it all. I will definitely be back!", "Date": "2012-07-24", "Author_Location": "Columbus, OH"}, {"Author": "Hungry H.", "ReviewID": "e6dXQUAgN_oxGVPFoqHbgg", "Overall": "2.0", "Content": "Summary: I was very disappointed with my recent dinner at the Z and won't be going back soon other than to drink at the bar as the wine list and prices are pretty good. Specifics:  Staff is friendly, waitress was okay, salads (spinach, and regular) were good, the bread was feeble (was given three pieces between the two of us - guess they wanted to see us wrestle for the last piece), main courses (the ravioli, and the Alfredo) were unimpressive and bland, but fresh grated cheese from the block was a nice touch.  Worst was the greasy smell on our clothes after leaving the restaurant.  We were not too close to the open kitchen but it seems they are in need of better exhaust.  Add the dry cleaning to the food bill.", "Date": "2009-12-16", "Author_Location": "Chicago, IL"}, {"Author": "Kathy G.", "ReviewID": "m3dtDC3rFr88cDfuLFyFRw", "Overall": "5.0", "Content": "We have eaten here often, and it is always a pleasure. The owner is committed to excellence, and often stops by to personally check on everything. Service is exceptional - managing to be both attentive and relaxed.  It doesn't take long to feel like a \"regular.\" I am partial to the gnocchi, but you really can't go wrong here.AN UPDATE: FEB 2013I just had one of most flavorful and creative vegetarian dishes I have ever eaten (and I have eaten in some of the best veggie restaurants in the country). Bravo to the chef for creating a brilliant special.", "Date": "2011-09-03", "Author_Location": "Columbus, OH"}, {"Author": "F Z.", "ReviewID": "WGIUfzqmLUOA40gbHetX_w", "Overall": "4.0", "Content": "Having come across many mixed reviews, my expectations were tempered as I stepped inside Z Cucina. A good time was definitely on board regardless of the food, as two of my favorite dining companions joined me on a breezy autumn evening.We were immediately greeted after being led to our table and were quickly overwhelmed with a throng of words, which we soon learned were the daily specials. The Z Tavola tasting platter allowed us to sample the restaurant's wide spectrum of appetizers. The three mainstays included the Calamari Fritti, Parmigiano Risotto Fritters, and the House-Made Mozzarella. The three chef's creations of the night happened to be a Mediterranean sardine concoction, pumpkin spread with baguette, and a fruit medley. The calamari fritti particularly stood out as the squid had been lightly battered, flash fried, and topped with a memorable shallot sauce. The parmagiano risotto fritters were equally delectable, with the distinct flavor of mozzarella contrasting nicely with the piquant tomato sauce. The fruit medley would have to be my least favorite of the six, since it was a mixture of raisins and cranberries. Paired with the pumpkin dip, however, the combination made for a refreshing appetizer.The bread basket was then presented -- which I found to be slightly odd. The warm herb and olive oil infused bread was tasty enough as is that the olive oil balsamic dipping sauce proved to be highly unnecessary.Hesitating between the Orange Sage Veal Loin and the daily special of Confit Risotto, the former trumped in a heartbeat when I saw Yukon Gold Potatoes as the accompanying starch. The veal loin itself was well-seasoned and spiced. A few squirts of lemon juice would have made it more enjoyable, however. The green beans and the aforementioned potatoes were slightly undercooked making them the crunchy components to my main. Whether that was intentional on the chef's part is beyond me, but I do like my potatoes a little softer (i.e. more cooked) in order to bring out the natural buttery taste.As a closure to dinner, ordering the Butterscotch Panna Cotta was a no-brainer. It was Z Cucina's signature dessert, and I could see why. A chocolate coated biscotti was served alongside a martini glass filled with layers of rich, thick caramel and gelatinous textured cream of milk and sugar. Absolutely divine.There were certainly a few hits and misses throughout the night. Both of my friends raved about their entrees (juicy scallops and the risotto), while both unanimously agreed on the uninspiring dessert libations, particularly the Z Caffe.Our charming server remained attentive and helpful during dinner -- being quick to answer any questions we had in regards to the ingredients and such. The restaurant itself was strewn with white fabrics, which transformed a rather plain looking space into a more elegant and more inviting area. No diner can feel out of place dressed down in jeans or decked out to the nines in evening dresses. And given the broad range of prices and menu choices (that vary by season), I must say that this is an excellent date spot!", "Date": "2009-10-18", "Author_Location": "Columbus, OH"}, {"Author": "Emily P.", "ReviewID": "y-VBm2jQjCk3DO7ehPRqpw", "Overall": "4.0", "Content": "Until recently it has been many years since I had dined here. I am now dreaming about my next visit! The service was good and the food even better. The Tortelli di Zucca was really yummy. The Caesar salad was okay; the addition of roasted red peppers is unnecessary and I would be happier if I did not have to cut up a head of lettuce at the table. Next time I will skip the salad and try an app or soup instead!", "Date": "2013-03-09", "Author_Location": "Columbus, OH"}, {"Author": "David B.", "ReviewID": "dvgf2EtJcIc7VkTErueOiA", "Overall": "2.0", "Content": "The food is OK, but they are not equipped to handle a busy night.  The service deteriorates, and the entrees run cold.  A step above Oliver Garden, but that's about it.", "Date": "2013-02-09", "Author_Location": "Grandview Heights, Columbus, OH"}, {"Author": "Whitney S.", "ReviewID": "YOXolA5Wyzb210OKRiw2Gw", "Overall": "4.0", "Content": "I've been here a few times with my friends, and I have to say, with each visit I've enjoyed this place more and more. It's a hip, trendy Italian restaurant - so don't go expecting all of the traditional Italian fare. The menu is on the smaller side, but there are specials as well. My friend and I both ended up ordering the Halibut special this last time (served with asparagus spears and crimini mushrooms), with which we were both pleased. I've never ordered dessert here because I can't resist walking over to Jeni's for ice cream. Z Cucina is also within walking distance for me and the staff is friendly and attentive. Another plus is the heated/enclosed patio that practically doubles the number of tables available. It was maybe 50 degrees out, and it was a good 70 degrees inside the patio. Awesome!", "Date": "2010-03-29", "Author_Location": "Columbus, OH"}, {"Author": "Leah W.", "ReviewID": "4TD-Ovx-UQwO-MjKwzZx9Q", "Overall": "4.0", "Content": "Good food, stuffy atmosphere. My husband and I enjoyed eating there and will return.", "Date": "2012-05-29", "Author_Location": "Rockville, MD"}, {"Author": "Dale S.", "ReviewID": "QTQKQoB5GnfQa6xaBc-2JA", "Overall": "5.0", "Content": "Wild mushroom & goat cheese ravioli were exceptional. Great service, nice atmosphere. About $70 for our appetizer, 2 entrees, wine, and shared dessert. We had reservations thru Open Table...not sure if they would have been required. Would definitely return and recommend.", "Date": "2012-08-17", "Author_Location": "Jacksonville, FL"}, {"Author": "Natalie A.", "ReviewID": "rcws7xqiRm8n8wNGEgQ8dg", "Overall": "5.0", "Content": "This is one of my favorite resturants in Columbus. When you enter, you are immediately greeted by the owner, Rick, who welcomes you with open arms. The atmosphere is modern, but relaxed which makes you want to stay for hours, (and we do). During our last visit, we arrived prior to our reservations, and our table wasn't ready. We were going to grab a drink across the street since there were no available seats at the bar. Well sure enough, within 60 seconds, Rick had brought us extra bar stools and a cocktail menu. Once seated, we ordered the parmasan risotto fritters, (best in the city) and at $7 an order, I am embarrassed to admit we ordered seconds. I had there goat cheese raviloi, which was amazing, but our friend ordered the \"winner\" of the night- New York Strip. It was perfectly seasoned and the spice rub left a warm feeling in the back of your throat. The portion size was huge for under $30!!As our dinner was coming to a close, Rick paid us a visit asked for honest feedback about our experience. It is obvious excited and proud of what he has built. And he should be. I will continue to visit this gem every chance I get.", "Date": "2011-09-21", "Author_Location": "Columbus, OH"}, {"Author": "Stacey S.", "ReviewID": "-ykB9Hr_cUr3dYya8WJPcQ", "Overall": "5.0", "Content": "Every dining experience I've had at Z Cucina has been amazing. Called ahead the first time we went to make sure there would be vegan/vegetarian options. We were greeted upon arrival by the owner, who coordinated with our server and chef to create a unique and delicious off-menu salad and entrée to suit our special requests. We received the same amazing service and food on several subsequent visits, even on busy Valentine's Day when the restaurant was packed. Our omnivore dining companions also raved about the food. Delicious and vegetarian-friendly in a lovely atmosphere.", "Date": "2011-11-20", "Author_Location": "Englewood, CO"}, {"Author": "Scott S.", "ReviewID": "8zxZLqe_Jgbltg7m9Hzifw", "Overall": "5.0", "Content": "Extremely friendly staff! The food was amazing especially their lasagna. If I'm not mistaken I believe the owner said everything was made there in the restaurant.", "Date": "2012-06-14", "Author_Location": "Columbus, OH"}], "RestaurantInfo": {"RestaurantID": "5jG-nhEX-m7NyP4uvwuekg", "Name": "Z Cucina Di Spirito", "Price": "$$", "RestaurantURL": "/biz/z-cucina-di-spirito-columbus", "Longitude": " -83.04440800000000", "Address": "1368 Grandview AveColumbus, OH 43212", "Latitude": " 39.985908000000002", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/YarBF9_gaG_seg6Wy31B3A/90s.jpg"}}