{"Reviews": [{"Author": "Alexandra K.", "ReviewID": "B9kKC4E3UuZ5MDFlOSXXVw", "Overall": "4.0", "Content": "I've been to the other (no longer around) Small Plates, but never to the Detroit location until today. The food all sounded good, but the prices were higher than they should be for sharable plates. I came with colleagues from my Detroit office, and they seemed to be happy with their food - and from where I sat, it looked delicious. I had the fried green tomatoes (so worth the 7 Weight Watchers points), and made a change to the eggplant and portobello sliders. I had them without the bun, and without the mushrooms, so it was just eggplant and mozzarella. Two of the three of us had soft drinks, and so the bill pre-tip came to just under $40. The food was great, the service was just OK, and so for that it gets 4 stars. If the prices were a dollar or so less expensive per item, I'd give them 5 out of 5.", "Date": "2014-06-06", "Author_Location": "Astoria, NY"}, {"Author": "Kyle Martin D.", "ReviewID": "FO9cNFDJt0WO5MQJ1eiXcg", "Overall": "3.0", "Content": "Should come with a caveat: Small Plates (by overfed Midwestern standards).Too much food and not enough originality. Pro: The staff is helpful and pleasant with sunbeams radiating from their smiles. Con: The lunch clientele is so uninspired (old guys in Robert Graham ties) it makes me want to eat a warm ham sandwich in the boiler room where my only companion is a three-day old Wall Street Journal covered in dried-out Diet Coke that I fished out of the dumpster. Pro: The restrooms are clean.Con: The soap dispenser was empty and if it wasn't for my disgusted coworker and his cancer-causing bottle of hand sanitizer, I would have consumed my meal with my hands littered in various types of bacteria. Bad form, Small Plates.Pro: The bill was inexpensive because a friend, drunk on ego and moderately priced wine, slipped the waitress his card in a foolish attempt to impress her while the rest of us argued about who had the nicest abdominal muscles at the table. Con: A friend lifted up his shirt to reveal his abdominal muscles, and much to my dismay, wasn't removed from the establishment by the manager, thus ruining the dining experience for the other patrons primarily because his abs were in fact that of a Greek God. This made me sad and I died a little on the inside.", "Date": "2014-06-06", "Author_Location": "Detroit, MI"}, {"Author": "Karey Q.", "ReviewID": "TiwQVuRK5cGAE5iHYD-48Q", "Overall": "2.0", "Content": "Meh. PLUSES: The waitress was really helpful and provided excellent service. She knew the wine list well and was very friendly and accommodating. CONS: The food was just so-so and a little pricey for what it was. We ordered a variety of things and I wasn't impressed by the quality of the food. Out of everything we ordered, I think I liked the signature french fries the best. Which I wouldn't say is a good sign.", "Date": "2014-05-08", "Author_Location": "Downtown Detroit, Detroit, MI"}, {"Author": "Avery S.", "ReviewID": "f30G4bVP8iRAPrDnvu1xFw", "Overall": "2.0", "Content": "small plates is not the same small plates it was 10 years ago. it's actually kind of lame these days. the decor is lame (\"graffiti art\"? come onnnnn) as the food is just okay. the service was mediocre, what an uninviting hostess! jerk chicken was bland, peach cobbler was basically a pile of del monte canned peaches, cinnamon, and vanilla ice cream. shrimp & garlic pizza was garlicky to the point of making my boyfriend nauseous (and he LOVES garlic). Caprese salad and friend green tomatoes were pretty good though. overall, okay food, overpriced, and unimpressive.", "Date": "2014-07-25", "Author_Location": "Redford, MI"}, {"Author": "Sean K.", "ReviewID": "8SsstRvBs4T1Lv_Y7ewc2w", "Overall": "1.0", "Content": "My wife and I have gone to this restaurant numerous times, but have not been there in the last year.  Waited 20+ minutes for vegetable spring rolls before we left.   The 20 something turds ( the female was eating mac and cheese with chopsticks) next to us ordered 5 minutes after us and got their  food came fairly quick.   The restaurant was half full and they were turning people away.    We will not go back.", "Date": "2014-07-02", "Author_Location": "New Baltimore, MI"}, {"Author": "Stephani M.", "ReviewID": "5MNsr4wC1jVTdN29DTrFJA", "Overall": "3.0", "Content": "Went here for lunch with two of my co-workers. I had the tomato bisque soup which was really quite delicious however the portion size was quite small - which yes I get is the point. I ordered the vegetable spring rolls which were decent enough but teeny tiny spring rolls for $7. My one co-worker orders the waffle/chicken sandwich and the other fish tacos. They both enjoyed their food and the portions were bigger. The service was great, our waitress was very friendly, helpful, and informative about the menu and restaurant. My one co-worker wanted to give it 4 stars, another one 3.5, and me 3. I just wasn't impressed. There are definitely better lunch places in Detroit.", "Date": "2014-07-09", "Author_Location": "West Bloomfield Township, MI"}, {"Author": "Anthony N.", "ReviewID": "FrobaiWSgt0KMixWoHCBog", "Overall": "3.0", "Content": "Large portions. Got the po boy sliders... Too much bread but great flavor. Southwest salad was standard, tostada tasted like the salad....disappointing. The meat and fries were too charred and dry. The fries had too much salt.Overall. Okay.", "Date": "2014-04-14", "Author_Location": "Aldie, VA"}, {"Author": "Shannon M.", "ReviewID": "Qx50F54flzy2N5xxrNgEUw", "Overall": "4.0", "Content": "Ive between going to this place since 2006. I love it. They remodeled  years ago and its much better then how it was. First I'll lay the negatives down- bathroom is small for the number of people that come in. Also when you sit outside you often feel neglected if its full inside. They only have 2 tv, so if you gappen in during a game you probably wont get to see anything unless you are lucky enough to get a bar seat and want one.Other then that, if you get in, food is great. A bit more then what it should really cost, but the quality is stellar.  Sweet potato fries- I mean so good. Pizzas and salads are always full of flavor and great. The fish tacos were a great addition. The only thing is they really shouldn't use tilapia for the cost. That fish is cheap so for the cost they should use another whitefush or Mahi.  Overall, fun place.", "Date": "2014-03-31", "Author_Location": "Charter Township of Clinton, MI"}, {"Author": "Brittiany R.", "ReviewID": "J4HLwAmgdmDsDdENEW6nRg", "Overall": "4.0", "Content": "I have been a fan of Small Plates since '07 (before Detroit really started to get cool again)They have a lovely outdoor patio and a raw, urban feel which also manages to be sophisticated. The food is my cup of tea. Order a ton of small plates (tapas style) amongst friends and dig in. For someone who can never decide on just ONE thing, this is the place to sample. Their prices are a big steep but all can be forgiven once you start munching. My favorite salad is the chop-chop salad which has recently been named. It's light & airy with wonton crisps. Next up, the fries! who pays for fries at a place like this? Everyone! Their sauces are a bit more unique than ketchup and you feel good knowing your crispy, greasy sticks still resemble potatoes. Plus they're delicious!I've sampled the scallops which were fresh and seared well along with a few sliders. I've truly never been disappointed at Small Plates. It's on a nice strip near the Opera House and YMCA and within walking distance of Comerica and Ford Field.", "Date": "2014-03-01", "Author_Location": "Detroit, MI"}, {"Author": "Rola K.", "ReviewID": "E0-hLcCczJ_MydCcMN2bSg", "Overall": "4.0", "Content": "I love this idea of small plates, absolutely love it. Can order a bunch of food, small portions, and share or eat a few bites of each and enjoying the variety a restaurant has to offer. The portions are just right and filling. Our waitress told me that the Mac n cheese is the best in Detroit....it was alright. It was more watery than cheesy. Might be from the different cheeses they put in it. I also didn't really care for the mushroom and tomato bruschetta, but it wasn't bad. The cornbread was soooo great and moist. Practically melts in your mouth, and the butter added on it makes it just perfect. Onto the dessert...my friends ordered the apple crisp...divine!!! The brownie I had was soo rich and sweet. To sweet for me, but I was saving my calorie intake the whole week prior to coming here and I inhaled that brownie. It had ice cream on top drizzled with raspberry sauce...ugh so good.", "Date": "2014-05-03", "Author_Location": "Dearborn, MI"}, {"Author": "Amy A.", "ReviewID": "_gxc9zc7H8-MxkfJmL_Wdw", "Overall": "4.0", "Content": "Four of us ate here before the red wings game and really enjoyed it. We were about five minutes late for our reservation but we were seated right away. Nice selection of beers, wine and craft cocktails and they had the right glass to put Stella in! As a table we ordered mozzarella and tomato salad, fish tacos, chicken and waffles, tuna salad, sweet potato fries and the pretzel sliders and buffalo calamari. The portions came as two or three per plate so sharing was a little tricky but we all tried everything and left satisfied.All of the food was great and we especially enjoyed the pretzel sliders and tuna salad and fish tacos. It was delivered quickly and presented very nicely. Right around the corner fromThe people mover and a parking garage so getting to Joe Lewis  arena was super easy too.", "Date": "2014-03-15", "Author_Location": "Rosebush, MI"}, {"Author": "Jenn S.", "ReviewID": "__of7j6kU9l9bl-dIrz_ZA", "Overall": "4.0", "Content": "I have been here a couple times and loved it! The place is small and cute with nice artwork on the wall. We ordered the Lotus Tuna which was my favorite. The wonton was the perfect holder for all the great flavors. We also got the Asian salad, sweet potato fries and the beef sliders. Everything was delicious. It is a bit pricy for downtown but I would pay it again for the good food.", "Date": "2013-12-19", "Author_Location": "Boston, MA"}, {"Author": "Victoria H.", "ReviewID": "8gN3T3TYVsIPQHmwrlu4gw", "Overall": "5.0", "Content": "My mother and I went after the Joffrey Ballet performance on Saturday. It was crowded. We sat at the bar. The food was great. We split Caesar Salad, Honey Salmon and Tenderloin over Fires. The bartender was nice. A little distracted with socializing with other staff at the other end of the bar at times. But overall, very pleasant.I had not returned to Small Plates since our last visit in 2012 which was, to say the least, very sub par. Saturday's experience turned my feeling around. I will be back!! Added bonus, I heard that my FAVORITE bartender.. Steven .. has returned to work there. He is amazing. I can not wait to see him again.", "Date": "2014-03-02", "Author_Location": "Royal Oak, MI"}, {"Author": "Beth N.", "ReviewID": "ZHQZTOvUyX-_RJ2tt6Rj4Q", "Overall": "2.0", "Content": "I went to Small Plates after the Detroit marathon with some runners, so we were looking for some really good brunch food. Pros:-I had the chicken sliders which were really good. I loved the sauce that came on it, and I'm obsessed with anything that has a full slice of avocado on it.-Upon walking in, it looked like a really fun and kind of upscale place for Detroit.-Menu had lots of variety - definitely wanted more than a few things when I was ordering.Cons:-I was really looking forward to the breakfast burrito and it was pretty bland. Even some seasoning would have made it better.-REALLY expensive for what you get. And $11 for a bloody mary?? Cmon, we are in Detroit people.-We came in at 12:45 for a 1:30 reservation (yay for faster than expected marathoners!) and they gave us an incredibly hard time, even though the restaurant was fairly empty. -I had to always ask for refills on my water, which was my only drink.Probably wouldn't pick this place again because of the prices and management, but I can see why some people really like it!", "Date": "2013-10-23", "Author_Location": "Ann Arbor, MI"}, {"Author": "John R.", "ReviewID": "LgS7AcfLq9lpBZvwQ9uSkQ", "Overall": "5.0", "Content": "I was pleasantly surprised with this place and was a little worried due to mixed reviews.  My wife and I sat at the bar and ordered about 6 dishes.  This is a perfect place for those that like appetizers and like to share.  The dishes came out as they were ready - which was one after another.  We literally finished one and there was another ready in front of us.   My wife and I had an intimate meal, food was good, ambience was great, and we left not feeling bloated or too full.  P.S. I would not recommend the veggie spring rolls as they are tiny with not much taste...but all other 5 dishes were superb! I think maybe this place has mixed reviews because it's not the type of place for everyone....", "Date": "2013-12-30", "Author_Location": "Ray, MI"}, {"Author": "Coralie D.", "ReviewID": "zSKYrGfK7JyCPhQFAwqDSQ", "Overall": "4.0", "Content": "Fried green tomatoes were delicious as fried food goes.  Cocktails were the best part of this Detroit experience.Good service, as they check on you frequently.  The food comes pretty quickly once you order.", "Date": "2013-12-14", "Author_Location": "Toronto, Canada"}, {"Author": "Catie S.", "ReviewID": "rpnxvn-RM5PigndCDbKHwQ", "Overall": "3.0", "Content": "Other Yelpers have done a good job covering the main points here: the menu is interesting, the food is good, and the prices are HIGH. The service is... ok?I came on a Sunday afternoon in a big group (~12), and although we had a reservation AND there was only one other table in the restaurant we still were made to feel as though we were a burden to take care of. One particular waitress called us all \"honey\" and \"baby\" every time she addressed us, and I had to ask three separate times for a water refill while most of the table waited the duration of the meal along with me, with empty glasses. What's interesting is that some of the \"small plates\" are NOT that small!  And in this case, they are a good value. You could definitely make a meal out of the croque monseiur, the fish tacos (maybe paired with a side), the chicken and waffles, the huevos rancheros, and the steak bruschetta (which was probably THE most amazing thing on the table). Other dishes like the sliders, standard waffles, or crepes do merit more accompaniment. Egg dishes seemed to be hit or miss, as we saw eggs arrive in all different stages of \"done-ness.\" One friend had the salmon benedict, and was disappointed at both the low salmon content and the fact that her eggs were more \"hard boiled\" than poached.Overall I think this spot is worth visiting, but you might do well to try it in a smaller group. Make sure you order a variety of dishes, and maybe stay away from the eggs if you're particular about them.", "Date": "2013-10-21", "Author_Location": "Brighton, MA"}, {"Author": "Marisa S.", "ReviewID": "Km75a6B4aZEAqGrW1sdL3A", "Overall": "5.0", "Content": "I love this restaurant! One of the best in downtown Detroit for a bite to eat. I have never had anything here that I didn't like. My favorite is the turkey burger sliders. I often get cravings for them. The fish tacos are also excellent and the lamb. Well priced. Good drinks. Service is always on par. Love visiting this place whenever I'm in the area!", "Date": "2013-12-17", "Author_Location": "Rochester, MI"}, {"Author": "Sue S.", "ReviewID": "U9h1Ar5mgVFYfbnpCE3g3A", "Overall": "5.0", "Content": "Had an awesome experience at Small Plates! First time here and i would definitely come back for some more!", "Date": "2014-06-17", "Author_Location": "Anaheim, CA"}, {"Author": "Kattrina H.", "ReviewID": "TzemfSQO-u2sKjC4wg90Rg", "Overall": "5.0", "Content": "BRAVO! I don't even know where to start.. I've been wanting to try Small Plates since I moved downtown in May, I wish I would have known it was this good, I would have been a regular by now! So I started with the tomato bisque which was delicious & perfect for this cold weather. My friend ordered the dragon shrimp which reminded me of PF Chang's dynamite shrimp but better, my favorite of all our selections. I had the seared sesame tuna I loved how they paired it with mangos and avocado, great burst of flavor! We also split the tenderloin bruschetta which we had to take to go bc our eyes were more hungry than our bellies were lol Their menu offers a variety of dishes, everyone can find something they  like! We had a great server, she was very attentive, kept our drinks refilled and we liked everything she recommended! The manager was also very friendly, came to out tables and talked to us about Small Plates' history and the renovations. I don't have anything negative to say about this visit! Another thing I like to check is cleanliness. They also passed that test with flying colors! I saw a few reviews that were kind of low, I saw nothing of what they described. Maybe they were just having a bad day bc Small Plates is definitely one of my new favorite spots to eat at downtown!", "Date": "2013-11-12", "Author_Location": "Detroit, MI"}, {"Author": "Kristie B.", "ReviewID": "fYgFXlez4nRH2K6lrtqWrA", "Overall": "5.0", "Content": "One of my all time favorite places to visit downtown Detroit! The crowds aren't bad, and the food is amazing. I highly recommend the Baja fish tacos or the chicken and waffles. Yum! Drink menu is pretty diverse, and the Bloody Mary bar during weekend brunch offers many many options to make your perfect breakfast cocktail!", "Date": "2014-04-19", "Author_Location": "Novi, MI"}, {"Author": "Blair R.", "ReviewID": "v1YoKCyXFIJx1o5U71YfoA", "Overall": "3.0", "Content": "I went to Small Plates for brunch after the Detroit Marathon w/ some runners and other yelpers...Hi Beth N. and Catie S.! Overall, it was a pretty mixed experience of highs and lows.FOOD:Let's start w/ the food since I know that's what everyone cares about. The quality of food was ALL over the place so maybe this will just help keep you in the right direction. My Sausage Skillet Frittata (minus the sausage plus spinach) was tasty. It was light and airy and I had no complaints but my waffles tasted pretty stale and left much to be desired. I am hoping for Small Plates it's because we asked for the sauce on the side and that typically the sauce helps soften the waffles a bit.The poached eggs over salmon hashed looked gross. I felt bad for my friend eating it. The egg was hard. There was no oozy yolk to be found. There were overcooked salmon pieces all over the place. Ick. But the lunch food all looked good and the sweet potato fries were tasty. I eyed a breakfast pizza that I wanted to dive into and the sliders were eaten up quickly. If I go back, I'll probably stick to what Small Plates does best - bar dishes and pizza. SERVICE:We got to the restaurant early and it was empty but the staff (I think manager) was obviously angry...we could hear her complain that our res. wasn't until 1:30. Geesh we were with two people who just ran 26.2 miles and 3 people who just ran 13.1 miles! Give some hungry and tired people a break especially when the restaurant is EMPTY! Otherwise, the servers were sweet, although a bit slow.Overall -- If you are in Detroit, I encourage you to try Small Plates. I think it was an off day with a big party. And I def think it's a better lunch/dinner destination.", "Date": "2013-10-26", "Author_Location": "Chicago, IL"}, {"Author": "Sean B.", "ReviewID": "LZpRIQTLr1mWbKRhjynhjA", "Overall": "4.0", "Content": "Really enjoyed the visit here. Came with 3 others, and we split 9 plates. All of them were tasty. The fish tacos and buffalo chicken pizza (which was a special) were probably the best of the two. The chicken and pork sliders were both really good - the buns had a ton of flavor and the pulled pork was very tender. Only gripe was the tostadas - which were basically two tortilla chips on top of each other with the chicken on it. Overall - very enjoyable and worth another visit!", "Date": "2014-02-14", "Author_Location": "Livonia, MI"}, {"Author": "Tricia H.", "ReviewID": "YipEGB8e0r9w0u0VRqqUZA", "Overall": "4.0", "Content": "I like this place.   I usually go here when a rep wants to take us out to lunch as it really IS small plates they serve.   You need to order a few (or more) plates to fill up and that gets pricey quick.my fav menu items:Sea Scallopspretzel slidersfried green tomatoesmac & cheese", "Date": "2013-04-30", "Author_Location": "Detroit, MI"}, {"Author": "Liz T.", "ReviewID": "KnFNUvUi1EJIErzhjoYmmA", "Overall": "2.0", "Content": "Not bad but not memorable either. At a business dinner at Small Plates, the six of us ordered two of everything on the menu. That's just how blood thirsty trial lawyers roll. The fried green tomatoes, smoked BBQ pork sliders, and pan seared scallops were the highlights of the meal, though nothing compared to the bone marrow and ribeye at Roast in the Westin (yelp.com/biz/roast-detro…). We also ordered the dragon shrimp, but it never came. I also had the worst cocktail of my life here. Her Name In Lights. Consider yourself warned.", "Date": "2012-12-26", "Author_Location": "San Francisco, CA"}, {"Author": "Leslie A.", "ReviewID": "y5ifqmr8t0UrOW3KvH_dHA", "Overall": "1.0", "Content": "I tried almost everything on their menu and its all microwaved food.disgusting.i gave them 3 chances too many.chicken and waffles the owner explained to me its a chicken breast pounded out (scallopini) style with homemade waffles..ok i ordered it,mind u it came out in 3minites.and when i got it,it was two frozen chicken stips in between two eggo waffles.nasty!!! Dont waste your time,appetite or money!!!", "Date": "2013-11-06", "Author_Location": "Dearborn, MI"}, {"Author": "Chris S.", "ReviewID": "oVc3aRjZE2TppTIijkm72A", "Overall": "3.0", "Content": "Small plates? YesHigh prices? YesDelicious? YesSo this is a tough place to review. I feel the food is excellent but the prices for the size of plates is a little higher than it needs to be. I don't want more food...just trim the prices 10%. Presentation is strong. I have had the tenderloins, fries, pretzel sliders and Detroit donuts desert. All excellent. Three of us cost $75, though, and only one person got one wine glass. I might go back if I am in the area, but I wouldn't go out of my way to eat here. Sorry, I want to like you a lot...but I can't.", "Date": "2013-08-11", "Author_Location": "Detroit, MI"}, {"Author": "Liz W.", "ReviewID": "yzziFQO4wHGxrqocPqeEHw", "Overall": "4.0", "Content": "You need to be very careful in here indeed. It is tasty food but can quickly snowball into a huge tab for you. The reason is it is all appetizer sort of items and it will lull you into getting more than perhaps you realized. Plates can range from four dollars all the way up to seventeen, it adds up.Small Plates is a cute little cafe on Broadway right around the corner from just about everything, including my old place of work. It has quite a following and with good reason, the food for the most part is really great. The premise is fun as well, little plates of happy food to share. It's romantic. You can even dine al fresco and really feel the spirit.A must get here is the Hand Cut Fries, served with homemade ketchup. I recommend you request the garlic aioli as well as it is absolutely delicious. I alternate dips myself. Not good for you but mmmmm. At four dollars a bargain for here.The seafood here just all seems to be primo. The Garlic Shrimp comes with bread for dipping and is just so tasty. The Pan Seared Scallops have a heavenly brown butter sauce and are served over linguine. The Panko Shrimp are delicate with two delicious sauces. The Crispy Calamari are tender and are served with a perfect spicy aioli. You can even get a Garlic Shrimp Pizza or Fish Tacos, happiness indeed.The other stuff seems a little more hit and miss. The Petite Tenderloin is spendy but quality with a rich sauce and crispy onions. I quite liked the Veggie Spring Rolls with three sauces, you have to love people who remember hot mustard. The Lettuce Wraps are not quite as good as PF Changs though, they need that great dipping mixed sauce to jazz them up. The Almond Chicken was also not impressive, good but not for that price.The Broadway Baguette was crisp and sinful as were the Sherry Mushrooms in their cream sauce with baguette to dip. Way too much starch and fat but worth it. A bit spendy at eight dollars apiece.The salads are quite nice and come in two sizes, great if you want to share. I like the Chop Chop but the Maurice is confusing as it has chicken instead of ham and adds tomato and olives. Any native Detroiter knows that a Maurice salad made the famous Hudson's way is shredded iceberg, ham, turkey, swiss, chopped gherkins and the creamy dressing, period. Just odd in a Detroit place where they should get it right. It's good but it is no Maurice.Bottom line, Small Plates is tasty but spendy for what you get. Watch when ordering and if you are going to splurge do it on the seafood which is all good.", "Date": "2009-11-08", "Author_Location": "Belleville, MI"}, {"Author": "Chris V.", "ReviewID": "gKa8ZN0YQ-K_wfg8LJcSvQ", "Overall": "4.0", "Content": "I've been to Small Plates a couple times before shows or events in downtown Detroit.  First of all, it's a really great place for groups.  I don't know how most people do it, but with my group of friends, everyone orders something different and then we eat off of everyone's plates like animals.  Thankfully the waitstaff is good about splitting up checks - I've never had an issue with that here.While the food has always been consistently pretty good, I think it's important to note I haven't been really blown away by a dish here yet.  Don't get me wrong, I've never had a dish here I didn't want to eat, but there haven't been any home runs yet.Small Plates seems to be more of a jack-of-all trades ethnically, which adds to its group appeal - there's something for everyone here.  The dishes are usually a little bit on the pricey side.  To most that goes without saying, as I've noticed there's always somewhat of a downtown premium.  All in all though, it balances out.  With a good atmosphere and a wide variety of simple (but tasty) dishes, Small Plates is a great place to get a group meal before a fun night out.", "Date": "2008-12-07", "Author_Location": "Houston, TX"}, {"Author": "Rachel K.", "ReviewID": "4s4uauUyze6zTUId4b1hog", "Overall": "1.0", "Content": "I went last night, one of many 'Groupon Weekends' so dubbed by the waitress who also stated that they are gearing up for about 3 more in the near future. It wasn't that busy but the tables were 90% occupied. There were 2(!!!???!) servers in the whole place. Many times throughout the meal the phone would ring unanswered or a couple would be standing at the host-less stand for far too long. (As did we.)The 'complaining-about-being-stiffed', 'working-a-double-shift-exhausted' shtick must work for a lot of waitresses because I keep being served by them. My meal would have been much more pleasant had you just done your job and not elaborated. Honestly? I smelled your cigarette break on you. And I don't care if two old ladies left you $2.07 on a $40 bill. Cry about it. You work at an overpriced restaurant.  Though you were apologetic about HALF of the menu being unavailable, you brought our wine out mid-meal.They were out of ALL salad.They were out of 4 of 9 small plates. They ran out of pizza after we received 1 (tiny) pizza.They were out of the petite tenderloin. The only dish that friends said was worth the meal.THEY WERE OUT OF 18 OF 32 MENU ITEMS BY 7 FREAKING 30 ON A THURSDAY.Explain to me how this is acceptable.The food that we did get was overpriced and mediocre at best. I WILL NEVER EVER GO BACK!", "Date": "2011-03-11", "Author_Location": "Detroit, MI"}, {"Author": "Rachel C.", "ReviewID": "Kn1OQ-3kMDFpitcxHf_7sg", "Overall": "5.0", "Content": "I wish we could give out half-stars here....as I felt while this place isn't a perfect 5, it's deserved more than a 4. I looooove this little restaurant. I had gone here once last year before a show at the Opera House, and went in here again with a friend who had a Groupon. This time we had the Forest Mushroom pizza, Sherry mushrooms (YUM), calamari, and the Maurice salad (half size). This was plenty for two of us and we even had half of the little pizza left and some salad to spare. They need to give you a little more than a small tablespoon glob of sauce for the calamari though (minor complaint) although I'll bet they'd have given more if we had asked. I just have to say to be careful, if you add more than a few items then yes, your tab will add up quickly. I'd say for 2 people with normal appetites, 3-4 items from the menu should be good. If I am remembering correctly, items on the menu ranged from $6-12 each.You order your choices (usually a group effort because you'll hopefully be sharing) and the server brings out the items one at a time, with the next one maybe overlapping a little. They allow you time to nibble on and enjoy and share the one item before they bring out more. IDK what they do in larger groups, as I have only ever been in there with one other person at a time. I wouldn't recommend this place to a group larger than 4 or 6 though; it's small and can get cramped and I don't recall seeing a table that can accommodate large groups unless perhaps you rented that whole place out.Anyway, in both times I have been there, I have not had anything bad, left full both times, and had excellent service. It's not a place I'd choose to go every day of course, but it's a little different of a dining experience which I do enjoy from time to time.I am one of those appetizer people and love 'pick-food' and finger food where I can take a couple of bites of something and move on to something else. This place is right up my alley; it may not be for everyone. I am not certain though, I thought I did see (at least on the lunch menu) some regular-sized lunch plates. Don't quote me on it and I am too fricking lazy to go look it up on their website because personally I love the small plates.Great place to go before a theatre show too, and I do believe they accept reservations.", "Date": "2010-07-26", "Author_Location": "Livonia, MI"}, {"Author": "Misty J.", "ReviewID": "vndM7Hacl569IUjQ_2aj3Q", "Overall": "4.0", "Content": "The atmosphere is relaxed and the high backed booths feel classy. The calamari is good but a little over breaded for our taste. I didn't expect the veggie spring rolls to be fried. The forest mushroom pizza is amazing! It's super garlicky with an awesome thin chewy crust. Definitely the beau's favorite part. They pour the drinks strong, which I can't really complain about it. We'll definitely be back, if only to try some other pizzas and get more of those tasty fries and ketchup.Sidebar: I was trying really hard to post this without making a comment to the girl who complained about seing a man date. But I just can't! So girl with socialization issues, please either grow up or stop leaving your house. kthx!", "Date": "2010-07-04", "Author_Location": "Detroit, MI"}, {"Author": "Colleen Z.", "ReviewID": "jUhYKqWSnYP5Qq7vlwhiGQ", "Overall": "5.0", "Content": "My girls from out of state were visiting and we decided to go into downtown Detroit for dinner.  Small Plates had been suggested to me months ago as a great place to eat so after reviewing the menu online we called for a Saturday night reservation for four.   Reservation easily made and later we received a confirmation call from the restaurant.  Nice touch.  While on our way to the restaurant we called to ask about parking and were directed to the Opera House parking garage which is across the street about a half block.  Very easy to reach the restaurant from the garage.  Parking charge $20.  Our waitress Kelly was terrific making sure we had full drinks and anything else we needed.  Cocktail service was quick to make a martini, sangria and two beers.Our choices for dinner included 5 oz. tenderloin with Gorgonzola sauce, almond chicken, panko shrimp (yum!), sauteed garlic shrimp and home fries.   Halfway through dinner we decided to order another order of the panko and garlic shrimp.  All dishes were perfectly cooked, hot when delivered and very tasty.  Only failure was the creme brulee dessert.  Absolutely no taste whatsoever, even the caramelized sugar top.  We were perplexed.  One attribute of the restaurant we noticed was the friendliness of everyone around us.  The space is quite cozy so your neighboring table is close but everyone was happy, relaxed and enjoying themselves.  Although we did not initiate, we had brief conversations with two separate parties seated at the table next to us, the hostess and bar patrons.  The dinner was a perfect start to a fun evening.  I will be back!", "Date": "2009-07-19", "Author_Location": "Ann Arbor, MI"}, {"Author": "Elizabeth B.", "ReviewID": "qHQZ9yKQAHv8m-PL4V8uOg", "Overall": "1.0", "Content": "Horrible tacky gross place. The inside is super bright and looks like a sports bar. They were out of EVERYTHING on the menu, I mean EVERYTHING. Bottles of wine, mushrooms, pizza...And the worst part is that it took them 30 minutes to tell us that. So after waiting for an 1/2 hour all we had was water and a menu of two choices to order and no wine. And it was a SATURDAY night at 8 o'clock!!I just can't say enough about how much this place sucks: Waitress was rude and looked like hell, the lights were so bright it gave me a headache, tv's going on all around, no food, no wine, the other customers were all gross to look at---NO CLASS. Ew ew ew ew...We finally just gave up and went to Cliff Bells and had the perfect night of amazing food, nice wine, low lights and enjoyable service (MUCH BETTER).", "Date": "2011-04-24", "Author_Location": "Washington, DC"}, {"Author": "Liz R.", "ReviewID": "WcbApbZZ9QH7CaKX-_4tzA", "Overall": "4.0", "Content": "Packed!  But we did choose to go on the night when the perfect storm o' entertainment hit - home Red Wings game 7pm, La Boheme at the DOH at 7:30pm (across the street) and Rock of Ages at the Fisher at 8pm.I made the reservation the day before and had to beg them to squeeze our two-top in because they were full for the evening.  They graciously accomodated me (with only minor scraping and groveling on my part) for 5pm.  We arrived 15 minutes early and were promptly seated.My order was the Sherry Mushrooms small plate and the Garlic Shrimp pizza.  I washed it all down with an excellent dirty martini, complete with blue cheese stuffed olives.  I'd get all three again, but the mushrooms were special.Mom ordered the Crispy Calamari small plate and BBQ Chicken pizza.  She also ordered the Hand Cut Fries, which came with housemade ketchup (equal parts ketchup and BBQ sauce plus a sprinkle of coffee grounds - I was snoopy and asked), garlic aioli and malt vinegar.  Mom's calamari was awesome - soft, tender, perfectly crispy/non-greasy breading, served with the aioli for dipping.  She washed her meal down with the Hemingway Daiquiri, which packed a serious, but delicious, punch.My one gripe, other than the time it took to get our order placed (but this seems to be a place where the waitstaff runs their tushes off), was parking.  If you don't find a spot on the road, metered during the week, then you must park in a nearby lot.  We paid $20 ($20!!!) to park in this teeny lot next door.  I was able to talk the guy down to $15 (yep, I'm that persuasive...), but it still pissed me off.", "Date": "2010-11-14", "Author_Location": "Livonia, MI"}, {"Author": "Katie H.", "ReviewID": "3x5HklmOGu8o1JPqg8LInA", "Overall": "5.0", "Content": "I have been coming to Small Plates since shortly after it opened in 2002. It is one of my must stop at places when I am back in Detroit. For small plates, the portions are actually quite good sized and the prices are right on. My husband and I usually share the ceaser salad (huge, garlicy, and with big slices of parm - $5), the thin crust barbeque chicken pizza (best bbq sauce ever - $10) and the gorganzola filet ( oh my god that sauce! the filet is only 4 ounces so they tend to overcook it - order rare if you want it medium rare - $12). That will fill us up easily. We have also deviated and ordered the chicken skewers (good, for meat on a stick), the four cheese pizza (excellent) the empanadas (very good) the scallops (yummy) and the beef stiry fry (the only thing I wasn't impressed by). The chocolate chunk cookie sandwich is sinfully delicious. My sister also hosted a party for her husband's birhtday last year and they did an excellent job with the group of 20. Service has always been good, especially at the bar. Kramer is a wonderful bartender - ask for a storm cloud martini and you won't be dissapointed. The wine list is excellent and now they have a cute outdoor patio. Oh, now I am homesick!- - -- - update 11/15They have now opened a Small Plates in Royal Oak.", "Date": "2007-09-10", "Author_Location": "Chicago, IL"}, {"Author": "Kara H.", "ReviewID": "zxzhJcKXdjCFVyYUJUfx6g", "Overall": "1.0", "Content": "This place is THE WORST!  This was the first restaurant I'd ever had tapas (although people usually think you're saying \"topless,\" everyone was fully clothed) and had I not gone to Miami and had amazing tapas, I would've been prejudiced against it forever.  Their dishes are overpriced (granted they are traditionally small portions of food, usually the quality makes up for the quantity), and the food is just not good.", "Date": "2010-03-03", "Author_Location": "Lansing, MI"}, {"Author": "Lorna D.", "ReviewID": "COR6wZLHQWBfSb0OBz23VA", "Overall": "3.0", "Content": "Found myself here when Small Plates first opened and remember sitting at the front chatting and tossing back vino on a Tuesday afternoon feeling glowy, decadent, and quite cosmopolitan.Stopped in again today for an early Sunday meal and the vibe felt quite different, more...everyman, perhaps?  It was comfy and upbeat though-especially when the couple seated two inches to our left vamoosed.  Our server was friendly, fun, and quite attentive, and the food was tasty and surprisingly replete. Had to doggie bag half my veggie pizza, and the cups of aioli and the barbecue-saucy house ketchup that came with our tasty fries were oddly addictive.  The ol' \"dip assorted foods in once you finish your fries\" allure.I would like to see more complexity and finesse in the dishes, even if the portions were smaller, but the food was good nonetheless.  A few spices shy of wow, but you'll find something different, pleasant, and very Detroit.", "Date": "2010-12-05", "Author_Location": "Detroit, MI"}, {"Author": "Scott M.", "ReviewID": "P1z26CJP5kZfE2bzuRU0TA", "Overall": "4.0", "Content": "Small plates was actually my first Tapas experience ever.  I have to say that as a man who prides himself on being a member of the clean plate club since the age of 8 weeks old, the idea of small plates was one of the biggest turnoffs for me.  I couldnt understand the concept of someone bringing me 2 ribs as opposed to a slab, or the fact that I had to find a way to split those damn 2 ribs 2 or three different ways..which meant I had to get real creative or I had to buy more of these damn small azz plates.Neither idea appealed to me.  So I waited for the jizob to have a lunch and once the recommendation came that we should eat at Small Plates, I jumped all over it.  I wasnt trying to experiment and have to eat this bill.So a group of about 5 of us went from the office.  Small Plates was definitely a good choice.  While it was a while ago, I can definitely remember the items that I sampled:a)  Pan Asian Lettuce wraps:  These work for me, tasty light, and a good \"sampling\"b) Garlic Shrimp: recommended by our server, definitely a good look.  You have to order a few of these if you are with a group, nonetheless, they are well worth it.c)  Bbq ribs:  what I thought was going to be two bones, actually turned into a half slab.  Great flavor, definitely a pleasant surprise.d)  Handmade fries:  These damn fries are off the chain.  The highlight is the homemade Ketchup...mmmm, they work!e) Chop Chop Salad:  This salad was surprisingly big, and plenty to share with the group.We didnt get desert, but surprisingly, I was so damn full that I didnt want to think about dessert.Great service, great drinks, great food.  Definitely a legit highlight of Detroit.", "Date": "2008-07-18", "Author_Location": "New York, NY"}, {"Author": "Stephanie L.", "ReviewID": "LnWva4nM2w4y25B-bL6Iew", "Overall": "1.0", "Content": "This. place. is. awful.By the name Small Plates, they seriously mean you will get small plates.   No seriously I'm not kidding, they're VERY small.  The restaurant should have been named Overpriced Small Plates so at least we had some fair warning.  Our waitress was awful and as many other people noted I think there were only two waiters serving the entire restaurant.  We were with a party of 5 and she brought out one person's food an entire 20 minutes before the rest of us.  I've never been a waitress, but even I know you don't do that.  We had to hail her down to get water or even place our initial order.I had a few friends recommend their french fries, but they're the exact same as the new sea salt fries at Wendy's.  No joke.We each ordered a main dish and split a few appetizers.  On the drive home, we realized we were all still starving to death and ended up going to Taco Bell which was twice as satisfying for half the price.If you eat here, you must be a masochist--you will be starving to death afterwards, be disrespected by the staff, and just have wasted plenty of money that could be well spent elsewhere.  Basically anything would be more worthwhile than eating here.", "Date": "2012-06-02", "Author_Location": "Chicago, IL"}, {"Author": "Kim H.", "ReviewID": "lcCx09CFt7VxbPWE2-7btQ", "Overall": "4.0", "Content": "I very much enjoy tapas and Small Plates makes me happy. I've yet to have a bad dish, service, or drink.That said, we rarely eat here as my dining companion is big eater with an enormous appetite and we'd have to order too too many plates of slightly overpriced food to satisify him. So, if tapas works for you, this is a great place. If however, your companions are large, hungry men, perhaps Slow's is the better option.", "Date": "2008-12-23", "Author_Location": "Grosse Pointe Park, MI"}, {"Author": "Tanya N.", "ReviewID": "cn91TJ6SB8Wam0m3htjSeQ", "Overall": "3.0", "Content": "\"What?!\"  \"I can't hear you!\"  \"What?!\"  \"Can you speak up A LOT?\"  \"WHAT?!\"  This was pretty much our entire conversation when dining at Small Plates in Detroit.  It was so loud in there and the acoustic were miserable.  We sat right between the bar and the big front window.  I guess that equals painfully loud.  We gave up on talking early into our time there, so we resigned ourselves to people watching - mainly watching at people yell at each other.Ah, speaking of people watching.  I did notice a happy thing.  For a Detroit restaurant, it was quite diverse.  I would say that it was 60% white to 40% black.  This was a good thing.  I see, way too often, restaurants in Detroit that are all white.  All white in a black neighborhood?  What's up with that?  I never understood that.  I enjoyed the diversity here.Service was pleasant enough.  Although, they should clear your tables more often due to the fact that you have a great quantity of plates coming to your table.  Ours was only cleared when the waiter could no longer find a spot for our next plate of food.On to the food and drink.  We ordered:#22 - Pear Vodka & Blackberry Brandy w/ Coconut Rum & Pineapple - But they were all out, so I sipped on a soda.  I was so disappointed as this drink sounds awesome to me.Broadway Baguette - Toasted Baguette Bread with Boursin Cheese, Roma Tomatoes, Parmesan, & Fresh Basil $8 - They must have been out of Boursin, as ours didn't have any on it.  It was tasty-ish none the less.  At 6 little pieces, it wasn't worth $8.Grilled Eggplant Sandwich - with Roasted Red Bell Peppers, Portobello Mushrooms, & Buffalo Mozzarella on Baguette - $8  I upgraded to having the hand-cut fries with this for an extra $2, which was worth it as those fried and the accompanying homemade ketchup and garlic aioli (ask for it) were quite tasty.  The sandwich was fine.  Nothing to write home about though.BBQ Ribs - Half a Slab of Baby Back Ribs Served with Hand-Cut Fries $15 - My husband was in hog heaven with this dish.  It was quite a bit of food.  Good deal.  He liked that the meat wasn't too fatty.  And there was more than he could eat, so he boxes some up for lunch the next day.Chocolate Chunk Cookie Sandwich - Guernsey Butter Pecan Ice Cream Sandwiched Between Two Housemade Chocolate Chunk Cookies Smothered with Sander's Hot Fudge $7 - Loved this!  Very yummy!So why the three starts, I might have been ruined for other tapas restaurants by Sangrias in Royal Oak.  They have an incredible selection - not so at Small Plates.  If you must go to one, go to Sangrias.", "Date": "2010-10-17", "Author_Location": "Farmington, MI"}, {"Author": "Derek D.", "ReviewID": "3ZTeqoM82GIasmy-7cn40w", "Overall": "4.0", "Content": "I went to Small Plates with my wife and some friends for the first time in several years. It has since come under new management, but the menu is still great & service was excellent.  The only downside was that the background music - initially opera music & later rock, was a bit on the loud side, making conversations somewhat difficult.With regards to the food, the Ceasar salad was ok, but not great; the Mac & Four Cheese Gratin was pretty good. The real stars were the lamb chops, the fish tacos and the Beef Tenderloin Bruschetta - all were excellent!", "Date": "2013-12-02", "Author_Location": "Westland, MI"}, {"Author": "Jenny Z.", "ReviewID": "pLHn_FOW4-TvttVDHK9AJw", "Overall": "2.0", "Content": "This place is so overpriced.  We had a Groupon and still felt it was a bad deal.  The food is really small portions - like even when you get the full plate for $16 that would normally buy a good sized meal.  A \"small plate\" then literally means 4 bites (not mouthfuls), I mean dainty little bites.  We paid $11 for 4 pieces of shrimp, and then I paid $16 for my entree of low quality meat dribbled with this cream sauce.  Not good, greasy and you leave feeling weighed down, like after you just binged on fast food or something.One thing that WAS awesome was the creme brulee.  I mean, it tastes as good as many other places, but it was definitely yummy.  Although, for the price - it was literally half the ramekin size of other restaurants.I would not come back here.  I just wouldn't.  There are soo many good restaurants in Detroit - there's just no point in ever coming here.  Detroit is one of those rare places that have great restaurants at really low prices.  Anyways, if you're pretentious (or you're trying to impress your anorexic date) and like fancy looking places over great food - go here, otherwise, if you're a true foodie, go to one of the other amazing places in Detroit.", "Date": "2010-07-20", "Author_Location": "Novi, MI"}, {"Author": "Maria B.", "ReviewID": "HI5FflhyGQgBLoFpT9l9qA", "Overall": "1.0", "Content": "After getting out of a concert downtown, and looking for a place to eat at 11pm, we decided to stop in at Small Plates. Most of the other places along the walk were either closed or stopped serving food at 10:00pm, and from what i remember on my last visit to SP (two years ago) the food was pretty decent.Sadly to say the food, service, cleanliness, and just everything about this place has gone downhill since : /First off, the waitress must've been taking some hits on her break b/c besides her pink glossy eyes, she didn't know what was going on half the time....no napkins, no silver ware, and after 45 minutes she said the burger was still not done and that it had to be put in the oven to finish cooking, really?!!?Then the spring rolls i had ordered tasted like they had been cooked, frozen, microwaved, frozen again, defrosted, and microwaved fresh on my plate.To sum it up: skip this place!", "Date": "2011-05-28", "Author_Location": "Detroit, MI"}, {"Author": "Kelley W.", "ReviewID": "7f84_i-LPmx3ewzAi9hOGg", "Overall": "4.0", "Content": "I've been to Small Plates a few times, most recently on Tigers Opening Day, which was a Friday. We hit up Small Plates after the game for dinner. Although they were out of several beers, every table was full, and the servers were super busy we had a great time.We were lucky enough to sit in the back bar that is at the cook's prep station. So it's really hot sitting there because the open wood oven is right there but, it's great to be able to talk to the chefs. Although they were extremely busy they still took the time to interact with us. The food was ok and the service was subpar. However, the previous visits had wonderful food and very attentive service. Truly delicious food, great selection and fun options.I would say the lesson learned is to not go there during busy times in Detroit when they are clearly overwhelmed.", "Date": "2009-04-14", "Author_Location": "Farmington, MI"}, {"Author": "Lisa W.", "ReviewID": "ae3tvIWoy55y64sjJ9HP5Q", "Overall": "4.0", "Content": "Coming here is a great, well-rounded experience.  The atmosphere is warm, with deep hues of yellow to welcome you.  The wine list is no joke, and the food menu is delicious.  I try to order something different every time.The fries here are hand cut and taste delicious with the garlic/vinegar dipping sauce.  I'm also a fan of their ribs.  I'm not so happy that their chop salad is made with iceberg, as are other salads on the list (but not all).  I have no idea why a nice place would waste their time with iceberg -- ick city.  Beer lovers may just have to roll with the wine or martinis if you're going this route.  I know I did -- I love Guinness, but maybe not here.Topping off the experience with dessert will not disappoint -- they have this cookie sandwich that's made with Guernsey ice cream and homemade cookie -- plus Sander's hot fudge!  Can't beat that along with a black Russian drink.", "Date": "2008-07-23", "Author_Location": "Flint, MI"}, {"Author": "Jeff C.", "ReviewID": "rfKI4R269j8EbJfKHFPwpQ", "Overall": "2.0", "Content": "The best thing Small Plates has going for them is location.  I've have been there multiple times with groups and each visit I wonder why we keep choosing them.  Seriously, Detroit has some amazing restaurants of which, Small Plates is not one of them.  It always seems dirty there, I have yet to sit down and not feel like I'm sticking to the table and/or floor.The food is horribly expensive for what you get.  I understand that small plates means small portions...I get it.  I just don't see the value in the taste, its not that good.  My last visit I tried the spring rolls and they were dry and tasted simple, same with the chicken skewers.  I guess at the end of the day, if I'm going to drop the kind of cash I can think of a lot of other options within that area.", "Date": "2011-06-15", "Author_Location": "Royal Oak, MI"}, {"Author": "Ruffy L.", "ReviewID": "Ms-5MlibbwYIW9jn6JOcWA", "Overall": "1.0", "Content": "I came to this place with a friend to meet and socialize with 6 other people before we all head to the main event of the evening. Whatever \"the event\" shall remain unnamed. hehehe.My friend and I sat down and, though we were still waiting for four people, decided to order because we were STARVING! We each had our turn to order. My first clue this was not going to be a pleasurable dining experience was when we ordered THREE items that they were ALL OUT! AT 7 in the EVENING????? REALLY? Correct me if I am wrong but aren't servers supposed to tell the customers what items in the menu they are OUT OF BEFORE he/she even give out the menu? This way, customers will mentally black out/skip those items they know they could not have even though they are craving for them. I don't know about you but for me, telling me \"sorry we are out of that\" AFTER I told you I want it, is just plain MEAN!So, after we have chosen our food from the \"runt of the menu,\" the rest of our company came. After what seemed like eternity (at least 30 minutes) we were served our food one by one. My friend who ordered fish tacos (3 for $9 dollars) shared one of them and started eating one herself when she told me the fish were BURNT -- not BLACKENED but downright BURNT! Naturally she sent it back (and ALL the time I have eaten in restaurants with her, this is the FIRST TIME she did so -- very out of character!). She waited an ADDITIONAL 20 minutes to get ONE fish taco! Uhmmm... aren't you suppose to replace ALL three if there were three in the original order? At LEAST two since she DID send back ONE \"COMPLETE\" taco and another one with only ONE BITE! THAT was not the worst part. When she bit into this \"replacement\" fish taco, she told me that this one is COLD (read: frozen!). Yes, it was AGAIN sent back! At this point, my starving friend was lucky there were enough of us who shared our food with her for her to \"cure\" her hunger.Our other friend ordered a pork loin and did NOT get it until AFTER at least three reminders to our server AND AFTER the \"cold\" fish taco was served! (If you were paying attention, about 50 minutes had already passed since we first ordered our food). Even then she had to send it back because when she cut into it, blood oozed out! It was cooked rare (for the past FIFTY MINUTES????? REALLY?????) when she specifically asked for medium well!In the middle of our dinner, one of the ladies in our group decided to get another one of her mixed drinks. About 5 minutes later, the bar tender came into our table and told her he would not be able to fill the order because they just RAN OUT (surprise, surprise!) of one of the liquors needed for the mixed drink!In the middle of the conversation between this gal and the bartender, I decided to just shut everything off and take myself mentally to my happy place sans alcohol. I don't drink mind you but I sure wish I have that night -- then again, they may have been out of what I want.IF I could ONLY give a ZERO star rating I would. That might be a little vitriolic but I think in this case, it is well deserved.Will I be back? To quote another one of my friends: \"f**k no!\"", "Date": "2012-02-25", "Author_Location": "Warren, MI"}, {"Author": "Devon A.", "ReviewID": "Pck1AFL0lgDqvETfxeW7TQ", "Overall": "2.0", "Content": "It's taken me 8 years to finally try Small Plates. After reading reviews and hearing the hype, I was expecting something stellar. Sadly, my first trip was bad enough to be my last.In short, the service was subpar. There were three servers working the front of the house, which was about 75% full. So, what's with the slow and inattentive service? The looks on other patrons' faces confirmed that we were not alone in our frustration.   The food was mediocre at best. Skip the pizza and the shrimp. I will say the Chocolate Chunk Cookie Sandwich was ridiculously good! Guernsey's butter pecan ice cream between housemade chocolate chip cookies, smothered with Sander's hot fudge was insane. Hell, skip dinner and just order dessert and wine. Oh, yeah, just make sure you're not in a hurry. I rarely judge a restaurant based off of only one visit. However, I have no plans on returning anytime soon.", "Date": "2011-03-12", "Author_Location": "Ann Arbor, MI"}, {"Author": "Jeff S.", "ReviewID": "tOnKdUs_-6nn5b_I9PmNOw", "Overall": "1.0", "Content": "Small Plates filed for bankruptcy last week.  While they filed under chapter 11 (reorganization for businesses) and intend to remain open consider yourself warned.Given the recent reviews here, I can't say I'm surprised.  The Royal Oak location showed all the same signs right before they went bankrupt - out of many/most items on the menu, understaffed, surly service, etc.It's a shame because in it's prime this was a really enjoyable restaurant with a great concept.  Fortunately there are others (Sangria, Cork and Tallulah's in my area) that have picked up the baton.", "Date": "2011-06-29", "Author_Location": "Huntington Woods, MI"}, {"Author": "Boodah D.", "ReviewID": "oAv-G_ZGKUHpecTf2A0I3w", "Overall": "2.0", "Content": "Hmmm *scratch head*... how do I write this without too much subjective...  OK, I CANNOT!  I drop no punches when talking from here on out!  Truth first, always!  Small Plate food good.  I only have problem with appetizer price.  I think... little too much for what you get.  Right now I feel somewhere between 2/3 star.  Technically, I give.. 2.5 star!  $11 Appetizers should be no more than $8 in my opinion.  We had tasty choices like veggie eggroll (interesting), fish taco, garlic shrimp pizza... all good, no negative thing to say about food choice.*Observation*  If any yelper sit at bar, next to wall, under flatscreen tv... look very carefully at mount bracket.  Only 2 screw hold TV in wall... and top screw come out *yike* I was good customer and told waiter (but you never know... check tv before sit!) otherwise you might be in middle of lawsuit.  Enjoy!", "Date": "2008-07-28", "Author_Location": "Dearborn, MI"}, {"Author": "Lindsey T.", "ReviewID": "DEY8D_7UWMOxS0vku_3_-Q", "Overall": "4.0", "Content": "Tables were a little close together, but the wine list was good, and food was much more filling than we expected. We ordered the pretzel sliders (a bit greasy) and the BBQ chicken pizza. Atmosphere, service, and views were good. Lots on the menu looked tasty! We were lucky to get in without a reservation on Valentines Day, I'm surprised they weren't busier...", "Date": "2014-02-15", "Author_Location": "Novi, MI"}, {"Author": "Darren R.", "ReviewID": "i7TcXR2bC0h6nocQMwJKIQ", "Overall": "2.0", "Content": "Over-rated! (clap clap, clap clap clap)I'm sorry, but the whole tapas fad is lost on me.  The food is fine but overpriced for what you get.  Their pizzas are OK.  If you're downtown for a show or whatever, my votes are for Detroit Beer Co. right next door or Vicente's, which is a couple blocks away.", "Date": "2008-04-20", "Author_Location": "Billings, MT"}, {"Author": "Frank C.", "ReviewID": "JPR4Qdup1lrirpUweDhp7A", "Overall": "4.0", "Content": "After hours of looking on line for a good restaurant to eat dinner at after the Red Wings game, i finally landed on Small Plates (thanks to fellow Yelpers)I went a Sunday evening around 7pm and there was about a 20 Min wait. It was worth the wait for me. The place it self is small, but the quality and atmosphere make up for it. Now, getting to the food!! One thing I did not know before I went to Small Plates, was that if you have a ticket stub from the Red Wings game, you get a free personal sized brick oven Pizza!!! Perfect! just what i was gonna ordered anyway!! I was concerned on the size and that it wasn't gonna be big enough, but it was more than filling! I also Ordered the Hand Cut Fries with the Homemade Ketchup!!!(def. recommend) My Girlfriend also ordered her free pizza and ordered a Salad on the side. She ordered the half portion and that was more than enough for the both of us!! Just as an FYI, our table was set at back of the restaurant with full view of the kitchen and the Brick Oven where they cooked my pizza ( I got to watch them prepare my pizza!!) Overall the food service was great. I was very impressed and would def. go back and recmmd to my friends and family!!!", "Date": "2009-05-18", "Author_Location": "Cheektowaga, NY"}, {"Author": "Rachael N.", "ReviewID": "rXASdhQ8pS6y1KYI5V_PaA", "Overall": "4.0", "Content": "Mmmmm. My girlfriends and I were having a girls night out to watch the Phantom of the Opera (which was showing ACROSS the street), and stumbled upon this restaurant. As you walk in, the decor is definitely modern, the lighting the right amount of light. It can be a date setting, a casual talk setting, a family setting, whatever you make it out to be. Although there wasn't a large enough table to sit our 10 people, we sat along the black booths on the wall. Drinks: - The drinks were good. I was saddened that they did not have their sangria that night, but I chose better. - - Cucumber Gin Fizz- I was a little hesitant about the \"cucumber\" word in my gin, but as I am not a huge fan of gin or cucumber, the mixture of the two was surprisingly refreshing. Definitely an all time fave. - Club Tropicana- Pretty good, if you like sweet drinks. The coconut rum was pretty strong in the flavor though. - Pisco Sour- This was another one of my favorites. Usually the sour drinks aren't that great, but for some reason, this one was superb. - Pimm's Cup- It was alright, it was just cool there was fruit. - Cactus Blossom- My friend got this.. and it was way too thick. They didn't stir the honey up? So all the honey sank to the bottom. I mean, just the description of honey in your drink... ewww. Food: Being a bunch of girls who 1.) like to eat and 2.) like tapas, we had fun at this restaurant. As the prices are all reasonable, this restaurant was a great place to try most of the plates. - BBQ ribs- my friend and I split this and it was DELICIOUS. It was MEATY (I was expecting just bone) and the sauce was so good. It was smoked just right, so it was slightly crispy. Not too messy to, as we were both dressed up. We were definitely eating it with our hands though. - Crab cakes- this was pretty good. I'm not sure how to rate crab cakes. - Olive and Cheese Plate- I didn't try the olives (I hate olives), but my friends said it was good - Broadway Baguette: The Boursin cheese that came with this plate was SO good. I don't even like cheese, and I thought it was great - Crispy Calamari- Probably the most tender calamari that I've ever had!! It was amazing. The spicy aioli sauce was really good as well. Not too spicy, but the flavor was great. - Roasted Veggie Pizza: Eh, it was a thin pizza... not too impressive, but the veggies were all there. We were so full afterwards.. definitely worth the trip. I would go back in an instant though! I wished I could have tried more of the drinks... and possibly the dessert. I think I would just go back for the calamari, bbq ribs, and cucumber gin fizz, all by myself...... :)", "Date": "2009-10-27", "Author_Location": "Cleveland, OH"}, {"Author": "Patrick H.", "ReviewID": "If_R6jtTF8Lr93aCVxr2qg", "Overall": "3.0", "Content": "Good but not great, more towards mediocre than outstanding, would have gave 3.5 if possible. Scallops were amazing, thought the Pinot Noir selection was disappointing.", "Date": "2013-01-03", "Author_Location": "Detroit, MI"}, {"Author": "F T.", "ReviewID": "TF9WkyXmQ0vqdlpdHCiSLg", "Overall": "5.0", "Content": "I've been going to Small Plates since 2004. It has had its ups and downs in service, but the food has always been a highlight of the poor city. Last Sunday I stopped in before a Tigers game and was reminded why I continue to frequent this place.Simply, our food was terrific! My partner and I like ordering in waves of the small plates to share. However, our service was lacking, then it was non-existent, and finally it became downright laughable before I talked to the owner who I happened to see walking by. His reaction was exactly what every owner or manager's should always be  - he quickly apologized and asked another server to take over our table. Needless to say, the experience quickly became one of the best we have ever had. He stopped by later to make sure everything was satisfactory and offered us free dessert. The Chocolate Chunk Cookie Sandwich is unbelievably  amazing!!! We thanked him for his understanding and even if we were not already going to be returning, his reaction and the new server's understanding made this such a wonderful experience. The food is excellent, the service is great, but most importantly, the leadership of Small Plates is what continues to make it stand out.", "Date": "2010-07-31", "Author_Location": "Alexandria, VA"}, {"Author": "Torrie M.", "ReviewID": "z1s46Smo9M6RWkCwbe8YzA", "Overall": "4.0", "Content": "I usually don't like to share my food, but thanks to Small Plates, I am a changed woman...ok only when I eat here! Tapas style dining is at its best in this quaint, midtown restaurant. I love their pizzas and fresh salads. They also offer calamari, spring rolls, crab cake and shrimp appetizers, as well as ribs, stir fry, and almond chicken. You'll go crazy for their french fries and bbq dipping sauce. You might also enjoy their creative cocktail menu and wine list. Their cheese cake and creme brulee are also pretty good. Check out small plates before or after a baseball game, opera, or concert. You'll be glad you did!", "Date": "2010-09-12", "Author_Location": "Farmington Hills, MI"}, {"Author": "Sarah C.", "ReviewID": "TjRpeb0uJu4fJYAkadTEMA", "Overall": "3.0", "Content": "Came here for my friend's birthday two nights ago. (Tuesday Night) The place is a lot smaller than I imagined but they also have outdoor seating. Too cold for that. It wasn't too busy but busy enough for a Tuesday night. We all just ordered our own. I ordered the garlic shrimp pizza. It was good and the right amount of food for me. The waiter said its usually 1.5 plates per person. I think that is for someone with a big appetite. Our waiter sort of ignored us and we had to flag him down after 15 minutes of sitting there looking at the menu. The food also took a while to arrive. But overall I think everyone enjoyed their food. I think I would like to come back and do family style so I can try everything! Nice bathrooms.", "Date": "2012-02-23", "Author_Location": "Detroit, MI"}, {"Author": "Henry B.", "ReviewID": "olILAWa7zmvS0Se-nT8hzA", "Overall": "2.0", "Content": "I've had catered food from here before and I got FOOD POISONING. It's way overpriced for mediocre food. And also I got FOOD POISONING.Did I mention I got food poisoning? :)", "Date": "2012-02-07", "Author_Location": "West Bloomfield, MI"}, {"Author": "Caadi D.", "ReviewID": "o-KbrZzBtRa9fZQZZ5ThSw", "Overall": "4.0", "Content": "Theater~ Dinner/Drink SpotI recently went on a week night before attending the Lion King at The Opera House (across the street). The crowd started in at around 5:30.We made a Res but ended up sitting at  the bar (smoking aloud there).What did I want to drink???? Anthony asked. Wine??? Martini???? I decided to go for the (martini) hair of the dog I said.  He asked me what that really meant and I proceeded to BS some reasoning. A few minutes Kramer came back with the Wikopedia explanation I was wrong. We tried almost the whole menu. Although simple the Pizza's were by far the best. The Fillet topped with gorgonzola was fab. I would skip the fishy crab cakes.Catch the people mover next door. We went to the Greek Town Casino where you are dropped off inside and then back for a buck round trip.", "Date": "2008-01-03", "Author_Location": "Clinton Township, MI"}, {"Author": "Brian S.", "ReviewID": "Nb43u1fcbaHUR62BxA8hPA", "Overall": "4.0", "Content": "I have ate at Small Plates a couple of times.  It has a good location and is central to lots of entertainment venues.  The ambiance is really nice.  The murals on the wall are striking.The service is OK.  The staff is competent and reasonably efficient.The wine list is good and has some nice selections.  The food is all solid as well.  At are most recent visit, the Chicken and Waffles and Fish Tacos were both great choices.", "Date": "2013-01-09", "Author_Location": "New Baltimore, MI"}, {"Author": "Amy G.", "ReviewID": "b9M6mg-d91BIEsvrqz_QHw", "Overall": "5.0", "Content": "Let me first say that I have not frequented many tapas restaurants, so I admit that I do not have a huge basis of comparison when writing this review.  I do have lots of experience eating at good restaurants, however, and this is one is definitely delish!   Everything about my experience was delightful, from the friendly and helpful waiter, to the ambiance and finally the food.  I do not eat beef or pork, so our selections were based on those restrictions.  The chicken and mushroom dish was by far the best, but everything we tried was really good.  The most exciting part about this restaurant is that it can hopefully be a part of the resurgence of a city that is clawing it's way back from despair.  Please go give it a try!", "Date": "2012-08-29", "Author_Location": "Novi, MI"}, {"Author": "Jessica A.", "ReviewID": "AGAd9IuFrpItM_Uprl8gow", "Overall": "4.0", "Content": "My job requires a ton of travel, so when on business trips, I try to experience each city's must-eat restaurants.  I rarely eat at the same spot twice. This was *not* the case on a recent trip to Detroit.  I stopped by Small Plates for lunch on Thursday and then came back for dinner on Friday because it was that good! At dinner specifically, my attentive + prompt server, Jason, recommended a few must try dishes.  Do yourself a favor and get the pretzel sliders, scallops and BBQ chicken pizza. There's a hint of cinnamon in the pizza that gives it a strange appeal that I had to have two days in a row.  The atmosphere was also something I could totally see here in New York. Local graffiti adorning the walls, sleek metal countertops, custom cocktails and a superb wine list.  The perfect place for afterwork drinks!  I'll definitely be coming back to Small Plates the next time I'm in Detroit.", "Date": "2012-04-28", "Author_Location": "New York, NY"}, {"Author": "Ben S.", "ReviewID": "PWXCUTOKqDlZ_IMVluckrw", "Overall": "4.0", "Content": "Food is great, but way too expensive for the offering.  I would eat here much more often if they made the prices a bit more reasonable.As an aside, the new ownership and management is a major improvement over the old Small Plates.", "Date": "2012-12-16", "Author_Location": "Ossining, NY"}, {"Author": "Katie W.", "ReviewID": "CzSR-ZYkGTMebnh6JVbsWg", "Overall": "4.0", "Content": "Was looking for somewhere to catch a bite to eat and a drink. Made reservations for 3, ended up being 15 minutes late and only 2 women strong! Seeing as how mapquest fails to mention that Park turns into Witherell, and that there is no street sign for Broadway at that intersection, hmm.......going in circles while trying to dial Small Plates and while passing a Detroit cop. Oh wait, it IS Detroit....they could care less.... so 15 minutes late, but they didn't seem too pressed when we showed. The ambience was nice....high back fabric booths, tables and dim lighting. A bar with two tv's, and they do have a small \"patio\" area, but it's in front of the restaurant facing the Detroit Opera House. Had a waiter come and ask for our drink order, then a waitress stepped over and asked for our drinks.... then they had a spat in our vicinity over whose table it was. Kind of disappointed that she told me that they had Three olives vodka then returned to tell me they didn't have it. Still ordered a red bull and vodka. My signature.I like the whole tapas idea. The dishes come out in a stagger. My friend got her chicken caesar wrap when my chicken skewers arrived. Then my Broadway Baguettes came, and finally our orders of their hand-cut fries and homemade ketchup. The chicken skewers with Brazilian Piri Piri sauce were yummy!! I wasn't sure what kind of sauce it would be, but when it came, it was great- a red pepper tomato almost salsa-y...with a lemony kick and herbs. The Broadway baguettes were a great addition. Could have used a lil more Boursin cheese spread, but I still cleaned the plate! The homemade fries were the shit! The housemade ketchup seemed like a heinz 57 + honey + bbq sauce....but it worked for me! Nothing like a ending of chocolate chip banana cake and a forkful, or three, of their homemade cheesecake! Delicioso!!!Could have done without the man-group-date. Something just turns me off seeing out of the corner of my eye: 4 guys drinking fuzzy navels and all spooning the desserts. Only paid $2 to park in the DOH parking structure and not a far walk at all! Would return if the opportunity presented itself =)", "Date": "2009-04-05", "Author_Location": "Detroit, MI"}, {"Author": "Lizzie S.", "ReviewID": "r7doqqqqcTyWjTUD401AJQ", "Overall": "3.0", "Content": "Small Plates was rec'd to me by several people both before and during my trip. My travel husband and I swung by for lunch after a morning at the Detroit Institute for the Arts.  The interior is cute, earthy & casually almost elegant. And there was nothing wrong with the service.Travel husband liked/loved his food. A cup of chicken veg soup in a light broth and a giant Caesar salad...the salad is definitely enough for two. My sauteed shrimp were ok...but my chicken lettuce wraps were pretty mediocre.  Lots of free refills on sodas, which is a nice touch.I guess my main problem was the lunch menu. I didn't feel like there were a lot of options for me. Lots of pizzas & sandwiches, not my lunch go to food. I could be persuaded to hit it again at dinner to see their evening menu & explore their wine list.", "Date": "2010-08-18", "Author_Location": "Los Angeles, CA"}, {"Author": "Nickie P.", "ReviewID": "F8C4HMenjkENCGTSagiXBA", "Overall": "3.0", "Content": "I'm only giving Small Plates three stars right now, because the service was so slow. I had the burger, and I thought that it was well cooked and very juicy -- it took a long time to come out though, and the restaurant was practically empty! Not great for anyone on a work lunch break. The others with me ordered the Panko shrimp and the almond chicken. They didn't seem too impressed, and ate more rice than anything. We went there because they had a \"now\" Groupon, and I definitely appreciated the discount. I also bought their regular Groupon deal, so I will be going back and hopefully updating my review for the better. I hear they have a great chocolate chip ice cream sandwich, so maybe that will make the difference!", "Date": "2011-07-09", "Author_Location": "Franklin, MI"}, {"Author": "Tiffany D.", "ReviewID": "roYhnFgD-aasTwOjSSaB0Q", "Overall": "4.0", "Content": "I've never had a bad experience here.It's a great place for groups, everyone can just order a couple of everything and then pass everything around the table.  It's the most fun and you get to taste mostly everything on the menu.All of the pizza's are good, I especially love the 4 cheese one with the roasted garlic.  They are wood oven fired, so they taste very rustic and full of flavor.  I love the french fries too, with the garlic mayo for dipping.  The empanadas, the tenderloin are also favorites that we get.  Oh, and the desserts don't get much mention but - the Creme Brulee is ah-mazing.  And it's not even that small.", "Date": "2008-10-18", "Author_Location": "Detroit, MI"}, {"Author": "Charles B.", "ReviewID": "ldRNirl9ZK9RTamSdrA0Cw", "Overall": "2.0", "Content": "Food was pretty good but the service . . . I would avoid going back to avoid the very awkward service.  You can't blame one wayward server for this one, because they were all working together to upsell, bring the wrong dish, push dessert before the rest of our order had all been delivered, disappear when we had the check ready to pay, and, well, you get the idea.Also, $7 for a 14 oz beer?  I guess so, because I paid it, but sheesh.", "Date": "2013-04-19", "Author_Location": "West Bloomfield, MI"}, {"Author": "Kelly O.", "ReviewID": "0-0kA-AcFrEoq8FCofrYVQ", "Overall": "3.0", "Content": "Went here for the first time on Saturday.  It was ok.  I was really looking forward to it because I love tapas.  I think I expected to see a few more interesting selections on the menu, but most of it seemed pretty standard.  We had panko-breaded shrimp.  Those were good.  We also had the pretzel bun sliders which were a grease bomb and pretty flavorless considering they had caramelized onions and white cheddar on them.I think it's a little over priced for the quality of food being served.", "Date": "2012-08-01", "Author_Location": "Troy, MI"}, {"Author": "Misi P.", "ReviewID": "UfVr3gTY-5ZZfXwPcax60w", "Overall": "5.0", "Content": "Small Plates is the definitive restaurant for small plates.  The atmosphere is excellent, located in the Harmonie Park area, it's perfect for the hipster crowd needing something to do and munch on downtown in the D.  The food is scrumptious, but I'll admit I am not a fan of the fish tacos.  Everything else i ate here (beef and chicken dishes) were absolutely delicious.  Seating is pretty ample and the waitstaff is really nice.  The only thing that kind of sucks is the parking, but parking always sucks in Downtown Detroit.  Get over it.", "Date": "2006-04-28", "Author_Location": "Chicago, IL"}, {"Author": "Parisa K.", "ReviewID": "JvqKYurEDOVFyC_bmLHNXw", "Overall": "3.0", "Content": "I like Small Plates when I'm not looking to eat, but just to munch while having drinks with a few friends downtown.  (I admit I'm partial to Sangria for tapas.)  They have a good wine list, and the tapas make for good snacking.  I like the ones with shrimp, and I also like the hand-cut fries, which are tasty and inexpensive.It's also got a good ambiance.  The inside of Small Plates is pretty cool to look at (it's a long and narrow space), and the staff is very accommodating.  They also have some great desserts, which have nothing to do with the ambiance, but I love sweets :o)The drawbacks are that this place is small, so it can easily get crowded.  Further, the tapas (for the most part) don't come cheap.  It's worth it if you are looking more to pay for the dining experience than if you are just paying for a good meal.", "Date": "2008-07-11", "Author_Location": "Detroit, MI"}, {"Author": "John M.", "ReviewID": "OHp_OfEi-8RtxsAR4Qjuxw", "Overall": "4.0", "Content": "Small Plates is great.  New-American pseudo-asian bullsh-t tapas style small plates in the D, just a stone's throw from Harmonie Park.Seating recommendation - at the prep counter in the back or by the front windows. Avoid the chicken and you're straight. Full bar.", "Date": "2007-07-25", "Author_Location": "San Francisco, CA"}, {"Author": "Mac F.", "ReviewID": "dPb8BNh1Vibzf_mb3r7w4g", "Overall": "4.0", "Content": "On a Friday evening at about 10:30 after some movies at the DIA, friends and I opted to head downtown for a late dinner.  Thinking that getting into a restaurant in downtown Detroit on a night where there wasn't an athletic even going on would be easy-breezy, we arrived at Small Plates to find the place was packed.  We were seated at the bar and treated to an evening that included superior service and decor (I would have to say that the only design boo boo the proprietors made was to include TVs at the bar - unnecessary) and, at least from my vantage point, decent food.  I had the chorizo-gorgonzola pizza, and the only flaw I think it had was that there was a bit much gorgonzola cheese on it (which for me is saying a lot, as I'm a total cheese whore).  All in all, a nice joint well worth a visit.", "Date": "2013-02-18", "Author_Location": "Detroit, MI"}, {"Author": "L Lynn H.", "ReviewID": "SYEVDX81LMJIGccCyrdHFw", "Overall": "4.0", "Content": "It's a great spot before a game or concert. Love the patio seating and the new owners and menu rock! Proximity to so many venues make it great before or after an event. Shared the sweet potato fries (didn't care for the pure honey dip that much), calamari (awesome) and fish tacos. Will definitely be back.Jason is an awesome server that was able to recommend great menu items and drinks. When I didn't like the sweetness of a drink, he returned it no problem and suggested another that I absolutely loved. Very attentive and friendly, but quick enough to get us to the game on time without feeling rushed.", "Date": "2012-09-04", "Author_Location": "Dearborn, MI"}, {"Author": "Brian P.", "ReviewID": "TPa_LbQ-rRN3xIeX6sIvQw", "Overall": "4.0", "Content": "My girlfriend and I recently returned to Small Plates on a Friday evening in April, we were cautiously optimistic as we both love Detroit and Small Plates having reopened deserved a second chance. When we walked in the door the signs were already pointing in the right direction, the staff was buzzing around, guests were smiling enjoying cocktails and all in all it was already an improved experience from our last visit. We got seated right by the window, which was awesome because the Opera House across the street was aflutter with activity and made for great people watching. Our server was awesome, I believe his name was Jason, he steered us through his favorite menu items as well as the best sellers and made us aware of what was sold out so we weren't disappointed when we tried to order it. The Fried Green Tomatoes were delicious, crispy delicious crust with a fresh green tomato. Some places tend to over salt and over bread but the chef here did it right with just enough accents to really let the tomato shine. The Warm Bruschetta was also amazing, my girlfriend practically licked the plate! The Duck and Pork Empanada was tasty, perhaps a little too much crust to filling ratio BUT it was cooked very nicely and had a great flavor profile. We both agree that the Mac and Cheese was a highlight, but you must get it with the pancetta croutons! If you come in, which I really think you should, ask for a table by the window and a bottle of the white bordeaux (which is really well priced, other restaurants around sell the same for much more)---enjoy!", "Date": "2012-05-10", "Author_Location": "Oak Park, MI"}, {"Author": "Mari V.", "ReviewID": "0jltjmhhMdnpcpMNf970_Q", "Overall": "1.0", "Content": "I was at small plates when I went to NAIAS earlier this year. Horrible service! Downright rude. Our first waiter sat us and as soon as we ordered water and not drinks he pawned us off on some other waiter to take a bigger table (aka bigger tip!) We ordered the fries with all the different kinds of dip (those were delicious) but then I had the fish tacos. The fish was burnt! Not just a bit charred and on some pieces, the entire fish part of the taco was black! The waiter came back to check on us, well, he didn't really. He only came back to fill our water and give us the check. He saw the fish, and didn't do anything! Didn't ask us how our food was ONCE.  It seems to me that they have changed ownership after I went so please consider that my experience was not that of the new ownership. From other yelpers, it seems the change was for the better and I am willing to give Small Plates a chance next time I'm in town.", "Date": "2012-05-30", "Author_Location": "La Mirada, CA"}, {"Author": "Bob N.", "ReviewID": "ZpUTbSc6fGMJN2I_wSPiXg", "Overall": "3.0", "Content": "Went for lunch today and hmmm. I want to give it 5 stars, even 4 but. I ordered a Arnold Palmer after being seated, very refreshing and a good tea blend, things were looking up. For lunch i ordered the Seared Ahi Tuna with a mango salsa. Tuna was fresh and properly seasoned and wonderfully delish. However, a piece of tuna the size of a sugar packet (I measured) and sliced into five bits is uhmmmm a bite. I realize it's Tapas place  and small portions but jeez.", "Date": "2012-05-11", "Author_Location": "St Clair Shores, MI"}, {"Author": "Michelle S.", "ReviewID": "8g-PyKxO9ATbSOnFdIVJbA", "Overall": "2.0", "Content": "i was going back and forth between 2 and 3 stars, i would probably give 2.5 stars.we were seeing Phantom at the Detroit Opera House right across the street and were planning on eating here. the inside was full so instead of waiting for a table we chose to sit on the patio. unfortunately it was pretty cold. our table was wobbly which was annoying, we were told 'it will be fine' which it was not, our glasses were almost spilling any time we touched the table. so we asked for some napkins to fix it, we had to fix it ourselves. my water glass had lipstick on it, a huge pet peeve of mine and you would think i place that is supposed to be semi-nice would pay closer attention to details.we all order sangria. $8 i believe, they don't have carafe's. it tasted like vodka and the fruit didn't seem too fresh. i also found a fruit fly in mine and later on so did my husband. i never finished my drink. the straw i was given was very small and fruit kept getting stuck in it which was pretty annoying. our waiter was pretty aloof and we had to flag him down multiple times for service. the food is a bit pricey for what it is, a few pieces of bruschetta should not be $8. here's what we ordered:chop chop salad $9 - this salad was huge and full of good stuff. 4 people ate it and there was still some left over. garlic shrimp $9- the shrimp was pretty good and the sauce was good on bread tooscallops $17- pretty expensive but they were good. broadway baguette (bruschetta) $8- it was ok, but my bruschetta is way better. fish tacos $13- 3 tacos. they were just ok, way too expensive and i have had cheaper and better elsewheresherry mushrooms $8- meh, pretty bland but my mother-in-law liked them. the food and service were pretty hit or miss. maybe it would have been better if there wasn't a show at the Opera House. also, the table we were at was very small for so many plates. i might try it again, but not for awhile. and i will want to sit inside next time as well.", "Date": "2009-10-18", "Author_Location": "Auburn Hills, MI"}, {"Author": "Rhonda L.", "ReviewID": "AQD-XVeIpGSUw6XtbFG9FQ", "Overall": "5.0", "Content": "Food was great.  Plates were small though.  I think the lesser reviews were under the old management.  It really was a wonderful brunch and the staff could not have been more accomodating.", "Date": "2013-02-18", "Author_Location": "Southfield, MI"}, {"Author": "Megan P.", "ReviewID": "JPYn4yb5WLSVIVbuLrsZMQ", "Overall": "4.0", "Content": "We went to Small Plates last night for dinner before a show at Music Hall. I was prepared for sticker shock based on the other reviews, but was pleasantly surprised by the amount and variety of food and beverages our group was able to enjoy at a reasonable price. I do think it was helpful that a) we had a group of 4 and b) we each picked a few different items and finally c)we shared everything. That meant I got to try 7 dishes and was plenty full by the time I left. We also had a bottle of wine (that only 3/4 people drank, the other had a few beers), and 3 after dinner cocktails. Total was about $80/ couple, which for the deliciousness, variety of food AND drinks seems perfect to me. In addition, I loved every dish we ordered. I usually avoid lamb chops at restaurants because they are often either two small or over-cooked (or both!), and our lamb chops with risotto were great. We also had fried green tomatoes, beef tenderloin bruschetta, lotus flower tuna, Crispy Calamari Peppernata, dragon shrimp, and portabella & eggplant sliders. To top it all off, the service was excellent and we had plenty of time to enjoy our dinner while having plenty of time to make it to the show.", "Date": "2013-10-09", "Author_Location": "Dearborn, MI"}, {"Author": "Sally B.", "ReviewID": "NFFekn_N1rUBGYqUicE6JA", "Overall": "2.0", "Content": "It pains me to throw a Detroit restaurant under the bus... .but... Last time I was at Small Plates was about 8 years ago.  It was excellent.  Tonight, not so much.  The Caesar salad seemed not to have any anchovies, therefore it was mostly flavorless.  The special house fries were quite tasty but the 'housemade' ketchup... ?? It seemed to be a combination of Heinz 57 and some not-so-tasty bbq sauce.  The panko shrimp and the veggie spring rolls could have been from Gordon Food Service... mediocre at best.  There was one waiter and the bartender; the service was slloo-ooww.  It was just not special and it's going to be hard for me to want to go back anytime in the NEXT 8 years.  Sorry.", "Date": "2011-03-02", "Author_Location": "Detroit, MI"}, {"Author": "Elsbeth S.", "ReviewID": "PtTe8QFY-5j1Ju_XOUkzTg", "Overall": "4.0", "Content": "Went to this place one night after a long day at work.  The bar was a great place to sit and people watch. The different food choices were great.  Had the new item chicken and waffles!  Who doesn't like some fried food and buttery waffles?  It was better than I expected and definitely made a fan out of me!", "Date": "2013-04-07", "Author_Location": "Downtown Detroit, Detroit, MI"}, {"Author": "Jonathon J.", "ReviewID": "GIh-mTJFlDT0JdGuzXk33w", "Overall": "4.0", "Content": "Excellent food, atmosphere and staff.  If you go, be sure to chat with the owner about his excellent knowledge of wines and if Ricao the bartender is working, copy down the ingredients for a Tea de Rico.", "Date": "2006-07-10", "Author_Location": "Foster City, CA"}, {"Author": "Nada O.", "ReviewID": "D52bwfvOczoqTWJeSUEZLQ", "Overall": "2.0", "Content": "Every time I've eaten at Small Plates, it's been something of a disaster. And I mean what-the-hell-is-going-on-here kind of disaster. Let me explain. I mainly have two problems with Small Plates. 1.) The service is spotty. 2.) The food can be ehh.      Let's start with number one. The last few times I've dined at Small Plates, the service was hit or miss. One night out the service was great- servers paying attention, no hovering, (I can't stand hovering) etc etc. However,  the next time, the service was horrible. I think it's a bit ridiculous if I have to ask four times for a water. Just sayin'.      Issue number two:  The food. Just like the service the food is hit or miss. The last time I was at Small Plates I payed $12 for three pieces of stale bread, 2 strawberries, a handful of grapes and two wedges of cheese.  However, the time before that, I ordered their  Roasted Veggie Pizza and the Chop-Chop salad and both were ridiculously delicious.      What do I actually like about Small Plates? The portions are perfect and the location is great. Would I go back? Probably. Just not anytime soon.", "Date": "2009-08-25", "Author_Location": "Warren, MI"}, {"Author": "Cyndi J.", "ReviewID": "e-dDHUo8ooZ6VO27AX8ryg", "Overall": "3.0", "Content": "It was hot, no AC. Food was great and beer was cold. Service was kinda slow but our server was very nice and accommodating. The fries with all dipping options was my fave!! We were kind of all packed in the place. I literally bumped elbows with the table next to me.", "Date": "2011-07-24", "Author_Location": "Beverly Hills, MI"}, {"Author": "Jonathan S.", "ReviewID": "4NEdYuqlQ5TfMghTvU9m8w", "Overall": "3.0", "Content": "This is a cute place in a great location downtown. Great place to go with a date before going to the Opera House, bars/clubs on Woodward, or a Tigers/Wings game. I just wish there were more places like this downtown.", "Date": "2009-10-21", "Author_Location": "Washington, DC"}, {"Author": "Chelsea M.", "ReviewID": "7X62e8b_6vssqX37VCaE9Q", "Overall": "4.0", "Content": "My boyfriend and I went there before and after the Wicked musical showing at the DOH across the street and had a good time. Be sure to make reservations ahead of time. If that isn't possible use call ahead because the wait when we were there was well over an hour. The service was ok but the food was delicious. The grapefruit martini I had wasn't the best so I would avoid that but the cheese and mushroom pizza was amazing.   We will be returning soon.", "Date": "2008-12-27", "Author_Location": "MI, MI"}, {"Author": "Rebecca O.", "ReviewID": "lJtixMnV_f8YrJhLXgN2YQ", "Overall": "5.0", "Content": "Small Plates is such a fun little place.  they're prices are really reasonable.  the food is phenomenal.  and the service is usually spot on!  i've been in here before a show, after a Tigers game, before boozin' it up on a Saturday night, and we came here with a small group of girls for a pre-dancing bachelorette party dinner.  everytime everything was great.  so get in there, order a bunch of different dishes, and share them amoung the table.  you can't go wrong!!!", "Date": "2008-01-15", "Author_Location": "Warren, MI"}, {"Author": "Tina B.", "ReviewID": "L-xw8ul7YhDcWiOWUH77yQ", "Overall": "4.0", "Content": "Very small place.  The servers were very nice and attentive.  I ordered the scallops which came with a small portion of linguine.  The scallops were excellent while the pasta was bland.  Hubby ordered the eggplant sandwich which was really good.  The cheesecake is made on site and was pretty good.  Prices were not bad.  We may go again after the game tomorrow if we don't find anything else to try out.", "Date": "2010-08-07", "Author_Location": "Syracuse, NY"}, {"Author": "Jason C.", "ReviewID": "tyohoEOOrmJJgTchgo_0nQ", "Overall": "2.0", "Content": "Bad awkward service and mediocre food.  Disappointed.", "Date": "2013-01-20", "Author_Location": "Birmingham, MI"}, {"Author": "Doug C.", "ReviewID": "sJA1mQ-7nbPMzeGexrdH9A", "Overall": "5.0", "Content": "We went to the Grand Reopening party at Small Plates last week and I have to say that everything I tried was incredible.  The fish tacos were outstanding and one of the larger portions on the menu - 3 full legit tacos with great flavors.  The scallops were melt-in-your-mouth good and the pretzel sliders were great.  I tried a little eggplant/veggie sandwich as well and that was also great.  I'm telling you EVERYTHING was outstanding that I tasted.  As good as all the savory selections were though, I have to say it was the desserts that absolutely blew me away.  The Key Lime Pie was amazing - for me that's a big deal because I'm always sure to get Blonde Giraffe Key Lime Pie when I'm in Miami or Key West and I'm a big fan of real deal legit Key Lime Pie - and this was real deal legit Key Lime Pie.  Also I tried something called butterscotch pots du creme - which I declared a threat to national security it was so good.....  Whatever they've done there, new ownership etc. - it's amazing and I am looking forward to getting back there.  Great decor and atmosphere too!", "Date": "2012-04-30", "Author_Location": "Orchard Lake Village, MI"}, {"Author": "Cherice J.", "ReviewID": "iZ5oDiOx8XFjDUR-c1fu2g", "Overall": "4.0", "Content": "Small Plates is a super narrow place downtown, but it is a nice environment. I just gave a surprise bday party for a friend there a few nights ago, and the customer service was really nice and patient with us...which is kind of rare on a Saturday night. My group pretty much ate everything on the menu. I had the BBQ Chicken Pizza, which was very good. It a good portion. My friends had the BBQ Ribs, Mussels, and Hummus. The prices are conservative, paying roughly $12 for a meal. They have a good wine list too. Because this place is small, I would suggest making reservations for sure!", "Date": "2008-06-30", "Author_Location": "Detroit, MI"}, {"Author": "Amy D.", "ReviewID": "w2R4ipmpOT8JtwDx63at1Q", "Overall": "3.0", "Content": "We had just finished seeing Chelsea Handler at The Fox theatre, so we were looking for a place to have a night cap.  We walked by Small Plates on the way to our hotel and it looked really nice.  They do have a patio, but it was a little chilly by the time we were there.  We both ordered a martini and they are $9 each.  We tried the SP Cosmo and the lemon drop.  I know people want they moneys worth, but it was like sipping a shot, it tasted like straight alcohol, they needed more cranberry juice or citrus.  Along with the drinks we split a garlic shrimp pizza, it was perfect for sharing.  The shrimp were huge and the crust was nice and crisp.  I would go back for their food, but probably not for the drinks.", "Date": "2010-04-05", "Author_Location": "Guelph, Canada"}, {"Author": "Duke A.", "ReviewID": "iFQDrherbM8Ovqf1Ar6fMQ", "Overall": "5.0", "Content": "At Small Plates, you get to enjoy and share multiple tapa dishes with your friends. It makes you feel like you are sampling food at an Iron Shef shooting. Great ambience and superb service too.", "Date": "2007-03-24", "Author_Location": "Detroit, MI"}, {"Author": "S F.", "ReviewID": "1YkngG8rDqHpB3cgV9uOPQ", "Overall": "2.0", "Content": "My bf and I received a gift card as a present to try the place.  I was excited to try it as I love to dine this way - tapas/appetizers/small plates - basically a bit of everything. I ordered the crab cakes and was extremely disappointed to get tiny (1/2 dollar sized) portions of shriveled, dry, fishy tasting pucks.  We also ordered the beef tenderloin and this was way overcooked and lacking in flavor.Our fries were served with the \"house\" ketchup which tasted like sweet barbecue sauce and we were scoffed at when we requested the good ol' REAL trusty condiment.Don't get me wrong, I'm one to plunk down tons of money for a well-cooked meal, and portions size really wasn't the issue here as some other posters have mentioned, but I'd rather eat at a dive bar with superior food than a trendy looking place with mediocre or subpar food.", "Date": "2010-08-17", "Author_Location": "Wyandotte, MI"}, {"Author": "Matt M.", "ReviewID": "a2wveYUpLDsdFBpu1nwUOA", "Overall": "2.0", "Content": "Bad experience for me though it was beautiful and comfortable setting. The Host took a while to greet and seat us. Once seated the waitress was prompt to greet and friendly but immediately became very slow. Sherry mushrooms were good but my petite fillet was ordered medium and delivered rare. Cold in the middle rare. It took ten long minutes for her to follow up. I had cut the steak in 3 pieces. It was returned to me in 3 pieces and was well done. My party was charged for a plate and a drink that never came. It then took an even longer time to get the correct bill. Nothing on the menu was creative. I coul've cooked a better meal myself. Overall it was just a bad experience.", "Date": "2011-04-18", "Author_Location": "Ferndale, MI"}, {"Author": "Matthew M.", "ReviewID": "2ydmp7PIEGMewZiMx5fNmg", "Overall": "3.0", "Content": "Parking was not really an issue...we went on a non Tigers game night. Waitstaff and bartender very friendly....they had plenty of recommendations. Drinks were good. Since we hadn't been in a while we ordered several items. Pretzel burgers were good, fish tacos excellent. Wedge salad needed a little something. Calamari was over salted. Cornbread was good; not the sweet variety. Tried the hot dogs. If you've ever had a real Detroit coney you will be disappointed. Finished up with the bread pudding which was good.All things considered, the atmosphere was good. The drinks were good. The food was good and had a great variety. We will def be back and would recommend to others.", "Date": "2012-10-15", "Author_Location": "Berkley, MI"}, {"Author": "Lauren C.", "ReviewID": "ILESJ2PwURGAmXFJsLTNKA", "Overall": "4.0", "Content": "Let me tell you something - I used to ignore this place.  It was not good the first time I went there.  But that was in 2009 or something.  They recently renovated and I believe changed some chefs/cooks.  Now, it's GREAT.  I have been there a couple of times in the past 6 months.  Everything I have tried tastes good.  Some things to try: pretzel sliders, calamari, fish tacos, BBQ chicken pizza.  And some customers leave poor reviews because they have unreasonable expectations. Don't forget the model of this place.  It's small plates, people.  I most recently solicited last week, and this was my third stop before I settled on where to eat.  I live in Detroit, and other restaurants were either closed early, or had crap service (DBC...). Small plates was open and happy to serve!  Thanks so much!", "Date": "2012-11-19", "Author_Location": "Detroit, MI"}, {"Author": "jerry p.", "ReviewID": "Y6jehSni9f02hVBWIfBItQ", "Overall": "5.0", "Content": "Small Plates was one of the first to start the upswing in Downtown Detroit dining. We have always had the Rattlesnake as far as great modern food, but Detroit needed more cool restaurants. I knew Chef Arron True when he worked at Shiro in Novi (another stellar restaurant)  He was always putting out amazing things from that kitchen.  I think that is why the Panko Shrimp and other Asian influences are so prevalent. I personally like the tenderloin, but there are usually some don't miss specials. Small Plates was just what Detroit needed at the time. A hip but upscale place where you could eat amazing things and hang out -- the bartenders here always make you feel welcome.", "Date": "2006-12-10", "Author_Location": "West Bloomfield, MI"}, {"Author": "Robert Z.", "ReviewID": "VksqSXprPUOG77521Xj3kg", "Overall": "4.0", "Content": "The food was pretty good...the service was fantastic. The only issue was that the vslue was underwhelming.", "Date": "2012-12-09", "Author_Location": "Chicago, IL"}, {"Author": "Erin H.", "ReviewID": "nagPlOeAbahYUPIRko-lng", "Overall": "4.0", "Content": "I love the vibe in the place - high end and comfy at the same time.  A great locale in Detroit and perfect when eating with a group of adventurous eaters - always better to do tapas with people who will try everything.  Everything we got here was tops.  Check it out!", "Date": "2008-04-27", "Author_Location": "Ann Arbor, MI"}, {"Author": "Jessica M.", "ReviewID": "1xTlTkmzhdxbFvH8cqEskg", "Overall": "3.0", "Content": "I came here again with a large party before a show at the Opera House. We were not well prepared and had to wait for all 9 of us to be seated. We almost missed the show.  It was not Small Plate's fault. They had tables set up for another large party seeing the same show. They lingered, enjoying their drinks, causally talking and laughing while the 9 of us stood in their incredibly small host area for about an hour. The bar was packed, as was every tableThe staff of Small Plates made it great for us. They gave us a few small 4 cheese pizzas on the house while we were waiting. They made sure to have our order in before the other party left so we could eat immediately and get into the show. They gave us extra plates, too once we were seated. The manager was doing his absolute best to make sure we were taken care of. The bills were even ready as our food came out so we could eat while the waiter processed our payments. I was extremely impressed at the level of service. I am sure they are aware of the sometimes discriminating crowd before shows at the Opera House. The food was good, although we had to rush rush rush. We ended up in the seats with literally 30 seconds to spare before the show started. Kudos, Small Plates we couldn't have asked for a more on-point example of top-notch service. I will try again and hopefully have great things to say about the food!", "Date": "2012-03-04", "Author_Location": "Harrison Township, MI"}, {"Author": "julie a.", "ReviewID": "xN1kHGAJZyeUU6mNtI1KSQ", "Overall": "1.0", "Content": "Small Plates in downtown Detroit is TER-RI-BLE unless you like bland,poorly prepared food. I heard about this place 3 years ago and made a reservation as soon as I came back to Detroit only to find out there are  new owners that changed everything but the name. Yuck. Last time I tasted food this bad I was in the hospital.  Apparently the \"chef\" sent all his guys in the kitchen home that saturday night to save money.Guess they took any semblance of flavour with them! The coffee shop next door is 10x better.", "Date": "2012-09-15", "Author_Location": "Los Angeles, CA"}, {"Author": "Kristina A.", "ReviewID": "E7owJ_wB3CmOQelEjDXCug", "Overall": "4.0", "Content": "SOOO good. Pick and choose tapas with friends and everyone can have a little of everything. The location is so great across from the Detroit Opera House so if you go before a show you see some fancy outfits and the place is packed. On an off day it can be completely empty though. Spring rolls, homemade fries and ceasar salad is what I crave. The presentation always feels modern and upscale.", "Date": "2010-11-21", "Author_Location": "Grosse Pointe, MI"}, {"Author": "Tyra N.", "ReviewID": "-TbXq9iDI206-Qfh_nl-ag", "Overall": "2.0", "Content": "My ahi tuna was fresh and tasteful. My drink with bourbon was great too. My date was disappointed with the capresse salad and the Caesar salad which was nothing like the one served by previous owners. The menu was more average American than speciality. They had a lot of regular food with a twist. They tried too hard. No more cheese platter! This disappoints me. The reason I brought my guy here was for the famous Caesar salad that many people could eat but their version with one whole romain heart cut in half, slivers of parmesan, drops of dressing, some sautéed onions and a single anchovy was over the top. Just serve a damn salad. Also it was on a small plate, not a bowl which is awkward for eating lettuce. Their chipotle sauce was lacking too, just mayo and something else added. We were offered no water and had to ask for flat wear. The wait staff congregated to complain at the bar and of course the most annoying was some typical black chick. I'm so over this place. This was my spot for a long time but I'd rather venture to Angelina's for fine dining or the brewery next door for American food. This will be closed... soon.", "Date": "2013-06-29", "Author_Location": "Midtown, Detroit, MI"}, {"Author": "Jeffrey C.", "ReviewID": "sWQnBRBj8zARPa78Ljn_9A", "Overall": "2.0", "Content": "Other than being right across from the stadiums and the opera house small plates has very little to offer. The service was dismal, and the food was entirely forgettable. My original drink could not be made because they were out of the requisite ingredients which in itself if forgivable but then the one ordered to replace this was not brought until after the food was served. On that note our food for a table of four was brought out at three separate times. I would hate to have someone tell me I had to go back here again.", "Date": "2011-06-19", "Author_Location": "Philadelphia, PA"}, {"Author": "Vidhi B.", "ReviewID": "WzAKefLrBdpdenk78LUEfg", "Overall": "3.0", "Content": "I took my brother here for a quick dinner before a Friday night Tigers game, having been here for a weekday lunch prior. So disappointed. The hostess was a space cadet - had no idea what was going on. Seated us at the kitchen bar (which was great and we loved it), but made it seem like it was a horrible place to sit. Sat down and waited 10 MINUTES, to be greeted and even then, I had to go to the hostess and tell her we hadn't been greeted. No apology, no nothing. Automatically put a sour taste in my mouth. I get that it was a busy night, but to be fair, there was no wait and it's a block from Comerica, they should be used to busy nights and how to accommodate their customers. The only saving grace was their food which I love. Plates are definitely small (especially their pizzas), but it's quality food. I've been to restaurants with better small plate options with much better service so I'm not sure I would go back.", "Date": "2013-05-30", "Author_Location": "Detroit, MI"}, {"Author": "adam J.", "ReviewID": "xcBzYeh4krCod0JqdPTdCg", "Overall": "3.0", "Content": "I have been going to this place since 2005. Usually a couple times a year.  Went recently at the beginning of November. They did not have one dish and one drink (weird?) that we wanted but otherwise a decent meal. We had the Groupon so that was nice. A couple things though.1. They need a new menu. Last updated one that I can remember was at least 3 years ago. Maybe I missed something. A place like this should have a new menu every season! I mean for a place that is on the edge I would think the first thing you would do is save the classics and get some new stuff on the menu!!2. This place has lost an intangible something. The charm isn't there anymore. They have that big paper sign hanging in the window like some Hall Rd. chain restaurant. The staff, while nice and attentive, when we went just lacked that original classic character when I first started going to Small Plates. They too seemed to be imported from a Texas Roadhouse or something. (No offense to those servers there, they work hard, but the servers that used to be at Small Plate's definitely dolled out the feel goods and warm and fuzzys.)This place can comeback to it's original glory but it needs to reinvent itself a bit. Not too high on my recommendation list as I don't think it can blow people away like it used to, but me and my wife will still go if only for sentimental and nostalgia reasons. Plus like I said, the food is still good but it's just different now.", "Date": "2011-11-25", "Author_Location": "Berkley, MI"}, {"Author": "Brian A.", "ReviewID": "XOfQ7IELvWmV5ZA9zFolJg", "Overall": "5.0", "Content": "Our first time here, read some bad reviews,but under new ownership and did not disappoint . Great food,service and atmosphere. Went prior to Tigers game and left full and happy !", "Date": "2012-04-08", "Author_Location": "Detroit, MI"}, {"Author": "Craig M.", "ReviewID": "QhosZcr3cdbrH7GJTBWKqQ", "Overall": "4.0", "Content": "I liked small plates, the food was good as was the wine.  It was a nice place to go after a Tiger game, very casual and no need to be dressed up.  Don't know if I would make it a destination restaurant, but while downtown it's a good place to stop by.", "Date": "2012-07-12", "Author_Location": "Canton, MI"}, {"Author": "Julia Y.", "ReviewID": "GKzK5MZYz20_pdG-TuF3AA", "Overall": "1.0", "Content": "MAC! I feel betrayed!! We were with you that night and thought the food was terrible! I ordered the margherita pizza and my partner had the calamari--and if there was any distinguishable feature of either of them, it was the distinct tastelessness of frozen, processed food thrown in a microwave! We also tried the fried green tomatoes and a few other dishes and were not pleased. bottom line: way too expensive for what tastes like TV dinners.", "Date": "2013-03-02", "Author_Location": "Detroit, MI"}, {"Author": "Ryan S.", "ReviewID": "mNtOv0tfWrtA9y0JRMiBnA", "Overall": "1.0", "Content": "Being that it was our first time there, we asked the waiter for recommendations. He coincidentally recommended the two most expensive things on the menu. We ordered a bunch of stuff, and the shrimp was really, really, overcooked - like rubber. We sent it back (I have literally NEVER in my entire life sent food back, it was that bad). It returned later just as overcooked with no apologies or explanations. Service was slow and uninterested as well. Never, ever again. Plus, no draft beer. Fairly small selection of bottled beer.  Other than that, great.", "Date": "2009-10-03", "Author_Location": "Commerce Charter Township, MI"}, {"Author": "C G.", "ReviewID": "avLqFWuTEUtg9wXTPady4A", "Overall": "4.0", "Content": "We had the Groupon (paid $20 for $40 worth of food), and we were up front about it in the beginning so there were no surprises.  It was Sat night at around 8 pm, and the place was full.  We had good timing and were seated right away because some other tables left.  The service was not good.  At all.  It took several minutes before we were greeted and put in a drink/appetizer order.  Then, the appetizer came out before our drinks, and we had no silverware/napkins.  When our drinks finally came, we told our server that we still had no silverware & when he came back with the next appetizer he STILL had not gotten us silverware.  But, we were in no hurry.  And, the food was good.  We had the Asian lettuce wraps and baguettes with goat cheese.  Both were great.  I would skip the Caesar salad next time (generous portions for the full size-more than 4 people need and some was left) and go for the Maurice.  We got the cut fries and chicken BBQ pizza.  Both were yummy!  When it came time for the bill, the waiter was fine with the Groupon (despite seeing previous reviews below), so don't let that deter you.  But if you come, be prepared for poor service (others were right that it looked like only 2-3 servers in the whole restaurant), and take your time to enjoy it!  The Groupon deal made this experience a real win for us!", "Date": "2011-03-27", "Author_Location": "Detroit, MI"}, {"Author": "Laura C.", "ReviewID": "vggw11oYewPpLbyYsWXwCA", "Overall": "1.0", "Content": "Not my kind of place.  Overly priced and not very fresh, though they claim they are fresh.  Just not good.", "Date": "2011-05-21", "Author_Location": "Atlanta, GA"}, {"Author": "Kristen M.", "ReviewID": "r_aCIxfUgEuTSdk54Bzz0Q", "Overall": "2.0", "Content": "Over the past 8 years or so I have been to Small Plates about 5 times and pretty good. Went there a few weeks back before the opera--disappointing. I ordered portabella mushroom and zucchini sliders they were bland and the buns really really big and cold.  The ceasar salad was good. Our check for 2 people was $65 and we were not very satisfied. Also, we were sitting at the pizza bar in back and the pizza cook told us it was his first night working there and didn't look like he had any idea what he was doing.", "Date": "2013-05-08", "Author_Location": "Grosse Pointe, MI"}, {"Author": "Chris M.", "ReviewID": "2LqepSbEYEwYiCs3kAJ2zg", "Overall": "1.0", "Content": "Dissapointingly dumbed down menu - from when they first opened. Friendly but generally below average service. Over-priced for what you get. Really wanted to like it - want to support downtown restaurants but sorry to say, we won't be back. Will stop reccomending it to friends.", "Date": "2011-01-14", "Author_Location": "Birmingham, MI"}, {"Author": "Stephanie R.", "ReviewID": "cd4P_dzc8kx2Th2THzLVaw", "Overall": "5.0", "Content": "Food was amazing! Service great! 1st time experiencing tapas style and I'd come here again for sure!!!!", "Date": "2013-01-05", "Author_Location": "Farmington, MI"}, {"Author": "Caryn W.", "ReviewID": "aSbz4vVn-w48WSzGmjZCrw", "Overall": "4.0", "Content": "I went to Small Plates last night in a group of 9 before seeing a show at The Detroit Opera House. I had never been there and didn't really know what to expect. We had a few questions for our server and she was very helpful in explaining portion sizes and that most people order 1.5-2 plates.  A friend and I split 3 plates. The fish tacos were amazing, and I am not even a huge fan of most fish. The fish was cooked and seasoned perfectly and was so light and flaky. The salsa was delicious and the lime sour cream was a great addition.  We also got the pretzel sliders (minus onion).. They were good, I think the onions would have made it better but my friend doesnt like them. The meat didnt really seem seasoned, but it wasnt bad, just pretty good.  We also got the mac & cheese.  This was also pretty good, the pepperjack cheese in it adds a little spice which helped. I also tried their fries which were just standard fries but the chipotle aioli dipping sauce was really good.  Overall, I really enjoyed this place and will definitely go back for a second try.  Again, I was surprised that I enjoyed the fish tacos so much considering I rarely eat any kind of fish.", "Date": "2012-12-29", "Author_Location": "Sterling Heights, MI"}, {"Author": "Barry S.", "ReviewID": "apB-hIzjbdJZkejDDhXzlg", "Overall": "5.0", "Content": "Tapas!  Very impressed, Great Service, and even better food!  We went here yesterday for a business meeting, sat on the patio, and had some fun.  Crab cakes, Fries, Shrimp, Filet, Salad, and a few Arnold Palmers.  They can hang with the best.", "Date": "2010-05-26", "Author_Location": "New Hudson, MI"}, {"Author": "Brian M.", "ReviewID": "Ujx5dWOt--v-Qi68JOur5A", "Overall": "4.0", "Content": "grabbed a quick pizza here before heading to the jazz cafe at music hall. fast, friendly service. good pizza.", "Date": "2010-05-13", "Author_Location": "Detroit, MI"}, {"Author": "Marty W.", "ReviewID": "bBwRNoBBBu4jvsYUIYfuCQ", "Overall": "5.0", "Content": "I love Small Plates! This is easily one of my favorite restaurants in the city. The food is always amazing (the BBQ pork sliders, crab cakes, and calamari are great) and it comes promptly. Their specialty drinks (like the Gorilla Milk) are pretty damn good too. The staff is always really nice, so the service is on-point as well. It's decently priced and I always feel good about the portion sizes. It's enough to fill you right up, yet you don't get the feeling that you're under-eating either. A very deserving 5 stars!", "Date": "2012-10-01", "Author_Location": "Chicago, IL"}, {"Author": "Annemarie F.", "ReviewID": "pTlF1YKDX0iPLtYKGMqVTw", "Overall": "1.0", "Content": "While the atmosphere is pleasant, the service is mediocre and the food is horrible.  The almond chicken was way too sweet, the lettuce wraps had absolutely no flavor, and the panko shrimp had been left in the deep fryer for too long (besides being topped with a mayo-something that was so heavy I had to scrape most of it off  with my spoon).  With just 3 small plates and 2 drinks our bill was over $60.  And I left hungry!  It was one of the most unenjoyable and overpriced meals I have had in a restaurant in a long time.  I wish I had gone next door and had a burger at Detroit Beer Company.  I suggest you do the same.", "Date": "2008-05-09", "Author_Location": "Ferndale, MI"}, {"Author": "Steve L.", "ReviewID": "FQydSxfXf1dRIXyEh61rmQ", "Overall": "1.0", "Content": "Had dinner b4 the McCartney concert - service was terrible, food was overpriced, no air conditioning.......", "Date": "2011-08-01", "Author_Location": "Jackson, MI"}, {"Author": "Neil T.", "ReviewID": "3t6aoSLk63CWt5pJv2Cwqw", "Overall": "3.0", "Content": "Solid place, especially for the theatre crowd. Eric is a great bartender.  A little pricey but nice.", "Date": "2011-12-23", "Author_Location": "Ann Arbor, MI"}, {"Author": "John D.", "ReviewID": "1Vi61UirmUQtHkbVxkLDUw", "Overall": "5.0", "Content": "Was at Small Plates recently since it changed ownership. Mac & Four Cheese, Pretzel Sliders and Ahi Tuni are incredible. Service was excellent. Can't wait to go back.", "Date": "2012-04-27", "Author_Location": "MERION STA, PA"}, {"Author": "Unknown", "ReviewID": "XSMndqc1Kx4dlTkep95CgA", "Overall": "4.0", "Content": "Fantastic food. Offers a wide variety of dishes and quite a few vegetarian options. Best to be shared with friends. The Empanadas are probably the greatest, in my opinion. The atmosphere is quite nice both inside the restaurant and outside.", "Date": "2008-03-31", "Author_Location": "Detroit, MI"}], "RestaurantInfo": {"RestaurantID": "5jo6ACfHYcOMIwZBRu_BnA", "Name": "Small Plates", "Price": "$$", "RestaurantURL": "/biz/small-plates-detroit", "Longitude": " -83.04871368408200", "Address": "1521 Broadway StDetroit, MI 48226", "Latitude": " 42.335784912109403", "ImgURL": "//s3-media1.fl.yelpcdn.com/bphoto/eOc6h7CpQp-U8NI2rQofXQ/90s.jpg"}}