{"Reviews": [{"Author": "Patricia W.", "ReviewID": "x5QetVO5e8dyQWRvcCpM2g", "Overall": "4.0", "Content": "We loved it! I went with 2 family members, celebrating birthdays, and we just wanted something different and cozy. My husband remembered eating there once long before with folks from his work. It was a week day, just after they opened, on a cold night.  They had all their heaters on, trying to warm up the place. (took off 1 star because the restaurant was not adequately warmed up prior to opening for dinner service.)  Between the 3 of us we ordered 15 small plates, including desserts! Loved the codfish bites, the sausages, the fig ice cream, too. And enjoyed every single one of them, sharing bites with each other. And the sangria was delicious. We thought the service was appropriate and attentive to us. It is definitely a restaurant we will go back to, sooner than later.  And one I am now recommending to everyone I know. Loved it!", "Date": "2014-03-06", "Author_Location": "Tacoma, WA"}, {"Author": "K H.", "ReviewID": "i2EazW3GC0GOdY3fjA0jxg", "Overall": "3.0", "Content": "I have to put in an update because the last time my husband and I were here in spring, 2014, the quality seemed to have gone down, which really disappointed me. The menus are at this point kind of dirty and a few have liquid paper on them. The owners, who I like very much, need to really get clean, nice new menus. The lighting is still bright, the chairs are kind of funky and don't fit the tables so well. There's little to no music so you can hear everyone's conversation too well.Having said that, the food was still delicious. The Basque sausage is always a favorite. I just wish they would make this place more updated and dimly romantic like La Vita E Bella in Belltown or Luc in Madison Valley.", "Date": "2014-04-22", "Author_Location": "Seattle, WA"}, {"Author": "Aileen H.", "ReviewID": "6c0NPKrhsJ0CG1JkS6jyaQ", "Overall": "1.0", "Content": "This place had by far the WORST service I've ever had. It took them 30mins to take our order. Then we had to wait an hour for our food. The paella has to be 2 servings but it's not even big. It's legit $41 for a mini pizza sized paella. The \"filet minion\" was like... A small piece of beef on a huge piece of salty bread. No one refills your water even if you ask. Bad food, bad service, bad price.", "Date": "2014-02-14", "Author_Location": "Greenwood, Seattle, WA"}, {"Author": "Yoyo M.", "ReviewID": "qktsK8MMV_be2zdgnlyiHQ", "Overall": "1.0", "Content": "Maybe I'm too much of a critic having lived in Barcelona as a student the past year but this place really did not impress me. I felt like I had cooked my own meal and it did not taste authentic or close to that. The waitress that worked there was nice but service was on the slow end. It's a cute restaurant but no a destination for tapas.", "Date": "2014-02-24", "Author_Location": "Seattle, WA"}, {"Author": "Sofie S.", "ReviewID": "zn-nQCOxkXtHm-JRxbOZ7w", "Overall": "2.0", "Content": "I really wanted to LOVE this place. I've been searching for a Spanish go-to for a while.Alas, I was disappointed.  The tapas are boring, the paella is way overpriced and nothing to write home about.  I must praise the sangria, it was wonderful....that saved my night.  Maybe it was a bad night for them, I can only hope. But, I don't think I will be back to test my theory.", "Date": "2014-02-11", "Author_Location": "Portland, OR"}, {"Author": "Kinda Invisible S.", "ReviewID": "PP68B5RG3UAE-2V_lwslgw", "Overall": "5.0", "Content": "This was our first visit and I'm already planning a return.  We arrived just as they were opening so waiting wasn't an issue (as mentioned by other reviewers).  We had a few tapas and then paella marinera.  I thought the rice in the paella should have been a little more crispy on the bottom, but the flavors were amazing.  We devoured everything put in front of us!  Whether you stick with tapas only or have an entree, I can't see where you can go wrong here.  Lovely atmosphere...", "Date": "2013-12-23", "Author_Location": "Snohomish, WA"}, {"Author": "Josh H.", "ReviewID": "tsETtk8dggufiWZ1sGwTWw", "Overall": "3.0", "Content": "We had a very nice meal here tonight. This is an owner operated restaurant. The couple that owns Gaudi cook, waits tables, host, etc.... I though the service was good. Its a charming little place tucked away in North Seattle. Intimate space. Food was very good. We got some tapas, and then both ordered a paella. We knew this would be too much food, but we figured we could pack it. I got the 'Mixta' paella that had seafood, sausage, rabbit. Yum. Really good. I like the shrimp croquettes tapas I got as well. I will be back to Gaudi, but I agree with some of the other comments about the paying at the table with their little machine. Its weird. I think the couple has been running this place for a long time together, and their operations are getting a bit long in the tooth. You could make a few minor tweaks to this place, and easily kick it up a star (or two).", "Date": "2013-02-16", "Author_Location": "Columbus, OH"}, {"Author": "Poulina K.", "ReviewID": "FzIOTyywww-Qp2136rdX7A", "Overall": "5.0", "Content": "I don't know about tapas in Boston or San Francisco or other places for that matter, but having recently returned from an extended vacation to Spain, I can speak for tapas from Barcelona and Madrid. Gaudi serves delicious authentic Spanish tapas with incredibly warm, welcoming and personal service that makes you feel like you are having dinner at someone's home. We celebrated a birthday here with a large group of folks. Big parties are always tricky to handle, especially when you are the owner/server/bartender/, but Joan managed the task with ease and grace. It felt unobtrusive, yet we received plenty of attention.As for the food, all of the tapas were delicious. Sausages and cured meats are made by the chef/owner in house, and pack a ton of flavor. Jamon, spicy chorizo and a sausage without casings that I can't remember the name of, were all perfect starters to our meal. Add some Spanish tortilla, which is a sort of a thick potato omelette, with a bit of garlic aioli on the side. Meaty steamed mussels with just a touch of herbs, onions and white wine, served with grilled rustic herb bread were divine and perfectly tender. I could just eat those every day. For the main course we shared three different paellas, rich with meats, seafood and Mediterranean flavors.We also consumed what seemed like countless pitchers of white and red sangria. I loved the cava (white) sangria for its refreshing citrus taste and effervescence! Sangria pitchers may seem spendy at $20-22, but you get a large pitcher enough for at least 6-8 glasses.The whole experience brought is back to Barcelona and we had a wonderful celebration evening filled with fantastic food, laughter, conversations and stories. Although Gaudi has an obscure location, it is well worth a visit and multiple returns.", "Date": "2012-07-02", "Author_Location": "Kirkland, WA"}, {"Author": "Jason M.", "ReviewID": "Z5X833W7akZp3V19-945Qg", "Overall": "4.0", "Content": "You only know what REAL tapas, pintxos & paella taste like if you've traveled through Spain... or been to Gaudi!  I've been to many restaurants across the US since my own travels through Spain and can say that Gaudi easily serves up the most authentic Spanish tapas I've found this side of the Atlantic.  If you're looking for a chic or yuppified \"take\" on Spanish cuisine where the tapas are defined by the \"marketing schtick\" du jour, go elsewhere.  At Gaudi, you're going to get flavors and recipes from the old world using the best of local ingredients.  Joan and crew have a passion for their cuisine and business that is evident in not only every bite but also the warm and personal service.  Ordering advice: If your not adventurous when it comes to new menus - stick to the classic tapas/paellas and it's likely you'll love everything you order.  But if you are adventurous (like me), I STILL recommend ordering up 75% classics and only 25% adventure.  Why so limited on the adventure?  It's authentic Spanish tapas! Not everyone falls in love with or can handle too much of the brine, vinegar or oily techniques some of the less mainstream delights incorporate. My personal favorites on the classics side: Gambas, Chorizo, Tortilla, Papas Bravas (mostly for the sauce), Mejillones Marinera (plus bread) & Fideua Paella for sure.", "Date": "2012-08-10", "Author_Location": "Seattle, WA"}, {"Author": "Hannah L.", "ReviewID": "lzqNWVId6p6ZOBMo4BjOlw", "Overall": "5.0", "Content": "Radical food.\"Radical\" is one of my favorite words, because it means something different than its typical use would suggest. Instead of meaning new or innovative, it derives from the Latin word \"radix,\" which means \"root.\" So innovative food comes from and returns to radical food. And in the case of a town filled with innovative Spanish tapas that push palate-limits with delightfully intoxicating fusions, a periodic return to radicality serves as a lovely palate cleanser.Those who know me know my only travel dream is a trip to Spain. Gaudi is a little placeholder for that, as the Spanish food here is presented not as an Americanized, theme-parked or boundary-pushing version of Spanish cuisine, but instead as the sort of tapas and paella and wine that you might eat or drink were you to be lucky enough to sit in a tapas bar in some plaza in some small town, or even in someone's own kitchen. In short, how you would eat as if you lived there.And what simple beauty! The salt cod, mixed with cornmeal and fried into meringue-like crisps, delicate and fluffy inside....The papas bravas with a subtly gentle aioli, and skins so perfect to the bite concealing lightness inside like no potato I've ever tasted. A special salad of quinoa wisped with lemon and balsamic vinegar and laced with silky strands of red pepper. A paella mixta with meats (including house-made chorizo) and seafood, and a rice so softly and uniquely addictive that I may never attempt my own paella, as shortfall is guaranteed. Accompany that with a bottle of some forgotten and rare Spanish red, and follow it with an orange port-like liqueur and a hearty, crumbly almond cake, and I was perfectly transported to someone's small kitchen. In this case, it just happens to belong to Jo and Joan Luna and be tucked away on a quiet block of 55th in Seattle, instead of their previous restaurant in Barcelona. But no matter...I can dream, and this dream, at least, is within reach. Radical.", "Date": "2011-08-03", "Author_Location": "Portland, OR"}, {"Author": "Valentina V.", "ReviewID": "wnFXm8ISpLSLqcAac6yZjw", "Overall": "5.0", "Content": "Idyllic.  I remember the night we went for dinner there and my heart glows. Maybe I was in the mood for emotional cheese as the ones we ate were so darn good.  So were the tapas.  So was the paella.  Oh, and so was the unbelievable sangria. We met with a fairly large group and went to have dinner to celebrate my friend Rebecca's birthday.  We all know the sous-chef, Jorge, who is one of the funniest and most adorable people I know in Seattle.  He is Spanish, so it's very nice to know that you're offered Spanish/Catalonian food cooked by people who already know how to pull out the flavor for certain cuisine. The chef is from Barcelona and, that night, he was wearing a Yelp t-shirt. They both had bandannas on their heads, which gave the already quaint ambiance an extra cool note.We started with the heavenly sangria. Perfect. Perfect. Perfect. I could type the word perfect for hours and still feel it's not enough to describe this delicious libation. What I loved about it is that is was balanced--not too sweet but not bitter at all--had the perfect amount of fruit, and the wine used was pretty good (I believe is was a Protos). This Sangria, when paired up with the food, made it happen: match made in heaven.  Everyone agreed on that.Jorge came to our table to make recommendations.  They had quail in chocolate sauce that night so, without a doubt, we ordered it.  He also told us about the selection of cheeses they had that night, and recommended us to get a plato mixto (with charcuterie).  Of course, the quail was both divine and sexy. *Deep sigh*.We also ordered cod, pan con tomate, tortilla and a couple of salads--one of them featuring cheese tortellinis which didn't make much sense to me, but it was fabulous. Everything was spectacular.  You would never imagine you'd be lusting after a piece of bread with smeared homemade tomato paste and olive oil...but the Dude and I were for this one. The tortilla was delicious, perfect egg-potato proportion with a delicate dipping sauce.  The Dude and I ordered the Paella de Monte (Rabbit, Chicken and Sausage) and loved it.  What I like the best was the sausage. It had a rich flavor and a very interesting texture, almost creamy.  Rabbit was tender (something hard to achieve) and the mix of its flavor with the chicken and the saffron on the rice was very good.  This was the Dude's first time trying rabbit and he really liked it. I have to say I've never been to a Spanish restaurant in the US good enough to remember (with the exception of Txori, which is more a tapas place).  They aren't easy to spot, because there aren't many.  Some say it's because ingredients are hard to find, or the taxes on items such as cured hams and cheeses are extremely high--and apparently, there are numerous problems with these and customs, too. So being able to come to Gaudi and have these amazing dishes was a wonderful experience.To finish our lovely dinner, we ordered a dessert sampler. First, the birthday girl was presented with a slice of chocolate cake filled with raspberry mousse.  It was delicious.  The other desserts were a bit odd: some of your typical Catalonian sweets that some palates weren't ready for, including mine. The Dude loved the liquorish taste of their slow-cooked pumpkin (which had a crunchy texture). The plate had a coconut paste that I really enjoyed but there was a piece of cake none of us were very excited about.  It was a bit too dry.  The only downside was the check part, especially when it comes to groups. They don't do separate checks and only accept three cards per table.  Be prepared and bring cash for a situation like this--and you'll have to bring a good amount, as Gaudi is pretty pricey. We went there on the night that snowed.  It was absolutely beautiful to go outside, bellies in bliss, and walk around in such a beautiful, silent and white night with the Sangria after taste in out mouths.", "Date": "2008-12-16", "Author_Location": "Seattle, WA"}, {"Author": "Qianru D.", "ReviewID": "fPQLXl10a8gndxAO2R5RtA", "Overall": "4.0", "Content": "Updated review 11-16-2013: I finally made it back here. The place is still very busy, so make a reservation if you are coming on weekends. Service is good, once we were seated. Food is good. Some special tapas (especially cured ham) are highly recommended.", "Date": "2013-11-16", "Author_Location": "Seattle, WA"}, {"Author": "Jillian R.", "ReviewID": "UG5Na2tfB7kktY7PFEJW_A", "Overall": "3.0", "Content": "Dear Yelp, please make it possible to comment on others' reviews. That way, when someone has a stupid complaint about something that has nothing to do with the food or service at a restaurant, fellow yelpers can ridicule and otherwise shame them. Also, you should make it a pre-requisite that no one is allowed to use the phrase \"Don't you know I'm a yelp reviewer\" in a restaurant. Congratulations, you can read and type.  My boyfriend and I love this place.", "Date": "2012-01-05", "Author_Location": "Seattle, WA"}, {"Author": "Susie L.", "ReviewID": "YhSmkPEfKmGwDpBkAk4_7w", "Overall": "1.0", "Content": "I feel bad writing a one star review, something I've never done until now.  We had high hopes for Gaudi; it's close to our house and we love Spanish cuisine.Where do I start... We should have taken the help wanted sign out front as a precaution.  We arrived about 7:30pm on a Friday night.  We were greeted and shown to our table, but that's where the service ended.We sat for 15+ minutes before anyone even acknowledged that we were there.  Having walked past our table 10 or so times, our server/restaurant owner never once said anything, not even an, \"I'm sorry, I'll be right with you.\". It was as if we were invisible.Finally she arrived to take both our food and drink orders.  We waited at least another 10-15 minutes to get our drinks, food started coming out about the same time.  (meanwhile, we noticed other tables near us were seeming to be frustrated with the service as well).I will say the food was quite good.  Not the best Spanish food I've had, but tasty.The clincher came when my husband's drink came.  The server/owner placed it down and said, \"oh\".  Then came back with a spoon as she proceeded to fish our a couple of fruit flies from his drink.  Are you kidding me?  I wouldn't serve a house guest a drink with a bug in it, let alone expect that from a restaurant where I was paying for it! Gross.  Makes you wonder what the kitchen looks like...Needless-to-say, we won't be returning to Gaudi.  The restaurant needs a visit from Gordon Ramsey and Restaurant Nightmares.", "Date": "2011-10-16", "Author_Location": "Seattle, WA"}, {"Author": "Sarah M.", "ReviewID": "Llz2zbTc7euecGyC1uTODQ", "Overall": "4.0", "Content": "This is such a cute, quiet little restaurant hidden away in Seattle. It's located in a residential area on a mini main road. My husband, who is not very adventurous when it comes to food that is not hamburgers or pasta, was not happy to come here at first. He stomped around, held his breath, and puffed out his cheeks. After his lime spritzer drink that was like a capirneah without the alcohol, he warmed up to the place. Once he got his tapas, he was sold. I've never seen him eat so quickly in my life!We ordered 4 tapas - the papas bravos, a meat ball with rice, dates wrapped in bacon, and the shrimp. All of the tapas were exceptional - but I barely had a bite before he polished all 4 off. They are small as others have warned...but that's the nature of tapas. We received one meatball, 4 bacon wrapped dates, 3 pieces of shrimp, and maybe about 8 potato wedges.After some deliberation, we ordered the vegetarian paella. I really wanted to try it but you need to be 2 people to order it. (Or at least pay for 2 people to order it.) While he wasn't sold on the paella, I was really happy with it. I've had better in Spain but as the only Spanish restaurant in the US that I've tried, it was pretty good. This place is a little pricey for what it is...the total came to about $86 with tax and tip. This also included a glass of wine and a mocktail. However, it was still good and fun every once in a while.", "Date": "2011-11-12", "Author_Location": "Issaquah, WA"}, {"Author": "Olivia L.", "ReviewID": "eubYqAK0uhRqROhmzP8aGA", "Overall": "3.0", "Content": "This is a great neighborhood spot, but I'm not sure I would drive to go to Gaudi.  The tapas menu is interesting.  They're not really Catalan tapas, but tasty nonetheless.  I was a bit surprised by the pricing ($3 for tapas = super cheap) but when the portions came, I saw why -- you literally get one meatball, one skewer, etc.  The only thing we got two of was the house made sausage sliced onto bread.  So be prepared to order more than one of the same dish if you are sharing!The one thing I did notice (we made a meal of tapas, so we had a lot of them!) was that the same sauce was used on several dishes.  For example, the same pinkish-white-creamy-spicy sauce was on the bomba (the solitary meatball) and the patatas bravas.  They also used the same loaf of rosemary soughdough to underpin two of the dishes.  While I understand that it's a small kitchen...it kind of detracts from the dish to have the same elements repeated.  It's a bit of an obvious cost-cutting measure, particularly because I really don't like sourdough! The sangria is a little too fruity for me, also a little on the weak side.", "Date": "2010-08-16", "Author_Location": "Palo Alto, CA"}, {"Author": "Debra B.", "ReviewID": "520kRuo21fFRDnRAJv05mg", "Overall": "5.0", "Content": "Amazing tapas restaurant with an inventive chef. He put together a brand new dish just before we came in with puff pastry, blue cheese, apples and jam, so delicious, as was everything else we tried. And we were the first to eat this wonderful creation! You will not be disappointed!", "Date": "2013-10-05", "Author_Location": "Longwood, FL"}, {"Author": "Connie C.", "ReviewID": "arXKKYy_paKLRNtvhVQ6-w", "Overall": "5.0", "Content": "Yum...Yum...Yum...Yum...Yum...YumGood paella - check!  Good sangria - check!  Good service - check! Love the place - ding! ding! ding!We walked in on Saturday night at 9:30 and realized the restaraunt closes at 10.  The staff was friendly and waved us in.  We looked at the menu and realized that Paella takes 25 minutes to arrive.  (YIKES)  But never fear the server pssht'ed us and took our order.  Our DE-LI-CIOUS sangria comes and we didn't even realize 25 mintues had gone by before our Paella is served.  IT comes IN the paella pan...not scoops in a bowl from batches made in the back.  First bite - yum,  second bite - YUM, and the rest is heaven.The woman who owns the place stops by often to ask how our food was.  When we finished gushing,  she told us her husband (the chef) is from Barcelona so we're chowing down some authentic Spanish grub. When we left fat, drunk and happy - the woman called out \"hope to see you again!\"  Oh yes Gaudi...we'll be back and we're bringing more friends.", "Date": "2008-08-17", "Author_Location": "Seattle, WA"}, {"Author": "Bacon B.", "ReviewID": "mjQBfGOOF125UyhsrRB3QQ", "Overall": "4.0", "Content": "I start with a warning: San Chez in GR, MI set the bar pretty high and I'm rather committed to that tapas restaurant. With that said, I implored a Seattlite to find a good tapas place near our hotel in the U District and she found Gaudi. It was a first for all of us, and we weren't disappointed.Yes, the tapas seem to be on the pricey side but that's par for the course with any good tapas restaurant. Can I say how much I thoroughly enjoyed every bit of food brought to our table? Fo shizzle, folks. Coupled with a pitcher of some of the best sangria I've ever had (and I'm a drinker by profession), this was a wonderful spot for meeting up with my cyber friend and finding a quaint spot to enjoy a lovely dinner. The service was fantastic, the tapas were spot on, and the paella was a thing of wonder.And to my dear San Chez, please know that in your absence I will try other tapas places, and may very well enjoy them and hope to return to them, but in your arms I will forever belong, my beloved.", "Date": "2008-10-13", "Author_Location": "Phoenix, AZ"}, {"Author": "Tanya H.", "ReviewID": "4LGbFU1Uuc6JElqSZJjfWQ", "Overall": "5.0", "Content": "Very late review!If my wallet would let me eat here everyday, I definitely would.My husband and I had a date night at Gaudi just this new year's eve. I loved the smallness of the place, it made me feel like it was more personal when it came to their service. My husband was able to try a couple of different kinds of wine before he decided on one that he liked. And for moi, I am allergic to alcohol and I told that to the server, so he suggested this yummy refreshing drink of perfection. It would be close to a virgin mojito but there was something more in it that I definitely loved. We ordered calamares for starters. It has the best garlic/wine/olive oil sauce ever! It was so good that I had to watch over my husband 'cause I thought he'd start licking the plate soon. For our entree we ordered Paella Negra. It had squid ink to make it black and it had fish, shrimp, scallops and of course the rice... oh man it was heaven! I could have eaten the whole thing myself if my husband wasn't there. We didn't have room for dessert in our tummies which was fine since we don't usually eat dessert. I know we're weird like that. I will definitely go back... alone maybe, so I can have the paella all to myself. HAHAAH! Oh and yeah, good date place. :)", "Date": "2009-09-18", "Author_Location": "Seattle, WA"}, {"Author": "Tom E.", "ReviewID": "hvb0VrnIp-HTfWlma89IBw", "Overall": "5.0", "Content": "Colorful décor. A perfectly balanced salad - textures and flavors.An interesting variety of Paella like rabbit. I had the beef brisket - deliciously hearty with an amazing sauce. Sponge cake with apricot and raspberry was out if this world perfection.", "Date": "2010-07-09", "Author_Location": "Seattle, WA"}, {"Author": "Andrew C.", "ReviewID": "0Jo8BABkBp66Ix_JSbaRPw", "Overall": "2.0", "Content": "I recently moved to Seattle from Boston, and having had excellent tapas in Boston, I was excited to see what the wetter and more politically correct city has to offer, and went to visit with a friend.The food was mediocre, but well priced. I had the dates wrapped in turkey bacon, the fried chopped shrimp, and the potatoes. In addition, for myself, I ordered the lamb skewer. The cuisine was definitely not as good as I've had elsewhere (read: any other Tapas restaurant)The ambience and service left something to be desired. The inside of the restaurant could have been any generic Mexican restaurant in Seattle, save for the pictures of Gaudi's architecture. Moreover, the service was terrible. There was one waiter serving at least 7-8 tables, who seemed flustered and disorganized. My dining companion and I asked to order more food, but waited at least 30 minutes and our waiter was not seen again. On the way out, she apologized for this but clearly seemed overwhelmed. Bottom line: the food is ok and reasonable priced, but I would not come back here because of the service.", "Date": "2012-06-28", "Author_Location": "Seattle, WA"}, {"Author": "Allison B.", "ReviewID": "Spa6BgclFv-64OUWTxKq9w", "Overall": "2.0", "Content": "I was very excited when my friend decided to have a welcome home dinner at Gaudi upon her recent return to the states. I've had great experiences at other tapas establishments so I was looking forward to excellent food and the intimate experience of a family owned and run establishment.The food was okay. I've never been to Spain so I don't have a feel for what is authentic and what isn't. It wasn't as good as some other places I've been to, like in Tampa or Anaheim. Okay, but not to die for.The worst part of our experience was paying our bill. We had 7 people and spilt the check by 6. Our waiter was very kind and started running our cards at the table. We didn't have a choice on the monetary amount for gratuity - it was an automatic 15 or 20%. Halfway through, the owner came over and started berating our waiter about  why he was running more than three credit cards. Unprofessional #1. She then turns to our bride's sister-in-law and starts berating HER, saying that she had told her on the phone when she made the reservations that they would only accept three cards per table. I'm sure she did, but how disrespectful to berate your guest and customer!! I know they have service charges for running cards, but really?? After she threw her hands in the air, told the waiter to continue what he was doing, and stormed off... That was it for me.I would return only if someone else wanted to eat there. I won't take anyone there or recommend anyone else to go. You're a business owner - take care of your business behind closed doors, not at the end of a table full of customers.", "Date": "2013-06-24", "Author_Location": "Olympia, WA"}, {"Author": "Rachael M.", "ReviewID": "tH_va1Q79cEUtTqipFq2EA", "Overall": "3.0", "Content": "I recently moved to Seattle from San Francisco, where I had a tapas restaurant that I loved (Zarzuela's) and was so excited to find a tapas restaurant near where I live now.  My boyfriend and I decided to try Gaudi's recently and were disappointed.  While our experience overall wasn't bad, it certainly wasn't what we were expecting or anything special.The restaurant is very cute.  The inside ambiance is nice, it looks nice from the outside, everyone was friendly.  I really wanted to like it!But, the food was hit or miss and expensive for what it was.  Some items were very good- we were impressed with the papas bravas (potatoes in a spicy sauce) and the morzilla (blood sausage).  The spanish tortilla, however, was disappointing.  I can make a better one at home, and spanish tortilla should be the staple at any tapas restaurant!  All of these three dishes were around $3 each.We also had two specials.  One was a fried cod ball.  I thought it was pretty good, my boyfriend thought it was disappointing.  The biggest disappointment was a lamb stew.  The meat was not high quality at all.  It was also very small.  We were shocked when we received the bill and the lamb dish ended up being $20- given the small size, it should not have cost more than $10.If we had only ordered the dishes we liked, then we probably would have walked out saying it was a great restaurant.  But the dishes were so hit or miss that we probably wouldn't go back for a full meals- just maybe to get appetizers and stick to the items that we know are good!", "Date": "2012-03-15", "Author_Location": "Seattle, WA"}, {"Author": "Alex G.", "ReviewID": "_pWNt0rDdfUKlniVfGWupw", "Overall": "1.0", "Content": "I wanted to like Gaudi. My wife and I were craving good tapas so we decided to give Gaudi a chance. We were the only customers there at 7:30 PM on a weekday, which is never a good sign. The atmosphere was reasonably quaint. We wanted to order a salad, half a dozen tapas and a paella to split. However, they have a policy requiring a minimum purchase of two orders of paella. I'm sure they have their reasons, but that was too much food for us, so the paella got nixed. This policy makes Gaudi unsuitable for a romantic dinner for two--unless you want lots of leftovers. The tapas ranged from mediocre (the too mild house-made chorizo, and pincho) to bad (the special salad of the day and bombas) with the several others falling somewhere in between.Bottom-line: I wouldn't recommend Gaudi and won't go back.", "Date": "2013-10-10", "Author_Location": "New York, NY"}, {"Author": "Suzanne M.", "ReviewID": "CTuJSbcfvESmIUBm_itHGw", "Overall": "3.0", "Content": "Tapas were delicious. Their house made sausages were so good. They come with bread, FYI. Paella--Paella negra, the one made with squid ink---was just ok. You get a ton of it. It does not have a lot of shellfish in it, though. And yes, its oily. Weird. Everything was cooked well, with a few exceptions, We had a few undercooked calamari--breading mushy, not crisp.  Also, the chocolate cake on my Forrest Gump dessert was stale. The rest of it was yummy. Hubs had the fig ice cream---more like sorbet. As good as they say, and its the caramel-like sauce that makes it good. Cheese plate--huge!  Enough for 4 people.  I love that.Red wines not over $34 a bottle! Score. Our service was good till it got busy. Owner seemed to be managing without support staff. She apologized, telling us its normally not that busy on a Sunday and she gave her staff the night off.  Whole dinner took 2.5 hours!Probably would have given more points if we hadn't ordered the paella.", "Date": "2010-05-30", "Author_Location": "Seattle, WA"}, {"Author": "non o.", "ReviewID": "Ahwp1A5Yi0Nx_N3V6TuMNw", "Overall": "4.0", "Content": "Just had dinner here for the first time. Great service and delicious food. The price is higher side though. Good shrimp in garlic and olive oil dish, but 5 prawns for almost $10 is little bit too high.We had sangria which was really good. Also paella was great. The portion was huge and we couldn't finish it. I guess I'm having paella for lunch today!My friend who is from Spain said their paella was okay. I was afraid to try it but I thought it was good.4 stars because of the high price for their small tapas plates... They don't serve sangria in glass. They are closed on Tuesday.", "Date": "2008-08-28", "Author_Location": "Seattle, WA"}, {"Author": "Enrico P.", "ReviewID": "Pz14e58g-oM-aNvsq6jP1w", "Overall": "2.0", "Content": "I was disappointed in the food.  I asked the waitress for suggestions as I had not eaten in this restaurant before.  The dishes did not go together well and the meal was too expensive for what I received.  I do not think I will eat here again.", "Date": "2011-12-25", "Author_Location": "Seattle, WA"}, {"Author": "Michelle T.", "ReviewID": "AQocMWZjgQu-c-7-CxKIlQ", "Overall": "5.0", "Content": "I live in the neighborhood and have visited Gaudi with my family. Their paella is great! I've had the paella del Monte and the paella Marinera. Both were delicious. I have to say, though, that the tapas are hands down my favorite! The shrimp croquetas are delicious as is the Morzilla. I also really love the owners of Gaudi. They do everything (cook, host, wait tables, tend bar), and they've always been lovely to me. Gaudi is the kind of place where you go to relax over dinner. If you want fast food, go to McDonalds. If you want to linger in a cute, quiet restaurant over delicious wine, tapas, paella and dessert, go to Gaudi.", "Date": "2013-07-13", "Author_Location": "Seattle, WA"}, {"Author": "Jeff S.", "ReviewID": "9PYSisoZeO4ClbsA_4ADww", "Overall": "4.0", "Content": "Gaudi is lovely. A quaint, comfortable and unassuming location in Ravenna. My wife and I have been driving by for the past few years and finally decided to drop in. So glad we did.We weren't in the in the pialla mood, so we decided to try some tapas. The steamed mussels were sweet and decilious, the fried cuttlefish was cooked to perfection and the bacalao was amazing. We were impressed by the myriad of daily specials. Very nice selection of Spanish wines and ports. The owners are very nice, and even brought us several ports to sample. What we loved the most was the authenticity of the location, owners and their food. Nothing pretentious or fancy. Overall, a very nice experience and we can't wait to come back.", "Date": "2010-04-24", "Author_Location": "Seattle, WA"}, {"Author": "Linda K.", "ReviewID": "QYU-ON5vo_lYdD2ub-0xLg", "Overall": "1.0", "Content": "Way way overrated. Service was slow although our group was the only table. Expensive. Hum drum pialla.I really wanted to like this place but it just didn't work for me.", "Date": "2010-02-06", "Author_Location": "Seattle, WA"}, {"Author": "C F.", "ReviewID": "kjs5Oqlbl5Q50Ojc3bVwRg", "Overall": "5.0", "Content": "Had a great time with the wife. The only problem was whether to try a whole lot of tapas or get paella. This time we went with tapas. We will be back to try the paella.", "Date": "2013-07-19", "Author_Location": "Seattle, WA"}, {"Author": "Kristin B.", "ReviewID": "n2GvXLlWD8TaBEzQqiq9HQ", "Overall": "4.0", "Content": "This was our first time visiting Gaudi and we were impressed with the service and the food.  We had a sampling of tapas, the lovely cava sangria and followed it up with a slice of chocolate cake.  It's an adorable little spot and we plan on coming back often.", "Date": "2013-05-17", "Author_Location": "Seattle, WA"}, {"Author": "Terry H.", "ReviewID": "IauViewbU2LA7HiNsxJpHw", "Overall": "3.0", "Content": "Service: 4*food: 3*ambiance: 3*Very nice servers, attentive, fast. No wait in a Friday. Tapas were good, platos good. Creative offerings, pretty good executionBrightly lit, a bit cool when we first came in. Worth a return trip", "Date": "2009-03-28", "Author_Location": "Seattle, WA"}, {"Author": "Eutreptia V.", "ReviewID": "RC3EQV2gRsIGGlwRqLBKlQ", "Overall": "4.0", "Content": "Great tapas place. Charming atmosphere, staff and wonderful authentic spanish food. The tapas specials were fantastic. Our favorites were the lomo (pork), spinach with pinenuts and currents, and the garbanzo cakes.  The flavors in the paella were fantastic, although I would have liked it a bit less oily. For the desserts, the exotic ones, a creamless custard (\"tocinitos\") and a fig ice cream, produced raves. (The chocolate cake was good, but we've all had good chocolate cake before. When  have you ever eaten an amazing, deep caramely tocinitos?)", "Date": "2010-05-12", "Author_Location": "Lake Forest Park, WA"}, {"Author": "Tomas G.", "ReviewID": "s11pt66rLS9m0mXpW9uG7g", "Overall": "2.0", "Content": "I came here once a few years ago and was unimpressed with the food (service was good), but our kids have been clamoring for spanish food in a restaurant, so we came again tonight as an end of summer hurrah, hoping the food had improved, especially after reading the recent reviews.  I grew up in Madrid, my mother is spanish, all my kids are fluent, we cook spanish food with some frequency, and to Yaya's house on sundays for real homecooked spanish food, so I do have some basis for comparison.  I agree partially with some of the reviews that talk about the authenticity of the food, because Gaudi's tapas do indeed capture a particular aspect of spanish cuisine - they taste like bad tapas made in bars that get so many tourists  they don't care what they churn out.  Before going too into the food, let me be clear - the service was great.  We were a family of 5 plus an infant with an early reservation, and had the hostess/owner all to ourselves.  She was sweet with the kids, and the food came quickly.  But this did not make the food any better.  I'll start with the good news:The croquetas are pretty good.  They didn't have that nice, creamy bechamel pop that real croquetas have, but no restaurant in seattle has pulled that off, so at least they didn't taste like fried mozeralla sticks.  The gambas were tasty and sweet.The albondiga was one big fried meatball of rice and meat and the kids liked it.The pintxo de cordero was a tough, insipid piece of skewered meat. The calamares were tough and chewy.  This is unforgivable in a spanish place.The empanadas had a flaky crust but the corn inside was dissapointing.  We got it because, other than a fake crab salad or a tomato salad,  this corn was the only \"vegetable\" on the menu.  The mussels, at $17 for a small bowl were the biggest dissapointment.  Our server raved about them, and they were the special, but they were chewy and fishy and their wine/garlic sauce, usually an easy winner, was watery and briney.  And the bread is extra $, as we found out later...Overall, the food just isn't very good.  They were out of all but two wines by the glass, Were out of the two desserts the kids were interested in, and have almost no fresh veggies on the menu at all.  You can certainly find places with food this mediocre in spain, but you'd be making a mistake with the myriad delicious places you could eat at.  Unfortunately for us Seattleites, La Taverna del Alebardero is closed, as is Bilbao.  Tango's food , like La Brasa and Andaluca has nothing to do with spain whatsoever, and el Txori has lost its way.  This means we are left with Harvest Vine, which still provides a great spanish meal, albeit a very expensive one that isn't really everyday spanish food, but certainly resounds with the flavors of el pais vasco.  Olivar is yummy, but is hard to describe as spanish.When we were finished, our credit card was entered into a remote machine that required us to tip either 15 or 20% while the server hovered.  I've never seen this before and it wasn't very comfortable.  Being charged for the bread, I wanted to tip less than 20 but more than 15, but felt a bit pressured, so I tipped 20.  Sorry, Gaudi, we wanted to like you, we really did.", "Date": "2012-09-03", "Author_Location": "Seattle, WA"}, {"Author": "Jessica W.", "ReviewID": "FgU-VLF3wVErgb1xh845DA", "Overall": "5.0", "Content": "A hidden gem! As I don't live in the neighbourhood, I discovered this restaurant by chance. Intending to meet a friend for dinner next door at Pair, we needed a plan B because Pair is closed on Sundays. I am SO GLAD we did! Gaudi reminds me of Europe in many ways, and the food is REAL Spanish (I grew up in Europe and spend a year in Spain, so I'd like to think I know what I'm talking about). The owners are a couple who owned a restaurant in Barcelona for over a decade, and I feel privileged that we can enjoy this cuisine here is Seattle. We decided to stick with tapas and a salad; a tasty succession of unique meals. Heavenly hummous, originals salads, and shrimp piri piri the way it should be. Am dying to try everything from the menu in future visits, but was happy to be guided by our hostess, who not only advised us on the perfect dishes, but also brought us wines to taste before we made our selection. The atmosphere is relaxed, but you do feel 'out for dinner', and the decorating is elegant, authentic and unpretentious. Really a great find. Salud - to serendipity!", "Date": "2008-11-18", "Author_Location": "Seattle, WA"}, {"Author": "C Y.", "ReviewID": "rG8XfDVFXC8mmZ5fxHMokQ", "Overall": "5.0", "Content": "Gaudi is a somewhat new Spanish restaurant located on 55th above U village.  It's small, very charming and serves delicious tapas, wines and entrees.   I've been drawn there by their Paella and I have to say it's wonderful. Start your dinner with some of their great tapas plates, they do change often depending on what is in season. After 3 visits to Gaudi and a number of plates,  I've not been disappointed with anything.  Last night we shared a small bowl of mussels that were cooked a a heavily herb-ed broth, along with the olive oiled toasted bread it made a perfect starter.  I love Spanish wines as they are great with food and are good values. The hostess/owner was nice enough to let us sample 3 different wines before we ordered a bottle for our dinner.We settled on a nice red blend (tempranillo) that went very well with our tapas and Paella.  For dessert we choose an almond cake that was perfect, not too sweet, nice texture served with a little whipped cream.  Gaudi also has some nice ports and sherrys.  The service was perfect, do ask them for recommendations. I'm very surprised more people haven't yelped this place.  Try Gaudi.", "Date": "2008-05-04", "Author_Location": "Portland, OR"}, {"Author": "Mork M.", "ReviewID": "tG1Vze4_bTWSMdNQ0Vl0bQ", "Overall": "5.0", "Content": "I went here for the first time the other day and was blown away both by the fresh, delicious custom tailored meal as well as the wonderful service and attention to detail. I had a smattering of tapas as well as a bit of a chef's invention; I seriously loved it all! Joe is quite the artist as well, designing and making much of the interior art and decorations. The chef and his underling are adept lovers of real earthy always fresh from scratch meals and it shows. Had a wonderful pitcher of sangria too.", "Date": "2008-08-04", "Author_Location": "Seattle, WA"}, {"Author": "Adam E.", "ReviewID": "icBxVcyNw6i0_Iwo3mozog", "Overall": "1.0", "Content": "Dined at Gaudi with two other couples, and we were the only party in the restaurant.  They may have had a problem with their heat, because it was freezing cold - we literally kept coats on during dinner, and by the time we left I couldn't feel my toes.  Service was slow considering we were the only guests, The food was ok, but our server didn't do a good job of helping our group order the right quantity.  At the end of the dinner the waitress ran our credit cards at the table, and waited there...very weird.", "Date": "2013-01-18", "Author_Location": "Seattle, WA"}, {"Author": "shirley r.", "ReviewID": "ulwIMaFgSaUKab5D8zKCWA", "Overall": "5.0", "Content": "Great restaurant.  The best Paella in town if you ask me and delicious sangrias.  We had 1 pitcher of the regular sangria and 1 of the white sangria and both of them are really good.My husband and I have had many paellas before but their \"paella negra\" is excellent.  The owners are very nice and the service is really good.  Simple restaurant with great food.Their appetizers are very  YUMMY too.We really want to go back and try the rest of the menu.", "Date": "2008-08-18", "Author_Location": "Everett, WA"}, {"Author": "Amber P.", "ReviewID": "zQLf-Vx4PDQ9JgEhNNKhjQ", "Overall": "4.0", "Content": "I loved the food, but I especially loved the service!  The woman who owns the restaurant took the time to stop by our table and talk about the different food and drinks offered.  A word of warning, the drinks, invented by this remarkable woman, are very strong!  I know I'll be going back to try the other items on the menu soon!", "Date": "2008-07-22", "Author_Location": "San Francisco, CA"}, {"Author": "Mark M.", "ReviewID": "Ae06VH7NQxajv2PkOBzhRQ", "Overall": "5.0", "Content": "We love Gaudi. It's quiet and the food is terrific. Love that the food is different and interesting.  It's quiet, low key and the food is prepared well.", "Date": "2010-10-10", "Author_Location": "Seattle, WA"}, {"Author": "Laura C.", "ReviewID": "Dt7T8I_stntsQGX-HHdIBg", "Overall": "5.0", "Content": "Our group of six was looking for a classy place to have dinner before an event at the UW. Gaudi had great reviews on Yelp so we decided to give it a try. We couldn't have had a better experience! Our group tried most of the tapas on the menu and loved them all. Drinks were a little expensive, but the pitchers of sangria were a good deal and very tasty. Our server was very accommodating and joked with our group and helped make our night all that much more fun. Thanks for a great evening and we will definitely be back!", "Date": "2011-12-05", "Author_Location": "Seattle, WA"}, {"Author": "Hillary M.", "ReviewID": "BjgJ1xyQl493OpPr9ohvlg", "Overall": "4.0", "Content": "Hubby and I had a great dinner here last week.  Service was charming - sage advice on what to order, great in letting us sample a wine until we found one we liked.  It was a perfect evening.  I highly recommend going with the chef's choice for what's good that night.  We just had tapas and wine over about two+ hour window, plus house-made fig ice cream with port wine sauce.  The decor and location are great too - off the beaten path, attracting true tapas fans and locals alike.", "Date": "2009-08-30", "Author_Location": "Seattle, WA"}, {"Author": "Pierre G.", "ReviewID": "EoPEW8BCwSwRueNNaKVwnQ", "Overall": "4.0", "Content": "For tapas fanatics, a solid alternative to Harvest Vine- Empredat Gaudi (a Catalan Salad) $7.75: fresh bursts of flavor, great tangy dressing, lots of white beans - perfect starter dish- Mojama [filleted salt-cured tuna] $3.75: 2 luscious slices, served with an oyster on toast - like great sushi - try this- Chocos (Marinated Cuttlefish, battered & fried) $8.50: - served with aioli, similar to calamari, fried with just the right touch- Gambas Romanesco (Shrimp in Tomato Sauce) $4.95: 3 delicious shrimp on a skewer - I highly recommend this dish- Chistorra (Cured Sausage) $3.25: 3 small sausages on a  skewerspicy and tasty- Gazpacho $6.00: with mango very flavorful and refreshingOur waitress was sweet and helpful with suggestions for both food and wine;I will return for paella [about $20 per person, minimum of 2 diners]for Tina", "Date": "2011-06-02", "Author_Location": "Hunts Point, WA"}, {"Author": "amez k.", "ReviewID": "yjehdA-Tj3HjVPH5UnjQ_w", "Overall": "5.0", "Content": "I recently went up to Seattle to meet a couple friends that are new to the city, and since I'm always on a hunt for greate Spanish food, I picked Gaudi based on the great reviews from Yelp. Oh boy, these reviews weren't kidding.We had a bunch of tapas from the regular and special menus, as well as sangria and paella. I've been to Barcelona multiple times, and I can tell you that these dishes are not only authentic, but as great as the ones I had in good restaurants in Barcelona.The atmospher is also great. It's a small restaurant, and Jo and Juan are so friendly and attentive to all the customers. There was also plenty of street parking (although I went on a weekday dinner, and it may be more crowded on weekends).I think I may fly up to Seattle, just to visit this place again... YUM!", "Date": "2011-06-06", "Author_Location": "San Jose, CA"}, {"Author": "Sonia G.", "ReviewID": "AU01GONx14NJQggLslnvUQ", "Overall": "4.0", "Content": "We came here recently and loved it.  The decor is quaint--the food and service are stellar.", "Date": "2010-09-21", "Author_Location": "Auburn, WA"}, {"Author": "b r.", "ReviewID": "j3UP02jOSgT0LE2IbswMXg", "Overall": "3.0", "Content": "very expensive. our waitress was the wife of the cook, and he was from spain. she was very knowledgeable about the wines, and very accomodating. the paella was tasty, although it didnt have the crispy bottom like its supposed to. the gambas ajillo were deliciously salty and garlicy.i prob wont be going back anytime soon just because of the price.", "Date": "2009-03-03", "Author_Location": "Seattle, WA"}, {"Author": "Elaine H.", "ReviewID": "FICgKHLEXrC8-q74v3kkJQ", "Overall": "4.0", "Content": "This place is kind of tucked into a strip of shops, but worth a visit.  We went on a quiet Sunday afternoon.  The restaurant is pretty small anyway, but there were only two other tables occupied besides ours.  The owner was our server.  She was very friendly and listed a bunch of specials but we already knew we wanted the paella.  Throughout the mean the service was friendly and attentive without being obtrusive. We also ordered bread with tomato spread and goat cheese spread as a starter.  I liked the tomato spread, but the goat cheese didn't have a ton of flavor.  I was a big fan of the paella.  The rice was well cooked (not too mushy), the seafood was tasty (prawns, mussels, clams, and rockfish), and the dish was well seasoned.  I'd say it compares well with paella I've had in Spain.The wine list wasn't huge, but there was a good selection and a fair price range.  They also had several wines by the glass.", "Date": "2008-09-21", "Author_Location": "Seattle, WA"}, {"Author": "Zaphod B.", "ReviewID": "SKzk6vkS6JX_crHLX71wJA", "Overall": "5.0", "Content": "Dynamite tapas, and the mussels might be the best in town.  Will go back for the paella next...", "Date": "2009-07-25", "Author_Location": "Olympia, WA"}, {"Author": "Brenda And Tommy M.", "ReviewID": "BmheD4eGP0DO1731g9vJUA", "Overall": "3.0", "Content": "Five stars for everything about this place... except the paella.Up until the moment that we started eating our paella (which came much quicker than expected and may have benefited from a bit more time in the kitchen), I fully expected to go back home and write a rave review.  Unfortunately, the paella did not live up to the service, the sangria or the tapas.  We had the paella mixta, which featured rabbit, chicken and seafood.  The rabbit was way to bony to eat in a rice dish.  The seafood was alternately under-cooked and overcooked, depending on which piece we put in our mouths.  And it was very highly spiced either; rather bland overall.The tapas, on the other hand, were WONDERFUL.  Tasty little bits of heaven on a plate at great prices.  We ordered a pitcher of sangria, too, and it was a wonderful accompaniment.We'll go again, but skip the paella.  The tapas and sangria are more than worth the trip!", "Date": "2009-12-04", "Author_Location": "Grapevine, TX"}, {"Author": "Alison H.", "ReviewID": "DkYxJEqKG8ErKZE7iO1Dxg", "Overall": "5.0", "Content": "My third time to Gaudi is the best yet. While I can't vouch for whether or not the tapas are authentic, I can say they are delicious. The fact that it's family-owned is icing on the cake, and speaking of dessert, the delicate chocolate/strawberry confection was perfection.", "Date": "2013-07-20", "Author_Location": "Seattle, WA"}, {"Author": "Priscilla D.", "ReviewID": "9B6EU_V7LId0P4RYHEMjVw", "Overall": "5.0", "Content": "My boyfriend and I made a reservation for Valentines Day and it was the first time that either of us had been here before even though we live fairly close. We tried about 6 or 7 different tapas including two specials and it was absolutely delicious. The atmosphere isn't particularly \"romantic\" in the sense of low lighting and soft music but it is the perfect combination of classy with uniqueness that pretty much describes my relationship with my boyfriend so it was perfect for Valentines Day. Our favorite was the meatball and a close second was the tortilla.And to anonymous couple who purchased my boyfriend's and my Valentines dinner: Thank you. It totally made our year.", "Date": "2012-02-15", "Author_Location": "Seattle, WA"}, {"Author": "Daniel R.", "ReviewID": "LYFyXoWnB3mDqldM8jReOA", "Overall": "2.0", "Content": "I want to like this place, I really do. I have eaten here twice, the first time was a good experience over all, the tapas was good but greasy and the owner was friendly. the second time was a bother, the service unbearable, the owner charged us for two glasses of wine we didn't drink, without apology then charged us for using a card to pay the corrected bill. I wouldn't go back.", "Date": "2012-03-14", "Author_Location": "Seattle, WA"}, {"Author": "P W.", "ReviewID": "uIsyizjdXPh3BEepKy6D4A", "Overall": "5.0", "Content": "This place makes absolutely wonderful paellas. It truly reminds me what authentic paella tastes like.", "Date": "2012-03-26", "Author_Location": "Redmond, WA"}, {"Author": "Andy P.", "ReviewID": "8-GY-EKJottO431rikOIWg", "Overall": "3.0", "Content": "Pretty good.  Ended up being a more expensive than I was hoping to pay that day.  Well... $20/person paella is normal, but maybe it would've been nice if some of the $7 tapas were more like $5.  The tapas were amazing though.  We got the meatballs (a special tapa that day), the tortilla, the bread with anchovies and peppers, the garlic shrimp, dates wrapped in bacon, and maybe another one.  Then we had the mixta paella.  The paella was very flavorful, but I would have liked a more developed soccarat.  To drink we had the cava sangria.  It was ok, but I think their caipirinhas are probably much better.  They were slightly understaffed.  It took a loooong time to settle up the bill.  We also had a little chocolate cake.  Yum.  Overall I think it was ok, and maybe on another night with quicker service it'd be four stars for the same food.  Five stars?  Maybe.  Probably if all I got were a ton of tapas.  The tapas were awesome albeit pricey.", "Date": "2008-11-02", "Author_Location": "Barcelona, Spain"}, {"Author": "Daniel L.", "ReviewID": "fmTrcZFpYptr0al3n_Z4BA", "Overall": "4.0", "Content": "Perfect end to a hot Sunday. The place was inexplicably empty at 6:30. My wife and I went for our anniversary, and romantically had the place to ourselves, though another couple of diners later appeared during desert.  I was dying for sangria, which my wife does not like, and the owner was very accommodating to make me a single large glass of it rather than a pitcher.  It was perfect with the summer breeze blowing in the windows.  My wife had a glass of red wine, Vega, which she liked.  We were encouraged to have both paella and tapas, but the paella is a 2-person minimum at $20 per, and the tapas specials sounded so good we wanted to try all of them (about $3 each.)  We started with delicious gazpacho, which was very thin, like a strained citrus juice. It came in a glass with spoons, which seemed a bit odd.  We are used to chunkier, but it was very good. With it we had the house salad, a chopped tomato-cilantro concoction that was also very good and of sufficient volume to be available to continue eating as a complement to the hot tapas, which were short on its heels; fried cod balls with a mayonnaise (who knew such things could be so good?), grilled shrimp skewers (yum!), a mild Spanish sausage (good flavor, especially when cut small and joined on the tongue with other things), salted roast pork (too dry), mushrooms (a bit Chinese tasting), and grilled lamb skewer (plain, a bit dry, but good).  On the side we had the tomato and oil-rubbed toast. The flavors were subtle to medium in intensity, and all complemented one another very nicely.  We finished with a yummy cake filled with juicy apricots and creme and topped by raspberry puree, and a chocolate-orange mousse cake.  Bill was $85 (without tip), discounted for cash to $78.  Husband cooks, wife waits.  They ran a restaurant in Spain for 15 years.  A great neighborhood find. We'll be back.", "Date": "2011-08-08", "Author_Location": "Seattle, WA"}, {"Author": "Walter M.", "ReviewID": "8zY3pFQrzDjZjoJJUTnZtg", "Overall": "4.0", "Content": "Delicious and fun with a great selection of hot and cold tapas, raciones (slightly larger plates) and paellas.  Everything sounded good to me, so I let the server pick some things (along with the wine), as she's the wife of the chef and is wonderfully knowledgeable about everything on the menu--and fun to talk with too.  I thought my slice of tortilla was too salty, but everything else was spot on:  delicious mussels with lots of bread for dipping into the sauce, great house-made sausage, etc.  I was sorry to see that the place wasn't busier, as it deserves to be, but I guess the day after tax day is a grim one in the restaurant business.", "Date": "2009-04-17", "Author_Location": "Seattle, WA"}, {"Author": "Aruna B.", "ReviewID": "4I5PHQCdp-0_Dys8SViErg", "Overall": "5.0", "Content": "This place is amazing. It is a great neighborhood restaurant, the place is small but the owners (who also serve and cook the food) take good care of you. The paella is to die for. We tried the vegetarian paella since some of our friends were vegetarian and the flavors were spot on. The sausages are another speciality here as is the dessert. A must go if you are/live in the neighborhood.", "Date": "2011-08-14", "Author_Location": "Seattle, WA"}], "RestaurantInfo": {"RestaurantID": "5jtqrP2-1eaiaFpfyHgxyw", "Name": "Gaudi", "Price": "$$", "RestaurantURL": "/biz/gaudi-seattle", "Longitude": " -122.291046", "Address": "3410 NE 55th StSeattle, WA 98105", "Latitude": " 47.668685600000003", "ImgURL": "//s3-media1.fl.yelpcdn.com/bphoto/3B7OTchw9rfKDMN5wkH1sA/90s.jpg"}}