{"Reviews": [{"Author": "Sarika S.", "ReviewID": "OtDL_-VjpxIhnSFygvS07Q", "Overall": "4.0", "Content": "Just had my first binh mah sandwich and it was yummmyyyy. As of recently, I've had the baguettes from Lee's and they are a life changer LOL. I went to go pick up some more and my friend and fellow yelper convinced me to try the sandwich. It's made on the same baguette bread, a 10\" piece, so I knew I was destined for greatness. I got the chicken and they did not skim. The reason why I am giving a 4 star is here- there were many pink pieces. I don't think it was undercooked, it may just be the cut. The sandwich comes with pickled carrots, daikon, onions, jalapeño and cilantro. Each flavor works with each other and perfectly compliments each other. I will definitely be back to get myself more baguettes and sandwiches.", "Date": "2014-04-24", "Author_Location": "San Jose, CA"}, {"Author": "Dennis N.", "ReviewID": "Sql8Jo8zC_9i_fwDkULebA", "Overall": "1.0", "Content": "This place is not the best Vietnamese sandwich shop around. I would have given another star for this review, but the customer service was horrible the last time I was there.I was there on a weekday evening. There was an older lady trying to place an order. The cashier was a young Vietnamese punk. The lady wanted a salami sandwich. He asked \"What number is it?\" I guess the lady ordering was not familiar with numbers so she asks for \"Salami\". Again, he asks for the number for the sandwich. After a few minutes of going back and forth, he says that they don't have a salami sandwich.They actually do have a salami sandwich. Not sure if there is a number, but they definitely have a salami sandwich. There is a big sign behind the cashier's head that says \"Salami Sandwich\". I guess he is too much of a douche to turn his head around and look at the menu. Or, he should already have some knowledge of the menu. He made no effort to look at the menu behind him.The owner of this Lee's Sandwiches establishment needs to step in. Sure it was just one customer that I saw that had a problem, but I can't say how many times this has already happened.Anyway, the food itself is not horrible. It is not really as authentic as it was 15 years ago. Because of this experience, I will gladly travel a little further for better Vietnamese sandwiches and customer service.", "Date": "2014-04-10", "Author_Location": "San Jose, CA"}, {"Author": "Vanessa L.", "ReviewID": "wV-a2D3AX8gPqk0Fk4kbbQ", "Overall": "3.0", "Content": "Stop by here to grab a quick bite after a hike and a drive through Grant Park. My bf has never had a banh mi before so I took him here. We ordered the #5 which I believe is the pork banh mi. I couldn't give it a 4 star because my #1 place for Banh Mi is back on the east coast, no one does it like they do..but for now, this place will do. BF approves. :)", "Date": "2014-04-05", "Author_Location": "San Jose, CA"}, {"Author": "Noelle J.", "ReviewID": "KkkNt_ktzV6aATmozIzZtQ", "Overall": "4.0", "Content": "Noelle's Yelp Notebook 2014Mr. Chieu Le the founder of Lee's Sandwiches first immigrated from Vietnam to the San Jose area of California. I remember meeting Mr. Le once at this location of Lee's Sandwiches on White Road. After placing my order and paying, I remember looking up at the large photo of Mr. and Mrs. Le and realized the man who just helped me was Mr. Chieu Le himself :) When I inquired, he confirmed that was him in the photo and simply laughed. Mr Le- was such a humble, kind and good humored man (RIP).I always think happy thoughts of when I first met Mr. Le ages ago when ever I come to this location. Customers who frequented this location from the start will notice that it's slightly smaller but still large enough to produce the great tasting sandwiches, snacks and drinks. Inside one will note that everything is clean and well maintained.noelle's favorites:ca phe sua dapâté chaudtaro smoothiehot baguettes hot wings#35 Roast Beef#6 Griled PorkI love the fact they sell their ca phe sua da (Vietnamese Iced Coffee) at Costco! On the go- I normally get ca phe sua da or a taro smoothie when I'm out and about running errands. The hot wings are spicy, crispy and delicious! The pâté chaud is a tasty pork meatball inside perfect puff pastry. For a sandwich on the go I normally get the #35 and the #6 for my husband. Food is fresh and customer service is friendly. As a new mom who is constantly on the go, this is a great place to pick up a snack when I'm in the area.They are a CASH only operation.LOVE in 2014,Noelle J.", "Date": "2014-03-18", "Author_Location": "San Jose, CA"}, {"Author": "Phi D.", "ReviewID": "fJyiHeXuGbJR9VeXkx8Otw", "Overall": "3.0", "Content": "Because there are so many vietnamese sandwiches offered in Santa Jose and where im from, i dont tend to order it. I onlyGet banh mi at a place by my house so when i go to lees is for their vietnamese coffee or panda  waffles or the corn cakes with custard. Only Some Lees offer it so u have to do a little research. Usually the lees that have their own store front will.For those who do come here for the banh mi i will say they are pretty decent the only problem is that the bread can be hard and cut the roof of your mouth. But overall the meat and veggies are good. I prefer the bbq and combination.", "Date": "2014-03-31", "Author_Location": "San Diego, CA"}, {"Author": "Sandra H.", "ReviewID": "g_4LXe2sqZbait3OfvWeDQ", "Overall": "1.0", "Content": "I am from the east bay where Banh Mi Ba Le is my go to spot for Vietnamese Sandwiches. I have heard good things about this chain and wanted to try it out since I was in the area. I am so not impressed! I got their #1 special combo. A really long sandwich with your veggies and pork cold meat. The sandwich was really bland to me. There was little pate and peppers. The pork meat had a strong \"pork\" smell, not really sure how to describe it. Just wasn't what I use to. The peppers were VERY VERY thinly sliced - like paper thin, where you can't even taste anything. This like 12 inch long sandwich was not cut in half either. How am i suppose to eat this??The man at the front was really rude. My friends and I walked in, he was on his cellphone. Didn't greet us. A couple of minutes passed. Didn't ask if we are ready to order. This is a huge turnoff for me. Definitely will not be coming back.", "Date": "2014-03-03", "Author_Location": "Oakland, CA"}, {"Author": "Amanda T.", "ReviewID": "LxYEtlWPechBhRFpIQziQA", "Overall": "4.0", "Content": "I felt that this was a decent Lee's Sandwich. The place is a little small though (just to point out). I ordered the grilled chicken and grilled porn banh mi. The transaction was smooth with the cashier; I have nothing to complain about. I went to sit at the tables and I'd have to say I couldn't find one without crumbs though. I mean it's just crumbs from sandwiches; I just brushed it off. Onto the sandwiches! I really enjoyed it! The french bread was crispy on the outside and soft on the inside. I love the way Lee's Sandwiches make their french breads (taste way better than Safeway's). And not to mention the length; it's super long! I guess it makes up for the width aspect of it. In all it was a great sandwich for a great price and I'll definitely buy it again!", "Date": "2013-12-19", "Author_Location": "Davis, CA"}, {"Author": "Robert E.", "ReviewID": "nHaYWPSVcKeE5J8TYVccjQ", "Overall": "3.0", "Content": "It's better than most Fast Good Joints. They don't take credit cards so remember to always have cash ready. Also come early or midday, I don't recommend buying past 6pm - that's just my personal opinion, at least as far as the ready made food goes.", "Date": "2014-04-02", "Author_Location": "San Jose, CA"}, {"Author": "Donn L.", "ReviewID": "_w4Mk3RVzJ_Dk-KZEiyoiA", "Overall": "2.0", "Content": "Not sure what happened here, it became smaller. The guy still seems lost when i order my food, and it im pretty sure i was sick because of the food. I paid 5.25 for a cold sandwich and 2 soft eggrolls. I asked for sweet and sour sauce he only gave me one...asked for another one, he gave me a \"what\" look. I loved this place, for the friendliness and service, but i guess times change?Please...no more cold sandwiches LOL", "Date": "2013-12-17", "Author_Location": "San Jose, CA"}, {"Author": "Pauline T.", "ReviewID": "D32FeNitYQTqNA53NV-XHw", "Overall": "3.0", "Content": "Lee's has great baguettes, Vietnamese iced coffee, and nuoc mia. Make sure you check the sign outside the store to see when they are hot and fresh, though. The sandwiches here are okay. I really like that the mayonnaise they spread is a sweet. It adds a little something to the otherwise dull sandwich. If you want a REALLY good Vietnamese sandwich, try Thanh Huong on Senter Rd. Sooooo good with lots of pate and meat.", "Date": "2014-03-22", "Author_Location": "San Jose, CA"}, {"Author": "Jon O.", "ReviewID": "g8A2STURakGUSK14sVjCTg", "Overall": "4.0", "Content": "Stopped in here for a Banh Mi sandwich and it was delicious. This store is a lot like other Vietnamese sandwich shops out there. You have a choice of several sandwich combinations and they also have a small selection of groceries and junk food to choose from. They also had a couple hot food bars set up but the pickings looked nonexistent on one side and slim on the other. I'd for sure go back here for the sandwich though and if you are near by check it out. All of the ingredients were fresh and the french bread the sandwich was served on was perfect. I would however caution against getting jalapeno peppers on your sandwich. I accidently got a bite of one and it not only lit me up it stayed with me for several hours to come. Also, best part about this place is that the sandwiches are cheap cheap. I think mine was less than 4$ and it will fill you up pretty well.", "Date": "2013-12-04", "Author_Location": "Raleigh, NC"}, {"Author": "Katherine C.", "ReviewID": "azjZ36t902hsO4joQ1GwoA", "Overall": "4.0", "Content": "I don't know Vietnamese sandwiches that well and I've never had them anywhere but any Lee's Sandwiches joint. But there's something about their sandwiches that I just love. When I lived in the Central Coast, I constantly craved these. I've been having them since I was little. However, when I was little I refused to eat the pickled carrots and daikon, or the cilantro and jalapenos in the sandwiches. Wasn't until I grew up that I realized they were essential to the sandwiches. I always get the #1. In fact, I usually order 2 or 3 just so I could eat one then, and then eat one for dinner, and take one to work. I don't know what's special about their french baguettes (that they make and sell on premises and also use for their sandwiches), but they're good. When the fresh baked bread first comes out of their oven, the place is packed and chaotic with people trying to get the bread they came for. On Super Bowl day, a man in front of me was telling people how he was from NY, and heard Lee's bread is one of the best (interesting).  He also said he was buying it to make steak sandwiches. The woman working at the register said they bake their bread at least 20 times a day. I hope I heard right. 20 times? Jeez. Whatever it is, when that bread comes hot out of the oven, it's really easy to just eat the whole thing by itself.", "Date": "2013-02-05", "Author_Location": "San Jose, CA"}, {"Author": "Tee C.", "ReviewID": "5h9TUVVjfqCi6Q4UdGRV4A", "Overall": "2.0", "Content": "Sandwiches are huge for the price. The coffee is strong! However, they put way too much ice and hardly any coffee. When you ask for light ice they don't fill it up all the way with coffee ... Which left me feeling ripped off. Paying 250 for like three sips of coffee. The service also is lacking a lot.", "Date": "2013-09-06", "Author_Location": "Sunnyvale, CA"}, {"Author": "Jasmine P.", "ReviewID": "wmWHhIjQ2qGrXSgQ0ZCFOg", "Overall": "1.0", "Content": "Do NOT come to this Lee's sandwiches. They rip you off, especially on drinks. I ordered a Thai iced tea with less ice and it was literally HALF the cup size.", "Date": "2013-12-22", "Author_Location": "San Jose, CA"}, {"Author": "Huy N.", "ReviewID": "394hIX6toWj3cuy31AMssg", "Overall": "2.0", "Content": "Kids, don't smoke crack.ALL Vietnamese sandwiches are under $3 and Lee's is the worst place to get one.Check it out: yelp.com/search?find_des…Thanh Huong, Houng Lan, Saigon's and Dakao smack the yellow out the face of Lee's.Please, people, I beg of you.  TRY a different VN sandwich and you'll know what I mean.  Lee's is like the McDonald's of VN food.  At least McDonald's has low prices in volume.  Lee's has the same prices as those other places I mentioned and not even close to the same quality.I cry for those who think Lee's is the end all of VN sandwiches.  Remember, Lee's Sandwiches started as a roach coach outfit and expanded into banh mi stores.  Do you really want roach coach food?", "Date": "2007-07-08", "Author_Location": "Santa Clara, CA"}, {"Author": "Donna Z.", "ReviewID": "3Gp7W0df0M9sBXIHmm2tjQ", "Overall": "3.0", "Content": "BBQ Pork Sandwich (beware of stink breath afterward)Fresh BaguettesFresh (and huge) Croissants    Open Daily 7am-9pm=Good food on the cheap", "Date": "2008-01-20", "Author_Location": "San Jose, CA"}, {"Author": "Mimi L.", "ReviewID": "7tv9bFDp-CUxLJXXs5OPyg", "Overall": "2.0", "Content": "I hate myself every time I order a drink here. Their $3.50 ca phe sua da, coffee with condensed milk, is more expensive than their sandwiches. If you buy the whole can of Cafe du Mond coffee at Lee's, it is like $4. *smdh*All of their drinks are actually $3.50. Ask for less ice and you will see how little drink is actually in there since it's already portioned out to about 1/3 of the cup.", "Date": "2011-08-15", "Author_Location": "San Francisco, CA"}, {"Author": "Gloria T.", "ReviewID": "mUQ0jsR7r10qlFk_c9Smvw", "Overall": "3.0", "Content": "Back in my Evergreen days, my friends and I would frequent this place. We were always low on cash and I didn't think they'd want to go anywhere more hardcore. The store always looks clean and they have a touch screen system and a little voice calls out your number when your order is ready. The sandwiches are ok, but I've found cheaper and better before. The real draw is their large selection of snacks. Spring rolls and Grass Jelly, YUM! It was a downer when my friends mom found a cockroach in her sandwich. We didn't go there for about a month after that. Then we decided, well WE didn't find the roach.", "Date": "2009-04-25", "Author_Location": "San Jose, CA"}, {"Author": "Janice Q.", "ReviewID": "V4Sfk2LQd34zkuJhaUsCYA", "Overall": "1.0", "Content": "This location in particular is just... Ugh.I always get The BBQ pork sandwich. The meat here just tastes weird, like it's not fully cooked or something. I lose my appetite mid-sandwich (or sooner).Also, the cashier boy that was there the last few times I've been there must either be very confused, incredibly lazy, or both. I tried ordering milk tea, and he tells me they don't sell that there. Um, it's clearly on the menu, and why is it that every other Lee's sells it?Anyway, the last time I was there, I decided to order an iced coffee after being told yet again that they don't sell milk tea. Instead of walking to the back to make one, he gives me a cup (and the only cup) that was already sitting on the counter behind him, with the ice melting and everything. I get that their iced coffee isn't exactly fresh, but OH. MY. GOSH. For all I know, that could have been someone else's order that they either got wrong or didn't like and returned. With the type of service I've been witnessing, I wouldn't disregard that possibility at all.", "Date": "2013-09-09", "Author_Location": "San Jose, CA"}, {"Author": "Quyen T.", "ReviewID": "EQxjWcnc6srktxecsGjRsA", "Overall": "4.0", "Content": "San Jose really has come of age when every 10 minutes or so you realize that you've passed another Lee's Sandwiches.  Back in the day, we'd have to drive all the way to Downtown SJ to even get our hands on these sandwiches.  And now, there's one right around where my parents live.  SWEET!There are very few places where you can get sandwiches for less than 3 bucks.  I like the grilled chicken.  I tell them to keep it light on the mayonnaise and to hold the chillis.  I stay away from the char-siu (Chinese sweet and sour pork - kinda greasy and fatty!).  But grilled pork is also good, as is the vegetarian version (tofu and other good stuff).  Other good treats - spring rolls to go, sweet desserts (Vietnamese cakes and other goodies), very strong Vietnamese coffee! Minus one star for the Vietnamese wannabe ganstas who gawk at every chick who walks across the storefront and who sip coffee (the same cup) all day long.  Get a life!  I'm a married woman!", "Date": "2007-05-27", "Author_Location": "Berkeley, CA"}, {"Author": "Janet N.", "ReviewID": "6C6yq0EUYWwKmlkA9zWreg", "Overall": "4.0", "Content": "Obviously if you live in San Jose you all know where the real Vietnamese sandwich shops are like: Huong Lan and Thanh Huong just to name a few.Lee's on the other hand is Americanized Vietnamese, but it doesn't mean it's completely bad. I usually come here for their fresh french rolls for when my family makes large pots of Vietnamese Ragu and the occasional desserts they carry here like Flan, Pandan Jello and Coconut Jello in a coconut.I've been craving Xiu Mai and opted for the Xiu Mai Sandwich (7). It came out hot and topped with loads Do Chua (pickled carrot & daikon), stems of Cilantro and slices of fresh Jalapeno. The bread itself was softer than expected although these sandwiches are not the french rolls. The bread Lee's usually uses for it's sandwiches are hard and leave crumbs ... everywhere.The sandwich was about a 7 inches and only cost $2.75. It was pretty damn good! Good cheap eats!CASH ONLY", "Date": "2012-06-05", "Author_Location": "San Jose, CA"}, {"Author": "Mary T.", "ReviewID": "lGA-nSDpA_jdO7qXEh8dWQ", "Overall": "1.0", "Content": "I don't know why I did this to myself.. I thought thanh houng was too far of a drive since I only have a 2 hour break and lees is right around the corner.I completely bamboozled myself with crappy food because I was being Stingy on gas. :(The sandwiches SUCK!  I am no expert on Vietnamese food but I know quality when I taste it. . I honestly don't want to talk about it because there is nothing good to say.Help me, help you. Don't go here.", "Date": "2012-10-25", "Author_Location": "San Jose, CA"}, {"Author": "Tina N.", "ReviewID": "zypWgPbrhlWOAi3wysPl9w", "Overall": "1.0", "Content": "Tina's Evaluation:   Taste: ( D  )Authenticity: ( F ) Portions: ( C )Service: ( B )Ambiance: ( B )Price: ( B )Comments:When I go to any ethnic restaurant I base it on the authenticity of the dishes they serve at the place. Lee's Sandwiches are faaarrr from authentic! Yes they are located at convenient areas, but \"banh mi\" on baguettes...come on now! It's just their way of being shystie. Well, it would be one thing if the baguettes were soft on the inside and crunchy on the outer crust...but they are hard as steel. Let's not get into it about their desserts now. What country did they get the ingredients from? Best places to get \"Vietnamese\" sandwiches would be at a little viet deli like Huong Lan or Thanh Huong, etc...My comments are the same for the other Lee's Sandwich places. As I said they are more convenient to get to and yes I have tried them all. Same story. The drinks are good though. J", "Date": "2007-06-06", "Author_Location": "Los Gatos, CA"}, {"Author": "Amy D.", "ReviewID": "HOeSxBQSFiiw8Wny5nJBIA", "Overall": "4.0", "Content": "While you don't get the friendliest service, the sandwiches are definitely tasty and cheap ($2.95 total, for lunch!). After eating all 10 inches of my #5 grilled pork sandwich, I contemplated how many calories I'd just consumed. I just looked it up on the Lee's Sandwiches website-- only 300! leesandwiches.com/2008/m…I'm really curious to see what the other sandwiches taste like. Maybe next time?By the way, they sell Oishi Ridged Cracklings Salt & Vinegar here, which are my favorite snack from the Philippines.", "Date": "2010-01-14", "Author_Location": "Brooklyn, NY"}, {"Author": "Enrique C.", "ReviewID": "Fkdv0N-Y7NFFaEdEoFW-ew", "Overall": "3.0", "Content": "I know I don't speak Vietnamese but I feel like that's no reason not be friendly with a paying customer, especially one who loves bread as much as I do.  Seriously.  Usually the baguettes are hot and ready to go but occasionally you have to wait for them to come out of the oven.  On more than one occasion I've ordered other pieces of bread (bolillos and croissants) and the guy at the register has kept my change.  I asked for change once and he looked at me like he forgot how to speak English.  Despite the occasional poor customer service the baguettes are still $2 cheaper here than at the Luckys supermarket a few doors down.", "Date": "2012-09-30", "Author_Location": "San Jose, CA"}, {"Author": "Sabrina E.", "ReviewID": "kO6s13NMiaPJUzX0Gg1KRA", "Overall": "5.0", "Content": "This was my first exposure to lee's sandwiches. They are some of the best sandwiches on earth and they are all under 3 bucks. I really enjoy the grilled pork sandwich and i like to accompany that by a fresh soy milk.And if you're not in the mood for a sandwich, these baguettes are amazing. and also super cheap.This location is actually expanding and I cannot wait.", "Date": "2006-04-11", "Author_Location": "San Francisco, CA"}, {"Author": "Mitchell F.", "ReviewID": "vjLQwNfkF4sab0vP8oMiUQ", "Overall": "4.0", "Content": "Cindy, If you're reading this... I'm rating your store a 4 juuuust for you. Okay, friendship aside... The prices are perfect for what you get. The food on most days are great, however one summer I did get turkey sandwich... with ants. Anyways, I'm over it.", "Date": "2008-10-10", "Author_Location": "San Jose, CA"}, {"Author": "Miss H.", "ReviewID": "Lfetekm8MCZqQEdv4A0mng", "Overall": "3.0", "Content": "I don't know what's up with my fondness of non-Vietnamese Vietnamese places (Lee's) & non-Chinese Chinese places (Panda Express) -- I guess I'm just not in touch with my roots :(My aunt always tells me there is a really good Vietnamese sandwich place in the plaza next to Target on Silver Creek but I insist on driving to Lee's. Perhaps the comfort of being able to order a #4, rather than asking for a banh mi ga nuong (or however you say it), is worth the drive!The sandwiches are decent -- standard for Lee's. Relatively speedy service -- standard. Iced coffee -- WTF. First it seems like they're ripping you off because the cup is only 1/3 full and they fill the rest with ice but after one sip, you KNOW why they fill it up with hella ice -- it's sooooo artificially, strange tastingly (yes I made up a word!) sweet. I bet they're dumping in half Torani syrup so they don't have to use that much real coffee and then charging 19273126x what they spend to make it....but we all know I'll keep going back, haha.", "Date": "2008-07-02", "Author_Location": "San Francisco, CA"}, {"Author": "Evelina C.", "ReviewID": "-kQtKHkPDdr5cI9HjRMeyQ", "Overall": "5.0", "Content": "I don't know about the other reviews on this page, but this location has never failed to deliver for me.The shop is clean, service is fast, and the sandwiches are delicious! The #1 is my personal favorite, and I've always found it to be full of meat with the perfect combination of crispiness (of the pickled carrots and radishes) and the meat, and the pâté.... yummm... I'm craving one right now.I'm giving it 5 stars because I like their sandwiches so much. I've never tried anything else though, but it looks good.", "Date": "2009-09-07", "Author_Location": "San Francisco, CA"}, {"Author": "Derek S.", "ReviewID": "ZNiHHeuIlnPHOUaNZ5CacA", "Overall": "3.0", "Content": "Came by for some Vietnamese coffee after lunch. The famous Lee's coffee is delicious and strong as always.The interior is dirty and messy. It seems that they just put a new flat screen TV in the seating area.Cash only and remember to clean off your table before sitting down!", "Date": "2011-01-17", "Author_Location": "San Jose, CA"}, {"Author": "Ellen G.", "ReviewID": "Ta-p3AAq_TLTYv1UZd_KUg", "Overall": "3.0", "Content": "The baguettes are amazing. Usually they're fresh out of the oven and smelling delicious. The price used to be only $1 for a baguette, but they have recently upped the price 25 cents. Okay, it's only a quarter, but that's still a 25% increase! Well, I'll still buy it because it's so good.The other thing I love from Lee's is the #9, aka the sardine sandwich. It's the only one I order, so I can't vouch for how good or bad any of their other sandwiches are. No one else understands or appreciates my love for this sandwich. My boyfriend particularly hates it. Maybe I'm the only person on earth who loves the fishy goodness, but I really do! Although predictably it gives you some major dragon breath.Also, they only accept cash, so come prepared.", "Date": "2008-02-13", "Author_Location": "San Jose, CA"}, {"Author": "Eric T.", "ReviewID": "r3JkFjUS_NCClbCXvm-1ZQ", "Overall": "1.0", "Content": "The \"Iced Coffee\" here is nothing more than coffee 'flavored' milk.  And its only $2.50 + tax for a cup of this iced milk that has a super milked out taste with a hint of what may or may not be coffee.  I can't comment on the on the substandard quality of thier sandwiches, but several people here can. Keep reading.", "Date": "2007-10-12", "Author_Location": "San Francisco, CA"}, {"Author": "Jessica S.", "ReviewID": "V22OLSEbKM-jfYtezohzhw", "Overall": "1.0", "Content": "Cheap, dirty, and uncomfortably cramped.  The first time I came here about a year ago, I thought this was such a gem.  I got a honeydew slush with pearls, I believe?  Mmmmm it was so good.  Tasty, flavorful, with just the right amount of sweetness--it was a little pricey, but really worth the extra $0.50.  Now, fast forward a few months later.  Bolstered from the honeydew slush success, I confidently strolled in here to grab a quick thai milk tea (tapex wasn't open yet and Quickly was just too far away).  As always, I asked for no ice in my milk tea.  Now, I do understand that Lee's Sandwiches may not be the optimal place to get milk tea... but they only filled my (SMALL) cup up HALFWAY with liquid.  LESS than halfway.  I drink my boba fairly slowly, and this would only have taken me about three sips to finish.  AND it cost around $3.  I stared at the pathetic amount of liquid in my cup, unwilling to believe that they would hand this to me and call it a thai milk tea.  I'm not usually the confrontational type, but this time I turned around and questioned them about my drink.  They said that since I had asked for it with no ice, that was all I was going to get.  Cheapskates.  I stalked out of here, narrowly avoiding the flies that tried to get into my cup.", "Date": "2010-06-24", "Author_Location": "San Jose, CA"}, {"Author": "Rhoda G.", "ReviewID": "jsDKTfEy28DSvAwgffnF0A", "Overall": "3.0", "Content": "If I want to eat something relatively cheap near my parents house, I come here because I don't want to eat at McDonald's.I'm not going to claim these are the best Vietnamese sandwiches around here because I don't eat them often enough to make any comparisons. However, BBQ Pork sandwich (#6) definitely hits the spot if you are hungry. Also I always tell them to remove the peppers because I don't like my mouth burning with every bite.", "Date": "2009-03-21", "Author_Location": "Raleigh, NC"}, {"Author": "A Good Customer C.", "ReviewID": "lKQBWWZ2pndOfbBjALvsQQ", "Overall": "1.0", "Content": "On our last visit we made it 20 minutes before they were closing. The lights were turning off and they were closing the door as we walked towards it. We got excited when the young worker welcomed us in. We thought that was nice of him (but questioned our selves why were they closing? there's still 20 minutes left). While we were ordering the older cashier was rude and displeased. He was taking the money out of our hands while we were mid order. He hadn't even put in our total in the register when he already had our $10.00 bill in his hand. Wow", "Date": "2011-04-03", "Author_Location": "San Jose, CA"}, {"Author": "David W.", "ReviewID": "1HbhTOIGtx6w92TNKB4ERA", "Overall": "3.0", "Content": "It seems like a love it or hate it kinda place.  I love the Turkey on a crassaunt.  The only problem I've ever had is they consistanty mess up my order.  How can you go wrong with numbers?  #22 and I get a #24 and so on.I'm going to keep it a 3 but yesterday they forgot the pearls in the smoothies which cost .50 more per drink.  I was just out of the parking lot so i took them back and they added the pearls in and gave me a free bagget.", "Date": "2009-04-06", "Author_Location": "San Jose, CA"}, {"Author": "Claire W.", "ReviewID": "b-Ufk2dQ6IlVzF_j62PYEA", "Overall": "1.0", "Content": "DONT GET THE SUGARCANE DRINK. Their sandwiches and other food are fine (the one on King rd is better). Workers are rude and calculate the price of your order before you're not even done ordering. And this was on a Sunday morning, not busy at all. Sugarcane drink experience:First the sign says 'fresh sugar cane'- I saw them bring out a box of frozen sugar cane. Fair enough, I can deal with that. Second, the machine doesn't look like it has been used in a LONG TIME. I was watching them the whole time. They splashed water on the machine (not very smoothly either, the water was spilling all over the counter and the floor), and out came dirty water. They repeated this step several times, but after watching how disgusted their face was with \"cleaning\" the machine and how dirty the water came out of the machine was, I lost my appetite. When they actually put in the sugar cane in, I'm not confident at all that all the juice that came out was actually from the sugar cane that was used for my drink. \"cleaning\" was only throwing water into/on the machine to force the dirt out. Seriously, you need to go in there and actually take out all the gunk that is probably moldy... I'm guessing their manager wasn't there to see this. Ridiculous.", "Date": "2012-11-04", "Author_Location": "San Jose, CA"}, {"Author": "Lozz Y.", "ReviewID": "bXu4Ffh20SaB0toxMubyUA", "Overall": "1.0", "Content": "This place is just terrible now. I ordered a sandwich just the other day and I only had to wait less than two minutes before it was ready. When I went to eat the sandwich it was a struggle because it was terrible. The bread was cold and chewy. It was probably from the other day and they did not even bother to heat it up again. The meat was also chewy and seems to have been sitting around. I remember when the sandwiches here used to be really good. They used to be warm with crunchy bread that did not hurt when trying to chew. I recommend not eating at this place. They have lots of bugs and rather unfriendly workers.", "Date": "2009-12-16", "Author_Location": "San Jose, CA"}, {"Author": "Aaron L.", "ReviewID": "LGPIJpTDLNSXmxPbd6WKww", "Overall": "1.0", "Content": "So I go to this place with my Dad and go here a lot. I ask for an iced coffee with just a little ice, and specifically say, \"can I get that without too much ice? I don't want the whole cup full of ice.\"....sure says the cashier. I get my drink, take one sip off the straw, and the whole cup is full of ice. Literally a sip of iced coffee for 3.50 are you kidding me. So I ask the guy, I asked for a little bit of ice and he says, \"sorry the machine measures it out\". Why didn't you say that when I asked! I got one sip for 3.50 what a waste. Poor communication skills, failure to communicate, and no offer to reimburse or get me something else. They got my 3.50 and will never get my business again.", "Date": "2013-04-24", "Author_Location": "San Jose, CA"}, {"Author": "Michelle Denise P.", "ReviewID": "VCfe4d4jR_AMVlaCWd3mfA", "Overall": "3.0", "Content": "I always get the pork bbq sandwich. $2.79. Can't beat that.And when I'm craving spring rolls I'll come here.3 overly stuffed shrimp spring rolls with peanut sauce for around $3 is great for me.Service is quick.I have yet to try other things out on the menu.", "Date": "2010-11-15", "Author_Location": "San Jose, CA"}, {"Author": "Shirley V.", "ReviewID": "wHJQeg6UOMdx8NLKSeRWlA", "Overall": "2.0", "Content": "2 stars for the only 2 things I get at Lee's: Vietnamese iced coffee and fresh $1 baguettes. Compared to other Lee's, this location seems to have fresh baguettes out the oven (or warm at least) most often. Perfectly crusty warm exterior gives way to a fluffy, deliciously carbtastic interior. If you want a sandwich, I suggest you buy one of these bad boys (or girls..?) + your own sandwich fixings. Do not, I repeat, do not get sandwiches here. They seem to be following some inverse proportionality of quality&amount with price. No go, bro. My condolences to you if you lost your Vietnamese sandwich virginity to Lee.As for the iced coffee. The stuff is deliciously strong, bitter, and sweet. I usually get one cup without ice (it only goes up to 1/3 to 1/2 of the cup), stick it in my fridge, and it's enough to last me the week. (I drink coffee daily, but in rather small amounts.) Again, coffee + baguettes. Omnom.", "Date": "2011-08-30", "Author_Location": "San Jose, CA"}, {"Author": "Aaron L.", "ReviewID": "LGPIJpTDLNSXmxPbd6WKww", "Overall": "1.0", "Content": "So I go to this place with my Dad and go here a lot. I ask for an iced coffee with just a little ice, and specifically say, \"can I get that without too much ice? I don't want the whole cup full of ice.\"....sure says the cashier. I get my drink, take one sip off the straw, and the whole cup is full of ice. Literally a sip of iced coffee for 3.50 are you kidding me. So I ask the guy, I asked for a little bit of ice and he says, \"sorry the machine measures it out\". Why didn't you say that when I asked! I got one sip for 3.50 what a waste. Poor communication skills, failure to communicate, and no offer to reimburse or get me something else. They got my 3.50 and will never get my business again.", "Date": "2013-04-24", "Author_Location": "San Jose, CA"}, {"Author": "Susan Y.", "ReviewID": "vglJFSZ7WqdN3yx9Hrq1IA", "Overall": "4.0", "Content": "This is the only Lee's I've been to. It's close to home and my family come here pretty often and they've been consistently good. This place is clean and bright inside and the baguettes are fresh and yummy. The baguettes sliced are always a hit for dinners and gatherings such as Thanksgiving. I usually order the grilled chicken or the veggie. They're both good, but your clothes will smell after eating any of the Asian sandwiches, so that's something to consider before choosing what to eat hah. Unfortunately the thit nuong sandwich isn't how I like it, and for that I'll go to Dakao. Their Vietnamese iced coffees and smoothies (with or without pearls) are really good thoughl. AND they fill it to the top which already earns points in satisfaction before you even take a sip.I think I remember them taking cards before, but today I found out cash only! So stop by the atm before going here! If your out of paper money, and you're part of BofA, luckily there's one in the Lucky's next door.", "Date": "2008-06-12", "Author_Location": "San Jose, CA"}, {"Author": "James N.", "ReviewID": "U3j0NZPR6oel2aKpgVDZqg", "Overall": "1.0", "Content": "Like all the Lee's Sandwiches chains I seen. Lee's is the worst of worst of all Vietnamese sandwiches.The quality of the all the stuff they put into a French roll is absolutely horrible. I would recommending going somewhere else for your sandwiches. Their sandwiches are consistently bad, you dont have the right balance in favor and texture when you bite into a Lee's. One Star since sometimes their fresh bread is good.Since this place is located in San Jose, there's tons of other alternatives Vietnamese sandwich shops. If you want to travel I recommend Oakland's Cam Huong.", "Date": "2007-10-09", "Author_Location": "Union City, CA"}, {"Author": "Elaine T.", "ReviewID": "syg688pMerg0bTXcQThkaA", "Overall": "1.0", "Content": "So...Lee's has become a household name, even across different cultures. Once upon a time, the sandwiches here were our weekly Friday dinner. Now, don't you DARE bring a Lee's sandwich into my home! Aside from the baguettes (which we will continue buying because they are delicious), the sandwiches have gone downhill so much I don't even know where to begin. I ordered a Banh Mi Thit Nguoi and as the name states, it was practically only banh mi and some thit nguoi. Skimp on the sides much? There were only a few pieces of pickled veggies in my sandwich. I was eating a very....naked sandwich and sad at that. Also, it's as if this place tries to hide it's dirtyness by drawing your eyess to the bright lights and shiny marble countertops. You don't trick me! Take what I say for face value: the ONLY fresh food item here are the baguettes!!! Everything else is well-stocked and never sold aka OLD.", "Date": "2011-05-31", "Author_Location": "San Jose, CA"}, {"Author": "Dang-Khoa H.", "ReviewID": "ln47GqL7_ORz16whW6Qnog", "Overall": "2.0", "Content": "Located in an awesome place next to Lucky's right off of Aborn and White. I been there a couple of times to get sandwiches and coffee. The place is good to dine in, but I ain't so thrilled.The bread... always hurts my gums. It's toasty but in a bad way.I rather drive a bit further to King road if I was feeling Lee's,or just drop by a different Vietnamese Banh Mi shop.", "Date": "2008-07-31", "Author_Location": "San Jose, CA"}, {"Author": "Leilani N.", "ReviewID": "2ooF2bc0y7xJXMCuyImwlA", "Overall": "2.0", "Content": "I usually see flies living it up on uncovered waffles and bread, but one day I saw a fly packaged in one of their spring roll dishes on the counter. Combined with the plummet of their food quality, their once cheap prices are now ridiculously inflated. And it also doesn't help that they don't offer real pearl drinks, but simply blended ice cream; and load their drinks up with ice so they don't have to put as much liquid.  There are way too many better places for vietnamese sandwiches and drinks.", "Date": "2009-06-13", "Author_Location": "San Jose, CA"}, {"Author": "Katie N.", "ReviewID": "VV09R0yozUigDswFQlQzCQ", "Overall": "3.0", "Content": "#1 and a Thai Iced Tea pearl drink, please.Besides the fact that they put way too much ice in their drinks, I'll always come back for the sandwiches. And don't expect any service from this place.", "Date": "2009-02-17", "Author_Location": "San Francisco, CA"}, {"Author": "Marvin N.", "ReviewID": "_T_krEQe28Lru1o9L4N0Pw", "Overall": "3.0", "Content": "I start this review with predigest, I'm not a fan of Vietnamese food.  I've tried it several times and it's not for me, not only the food but the smell itself (sorry to those that love it if I offend).  I admit today I was going to try it because it was a free lunch brought to the office and how can you turn down a free lunch that is delivered and all you have to do is eat it.  I was given the BBQ Pork sandwich and after looking it over with a weary eye I took my first bit and it was good.  Actually it was very good.  Am I a convert to Vietnamese food? No, sorry it wasn't that good, but it was tasty.  The portion size was good and the vegetables were fresh.  I especially liked the bread, not to hard, not to much it was just right.I will definitely try it again.  I see there are several locations with varying reviews (like many chains) but this one was good and worth going to again.", "Date": "2011-02-17", "Author_Location": "San Jose, CA"}, {"Author": "Wilma G.", "ReviewID": "0XaoGSyvLFORoyrtEeT_BQ", "Overall": "4.0", "Content": "Oh I love going to this place for a sandwich fix!  The bread is fresh, the filling is tasty, and it's hella cheap!  The sandwiches are big so you'll definitely be full.  I always get the grilled chicken sandwich and I've never had a problem- with the way it tastes or with customer service.    I'm going to miss Lee's when I move back to San Diego =(  They don't have a store there.Just so you know, it's cash only.  Lucky's is next door if you forget your cash!", "Date": "2011-05-29", "Author_Location": "San Diego, CA"}, {"Author": "Lily N.", "ReviewID": "JTILoJLSWEYWHTbtf5c3DQ", "Overall": "4.0", "Content": "This is one out of 2 respectable Lee's to eat at. Other places just seem to not put in the care for the sandwiches as much as this one. It always taste more fresh here.Watch out for items you buy here like random cookies and what not. I guess they dont keep their eye on it but one time i was in and a customer came back in returning a Grandma's Cookie he purchased because it was expired already.", "Date": "2008-05-20", "Author_Location": "San Jose, CA"}, {"Author": "Tin F.", "ReviewID": "gBsIc3SYahn3LTbn3soN-g", "Overall": "1.0", "Content": "I came in here this morning before work to get some baguettes and thai iced tea.  I was the only customer in there.  The cashier took my order, said something to the guy working on the bread (it was in vietnamese) and just stood there for awhile.  I thought she told the guy what I ordered, but she apparently didn't. After a few minutes, she made my drink and handed it to me.  Another customer came in and she took his order.  I was standing there and she asked me if she could see my receipt, I handed it to her and she told the guy something and he gets my baguettes. WTF, you forgot my order when I was the only one in there?? Come on now, It took over 7 minutes to get a Thai Ice tea and 3 baguettes(the baguettes were already made).   Maybe get someone competent enough to take orders.This place sucks.", "Date": "2011-05-15", "Author_Location": "San Jose, CA"}, {"Author": "Ally W.", "ReviewID": "gTE2Kd93dUAw_pDam0DRtw", "Overall": "5.0", "Content": "Honestly, I am really surprised at such negative reviews for this location. Yes, their prices have gone up, but I say 3.50 for a sandwich is still a good deal. And this is an Americanized Vietnamese sandwich place, so if you're expecting any other type of food, you will of course be sorely disappointed. I am a fan of #4 grilled chicken sandwich. When I feel like eating something filling but not too much and economical, this is the first stop that comes to mind.", "Date": "2012-02-21", "Author_Location": "Santa Clara, CA"}, {"Author": "Rea C.", "ReviewID": "BUSRJvQ0L4DMF1C3VLw2QA", "Overall": "4.0", "Content": "I've been coming here occassionally since I was in high school and I still visit whenever I'm in town. A lot of people say that there's lots of flies landing on the food that's out but I've never witnessed it out of 6 years I've been going here.I THINK they accept credit cards, but there's a $10 minimum. I'M NOT SURE SOMEONE PLEASE CORRECT ME IF I'M WRONG .__.;;Anyways, here's a short review:PROS:- cheapest Lee's Sandwich I've seen (only by like 25 to 50 cents)- although smoothies are powder-based they're better than ALL powder-based smoothies I've tasted :PCONS:- not as many choices as other Lee's Sandwiches- they leave the ice in a bin. I don't think it should be out in the open like that.OTHER COMMENTS:- no cucumbers in their sandwiches (I know the one in Cupertino has cucumbers in their sandwiches)- workers aren't \"young\" (\"young people\" that work are usually either annoying and don't do anything or really helpful and do everything. Hooray for ageism.)This place gets a 4 because I am a fan but not a 5 because it does have room for improvement :)", "Date": "2009-09-21", "Author_Location": "San Jose, CA"}, {"Author": "Oyster H.", "ReviewID": "drx6kp1eei7s2aCf9Af8Pw", "Overall": "1.0", "Content": "Basically if you didn't know its supposed to be a Vietnamese sandwich shop.  It's not. It's a white wasted sandwich chain shop that caters to the america taste palates.  Meaning its bland and they skimp on the meat.  The coffee is the sucky powered stuff.  How much are you saving by doing this Lee Sandwich?Come on please.  Why go here?  Sure I understand it you were in the boonies somewhere and need a some banh mi and ca phe (vietnamese sandwich and coffe) fix  then it make sense to go here.  But look around, there are like at least 1 authentic Vietnamese sandwich shop with much better quality within  2 miles radius of wherever you stand in San Jose.Eat quality when you can and enjoy life.", "Date": "2011-09-11", "Author_Location": "San Jose, CA"}, {"Author": "Monica M.", "ReviewID": "48SfxZbNU8jKMT8Liby6JQ", "Overall": "4.0", "Content": "Mmmm their sandwiches are super filling and yummy. Im not sure about their vietnamese sandwiches but the american/ traditional sandwiches are great! - got the salami and cheese , it came with mayo, lettuce, tomatoes, pickle, and a pepper. The portions are huge and they are not stingy on the meat! It was filling for me all day. Not bad for$4.75.", "Date": "2013-03-05", "Author_Location": "San Jose, CA"}, {"Author": "Esha P.", "ReviewID": "BwuuM0202q6vU8OGuN-ayw", "Overall": "4.0", "Content": "Great sandwiches, for a very reasonable price.Really friendly staff.The food can be a bit too greasy, though.", "Date": "2007-01-06", "Author_Location": "Boston, MA"}, {"Author": "Kevin H.", "ReviewID": "RKA4gKUCnqyO1JqIFyqDPg", "Overall": "4.0", "Content": "Staff/Employees-4*;Very alert and helpful, esp. the ones at the cashier!Food-5*; Great choices and prices. (Reccomend Roast Beef Croissant, I've been eating it for years xD)Tidyness/Cleanliness/Decor-4*; Very nice, simple decor, plenty of seating.", "Date": "2010-08-29", "Author_Location": "San Jose, CA"}, {"Author": "Tone Q.", "ReviewID": "9YQQm-TfWt0c6WTGrb9S_Q", "Overall": "1.0", "Content": "I got to say Lee sandwich shops are cool when they first open, but go down hill after a couple of years and that goes for all locations. This place was clean the first couple of years and now it is hella dirty!!! Dead flys on all the window ceils and the floors no better. The staff is cool, but it all depends on who is behind the counter taking your order and money. The one I dealt with threw my change on the counter after holding out my hand for her to place it in.If the front of the house is that dirty I would hate to see the back of the house!!! To recap this place was cool back in the day, but I would have reservations now eating there....But I did notice a decline in all of the Lee spots", "Date": "2011-04-28", "Author_Location": "San Jose, CA"}, {"Author": "Juliana C.", "ReviewID": "axlNmNce3R7OkbtfAmncmQ", "Overall": "1.0", "Content": "Dropped by the other night to pick up a baguette to accompany my dinner and got a little bit more than I expected. I was browsing the items on the counter while waiting for the baguette and decided to pick up a rice cake for closer inspection. However, when I moved it a SWARM of fruit flies rushed out. Needless to say, I was disgusted and will think twice about coming back here.", "Date": "2009-11-23", "Author_Location": "San Jose, CA"}, {"Author": "Sheila S.", "ReviewID": "woo1ywtxtTJFy3v2-Sk5Sw", "Overall": "1.0", "Content": "Okay so I was craving Lee's sandwich today.  As usual I order the #4.  So I'm enjoying my sandwich and as I was gonna take another bite I saw something in my sandwich.  \"What the heck is that?\"  I said to myself.   Gross---a dead fly.  That totally ruined my appetite.  I go up to the cashier and told him there is a fly in my sandwich.  He go gets another employee and they're examining the sandwich.  They look at me as if I'm the one who put it in there---WTF?  After looking at the sandwich they finally throw it away.  The cashier says \"sorry\" with a big smile.  Asks me if I want another sandwich or my money back.  Dude...I've already lost my appetite---just give me my $3.00.  This review is just for this day otherwise their sandwiches are pretty good.  Love their iced coffee.", "Date": "2008-07-25", "Author_Location": "San Jose, CA"}, {"Author": "Noel M.", "ReviewID": "BIXRtrFYPfolxD6-Js9vtw", "Overall": "4.0", "Content": "My last review said I wasn't too fond of the baguettes.  That was before I started getting them fresh for home consumption.  Baked every 30 minutes for only $1 how can you go wrong?  I was looking forward to trying the croissants fresh but the one I got was cold.  No worries though, I took it home and popped it in the microwave for a second.  With that much butter in it, it was good as new!", "Date": "2009-11-06", "Author_Location": "Milpitas, CA"}, {"Author": "Jessica R.", "ReviewID": "pvtzr5ifMlvQ6fo4jk6tWg", "Overall": "4.0", "Content": "Always good to go here for a quik snack or lunch. Can't go wrong with their pork buns with iced coffee or their  croissant sandwiches with a pearl smoothie drink. Plus, they move fast here :)", "Date": "2012-02-21", "Author_Location": "San Jose, CA"}, {"Author": "Crystal V.", "ReviewID": "sRRbsHc0tEZW7Vvkd9F4OA", "Overall": "1.0", "Content": "I wish I could give them zero stars. One of the worst sandwich places ever. Great bread, but they never get my order right. How hard is it o get turkey and cheese with no mayo, dry and plain? And no pickle on the side because I do not like them? Not that hard, but I always check and I seem to miss the mayo, but I am already home! And I tried their honeydew pearl tea and it had weird chunks in it, not fruit, and my pearls were hard, they're supposed to be soft and chewy not hard! Do not recommend..", "Date": "2011-04-25", "Author_Location": "San Jose, CA"}, {"Author": "Jonathan T.", "ReviewID": "n2fIFkhrkE2hRy1YAh9_BA", "Overall": "2.0", "Content": "I used to go to this Lee sandwiches alot and they have good smoothies and some okay desserts. However, you come for the sandwiches and to be honest it's not really the best you can have. Huong Lan sandwiches is not that much farther from here and would be a better choice if you're looking for Vietnamese sandwiches. The cashiers at this location are nice and it doesn't get very crowded here either. There's something about their sandwiches that kind of cause the roof of my mouth to start to slough or have this weird feeling as if it's scraping my mouth. In general I am not a fan of the baguettes they use to make their sandwiches here but if you're looking for smoothies or some quick lunches this place is okay.", "Date": "2013-02-21", "Author_Location": "San Jose, CA"}, {"Author": "Lisa M.", "ReviewID": "76Zjg9GX7EzLq1e--QwLKA", "Overall": "5.0", "Content": "I always have cravings for there grilled pork sandwich. I cant eat the BBQ pork anymore bc its just too fatty. The smoothies are pretty damn good too.The best is the Viet Ice Coffee.", "Date": "2006-09-18", "Author_Location": "San Jose, CA"}, {"Author": "Algier R.", "ReviewID": "O1mP8lqGKsD3kn5auxVF0Q", "Overall": "4.0", "Content": "If your from san jose you know of lee's sandwiches. The bread are always fresh and hot. The price can be cheaper. I remember when it use to be a dollar!  They also have other vietnamese dishes which are ok. I would recommend to go in rite at lunch time so its still hot.", "Date": "2012-07-24", "Author_Location": "San Jose, CA"}, {"Author": "Sandra C.", "ReviewID": "FqzAPxDA7pDb4O0dyFWteQ", "Overall": "5.0", "Content": "5 stars for the iced coffee alone! Sandwiches are tasty as well.", "Date": "2008-11-07", "Author_Location": "San Jose, CA"}, {"Author": "Nana B.", "ReviewID": "YGxG5KHNEpQvwS1KSTwiZw", "Overall": "4.0", "Content": "Four stars because it's convenient. Fast and fresh and cheap and yummy. I know this place gets backed but 4:30 on a Monday afternoon and we were the only ones in there.", "Date": "2010-08-23", "Author_Location": "Glendale, CA"}, {"Author": "vishal k.", "ReviewID": "PgFvu868BqpXOJjL3RcSKA", "Overall": "5.0", "Content": "Never has disappointed!", "Date": "2009-09-21", "Author_Location": "San Francisco, CA"}, {"Author": "Amberlene W.", "ReviewID": "a3Q4Jqb5DS89dEIniLHsZQ", "Overall": "1.0", "Content": "This place is by far the worst Lee's Sandwich I've been to. The food had a lot of flies around it and when I asked for a \"hot\" waffle the lady assure me it just warm is that ok, I said ok as long it warm...That waffle couldn't get any colder than ice! This place have a lot of food that has been sitting out, for days maybe. I never liked Lee's Sandwich, there sandwiches has nothing in it, not enough of anything; two slices of paper thin meat. It's weird how they have become so popluar in the south bay.", "Date": "2009-06-25", "Author_Location": "San Francisco, CA"}, {"Author": "The Honest Virgo S.", "ReviewID": "wkPM3K5bumLBBRVoZGObHA", "Overall": "2.0", "Content": "My boyfriend and I LOVE LEE SANDWICHES BUT........this by far is the worst location I've been too. We wondered why it was empty when we got there, It's not bad in customer service it's just usually I look forward to their croissants sandwiches and for the first time I was not satisfied. My croissant  was dry and not fresh. Usually they melt in your mouth. This will be our first and last visit to the white and aborn location. and they only have a small selection of drinks.", "Date": "2013-03-13", "Author_Location": "Bay Area, CA"}, {"Author": "Lois C.", "ReviewID": "DU7H_Oeg2Au9hsHIK3UYRQ", "Overall": "3.0", "Content": "I love Lee's grilled pork sandwich. Their bread is soft and their meat is juicy and full of deliciousness. I only get to eat here when I'm visiting family but out of the 4 days I was in town, I ate it 3 times so that may tell you exactly how I feel about Lees.", "Date": "2012-10-22", "Author_Location": "Hoffman Estates, IL"}, {"Author": "Destinie Z.", "ReviewID": "DhOv3FNDPnpmPlsDx8N7yg", "Overall": "5.0", "Content": "Great cheap lunch, always come here after school to chow down before I rush off to work. Order the BBQ pork sandwich with no onions every time. Also I have tried fried rice, spring rolls(wouldn't recommend these), and some kind of noddle/pork/egg roll plate which was really really good and I definitely would get it again. The iced coffee is too sugary for me as is the Thai tea. The canned drink selection is vast and I always find something good in there. Cash only!", "Date": "2012-02-18", "Author_Location": "San Jose, CA"}, {"Author": "domo k.", "ReviewID": "2O861ucz96iybpkro1jpMQ", "Overall": "3.0", "Content": "this is the only place i can pick up a sandwich @ 6am. (my lunch @ work)i get #5- grilled pork, ask for extra veggies & cilantro.i never eat in, so i can't comment on the cleanliness of tables, etc.i have always had a courteous server.they also serve spring rolls, rice, etc . delivered later in the morning.get a fresh baguette.", "Date": "2011-04-23", "Author_Location": "San Jose, CA"}, {"Author": "Minh V.", "ReviewID": "cXygUeaIIBWzxlgOLqmqLw", "Overall": "1.0", "Content": "OMG - this place is like the McDonald's of Vietnamese food.  Kinda crappy, inexpensive, and caters to EVERYONE (mostly non-Vietnamese people it seems).  The sandwiches barely have any meat or substance, and the baguette bread is hella hard and thin.  If you're looking for some fast-food that's not terrible, then this is a place to try... but if you want real vietnamese food, go to a real vietnames restaurant.", "Date": "2008-07-10", "Author_Location": "San Jose, CA"}, {"Author": "Amanda B.", "ReviewID": "SagRETGoxnQ5m7gjxTy-yA", "Overall": "2.0", "Content": "Pretty much all Lee's Sandwiches are the same. The only thing that made me decide to give them a 2 star instead of a 1 star would be because I like the taste of the baguettes. Besides that, I would say their sandwiches are not very traditional. They are like the American version of Banh Mi (Like taco bell is to Mexican food) The mayo that they use is very greasy and you are left with an unbearable after taste and smell :/", "Date": "2011-11-06", "Author_Location": "San Jose, CA"}, {"Author": "Daniel D.", "ReviewID": "RJbDiA06g0hlVqHeBBJwRQ", "Overall": "1.0", "Content": "Yuck yuck yuck", "Date": "2013-07-05", "Author_Location": "San Jose, CA"}, {"Author": "Chuck N.", "ReviewID": "CTBmExDQZ3gMSg0OWU-nZg", "Overall": "3.0", "Content": "Quick and easy chicken / pork sandwiches and other Vietnamese bakery delicacies. What more can you ask for. Service is nice and it seems rather clean too. Quick and easy place to pick up a simple meal. Don't try the smoothies / thai tea though, definitely not worth it. Chicken wings are way too fatty and overcooked too. Stick with sandwiches and you can't go wrong (I recommend the teriyaki chicken).", "Date": "2008-08-07", "Author_Location": "San Jose, CA"}, {"Author": "Leslie Q.", "ReviewID": "Wvoyo2232m29npOEdNudMw", "Overall": "3.0", "Content": "My bf and I come here whenever we're out of ideas of where to eat for cheap/ in a hurry. We usually come here before a Sharks game and order our usual #1(combination) and #5(grilled pork). They can do no wrong. But sometimes, we test the workers and ask how much one of the drinks are in the fridge and they always come up with different answers... sneaks.", "Date": "2010-10-12", "Author_Location": "San Jose, CA"}, {"Author": "Cindy O.", "ReviewID": "XQzsuYIk-Cp8P0wu8iAOcg", "Overall": "1.0", "Content": "i love lee's but not this location.i usually get the number 5 so when i get it i dig in and it tasted off. had like a sourish taste i cant explain. im definitely stick to going to the story rd location.now you know.", "Date": "2011-03-23", "Author_Location": "San Jose, CA"}, {"Author": "Lisa N.", "ReviewID": "lL30TG59pHef-1mYEtpVkA", "Overall": "4.0", "Content": "The croissant sandwiches are always good! This is my go to location for Lee's because it's way fresher than the one on King rd or the one on Senter rd/Monterey. This location bakes their own bread, which is a plus. The sandwiches are always fresh. I've never had a bad experience at this location.", "Date": "2011-07-23", "Author_Location": "San Jose, CA"}, {"Author": "Melissa B.", "ReviewID": "_etHj_ly5Gw5W1DT_KTTig", "Overall": "4.0", "Content": "Yummo! This place has some awesome Vietnamese sandwiches! I wished they were a bit more authentic with the sauce (which they do not have unless maybe requested?) All the while, it's still a great place to eat if you are on the go! Their boba drinks are yummy too! A bit on the pricey side, but what do you expect for that area? It is in Evergreen!", "Date": "2011-08-22", "Author_Location": "Beaverton, OR"}, {"Author": "Ro C.", "ReviewID": "xznTjy3gikogR_EGG6ySrg", "Overall": "2.0", "Content": "Lee's is too commercialized.  There sandwiches here are just okay.  The baguettes they use for the sanwiches are too rough and chewy.  I like mine soft on the inside but a nice crunch on the outside.  I've also noticed they increased their tapioca drinks to $3.75?  Geez.  Way too expensive.", "Date": "2007-07-08", "Author_Location": "San Jose, CA"}, {"Author": "Lynette L.", "ReviewID": "-BFzwvFwqZ9IhI4gXPvrrA", "Overall": "1.0", "Content": "Don't by the Thai Iced Tea they put WAYYYYY too much ice. You can get about two sips in and your done! Its in expensive but they have managed to find a way to make cheap feel like a rip off!", "Date": "2008-09-09", "Author_Location": "San Jose, CA"}, {"Author": "Derek F.", "ReviewID": "AsTCEUHU8o0RRefNNwmb-w", "Overall": "2.0", "Content": "The sandwiches here doesn't always taste fresh. After so many disappointments I no longer have cravings for Lee's Sandwiches.  Although if I was in Garden Grove I'd visit the Lees there cause that's where it was best.", "Date": "2010-06-05", "Author_Location": "San Jose, CA"}, {"Author": "Annie W.", "ReviewID": "IdwxPhlCLoyBF1oZylTf7g", "Overall": "3.0", "Content": "I like this location because it is cleaner than the others, but the people here aren't very friendly. They pretty much just take your order, make it, and give it to you. A little warmth to make you feel welcome would be nice. I haven't had a sandwich from here in a while, but the Avocado Smoothie with pearl is pretty awesome, actually all the pearl drinks I get from Lee's are delish!", "Date": "2010-07-23", "Author_Location": "San Jose, CA"}, {"Author": "Katarina M.", "ReviewID": "wejylc8FQbBjysXDVes03g", "Overall": "4.0", "Content": "LOOOOVE the vegetarian sandwich. I'm not vegetarian and it's so good. However, they don't take cash, the Thai iced tea was not my cup of tea (pun intended), and the eggroll was meh. They are great cheap sandwiches though and mmmmm those fresh baked baguettes.", "Date": "2011-07-24", "Author_Location": "Sunnyvale, CA"}, {"Author": "Chrystel J.", "ReviewID": "Z9WcwejpVXEjUqEULr_FPQ", "Overall": "4.0", "Content": "Let me just say, I love their baguettes. Nice and crusty! I usually get the vegetarian banh mi and it's always delicious!  For $3 you can't complain really.  It's clean and the employees I've dealt with were pleasant and helpful.  This is the Lee's I prefer to go to, unless I'm in another area.", "Date": "2012-08-01", "Author_Location": "San Jose, CA"}, {"Author": "Jack B.", "ReviewID": "NvLOC06VJXA2RGQhohwsbw", "Overall": "3.0", "Content": "I had a ham and cheese which was pretty decent. I like the bread. My friend got the tuna fish and said it was excellent. Cream puffs for fifty cents!!! I would go back because it is so cheap!!", "Date": "2009-03-21", "Author_Location": "Petaluma, CA"}, {"Author": "Linda J.", "ReviewID": "LftkykB5Pax28s5zJhHzJQ", "Overall": "5.0", "Content": "I love this place I first stopped in years ago to pick up a loaf of bread and ordered one of the barbeque pork sanwich the best.everyone else can have their subway,togos whatever im loving my lee's sanwiches and coconut water.really nice staff and great food what else can you ask for.I had the fresh basil seed drink last time its good and refreshing I like their cream puffs too.", "Date": "2011-11-09", "Author_Location": "San Jose, CA"}, {"Author": "Ryan C.", "ReviewID": "P2chDeyXFbCceSOGBsIANg", "Overall": "2.0", "Content": "I don't know a good Vietnamese sandwich when I see one so you can't count on me for that. What I will say is that I really like their food. Only complaint I've had with this place is their service. There is a lady who works the register from time to time and she never seems happy. The last time I went there I ordered a sandwich. Paid with cash(because you have to). She gave me my change and on this particular day, for some strange reason, I double checked the change she gave me. She shorted me $0.50. No biggie right? Mistakes happen. When I went back to the register to let her know, she accused me that I was wrong. I showed her the change she gave me and the receipt she gave me. Without saying anything (I'm sorry, my mistake, here you go, etc) she gives me the correct change and appears to be pissed off at me. I thought it was just a strange encounter on a strange day. However, as I drove home I thought, \"Wait a second. Cash only. Shorted me by $0.50. Seemed pissed of at me for her mistake.\". If she does that to a number of people throughout the day... take your guess. That lady could be pocketing a good chunk of change every day. I still gave this lady the benefit of the doubt until I came onto yelp and read a couple of reviews where people pointed out a similar situation. Two stars for this location only. I like Lee's but I have a feeling this location may be doing something sketch and honestly, there are so many Lees throughout San Jose that I wouldn't support this place full of shady mcgradys.", "Date": "2013-01-31", "Author_Location": "Los Angeles, CA"}, {"Author": "Maile R.", "ReviewID": "4K-qAnnKrsQ7bv90QSflrQ", "Overall": "1.0", "Content": "I love Lee's Sandwiches, but this location isn't that great in terms of sandwich selection.  I would much prefer going to the one near San Jose City Hall on E. Santa Clara St. or Berryessa.  They also don't accept cards at this location.  I remember ordering chicken skewers one time and the cashier dropped it on the floor.", "Date": "2010-12-18", "Author_Location": "San Jose, CA"}, {"Author": "Philomena G.", "ReviewID": "P4W_NbM6pA4w90uJv0twuw", "Overall": "2.0", "Content": "This location is not very clean. The tables seem to always be dirty and there are flies flying over my head as I try to put down my sandwich. I use to be a fan of Lee's sandwiches, but I don't know, their prices are rising and their getting more careless on how they make their sandwich. Oh, and the lady behind the register, would it hurt you to smile every now and then? I mean, she looked so angry and evil it almost scared me off. The guy however was very nice. Their sandwiches are okay. I don't think there's any wow factor to them. I do like their Spring Rolls though.", "Date": "2011-04-10", "Author_Location": "San Jose, CA"}, {"Author": "Vivian H.", "ReviewID": "M2g0KWEjCIh1q0ftzEasWQ", "Overall": "2.0", "Content": "I like the sandwich from Lee's, but at this location they never have the cucumber like other locations.  Their drinks are not that great neither.", "Date": "2011-09-16", "Author_Location": "San Jose, CA"}, {"Author": "Gabe F.", "ReviewID": "VwNiJzp1Ws0hC6sTdHV-sg", "Overall": "3.0", "Content": "Delicious sandwiches and cheap. The #4 grilled chicken sandwich on the fresh baquette is tasty and only $4. Fresh baked baquette bread for $1 is such a deal.", "Date": "2012-06-25", "Author_Location": "San Jose, CA"}, {"Author": "Joe V.", "ReviewID": "0TvCX_K2HgFZHvHo2YwDAg", "Overall": "1.0", "Content": "The only thing worth getting from here is the ice coffee.  The food always seem like is going up in price!!", "Date": "2011-12-27", "Author_Location": "San Jose, CA"}, {"Author": "Sole M.", "ReviewID": "-CTVe3KRtABzHhTMtALeRA", "Overall": "1.0", "Content": "I went to this location earlier and ordered the chicken sandwich. I noticed it was pretty greasy and tasted kinda weird as i was eating it... sure enough, 1 hour later i realized i got food poisoning. NEVER GOING THERE AGAIN!! Bad quality meat and very dirty.", "Date": "2012-07-07", "Author_Location": "San Jose, CA"}, {"Author": "natassia s.", "ReviewID": "HiBFD0pBCntrxETWMyRVDw", "Overall": "5.0", "Content": "alot of southbay folks take lee's for granted! we only have 1 in frisco and it's in a bootsy neighborhood. its like a vietnamese supermegastore of goodies and snacks. i get crazy cravings for bbq pork sandwiches oh my gaaawd, so soo good!", "Date": "2008-06-17", "Author_Location": "Daly City, CA"}, {"Author": "Joy S.", "ReviewID": "m4rSWCyxVRERVh-DMmCVqw", "Overall": "1.0", "Content": "I've loved Lee Sandwiches'  food and their prices. But this place made me think twice in walking into one. Worst Lees Sandwiches ever! I've given them plenty of chances to redeem themselves but somehow they will always fail. Please let me elaborate on my experiences.First Fail:I bought a BBQ pork sandwich like I always do from any Lee's Sandwiches. I got home and began to enjoy it. As I pulled away to adjust the veggies, guess what I saw staring right back at me....that's right ladies and gentlemen I found a nickel sized shiny green beetle, DEAD, in my sandwich.No lie, I practically had to try and throw up what I just ate. Where did that beetle come from? God knows where! But SERIOUSLY?????Second Fail:Thinking to never buy their sandwiches, I began to buy their little pastries they have set out on their counter. My favorite WAS this green, purple and white jelly thing that I tend to buy every so often I got a chance to go there. Thinking that they wouldn't fail in that category, I was dead wrong. I bought two little plates of those jelly things and went to my car. As I opened the packages, this weird aroma fill my car. I noticed that the bottom the styrofoam plate was covered in this kind of goop,(a goop that would appear if something was spoiled. Yes, people...these people just sold me SPOILED food. I looked at my second plate thinking it was a fluke, I was wrong...I found MOLD growing on the food. I quickly returned both plates to get my money back. As I was returning the food(which is something I really don't do at all), I noticed the rest of their jelly kind of pastries were secreting that same kind of goop I found in my plates.This is just a glimpse of what I've gone through. This is utterly disgusting and horrid, that I swear that this place should be thoroughly inspected by a health inspector immediately! Do not go to this Lees Sandwiches. You will probably regret it.", "Date": "2010-04-28", "Author_Location": "San Jose, CA"}, {"Author": "Raphy M.", "ReviewID": "cQbS-kKDGfY7e7RWWEmuEg", "Overall": "1.0", "Content": "walked in first time saw a sign that said \"cash only\" ok i went to atm next door. came right in, was probably standing there for 10 min now im a patient person sometimes, but when your standing in a deli for 10 min when no body acknowleges you in an empty deli can get pretty ridicolous. finally they see we been waiting and still no reaction. finally i see the lady coming towards counter tries to hand me an order which belonged to someone waiting outside. wtf? i decided to turn around and leave.", "Date": "2011-10-25", "Author_Location": "Redwood City, CA"}, {"Author": "Molly K.", "ReviewID": "AJnC0GpC7HBbRhiYNOFSxw", "Overall": "4.0", "Content": "This place has a bunch of choices if you're craving asian. I love the #4 grilled pork sandwich. It's only a few dollars and super low on calories! Just 200 per sandwich ( yes the whole thing! ) The coffee might be a bit strong for other people. Baguettes are fresh every 30 minutes so make sure to get them while they're hot!", "Date": "2011-10-27", "Author_Location": "San Jose, CA"}, {"Author": "Jane Y.", "ReviewID": "mVyq1d6AIGkGy3EvwjaRuA", "Overall": "1.0", "Content": "Rude lady refused to remake my drink with less ice. I kindly asked her to remove ice and add more product and she didn't. She told me she would have to charge a dollar more.  So I asked for my money back. She ran to the back, yelling something negative towards me of course.  But no way am I going to spend $2.75 for a SIP of Thai Tea.  Their loss, not mine. For attempting to be a cheap business, they ended up paying for the wasted drink because I got my money back!  And their chicken egg rolls tasted like crap!  I yelled thank you and received nothing in return. The most horrible customer service I've ever seen!", "Date": "2012-07-29", "Author_Location": "San Jose, CA"}, {"Author": "Ro S.", "ReviewID": "BvLVzphnpUF6iulG3KE3JQ", "Overall": "3.0", "Content": "I have been going here for years, and I realized that the sandwiches got a bit smaller. Still good size and real tasty though. Price for sandwich is just right. The other asian snacks/food they sell on the counter I would skip. I think they are days old and they taste terrible every time I tried them, so I just skip them when I go in. Fresh baguette is a must. Even better when if you can get it out of the oven. Bring'em home, butter them up and... Real good. Sandwiches, Baguettes and smoothies get 4 star. The other Snacks get a 1 Star.", "Date": "2010-07-03", "Author_Location": "San Jose, CA"}, {"Author": "M S.", "ReviewID": "mgek_JMHHP_Z55Mgn4Qkfg", "Overall": "3.0", "Content": "Used to love going to this location but as the years have gone on the food seems to be getting worse. Not sure what it is but I definitely go out of my way to go to a different location now.", "Date": "2011-03-24", "Author_Location": "San Jose, CA"}, {"Author": "Su T.", "ReviewID": "mVDvXw4puOxnZwx1mktesw", "Overall": "5.0", "Content": "i love lee sandwiches. up the street theres a quiznos that will rip you off. 10 bucks for a sandwich combo? well now its like 13-15 bucks but lee sandwich keeps it real. i always order the ga nuong but don't order it in vietnamese if you don't know vietnamese. i looked at the menu and i decided to give my vietnamese a try so i said can i get a ga nuong? then the cashier was like BaH mUaY BuM LaM something something something. i was like \"oh god no now i don't know how much to pay her..\" i tried looking at the cashier machine to see if it would show the amount but no luck. i just had to get lucky and dish some money out. i decided my lucky number would be 3, and suprisingly that was the actual cost of the ga nuong. i was relieved that she didn't yell at me for short changing her. now that i know its 3 bucks i just say ga nuong anyway to impress any cute vietnamese girls standing in line behind me. and when they say BaH mUaY BuM LaM i just give them 3 bucks like it ain't a thang. life works out, and we're all happy. this sandwich was awesome, hell i'd pay 6 bucks for the sandwich. but i'm fine with just 3 =] i love this place its my new favorite sandwich place. oooo and if you want really good bread then just order their baguette, its so bomb", "Date": "2008-06-27", "Author_Location": "San Jose, CA"}], "RestaurantInfo": {"RestaurantID": "5kewWoloCwQJsXO5s_zuUg", "Name": "Lee’s Sandwiches", "Price": "$", "RestaurantURL": "/biz/lees-sandwiches-san-jose-7", "Longitude": " -121.79064203779", "Address": "3276 S White RdSan Jose, CA 95148", "Latitude": " 37.314711237244708", "ImgURL": "//s3-media1.fl.yelpcdn.com/bphoto/T_KdVS7hiyv60YUI8DmF1Q/90s.jpg"}}