{"Reviews": [{"Author": "Amy H.", "ReviewID": "K64pY7Pd7cYcaQKpsAtEIg", "Overall": "5.0", "Content": "Have not had a bad meal here yet!!! Highly recommend the Veal Marsala DELICIOUS!!! I never eat a whole meal and I usually box half of it to go for the husband but I ate EVERY single bite of this thing!! Their pizzas are fantastic! My favorite is Pizza Bianca!! So simple yet SO good! Authentic pizza!! Love their Bruschetta, and their calamari is standard calamari but the sauce that comes with it is great. Now let's talk lasagna, maybe  I have not had good lasagna but this thick piece of deliciousness is DELICIOUS!  I usually order a to-go one and pop it in the oven at home to share with the hubby ON TOP of what I order there. I never say no to it. SO good!! The service is great, wine selection is great, and the atmosphere is great! Overall great great great!", "Date": "2014-05-29", "Author_Location": "Vinings, Atlanta, GA"}, {"Author": "Lawrence C.", "ReviewID": "BFrAezg5T9mAayxORLJCkQ", "Overall": "3.0", "Content": "Crabcake appy $10, as was the insalata w/ Gorgonzola cheese.  Linguini pescatore $19, was reasonable plate. Various tastings of wines by the glass until we found one we liked; $9/glass. Timothy (head waiter?) took excellent care of us.Not a destination restaurant, but very good for when you're in the midtown/theater area.", "Date": "2014-04-05", "Author_Location": "Atlanta, GA"}, {"Author": "Jim L.", "ReviewID": "fakA9VSkGhEpxIm4RAJIJQ", "Overall": "5.0", "Content": "I have long said that Baraonda is about the best Italian in Atlanta. I haven't been to every place that serves all of the regional Italian fare, but it's hard to imagine better than here. I first ate here after seeing 'Phantom of the Opera' next door at the Fox, and have been back several times since. Wonderful food, service, choices, and such. Never had bad food or experiences here. Plus Jim's Pizza Tour invaded on September 27, 2013, and got one of the most amazing pizza's ever. Topped with prociutto! Oh, my, it was so good. Maybe top 5 of all time.  Perfect place for you and your date on a Fox Theatre night.", "Date": "2014-03-11", "Author_Location": "Cleveland, GA"}, {"Author": "Arlene R.", "ReviewID": "94HRtBpjCz615AA-JA9euA", "Overall": "3.0", "Content": "Sorry after reading rave reviews I was disappointed. I have Lingini with seafood and husband had a sausage dish which he said was bitter because of the greens. The service was just ok  wouldn't break my neck to return. Others seemed happy may be it was just us.", "Date": "2014-07-20", "Author_Location": "Snellville, GA"}, {"Author": "Kawika V.", "ReviewID": "hbxVD_ZdC52d9kPYIbYDIw", "Overall": "5.0", "Content": "Baraonda has always been a favorite of mine. They really get the whole picture here. The atmosphere, the food, the service all impeccable. You simply must try the Lasagna and the tiramisu. I trot down here just for the tiramisu.", "Date": "2014-06-23", "Author_Location": "Atlanta, GA"}, {"Author": "Regina S.", "ReviewID": "l9htAwq8tQADPO0AIRXlcA", "Overall": "4.0", "Content": "Took out of town guests here and had a wonderful experience. The food was very tasty; we usually add salt and didn't need to add a thing. For first courses- the salads were fresh and a nice blend of ingredients.  Entrees- margarita pizza was outstanding, house made ravioli was full of flavor, but did need a bit more heat (temperature) and linguini with mixed seafood was crazy good. Would recommend.", "Date": "2014-07-08", "Author_Location": "Atlanta, GA"}, {"Author": "Wendell B.", "ReviewID": "i_TegoO9jmmO7EPkQVhEVg", "Overall": "4.0", "Content": "Stopped in for \"lupper\" with our best friends, prior to seeing \"Evita\" at the Fox (less than a block away.0  My wife ordered her favorite caprese salad, which she devoured,  and two of us had the house salad with a delicious balsamic viniagrette.  For our entree, I ordered my favorite, lasagna, and it was so tasty I wanted to pick up the skillet it was served in and lick it, but I restrained myself.  My wife had the Pollo, a organic white chicken breast with fennel, olives and cherry tomatoes served over sauteed spinach.  Bred was crispy and replenished.  The food and service were impeccable, but it was a little too pricey for us, but the convenience outweighed the price.  We would go again with the right company, as we had this time.", "Date": "2014-06-09", "Author_Location": "Rome, GA"}, {"Author": "John H.", "ReviewID": "QrTYlYJEHPNTXMaRoh_YcQ", "Overall": "4.0", "Content": "Terrific try the Caper Island Clams... excellent. Excellent wine list. Service was attendant without being intrusive.  Not a large menu but all five dishes in my group were well received.", "Date": "2014-05-30", "Author_Location": "Clemson, SC"}, {"Author": "Steven P.", "ReviewID": "QEDeuwo4OY-FkJRnedqMDA", "Overall": "4.0", "Content": "The meal was great. I had the pizza made in their brick oven and it was very well prepared. My friend had a pasta dish with shrimp and he said that it was delicious.", "Date": "2014-05-15", "Author_Location": "Pearl River, NY"}, {"Author": "Greg E.", "ReviewID": "dJJIdfSKtsYC97ZG7XkCOQ", "Overall": "1.0", "Content": "Weak , rude servers , slow service...   cold soup. The upside , cold beer . On your way to the Fox theatre ... Go anywhere else.", "Date": "2013-12-17", "Author_Location": "Burbank, CA"}, {"Author": "David M.", "ReviewID": "yg7iDLy9TaPQVo1dSmetEA", "Overall": "2.0", "Content": "Well just a couple weeks before I move away from Atlanta and finally had experiences here that took it off my favorite spots in Atlanta.First a plus.. its finally on OpenTable.  Though honestly I'm fairly convinced they block out good reservation times because of the Fox.Which leads me to the bad and what will unfortunately taint my memories and opinions of Baraonda.  Since the last time I've eaten here they have enacted a new policy to have a limited menu at dinner.  The nice extensive list of pizzas are gone and relegated to the lunch menu.  That left maybe 6 that could be ordered for dinner.  I was told tonight that because of how busy nights are when there are shows at the Fox, they decided to limit the options to make sure customers get quick service.  Unfortunately for me that means that the primary reason I'm going there was taken away.  Was craving their Bianca pizza all day (since I really don't like red sauce pizzas) and was told that I couldn't get it for dinner anymore.  Very disappointing for what was my favorite pizza place in town.", "Date": "2013-11-05", "Author_Location": "Pleasant Hill, CA"}, {"Author": "Coleen F.", "ReviewID": "HbI8wjeIWWjEpiIE93R3RQ", "Overall": "3.0", "Content": "This place has a young hip vibe. I came in to get something to eat only (no drinks) since I had to work that evening. The person greeting me at the door told me to sit at the bar because they were expecting a large theater crowd coming in. So I sit and wait. And wait. Two servers were having a conversation behind the bar. I guess I was intruding. I was finally asked what I wanted to drink and when I said water, he acted like I was a waste of space. Sorry dude, my company does random drug & alcohol testing. I decided to order a Romano pizza to go and get the h*** out of there.  Prosciutto, cheese, caramelized onions and sun dried tomato on a thin crust. The pizza was decent, but $15 for a medium size pie and toppings were scarce. Also, they need to look up the meaning of caramelized. It doesn't mean \"translucent & and still crunchy\", which is the way theirs was prepared. I won't be back.", "Date": "2013-11-17", "Author_Location": "Bedford, TX"}, {"Author": "S P.", "ReviewID": "yo9kVS41r94tdTj8NkGNRA", "Overall": "5.0", "Content": "We had their pizza and pasta (farfella) and they were very good.  Good quality ingredients and nice atmosphere, will be coming back!", "Date": "2014-03-28", "Author_Location": "Alpharetta, GA"}, {"Author": "Phil H.", "ReviewID": "ecJDbQbgfQa7dtUALiq-8A", "Overall": "2.0", "Content": "I'll start somewhat positive. The ambiance is nice. Good mood lighting. Pleasant background music. Decently nice setup. In fact, ambiance is nice enough that I would have given the place three stars but for the fact that I saw a man's dick while I was eating my calamari. Yes, while sitting at a table facing the intersection of Peachtree and 3rd, I happened to look up at one point and notice a homeless man urinating in the bushes outlining the restaurant. Certainly not Baraonda's fault, but hey, stars have to be docked anytime we're talking about a man's cock in the middle of a restaurant review. Lots of panhandlers outside, too, so I wouldn't be surprised if it's the first time the restaurant's bushes have been used as a Starbucks bathroom. As for the food, it's ridiculously blah. As usual, Atlanta cannot get Italian food right. First of all, Atlanta Italian restaurant chefs: it's called SUGAR. Please use some in your red sauces. The lack of such ingredient made for a terrible seafood linguini - tart isn't even the word to begin to describe that sauce. The calamari was rubbery and bland, which actually keeps me from complaining about the minuscule portion they serve. The Margherita Pizza looked and tasted straight out of Chuck E. Cheese. The cheese even strung like it, too, which everyone knows should never happen with a Margherita Pizza.Oh, and parking. It's free up to two hours. Only thing is, you have to park down the street and get your ticket validated. Don't enjoy the ambiance too much and end up staying in there for longer than two hours and end up paying for parking. Wait staff is nice, but long story short, this place is totally overpriced, bland, and frankly, not that good. I'm not coming back. Wish I never went in the first place.", "Date": "2013-11-29", "Author_Location": "Manhattan, NY"}, {"Author": "Nichole K.", "ReviewID": "v_sfBn8MXfIMDFql1jdPcw", "Overall": "4.0", "Content": "I've been here numerous times especially since I work next to the restaurant and it's always a nice place to go before a show at the Fox.I've always had great service. The selection is small, but it is good. Their pizza's are excellent and they also have really nice small plates and salads. My advice for going here before a show at the Fox.It's going to be very crowded. You probably won't get a table if your not there very early or have reservations. Unless, this is a personal favorite restaurant or a tradition before seeing a show at the Fox, I would suggest another place that isn't so close to avoid the crowds.", "Date": "2013-07-18", "Author_Location": "Atlanta, GA"}, {"Author": "Michael W.", "ReviewID": "kRXlgTK011pQZ0UqAmo0PA", "Overall": "1.0", "Content": "Owner was also the owner of Enoteca Carbonari which shared the SAME address.  He issued coupons in lieu of paying for radio ads. He closed off that part of the restaurant but did honor the coupons for a time once he closed it down.      Coupon has NO EXPIRATION date. Yesterday he referred to Enoteca Carbonari as \"them\" when it is indeed HIM and refuses to honor.  He also owns Publik Draft house there on the corner of Ponce and Fig Jam.   It's just a bad business practice, and to imply that wasnt him is unacceptable. People know its the same owner, and its in comments right here on yelp under Enoteca Carbonari also. Photo posted", "Date": "2013-08-14", "Author_Location": "Atlanta, GA"}, {"Author": "Kevin L.", "ReviewID": "lPONKTiw6VBsB7kM21XFFw", "Overall": "2.0", "Content": "The rustic limestone walls and open wine collection make this a great location for an intimate get together, but the quality of the food ruins the entire ambiance. We had the clamcowder, linguini pescatore, margherita pizza, and fra diavolo. The clamchowder was only luke warm and had a strange after taste. I was expecting far more because it was the night's special. The linguini pescatore was even worse. The noodles were completely undercooked (not even aldente), and the seafood wasn't fresh. The flatbread pizzas were honestly not bad, but I was already so disappointed with my dinner that I couldn't enjoy them.I called before walking into Baraonda, believing that there would be a long wait at 7pm on a Saturday night. There were only 4 tables occupied. I should've known from that moment that something was wrong.I may come back to Baraonda in the future, but I'll stick to the pizzas.", "Date": "2013-08-17", "Author_Location": "Chicago, IL"}, {"Author": "Ryan A.", "ReviewID": "RgDrwqQyY0MtagAFiA3HJQ", "Overall": "2.0", "Content": "Smug. That's the word that comes to mind when you are first greeted by the maître d'. Most of the people dining here, including us, only went here because of it's vicinity to the Fox Theatre. There was no reason to become a regular here - the food is overpriced for what it is. Don't get me wrong - I am more than willing to pay for good Italian food. We ordered the calamari as an appetizer and though the flavor was just okay, it was indeed cooked correctly. One of us ordered a lasagna and commented it was just better than a microwaveable Stouffer's frozen, boxed dinner. Everybody else weren't blown away from our food. They don't have any right to be smug about their restaurant. The only reason they are packed is because people need a place to eat dinner before watching a show. If an Olive Garden was to replace them, I bet you they'd be packed too.", "Date": "2014-02-05", "Author_Location": "Roswell, GA"}, {"Author": "Marcia W.", "ReviewID": "mdZLMacvTxN8IDyXwwpagg", "Overall": "2.0", "Content": "Beings we made reservation on Yelp we were put on different waiting list and waited an hour for our table. Their policy with online reservations. Ordered Linguine Pescatore and for $22. there should have been a lot more seafood in it. Small portion and salty. Expected a nice crusty Italian bread with good EVOO. The soft bread served wasn't worth eating and neither was oil on table. Didn't see much of our waiter either. IF we ever go back  it'll be for appetizers or to try a pizza. Better service and less wait next door at the Fox!!", "Date": "2014-05-22", "Author_Location": "Marietta, GA"}, {"Author": "Liz V.", "ReviewID": "JpKJH4pDQpZNZYpfk5dNOA", "Overall": "5.0", "Content": "Baraonda is a very dimly lit, romantic restaurant. The dark wood café tables with white tablecloths, large framed Italian pictures and soft tea candles at every table added to the ambiance. We came off of bustling Peachtree Street and were transported to a quiet, soft spoken restaraunt. It may have been who I was with, but this place is magic at night.We ordered the bruschetta, a pizza, a side of stuffed olives and a few strong drinks. The drinks were a random nightly special; something pink and fruity that brought on the giggles and a few hair tosses.The bruschetta was made with thick, crusty bread and topped with a chunky mix of tomatoes, olive oil, garlic and cilantro. The appetizer was a meal in its own and we couldn't finish it.The pizza we ordered had artichoke hearts, olives and prosciutto. I only wish I knew the name as it was on the menu-I blame the drinks. After my 3rd martini, I was pleased to have the thin crust to keep my head from spinning. Their pizza is baked in their custom pizza oven that cooks the dough evenly, leaving the pizza so fresh and crusty you lick your fingers between bites. The food portions were out of control! We left with 2 boxes of leftovers, which made for an excellent cold pizza breakfast. I only wish Baraonda had more locations and were OTP. What a fabulous, little place!", "Date": "2013-04-08", "Author_Location": "Atlanta, GA"}, {"Author": "Theresa S.", "ReviewID": "k4uENThAEAOKZJ8IA5939Q", "Overall": "4.0", "Content": "I am rarely in midtown during the week for lunch.  But today I was, so I wanted to give Baraonda a whirl.I enjoyed the food but agree the service is hit or miss.Hits:  Fresh tomato sauce on my Margarita pizza.  Simple and classic.  I got the lasagna to go for later and despite a little reheating in the microwave, it held together very nicely.  Chunks of carrots in the bolognese, layers of thin al dente pasta (even after sitting around for a bit!) - cheese and sauce.  All the players together in every bite.  Some of the entrees sounded interesting.Misses:  It got really busy for lunch and the bartender was working the bar and the bar area so in fairness -- he was way too busy to provide top service.  Mgmt could add another bar tender or server....because the lady next to me got my pizza but I asked her if she ordered a margarita (she hadn't) so before she took a bite, we switched.  She had ordered the bianca.  ... I wasn't offered any bread and by the time I realized it, the bartender was way too busy to slow down. I am glad I checked it out and will maybe be back (I am averse to paying for parking :)  Comp valet - sure.  Metered parking...not so much especially with it being close to the Fox and on show nights...$20...regular price $5).  But there are some other Italian restaurants I want to try and Cibo e Beve is still my fav (and they offer cooking demos!)", "Date": "2013-04-01", "Author_Location": "Atlanta, GA"}, {"Author": "Jim W.", "ReviewID": "NqiIGP8iKa0W1Lj1KPmxUA", "Overall": "3.0", "Content": "We had just finished a morning tour of the Fox Theater and were checking out dining options en route back to the parking lot.  This place was on the way and looked promising so we stopped in for lunch.They were not that crowded so we were seated right away.  Our server was initially very attentive but got harder to attract later in the meal.  My wife and I split a basic pizza, which was good.  Our daughter had a pasta dish which she liked.  The wine list seemed quite good, and the selection I got was nice.In all, I might visit again if I were in the area, but I don't think I'd make a special trip from OTP just to dine there again.  If you are attending an event at the Fox, this might be a good dining option.", "Date": "2013-08-25", "Author_Location": "Suwanee, GA"}, {"Author": "Tiffany D.", "ReviewID": "TNaWCSUoH97jW60DcYz92Q", "Overall": "5.0", "Content": "I like it. I kind of have to. This place is like that best friend you grew up with and love, and although you have had your disagreements, you know you can always go back to them.I have been going to Baraonda for years, and although they tout their fresh pizzas, I highly recommend their pasta entrees. I have had a mushroom tortellini here that was outstanding, with fresh mussels, and a lovely white wine.This place is down the block from the Fox theatre and in the middle of everything, literally. I like to sit on the heated patio in the Fall and people watch. Service can be flighty, depending on the night.This place can get jammed packed on a weekend due to it's location. I recommend calling ahead, they take reservations. Also, parking is tough. Take a cab or park in a garage.The crowd could be a little hipster-y. Everyone kind of wearing the same thing, flipping their hair about. But I don't really mind. I love Atlanta and it's inhabitants.Wear: A well fitting blazer and a cute dress.  Recommended for: Date Night", "Date": "2012-12-30", "Author_Location": "Chamblee, GA"}, {"Author": "Anthony K.", "ReviewID": "t-VzFeOp856icucT54gkEQ", "Overall": "3.0", "Content": "Excellent wood fired pizza. The special was good as well. Thought the wine list could have been a little larger.", "Date": "2014-02-11", "Author_Location": "Millersburg, OH"}, {"Author": "Michele S.", "ReviewID": "HQEMerG0YZPRlgPArpABmg", "Overall": "5.0", "Content": "Traveling with a group of colleagues for work, and we decided to stop here for dinner one night.  What a beautiful restaurant, and fantastic wine selection.  I went with a glass of chianti which was worth every penny my company paid for it.  We ordered bruchetta for an appetizer.  The tomatoes were bursting with flavor.  I was so impressed, but maybe the produce in the southern states is better. For dinner, I went with the chicken and spinach ravioli in cream sauce special.  Maybe I was really hungry, but this dish incredible.  The portion was big, but not too big for me to finish the whole thing.  The cream sauce was delicate, and gave a well rounded creamy flavor to the ravioli.  I wish my husband had been with me because he would have loved the menu.  If we ever find ourselves in Atlanta, I'll be sure to take him here for dinner.", "Date": "2013-05-03", "Author_Location": "Lombard, IL"}, {"Author": "Sol A.", "ReviewID": "N93C7-dhqMSNcMUAbll6CA", "Overall": "4.0", "Content": "I came here with my team from work. They gave us a big table right away as well as water. The service was quite remarkable with the waiter making good suggestions. We were a big group, so we had a couple of entrees: brocheta, carpaccio, tomato/mozarella and calamari (I only tried the veggie entrees) and they were all good and fresh. For the second entree I decided to have pasta with tomatoes and mozzarella (penne checa?) and it was so fresh and tasty. And, if it wasn't enough after a good pasta and wine, dessert came in! omg! the tiramisu is to die for!", "Date": "2013-06-03", "Author_Location": "Atlanta, GA"}, {"Author": "Kevin D.", "ReviewID": "bidNgF1K4S-9_XFmAOjUsQ", "Overall": "1.0", "Content": "I had really high hopes for this place but I stopped in for a drink while I waited for friends to see a show at The Fox and the two bartenders acted like I wasn't even there. I ordered a bourbon on the rocks and it took 10 minutes to get to me. The whole time they were chatting with all the couples around me so I assume it was because I was alone that I ranked so low. Needless to say, my friends and I won't go back there after the show.", "Date": "2013-11-22", "Author_Location": "Decatur, GA"}, {"Author": "Ashley M.", "ReviewID": "Ns0spxZ0JJAoX6Km2Eb2CQ", "Overall": "3.0", "Content": "I was really excited to try this place after hearing some of my friends were big fans! We decided to come here for girls' night, just the four of us. We split a bottle of wine, two pizzas-- a Margherita + shrimp (yum!!!) and the Prosciutto di Parma.  I tried their special for the evening, the braised beef ravioli.My favorite part of the meal was the shrimp pizza. It's not the best pizza EVER, but it was pretty good. I disliked the ravioli because the dish because the sauce was oddly cold.Contrary to some of the other reviews, our table received excellent service from a very friendly older gentleman. I wouldn't mind coming back and sampling one of their more popular dishes from the menu, perhaps I would like it more than my ravioli special. My one big gripe is I think this place is a bit pricey for the value, even for Midtown.", "Date": "2013-05-08", "Author_Location": "Atlanta, GA"}, {"Author": "Candace M.", "ReviewID": "TKq-nzI6HVBZMb21aPF4hA", "Overall": "3.0", "Content": "It really is the best idea to make a reservation if you are planning to eat here.  If you don't check that there is not a show happening at the Fox that night or there will be a wait. Baraonda was OK.  I got the Linguine Pescatore  which was made with shrimp, clams, calamari, white wine, garlic, red chili flakes, Italian cherry tomatoes.  It was ok but I did not like some of the calamari pieces and the seafood in it wasn't that fresh although the overall flavor of the dish was good. What stood out was the calamari, which  were not as tender or fresh as I like them. Other than that, I think that the dish was good.  I loved the Margherita pizza.  My sister got that and I must admit I was a little jealous as I ate my chewy calamari and she chomped down on that fresh tasting pizza.  I was not overly impressed by this place.  It was just nice but I can't really say that I can go on and on about how great the food was.  I will say that this is a good little spot to stop by if you are planning to see a show at the Fox.  Over all experience, with the restaurant and a show will make it a good night.  Enjoy!!", "Date": "2013-04-17", "Author_Location": "Smyrna, GA"}, {"Author": "R B.", "ReviewID": "RyONflZ1Tnj_66GW0MgAcQ", "Overall": "3.0", "Content": "The venue is gorgeous!!!Food is delicious!", "Date": "2013-07-17", "Author_Location": "Atlanta, GA"}, {"Author": "Tracy A.", "ReviewID": "1Jn8KVv2TcQAzW7DuUj1ZQ", "Overall": "4.0", "Content": "Had dinner here before a show at the Fox.  Had the Pollo Picatta, which was delicious.  My friends and family all enjoyed what they ordered as well.  The room we were in was a bit loud, hard to hear at times, but there was some lovely outdoor seating.....", "Date": "2013-06-10", "Author_Location": "Avondale Estates, GA"}, {"Author": "Ange T.", "ReviewID": "nlID4EJRwJqBY-odYyy9jA", "Overall": "4.0", "Content": "We stopped in after a Georgia Tech football game. Our team lost, but my meal at Baronda was a winner. I really enjoyed my pizza, the sauce tasted very fresh. For once, I cannot complain about the service; our waitress was great, as a matter of fact, everyone on staff that afternoon seemed very nice and friendly.", "Date": "2013-10-29", "Author_Location": "Grayson, GA"}, {"Author": "Robert M.", "ReviewID": "Uds78obDODcpQCKutRgJ5Q", "Overall": "4.0", "Content": "Margarita review:Baraonda used to be a regular haunt for me, what a great place for a quick meal.  A few weeks ago I got back to Baraonda for the first time in a long time, and quickly remembered why it was a regular haunt.This is one of the best pies in Atlanta, brick oven style.  Beautiful thin, charred crust with a smoke infused flavor, fresh ingredients and taste, good amount of sauce with the right cheese ratio.  Just as surprising though, is that their pasta was very good.  I was never big on Baraonda's pasta but it clearly improved.  Would I choose it over their za though?  No way...", "Date": "2008-10-03", "Author_Location": "Atlanta, GA"}, {"Author": "Rick F.", "ReviewID": "nmWa23hFFMQNaGFmmB_HZA", "Overall": "4.0", "Content": "Light Bite after the show at the Fox Theatre.Caprese Salad was excellent just the right amount of fresh basil and Olive Oil.Spicy Salami and prosciutto de Parma and Arugula Pizza was above average.Service was great, friendly and entertaining!", "Date": "2009-07-17", "Author_Location": "Chicago, IL"}, {"Author": "Joel C.", "ReviewID": "CYQDN40Bk5nLUenWrY7qsw", "Overall": "4.0", "Content": "Leslie, Robert and I were heading to the Atlanta Pride Parade and got off at the North Ave exit.  As we approached Peachtree Street we ran into a bunch of our neighborhood friends.  Then without warning, it started to pour.  We ran into Baraonda and to our surprise, they were able to sit us at a window table facing Peachtree Street!We started with the fried calamari, which was delicious.  Leslie and I ordered pizzas and Robert ordered a pasta dish.  I really enjoyed Robert's pasta dish more than my pizza (well actually Leslie enjoyed it more by practically eating the entire thing!), but the pizza was very good.  The parade started and we had the perfect view!  I totally felt like VIP at this years pride parade and may have to think about doing this again next year if it starts to rain as hard as it did today!", "Date": "2008-07-06", "Author_Location": "San Francisco, CA"}, {"Author": "Sabrina C.", "ReviewID": "2UhoMBR2WMJidKOtzvFQ8Q", "Overall": "3.0", "Content": "This is generally my go-to location when I'm in this part of town and on the way to the fox/other show.  The food is quite tasty, the service is a little snooty and overall the prices are somewhat high...In all its worth a go...", "Date": "2013-02-20", "Author_Location": "Atlanta, GA"}, {"Author": "Katie W.", "ReviewID": "dHSgCw_FCuonMKom8WPz3g", "Overall": "5.0", "Content": "I've always enjoyed the pizza at Baraonda but had not written a review since it had been a while since I'd actually been there.  Then, last week, I had the good fortune of eating at Baraonda twice in a single week!  And, it was very good fortune because I do love Baraonda.I mainly stick to the pizzas here because I really cannot miss with them.  I've never had a bad pizza here.  In fact, I've never had one that was less than delicious.  I used to always stick to the Quattro Formaggi with added arugula but I branched out this week to try the Capricciosa and the Specialita (with added gorgonzola).  Both were excellent.  I love the thin crust, the char on the pizza and the foldability.  And, the ingredients are very fresh and flavorful, too.I also had the fried calamari this week and tried Kit's special risotto.  The risotto was delicious and it makes me think that I should consider the specials and the pastas when I eat here in the future (although it will sure be tough to sway me from the pizza).  In the past, I have had salads here, as well, which were very good.The service was overall very good, the wine list has a nice selection of wine by the glass as well as full bottles, and we received our food very promptly.  I do like the décor and I think it is fun to eat here.  It's also kinda fun to sit at the back bar where you can watch them making the pizzas (although it can get a little warm - sit here in cold weather, not summer).  I also hear that they only take reservations for parties of six or more.I am so happy my memories of Baraonda were so pleasantly refreshed.  I will definitely be back soon!", "Date": "2008-08-19", "Author_Location": "Atlanta, GA"}, {"Author": "Danilo G.", "ReviewID": "ZwcmtQ5zs51F0ofLY5TakA", "Overall": "5.0", "Content": "I get to Atlanta quite a bit.  This place hit my radar a few months back when I started staying at the Indigo.  I went in on MLK day for an early cocktail, and found their selection of bourbons very good, and resolved to give them a shot over a corporate meal soon after.Baraonda gets grief for not being too regional.  I think that's fabulous, since there are so many specialty dishes from so many regions, Baraonda can't be pigeonholed.Two days later myself and three compadres walked through the front door with a big appetite.  We had appetizers:CarpaccioCapreseBruschettaBourbons all around.Dinner:Strozzapreti with Wild BoarVeal ScallopiniLamb ChopsBig bottle of Italian RedDessert involved Strega and Limoncello with Tiramisu.Oh my God was the service and food fantastic.  Our host, Adriano, made damned sure that our waitstaff and food was top notch, recommending some fabulous stuff and keeping us laughing so hard we were hoarse the next day.  Everything was amazing and the entire evening was so wonderful I can't wait to go back.The Wild Boar, Lamb Chops and Carpaccio stood out.  The Carpaccio was cut so thin you could read a newspaper, but yet the portion was plentiful.  The Lamb Chops, which can be a \"phone in\", were anything but.  Beautifully herby, well-presented and completely off the ubiquitous scale, I haven't had anything like them and I've eaten enough Lamb to cause a panic in New Zealand.And then there was the Strozzaprete with Wild Boar Ragu -- What a perfect mix.  Strozzaprete means \"Priest Strangler\".  It is long and curvaceously U-shaped, and perfect for Ragu, or meat sauce.  The Wild Boar is a traditional dish from the Marche' region of Italy (think east coast, mid-way down the Adriatic).  I cannot say enough about this dish.  We had two orders, and when I took a bite I was utterly speechless. As I write this I'm trying to recreate it in my kitchen.  It will take me weeks and hundreds of dollars to get it right.  To hell with it.  I'm getting a plane ticket and going back.  Don't go in a hurry -- I think that a lot of people try to catch a quick bite on the way to the theatre.  This is Italian food.  It should and will take hours if you want your money's worth.If you want Italian in Atlanta, I don't think you could do better.  Make friends with Adriano and you'll never be sorry.", "Date": "2007-01-21", "Author_Location": "Northridge, CA"}, {"Author": "Sandra K.", "ReviewID": "Cfz1MSxhGHBH4djb8-PqMQ", "Overall": "5.0", "Content": "DISCLAIMER:  I've never eaten here.  I've only had some beers.  Yet they quickly accommodated a group of fifteen, so I liked them already.So why am I writing this review?  Because I saw a bartender at this place, who will go unnamed, make sure that a damsel in distress made it back to her hotel up the block safe and sound.  I exited the bathroom and saw the server (going off shift) offering to help the girl who was completely incoherent.  To make things not-sketchy, he turned to me and asked if I would help him escort her two blocks away so that she could get home safely.  I didn't know him, I didn't know her, but I was happy to help someone out.  This man is a hero.  And now I have a friend for life.If the rest of the staff has a heart like this guy, then five stars all around for Baraonda.", "Date": "2009-11-05", "Author_Location": "New York, NY"}, {"Author": "Paolo B.", "ReviewID": "39Fs52xLTUPBvqviS6iVeA", "Overall": "4.0", "Content": "I'm from Italy and whenever i want to eat real Italian food, i chose Baraonda! The owner is Italian, the food is really good and not expensive. The wine is also good, you can find a lot of types of wine from all over the Italy.  The restaurant is nice, just a little bit small.. but if your party is with 6+ people, you can book a table.If you like Italian food, you may love Baraonda!", "Date": "2009-02-18", "Author_Location": "Smyrna, GA"}, {"Author": "Drew W.", "ReviewID": "Yoj3zn78iiYRiXyCq_76tw", "Overall": "4.0", "Content": "I usually keep my Italian/pizza outings low-key, but I decided to give Baraonda a try before a show at the Fox. I've had some less than stellar experiences at \"gourmet\" pizza establishments (yes, I'm looking right at you Piebar). Baraonda was a nice change that shows that you can use better ingredients, charge a little more for it, but not take yourself so seriously (ahem, Piebar) to be obnoxious.In the evening you get a nice mix of after work midtowners and ITP'ers venturing into the scary city to see a show or meet friends. Baraonda has a nice selection of affordable wines, and they are frequently having specials. Most importantly, the bartenders aren't afraid to use a heavy hand when you order bourbon. Or maybe I just look like the type that needs a lot of bourbon.I can't remember the specific name of the pizza that I tried on my last visit, but it had some peppery arugula and lots of slices of prosciutto on top. Pizza with cured meats? I could eat that every day until my heart explodes. Which should happen just about....", "Date": "2007-09-13", "Author_Location": "Atlanta, GA"}, {"Author": "Randy G.", "ReviewID": "bxCFnTHFVIwOAN4hDOOEXw", "Overall": "4.0", "Content": "Every time I come here I say, why don't I come here more often? I really should as I live just blocks away and walk by it often.I have never had a bad meal here. Maybe it isn't the most amazing but it is always really good and at a reasonable price. And I always drink a glass or four of some interesting Italian wine and leave happy!The decor is nice and relaxing. The aroma of the pizzas fills the air nicely. I usually order one of the specials if it sounds intriguing. Otherwise I will order the Linguine Pescatore. Service is good, especially when I sit at the bar. Had a great conversation with the bartender last night.   A real enjoyable evening. Good food, good wine, good service.Yay! I'm a fan.", "Date": "2009-06-12", "Author_Location": "Atlanta, GA"}, {"Author": "Amanda S.", "ReviewID": "qHvC0fCW_sLP3yGUYo82tA", "Overall": "3.0", "Content": "You know what I love about Yelp?  The fact that, when you're in a restaurant, they don't know you're going to yelp about it, so they treat you like anyone else.  And when my boyfriend and I came here for a nice dinner last night, we certainly didn't receive any special treatment.I made sure to check showtimes for the nearby Fox, and there wasn't a show until 8pm.  We arrived at about 5:15, and waited for about 20 minutes for a table for two.We were seated in the back corner, right next to the pizza oven.  The smells were fantastic.A guy (not our waiter) promptly came over and filled our water glasses.  It wasn't until about 10 minutes later that our waitress showed up.  When she asked for our drink order, I said, \"I'll just have water, thanks.\"The waitress looked at me as if I were a moron.  \"Okay, your water's right there.\"  She pointed at the glass of water that I had already drank from as if trying to communicate with a chimp.Can you tell I was offended?She then said, \"Do you guys want to order now, or what?\"  So we ordered, having looked at the menu while waiting for a table, and she rushed off.Every 5-10 minutes, the little guy would return to refill our water glasses, but the waitress only showed up whenever I made eye contact with her when she was at another table.  It was pathetic.  I mean, I can understand her being busy, but it was simply ridiculous...and rude, to say the very least.Our food was brought out by someone other than our waitress.  Brad & I split a pizza and a bowl of pasta.We ordered the Penne Sausicia, a penne dish with crumbled sausage in a white cream sauce.  It was wonderful.  The pasta was perfectly al dente, and the sauce and sausage was an intriguing combo.Our pizza was the Funghi Pizza, meaning that it was just topped with mushrooms.  The mushrooms were fresh and thinly sliced.  The crust was thin and flakey.  It was good, but not fantastic.Meanwhile, some elderly people were seated beside us as we ate.  Their party was being split in two because there wasn't room to seat a party of 6 on a Friday night without a reservation, which wasn't clearly expressed to them before the 6 of them were escorted to a tiny 4-seat table.  They looked baffled.Once they (or at least, half of them) were situated, the waitress (our waitress) came over to them.  She introduced herself as Sonya (the first, and only, time all night that I'd heard her name) and told them about all of the specials they were having.Specials?  I didn't even know they HAD specials.  Thanks, Sonya.  Really.  You're a doll.So yeah...I'd say 4 stars for the food.  The pasta and pizza are both authentic Italian.  But 1 star for the service, and only because of the prompt little guy refilling my water glass.  Sonya gets 0 stars for making me feel completely insignificant.EDIT: Forgot to mention this.  As we were leaving, we heard a guy complaining to the hostess, \"You said it'd be 20 minutes.  Twenty minutes does not take over an hour!\"", "Date": "2008-02-17", "Author_Location": "Cumming, GA"}, {"Author": "Courtney N.", "ReviewID": "Xm2vVWHew-sjwPR25OTIww", "Overall": "4.0", "Content": "I feel like they kind of don't deserve the title of being an Italian place since 70% of the entree options are pizza or calzones (there are like 4 pasta options and 3-4 secondi options).  With that in mind, it was absolutely delicious and they were VERY accomodating.  Here's what we ordered:Free bread -  Great flavor from seasonings on top, crusty foccacia styleCalamari  - Light breading, crisp, not greasy, lacked seasoningVeal Scallopine Marsala - Breading was a little mushy but overall it was delicious.  The marsala sauce is to die for and the mushrooms were perfectly sauteed.Chicken Piccata (NOT ON THE MENU) - They made this for us by special request because they happened to have a salmon piccata as a special for the day.  For just throwing something together, this was delicious. Bottle of Sartori Pinot GrigioI would definitely go back next time I am in Atlanta.  The decor is fantastic and inviting. Dark woods, spacious seating, dim lighting but not in a way that is too intensely romantic that you would feel awkward going with friends or a group.If they added 2 or 3 more pasta dishes to the menu, it would definitely bump them up to 5 stars in my book :)", "Date": "2007-07-23", "Author_Location": "Phoenix, AZ"}, {"Author": "duane m.", "ReviewID": "Hw284_xJ3x0gXRkXPZ07_Q", "Overall": "4.0", "Content": "Now, I'm gonna start with this: I ain't one to pay high prices for a dinner, but I have to say, this place was more than meets the eye. While my meal was more than I would normally rather fork out, I managed to have a few beers, and a delicious pizza for about $25. I went for a friend's birthday celebration, and was pleased to see us seated with reserved tables for our party. The service wasn't stellar, but it wasn't bad either; she split the check for me, and totally improvised with the pizza requests I had.Now, I don't think that this will be a place I chose frequently, but if people suggest that we go here, I will be all about it; I had a great meal, a great time, and look forward to similar experiences in the future.", "Date": "2007-09-06", "Author_Location": "Atlanta, GA"}, {"Author": "Anelya S.", "ReviewID": "a3N-GNH_iiboR42Vw_luCg", "Overall": "4.0", "Content": "I was visiting Atlanta, and had lunch at this restaurant with good friend of mine, and I loved my garlic and cherry tomato linguinie and he was pretty happy about his spinach ravioli. The one thing we noticed was service. During our conversation small accident happened and glass of water spilled on the table. Waiter was right next to us, he saw it smiled and left. Never got back, we wiped everything out with napkins. Then manager came by just to pick up tab, and \"managed\" not to notice wet pile of napkins on our table. Overall food is good and not that pricey, but I won't be back.", "Date": "2008-05-27", "Author_Location": "San Francisco, CA"}, {"Author": "Yvette J.", "ReviewID": "Dq_wpMcs3gmzsfhh8UFGVA", "Overall": "4.0", "Content": "I have to agree with Karen F. - best risotto ever!The only downfall was when my husband ordered a bourbon and coke. Our very Italian waiter brought him a coke and a bourbon - in separate glasses.", "Date": "2007-06-18", "Author_Location": "Decatur, GA"}, {"Author": "Matt Y.", "ReviewID": "3AdSiOcywHpNTpf5OhVaIw", "Overall": "3.0", "Content": "Alright, let's start with the good stuff.The food,every time I've been here, has been excellent. Well, on my last visit the ravioli was a bit too al dente, but it wasn't worth complaining about at the time because it was still quite tasty.The price, well, it's a bit more on the expensive side I would say. Don't come here if you're trying to be frugal but it's not prohibitively expensive.My one complaint, no iced tea. What continent are they living on? Atlanta  is hades hot in the summer, even at night and they can't get the proper equipment to brew some freaking tea? FAIL. If I were paying in Euros and not using deodorant then I'd expect them not to have iced tea, simply because the concept of ice has yet to hit the Europen mindset, and that's fine, for them. However, they have ice in the water and they can go through the trouble of having a full bar so go brew some iced tea already. For this huge oversight, they have achieved an epic fail, so three stars is the best I can give them.", "Date": "2010-10-03", "Author_Location": "Denver, CO"}, {"Author": "Kristine M.", "ReviewID": "G1OSSXeoiPhmfIZl5xt2SA", "Overall": "4.0", "Content": "I have yet to have a real complaint about Baraonda, after several visits and several delivery orders through Zifty.  Whenever I'm actually in, I've already eaten or the ravioli du jour is lobster (nrom nrom nrom), so I've gotten that.  When I get delivery, it's usually pizza, which is good, but not nearly as good-looking as when it's pulled fresh out of the brick oven and piping hot.Decent wine selection, good service.  Ok but not write-home-about-it decor.  I'd take family or friends that were in town.  Not sure I'd bring a must-impress date or business colleague.  (Yet.  This could change.)", "Date": "2008-07-31", "Author_Location": "Denver, CO"}, {"Author": "Loren S.", "ReviewID": "xI6I2FRSI_n3mv-lPvpvHg", "Overall": "4.0", "Content": "I visited Baraonda for the first time last night, and boy was I impressed!  The restaurant does not look especially big or impressive from the outside, but the layout and decor definitely delivered.  The tables are great for intimate meals with friends, the hip layout is at the same time alluring and relaxing.  While there were families at a number of tables, I wouldn't generally think of Baraonda as a family restaurant.  If you don't have time for a full meal, but still want to soak up the amazing atmosphere, they have a full bar and an extensive wine list.The menu is long and there were numerous specials last night, but we were all about the pizza.  I recommend the 'Specialita', with an addition of spicy salami.  This harmony of wood-fired flavors is amazing: cherry tomatoes, mozzarella, arugula, goat cheese and the aforementioned salami on a thin, crispy crust provide a fresh, slightly salty combination that is beyond delightful.At just $12, this pizza for two will not break the bank.Others have described this restaurant as great for people-watching, or a great dining location for a night out at the Fox Theater, but give Baraonda its due: this restaurant is just plain great.", "Date": "2008-03-20", "Author_Location": "Atlanta, GA"}, {"Author": "James U.", "ReviewID": "w23tpWgGZFguItCmJPlLeA", "Overall": "4.0", "Content": "Baraonda is one of the best Italian places in Atlanta (and ATL is BIG!).  I hate parking myself, hate being in a downtown area, and /hate/ crowds.  But I will gladly put up with all three to eat here.  The pizza and pasta are always good, and the waiters actually seem to know which wines will taste good with which meal (maybe they have a cheat sheet?).Now that we have moved away I find myself missing the good eats there.  This is definitely on the 'Tour of Atlanta' I plan to take when I finally get to go back for a visit.", "Date": "2009-01-07", "Author_Location": "Baltimore, MD"}, {"Author": "Henrik C.", "ReviewID": "WdF16Lq5i9hTrg5Y_FLXbQ", "Overall": "4.0", "Content": "The restaurant has both an patio/\"outside\" area and a regular indoor area. The indoor area is a joint bar/restaurant. The outside area is on the sidewalk and you might have exhaust as an integral part of your dinner. Some might like that, personally I prefer dinner without exhaust. The restaurant/bar area is rather noisy and can be rather busy. The food is traditional Italian with a good variety of antipasto, pizza and a variety of pasta. The menu is limited but overall the food is fantastic. We have tried ravioli, lasagna, and pesce giorno. All of the dishes were really great. They have a Monday night wine taster. Stay away from it, the price is good but the wines are not. Other than that they have really good Italian wines. If you do not mind the noisy ambiance or sitting on the sidewalk this is a great place to get Italian food.", "Date": "2009-03-04", "Author_Location": "Atlanta, GA"}, {"Author": "Sona C.", "ReviewID": "AmI4aPu1ICa0cyvroxn0Eg", "Overall": "2.0", "Content": "Came here to celebrate my 25th bday. We had pastas, which were average. Some of the customers were snobbish. Was sort of expensive, this place will fall in the $$$ price range. Our server though was a nice lady- she brought my purse out which I had forgotten inside.", "Date": "2013-10-11", "Author_Location": "Sacramento, CA"}, {"Author": "Amber M.", "ReviewID": "0lx8BgL4s2Im0Km2C4-H8Q", "Overall": "3.0", "Content": "Took my sister here for pre-Nutcracker afternoon show at the Fox. At first it looked like a chain restaurant but once we settled into two seats at the bar it started to grow on me. Odd music but fabulous place to split a pizza and a salad. Everything was very fresh, cold when it should be cold, hot when it should be hot. Moretti on tap, skip the bloody mary.Big windows to watch people freezing their behinds off, pushing through a windy day. I'll definitely go back for the pizza on another day, no show at the Fox required.", "Date": "2007-12-18", "Author_Location": "New York, NY"}, {"Author": "Jesse W.", "ReviewID": "nQpZtEYLKTy2dFx68vxRig", "Overall": "4.0", "Content": "So we popped into Baraonda after sneaking out of a horrible presentation of Grease at the Fox. After such disappointment at the theater, we were really hoping to turn around the evening with some good food. We weren't disappointed.We started with a Caprese salad that was a great way to start the meal. For my main dish I ordered a wood-fired pizza since that seemed to be what many other folks were ordering.  Not sure the name of the pizza but it had broccoli, zucchini, onions, roasted red peppers, and very little cheese (if any). The crust was thin and crispy, and the toppings were light a very tasty. It certainly wasn't the kind of pizza that I would go back to if I had a real hankering for pizza, but as an off-the-beaten-path kind of pizza, I couldn't have been happier.Service was good, the place was maybe a little loud, but other than that, it was a solid dining experience.", "Date": "2009-08-14", "Author_Location": "Atlanta, GA"}, {"Author": "Steven B.", "ReviewID": "h8FvaulWRGrfGRvFAywEOw", "Overall": "1.0", "Content": "I called... I was sent to a computer. I went to the front door. Locked. No note on the door, No outgoing message.. Did this place close? The stars don't matter since I love the pizza there normally and it's very close to me. But restaurants come and go so fast in Midtown without notice I wouldn't be surprised if it was gone too. At best they decided to close on Easter Sunday and failed to let potential diners know the situation. Poor customer relations. At worst they locked the doors and sent the employees home for unemployment. I hope they at least got a bottle of wine.", "Date": "2012-04-08", "Author_Location": "Atlanta, GA"}, {"Author": "Jeremy A.", "ReviewID": "ihtN2PueVfohcnYbzNr7Wg", "Overall": "4.0", "Content": "I would come back here for sure based on my one visit. I had a italian sausage penne dish and it was very good. My girlfriend had the tagliatelle and it was pretty good as well. I can see parking being a huge pain in the ass here so try to go during the week or park down the street.", "Date": "2008-11-24", "Author_Location": "Raleigh, NC"}, {"Author": "Jai R.", "ReviewID": "wJeBYR-LxB5L8jDWSrFflQ", "Overall": "2.0", "Content": "Creepy ass waiter and disappointing food.I tried the Romana pizza with is Italian bacon, sauteed onions, mozzarella and sun dried tomatoes.  It was bland and nothing worth a further discussion.  My friend had the seafood linguine.  He said it taste like the noodles were smothered in flames then boiled in hotdog water.  But on a brighter not the wine list is good and I had a wonderful pinot noir.", "Date": "2012-05-22", "Author_Location": "Atlanta, GA"}, {"Author": "Julia B.", "ReviewID": "8iI1oVOUtwq8oHUwsDvz3g", "Overall": "4.0", "Content": "Go see my buddy Spencer the bartender.  He is hilarious.  A few glasses of big, bold, red wine and a thin crust pizza split between myself and Spencer's wife along with some fabulously fresh salad made for a terrific evening at Baraonda.It goes without saying that this and Bazaar are some of your best pre- and post-Fox Theatre outings.  But Baraonda is worth the trip for any old day as well.  It has consistently served delicious food, atmosphere and wine every time I have paid a visit.", "Date": "2007-10-16", "Author_Location": "Nashville, TN"}, {"Author": "Liz C.", "ReviewID": "VpVG_hJrsMMYmZ_2hMH7Hg", "Overall": "4.0", "Content": "If one of my BFFs didn't like this place more than breathing (okay, maybe not that much, but pretty close), I might have never tried Baraonda. And what a shame that would be!On a recent dinner visit to Baraonda with the aforementioned BFF and her mom, I tried the Anatra pizza. I swapped the sundried tomatoes for mushrooms, which were delicious. But the true highlight of this dish was the duck breast. I'm a duck fanatic, and this did not disappoint. I was stuffed to the gills from gorging myself on my duck pizza, so I didn't have any dessert on this visit, but I've had their tiramisu before and I can safely say that it's one of the best I've ever had anywhere. They also serve up a tasty and rich cup of java.I think the service here is good and the atmosphere is relaxing. It's a great spot for a date or dining with friends and it's proximity to the always awesome Fox Theatre makes it a great pre-show spot.", "Date": "2010-03-31", "Author_Location": "Lawrenceville, GA"}, {"Author": "Todd P.", "ReviewID": "AD3-Crna4SG13m9QutHggQ", "Overall": "4.0", "Content": "Business lunch meetings are great for several reasons. 1) It's lunch! 2) It's paid for by the company. Yeehaw!My most recent venue for tasty food and a little bit of shop talk: Baraonda. I've been meaning to try this place for some time and was glad I got the chance. Hopefully I can make it back again soon since this first visit made me smile.I ordered their daily fish special, a grilled tuna steak served with a generous pile of steamed spinach and a slice of tomato dressed in olive oil. Simple, perfectly cooked, delicious. And healthy!", "Date": "2009-08-19", "Author_Location": "Atlanta, GA"}, {"Author": "Kaitlin L.", "ReviewID": "835mFu8-UzS7aMKklpNAhQ", "Overall": "3.0", "Content": "In the spirit of seeing Mamma Mia - we thought we would do a nice Italian meal before hand.  Being a Saturday night - we got there around 6pm and waited about 30 minutes for a table.Everything was just OK.  Service was good - but impersonal and I felt like we were being rushed through.  Food was good - but small portions.  I even asked the waiter when I ordered their special lobster ravioli - is this going to be a tiny portion?  No - its entree size.  Yes the plate may have been entree size - but there were 5 pieces!  So I probably wouldn't go back - but I wouldn't steer people away - it was exactly how I expected it to be after reading all the reviews.", "Date": "2008-06-16", "Author_Location": "Atlanta, GA"}, {"Author": "Patrick C.", "ReviewID": "9gzJhF321X3Q0yINEKkEsg", "Overall": "2.0", "Content": "Baraonda is the perfect place to eat before a Fox Theatre event. Our party of six dined there prior to Wicked (which is another review altogether.)Reservations for larger parties are tricky, and Baraonda didn't make the grade. Unfortunately, one in our party is diabetic and must eat on a rigid schedule. Let's just say she didn't have a good evening.Reservations aside, my eating partner and I split the calamari (which was somewhat rubbery, had little flavor and possibly was a frozen product) and a Margherita-pizza-add-Italian-sausage. The pizza wasn't as good as we had remembered from a previous visit, and the quality of the Italian sausage wasn't acceptable. A nice bottle of Italian wine helped matters along, but wine does not a meal make. (Well, I suppose that's debatable...)In fairness, this place was packed, so they're doing something right. I try not to judge too harshly the *potential* of a restaurant when it is at full capacity. Seventy percent capacity is best - it keeps the food turned over and fresh, keeps everyone on her/his toes but doesn't make the staff crazy. This staff tried to overcome the craziness, but insanity is contagious, yes? The management needs to rethink some things or they will kill the goose that laid the golden egg.Not recommended prior to Fox events; however, we'll return when it's not so bizzycrazy.", "Date": "2008-10-26", "Author_Location": "Atlanta, GA"}, {"Author": "Courtney C.", "ReviewID": "v26WjdSyHDJqQxo9Ho8Skg", "Overall": "3.0", "Content": "For always being so crowded after shows at the Fox, I thought Baraonda was going to be \"fa bene\" fantastic. Well, the shirts the waiters wear certainly are adorable, but the food was just \"A-OK.\" Our waiter was lively, and the wine was good (not sure what we had though), but the carpaccio was under-seasoned, the calamari was under-seasoned and a bit greasy (but not rubbery at all and not over-breaded so that's good), and the bruchetta bread wasn't as crunchy as I like it (but the tomatoes were good and fresh and plenty garlicky). As for the entrees, two people at the table had to send the halibut special back because it was dry. My pizza (the romana) was dry. Another tablemate's pizza was...you guessed it, dry! The lobster risotto was very tasty and full of lobster, so that was definitely the winner. I'd say that this place needs to revamp itself or risk losing business, but its premiere location next to the Fox Theater makes me certain it'll maintain its flow. If I return I'll try their risotto of the day or maybe a pasta. And I'll definitely try to buy one of their adorable t-shirts!", "Date": "2009-06-14", "Author_Location": "Atlanta, GA"}, {"Author": "Mike D.", "ReviewID": "_LBkWD-l7oHW1Eg2bqBavg", "Overall": "5.0", "Content": "I'm an Italian from the North East and this is the only Italian restaurant in Atlanta that I will go to. The food in Italy is prepared with simple ingredients. The reviewers saying it taste bland might just be to used to the Olive Garden to enjoy this place.I've been several times and have always enjoyed the food. I have had several dishes specially prepared that are not on the menu, that were very good as well.I took a date here one time and one of the waiters sung at our table in Italian. It doesn't get any more romantic than that! This is where the Italians in Atlanta go...nuff said.", "Date": "2009-10-15", "Author_Location": "Atlanta, GA"}, {"Author": "J. D.", "ReviewID": "_hKWJjhCG03PCW9UVJCLyg", "Overall": "4.0", "Content": "Still a quality classic and is more \"under the radar\" than it should be. A recent pleasurable experience: my girl friend is a vegetarian and they created an off the menu veggie plate to rival any in the city. i'm still not sure what they did to the zucchini to make it taste so good. My evening special of Brasstown beef ribeye was also better than any steak I've had in Atlanta.Yes, I ate meat in front of the girl - she is okay with it!  Keep up the good work guys.", "Date": "2013-08-30", "Author_Location": "Atlanta, GA"}, {"Author": "Steve B.", "ReviewID": "Rhgn4nvf3vw7ZC675S7d7w", "Overall": "2.0", "Content": "Located at Peachtree Street and 3rd in Atlanta, Baraonda is an Italian restaurant that has some nice touches.  The ambiance is pleasant, the wait staff is nice and its location - one block north of the Fox Theatre - is great.Recently, 7 of us met for dinner and ordered 7 different dishes from the menu.  There is nothing wrong with the food but, ostensibly, Baraonda is billed as a notch above the crowd - the reason we went there.  In the opinion of our group, it really isn't.  I'm not knocking Baraonda but, at this price point you'll need a reason to select this restaurant above others in the general area - perhaps, a show at the Fox or a business client staying in a close hotel - or, you live in Midtown.If you go to Baraonda, there is parking across Peachtree St. behind the Bank of America building on 3rd.  It was easy to park and a quick walk up 3rd delivers you to the front door.Bottom line:  I have all intentions of giving Baraonda a second shot - then updating this post.  I'd say try it for yourself, you may love it.", "Date": "2012-09-08", "Author_Location": "Atlanta, GA"}, {"Author": "Carrie Neal W.", "ReviewID": "SW0ejh3iBkjYEdJC7h1Cjw", "Overall": "5.0", "Content": "Yesterday, I wanted to want my usual beloved checca. But . . .it just wasn't quiiite what sounded perfect. So after a bit of menu-perusing, I went for the calamari (and decided I could always get the pasta to-go, and have it for dinner!).For $7, a huge plate. Even better, it was delicious - all \"rings\" (the tentacly pieces creep me out), lightly fried just so, and with a yummy marinara sauce and fresh lemon wedges for squeezing over the dish.Exactly what I wanted, as it turned out - and certainly something I'll order again!", "Date": "2009-07-07", "Author_Location": "Atlanta, GA"}, {"Author": "Debbie K.", "ReviewID": "9UwlZvbfPYduAp3F6sgebQ", "Overall": "4.0", "Content": "Food: The pizzas are nice and thin & crusty.  The cheese tortellini was delicious and the halibut special was nicely prepared.  Some of the dishes seem to be a bit heavy handed on the salt.  The calamari starter in particular was quite salty, as were the sides that came with the halibut.  Liked the wine choices.Service:  It was uneven.  This last time, the hostess seemed distracted and the bartender (we got drinks while we waited for our table) wasn't very nice.  We liked our waiter though he forgot one of our drink orders until we reminded him. Overall: Easy, low-key place for Italian food. Good place to get a bunch of friends together and start the night off .", "Date": "2006-05-08", "Author_Location": "New York, NY"}, {"Author": "Valentina V.", "ReviewID": "kHzG-958dwObteltlfqkKQ", "Overall": "3.0", "Content": "Baraonda is always my spot for pre or post Fox visits, and if you have a soft spot for good looking waiters, this is your place! When I visit before the shows I usually have drinks. Their flavored Martinis are good, and the Brandy Alexander is great. Wine list is pretty decent, too. Usually is a good time to hit this spot because is not as packed as the apres show time. Oh, and after a blissfully happy night at the Fox (I've been blessed with just gooood shows at my favorite theater of all times) then it's dinner time! Baraonda is a must for this plan always. But listen (or read) very carefully: this restaurant has good pizza, really, really good pizza. DON'T even look at the pastas. The one time I had pasta I was extremely disappointed. Salty penne with \"italian sausage\" that I could barely eat.  My fave pizza is the Cafuncella, a delicious blend of prosciutto and brie cooked to perfection in their brick oven. To be fair, I often order the Cozze (mussels in white wine and garlic sauce) and I have to say, it is lush and mmmmmm!Expect a loud, and crowded place after 7:30 PM. That means a fairly long wait. Reservations are not especially honored, but yes, the hostesses are nice girls. And it's definitely a spot to go see and be seen.", "Date": "2007-12-20", "Author_Location": "Seattle, WA"}, {"Author": "Liz L.", "ReviewID": "YSIxbXNaZO-lbG51Dh3mbA", "Overall": "4.0", "Content": "Even though we had one of the worst waiters known to man at this place, I'll still give it four stars.  And I'll still tip nearly 20%.  Because people have bad days, and I can acknowledge that with the best of them. So.  On to the food.  And the divine prices.  Calamari.  Excellent.  Pizza.  Suburb (and by \"suburb\" I'm pretty sure I meant \"superb\").  Salad.  Pretty good, but I'd ask for the dressing on the side, especially when ordering the Caesar salad, which apparently was slogged down in liquid to the point of being nearly inedible.  Also kudos to the hostess who gave us a nice warning to come in about 1/2 later than originally planned so as to avoid the Fox Theatre crowd.  I've had too many run-ins on the phone with hostesses of the \"I'm-too-busy-to-take-five-second-to-actually-be-­a-human-being-and-talk-to-you-slash-do-my-job\" variety, and this was a welcome departure from those.  Plus it's a great location.  Although I'm still not sure what I think about its sister restaurant, Enoteca Carbonari, having a space right next door.  I understand the theory - the lower priced pizza/pasta parlor in an slightly upscale environment, and the more formal Italian restaurant right next door, but it almost seems like over kill to me.  However, I haven't been to Enoteca Carbonari yet, so I suppose I'll have to sacrifice myself for the greater good and go there to eat, and see if it's worth it.Sigh.  I have it so rough...", "Date": "2007-12-16", "Author_Location": "Los Angeles, CA"}, {"Author": "Guru P.", "ReviewID": "P0yGqeTH5IaQA33gSkX3Qg", "Overall": "4.0", "Content": "This is one where I wish we could give stars in 1/2s....  The food was good but the seating was highly uncomfortable.  The service was below par.  The waiter took 10 mins to get my son's soda.  This at the time the place was half empty (the show was about to start!!).  So, I wish I could give them 3.5 stars!The pizzas were good as expected.  The drinks are decent.  So, all in all a good place for a casual dinner.", "Date": "2008-04-13", "Author_Location": "Alpharetta, GA"}, {"Author": "Scott C.", "ReviewID": "C5YfHGY7RP-0NdTvuDslgA", "Overall": "2.0", "Content": "Really wasn't impressed with Baraonda.  I was there with friends after a Fox event this week.  They were quite busy for 930 pm.  The service was just adequate.  Our server was very soft spoken in a loud restaurant.  I kept having to ask him to repeat himself.  His accent didnt help, but I can live with that.  Either turn down the music or turn up the voice.  Decor was fine, but I see those same posters in Target and TJ Maxx.Food was not flavorful and was a little on the high side.  $19 for a pizza, diet Coke and tip is ridiculous.   A few sun dried tomatoes, Italian bacon, grilled onions, cheese and crust.  Flavor was lacking and the oven had some hot spots on the bottom of the crust.  I would have been happier at Slice, Oz, Johnnies or Felinis.", "Date": "2009-03-27", "Author_Location": "Atlanta, GA"}, {"Author": "Gale E.", "ReviewID": "1vccxRwCwLHNesh4fKlTbA", "Overall": "3.0", "Content": "I work in Midtown and spend a lot of time there in various restaurants, and I want to like this one.  The octopus and pizzas are good, but the host, bartender and servers are not service-oriented.  In other words, pretentious and not particularly warm.  I'll go to Lure where I can sit at the bar and be greeted as a friend.", "Date": "2014-03-14", "Author_Location": "Atlanta, GA"}, {"Author": "Simon C.", "ReviewID": "YPK5R5GW2RJpqfts9BmRKw", "Overall": "5.0", "Content": "I can realistically say I have never had a bad meal at Baraonda. The setting is laid back and romantic enough for a date but also great for a professional lunch or other engagements. The food is always good, most especially their Prosciutto de Parma pizza which I find myself in withdrawals from occasionally. The pastas are all good from what I hear (I stick to the aforementioned pizza) and the appetizers are fantastic. A good and moderately priced wine list makes this a favorite as well.All in all I would say this is by far my favorite Italian restaurant in Atlanta and competes for the number 1 spot over all. Check it out.", "Date": "2009-02-17", "Author_Location": "Atlanta, GA"}, {"Author": "chelsa v.", "ReviewID": "Lp1OMoke9W-MlcNiBZgZnA", "Overall": "5.0", "Content": "Had a late Monday evening dinner here with a girlfriend of mine,  awesome night to sit outside enjoy the weather over a nice glass of red wine and good company.  The pasta dish I ordered was good.  The red wine was nice and spicy, just as I requested.Our waiter,  with his cute accent, made ordering fun!The patio had the perfect ambiance.Great hours to accommodate for last minute plans. Close to my house. Good enough for 5 stars, if you ask me.", "Date": "2007-07-27", "Author_Location": "Austin, TX"}, {"Author": "Emily K.", "ReviewID": "ctZbvLH02ffuSIiK-UhbVQ", "Overall": "3.0", "Content": "I have a bit of a love/hate relationship with Baraonda. The food is good, but the wait can be agonizing if you go at the wrong time. The restaurant is fairly small, so it can take a while to get a table. I'm one of those people that hates eating \"outside\". Why do I want to stare at a parked car while I'm eating? However, I'll suck it up because often the outdoor tables free up more quickly than ones indoors.The staff is friendly and knowledgable. It's not too loud in spite of the fact it's fairly small. The menu isn't huge, but that means that the kitchen can master them rather than be only okay at a wider variety of dishes.I wouldn't go out of my way to eat here, but if I'm in the area and in the mood to wait a bit, I'd stop in and get a bite.", "Date": "2009-02-17", "Author_Location": "Atlanta, GA"}, {"Author": "Rachel P.", "ReviewID": "fQw3yy8psqqT_qdT5MvUjg", "Overall": "3.0", "Content": "Clearly this restaurant's life is maintained by its proximity to the Fabulous Fox Theater, because other restaurants with much better food and service have not made it in this town. Our service was friendly but forgetful...we never got out wine at all.  The food was variable but mostly intensely mediocre, almost flavorless.  All this AND an upscale price.Walk three blocks further and have a really nice meal at ECCO, who has remained open due to great food, ambience, and service if you want a restaurant at that price in this neighborhood.", "Date": "2013-02-02", "Author_Location": "Atlanta, GA"}, {"Author": "Mark B.", "ReviewID": "23tuJhOEMtUXpUTNCA8ilQ", "Overall": "3.0", "Content": "Wow. We had the rudest service of our lives here. But a pretty good pizza. In fact, the pizza rates five stars simply because it is Atlanta's best. Thin crust, charred, with excellent toppings. Priced right, all very European.But Craig, oh my, what an unbelievable attitude. He tried to explain it later by saying most people were trying to get to a show at the fox and therefore wanted to be out really quick. Like being waited on by a stormtrooper.Come here for the pizza and Europeeish charm but do request someone other than Craig!", "Date": "2010-05-23", "Author_Location": "Atlanta, GA"}, {"Author": "Christopher H.", "ReviewID": "I6lQLscbGlx5DC15aNXeDA", "Overall": "1.0", "Content": "My theater buddy and I had wanted to try Baraonda for a long time, so we had dinner there before catching a show at the Fox.  We arrived around 6:00, and were seated immediately on the plastic-wrapped patio.  It was a rainy night, but not cold out, so we weren't real sure why all the heaters were on (it was sweltering on the patio).  Our server was friendly and attentive, with the other server on the patio helping out when she wasn't immediately available.  After placing our orders, the food came out fairly quickly.I ordered the vegetarian linguine with red sauce, my \"date\" had the rigatoni norma.  While I can't say the linguine was awesome, it was tasty and the portion size was excellent.  I ate every bit of it.  My partner seemed to enjoy her rigatoni; there weren't any complaints.When considering everything, including the prices, we decided Baraonda was an OK place, but nowhere near the best Italian available in the city.  As we were leaving, the comment was said we wouldn't be in a hurry to return.Several hours later... my opinion of Baraonda changed from \"eh\" to \"never again\".  I can assure you the vegetable linguine tasted much better going down than it did coming up.  Doing a postmortem with my friend, we realized the only thing I ate that she didn't was the veggie linguine.  We both had the same bread, same red sauce on our dishes, same everything other than the linguine. I can't tell you how wonderful it is to puke up a $40 dinner in this economy!", "Date": "2010-03-11", "Author_Location": "Atlanta, GA"}, {"Author": "Maggie R.", "ReviewID": "29oysaHEOqCkr-zG73M57w", "Overall": "2.0", "Content": "I hate to say it, but I wasn't all that impressed with my experience here.The bread was nice, but it wasn't good enough to where I would continue eating it (which turned out to be convenient, since our server was not reliably around that often).  When I'm served bread with olive oil, unless it's a specific olive oil tasting (see: Sotto Sotto), I've come to expect a balsamic vinegar option as well. No such luck here, and the olive oil wasn't special enough to hold its own.My dining partner ordered the Mahi Mahi, which was a special that day, and I ordered the special pizza for that day, which included pesto, chicken, sun-dried tomatoes, and mushrooms. My pizza was a little difficult to maneuver, as all of the toppings kept falling off. I feel as if the mushrooms were a little too prominently featured; they almost became a nuisance, and had there been mozzarella on the pizza, it would have mellowed that flavor enough to where it wouldn't have been overkill... but it was a pizza with no cheese. It was mushroom central, and when the two main features I'm getting off a pizza (pesto and mushroom) don't necessarily complement each other, I get a little worried.The crust was... weird. Definitely \"real\" Italian crust, for sure, but the type of flour dusting on it was more sour than I was prepared for. I wish there had been a way for it to be sweeter, which I think would have been more suitable for the pizza.The Mahi Mahi was well-prepared, but it was essentially just the fish, with very few spices or seasonings, and it didn't taste fresh enough to where I trusted it to stand on its own. The vegetables that came with it were a little bland.It's totally possible that I was here on an off day in the kitchen, since many of the other reviewers seemed to enjoy their experience a lot. I'd consider going back one more time. The atmosphere was certainly nice, and they validate parking in the Bank of America building, which is a quick walk from the restaurant. When our server was around, he was very nice and very accommodating... he just wasn't around much. Oh well. I'd try it again, but it won't be top priority for me by a long shot.", "Date": "2012-03-17", "Author_Location": "Atlanta, GA"}, {"Author": "Wendy S.", "ReviewID": "htUEYHdDbmxBTFACCrlOyA", "Overall": "2.0", "Content": "I have eaten at this place a few times in the last year when i visit atlanta.  it happens to be the closest place to grab food near our hotel.  tonight was my first take out experience. i ordered salad + pizza and was told that it would be ready in 10 minutes.  I arrived for my take out in 10 minutes and it was ready.  I picked up my dinner for $19.45.  Now I know why it was ready so quick.  1.  the pizza was not cut, thus i am left here in my hotel to rip it into pieces.  2.  the salad looks good, but just a pile of greens with some shredded carrots.  If you have not other options, then hit this place up.  otherwise, keep looking.", "Date": "2009-07-08", "Author_Location": "Los Angeles, CA"}, {"Author": "Michelle B.", "ReviewID": "Fc23soChZx-QqKCjydTSAQ", "Overall": "2.0", "Content": "Had to update my review...I'm not sure if they've gotten new management, but the food has gone WAY downhill in the last couple of months. Maybe it's just 'cause I get it to go, but STILL...!!!Pizza Margherita is SUPPOSED to be topped with tomatoes, basil and mozzarella. That's what it says on the menu. That's what I got when I had it in Rome, New York, St. Maartin and every place else in Atlanta. That's what they show on their website...several times. That's not what I got here the last couple of trips. All I got was cheese pizza with a couple of basil leaves on top. I can do that at home. To make matters worse, I was told I didn't know what True Margherita pizza was when I called to complain. EXCUSE ME??? I wonder if the person I spoke to on the phone was the same one who told me I couldn't get a job there unless I spoke Spanish? WHATEVER!!!", "Date": "2010-10-26", "Author_Location": "Atlanta, GA"}, {"Author": "Travis N.", "ReviewID": "t3idDuy_wpvvvlwhhDGgTg", "Overall": "3.0", "Content": "I don't know why I always end up at this place in odd hours, (eating lunch at 2pm, eating dinner at 530pm etc).The first time I went I ended up having the Ravioli of the day, which was a little crisp for a pasta dish (either it was sitting out too long, or it was a little stale).The other times I've stuck with their pizza, which are very good.  One but of advice though, their Margherita pizza is just a cheese pizza with basil strips, it's good, but the first time I got it I was looking for the tomatoes on top (apparently when it says tomato on the menu they mean tomato sauce).  In the scheme of things not a big complaint, but  something to be aware of, if you're a tomato lover.  The staff seems hit or miss, but I'll give them the benefit of the doubt considering the bizarre times I've been eating there (shift changes etc).I'm not sold that it's a life changing Italian restaurant, but they're pizzas are unique and worth stopping in, and taking back home, if your in the neighborhood.", "Date": "2007-12-30", "Author_Location": "Atlanta, GA"}, {"Author": "Lisa T.", "ReviewID": "ug8XgJpx-kSnY3Ix00kndw", "Overall": "4.0", "Content": "I love Baraonda because its my go to place when I need a pick me up (I work close by but I'd go here even if I didn't).  What's super good: I get the Rucola Salad all the time! It's really fresh with arugula, and the shaved  parmigiano, carmalized shallots, and bits of pancetta give it really good flavor. The lemon olive oil is makes it super light.  I also love the Carpaccio and it's only $10 (cheapest I've ever seen).  Lasagna is great, it looks small but is very filling. Butternut squash ravioli was light and not too sweet.Not so good: My sister got the Gargenelli Pasta..if you like sauce do not get this.  The Tomato Basil Soup is a little too salty.I like the atmosphere...very loud but fun.  There's an outside patio, bar, and 2 dining rooms.  Service is usually very nice...sometimes slow so if you're getting pasta don't be in a rush.", "Date": "2011-08-12", "Author_Location": "Los Angeles, CA"}, {"Author": "Timber W.", "ReviewID": "fh4a4IefUkvA9qfND5PTwg", "Overall": "2.0", "Content": "I have no idea why I've been to Baraonda more than once.  Most recently, one of my friends suggested we go there with a group.  I decided to go with the flow and kept my protests to myself.  This proved to be a mistake.  The service was terribly slow and neglectful.  My asparagus risotto was bland and unimpressive, and I had no water in my glass to help force the tasteless arborio rice down my throat.  I'm not sure any of my companions enjoyed their food.  Next time, I intend to speak up the millisecond after a person suggests this place.", "Date": "2009-08-12", "Author_Location": "Augusta, GA"}, {"Author": "Tiffany D.", "ReviewID": "g6ekXAXV0io49WR8Q4x7Sg", "Overall": "4.0", "Content": "Came here on New years night, it was about 10:45 and they close at 11. With it being so close to closing my husband and I still got great service. We started with the Calamari which was cooked perfect. I really enjoyed the ceaser salad and I like anchovies so having it on the salad made it even better. For our main course my husband got the lasagna, which he said it was the best he had ever had( I tried some and it was great!), I got the Tagliatelle Fungi which is 3 different mushrooms with pasta in a light cream sauce. WOW, so good. The atmosphere was good, service great, food great. I will be back because I want to try some of the pizza.", "Date": "2011-01-03", "Author_Location": "Atlanta, GA"}, {"Author": "J. B.", "ReviewID": "7wk2fHEm0afihuzDoueObg", "Overall": "4.0", "Content": "I got turned on to Baraonda by some friends of mine from Italy who worked there.  They were telling me that the food there was really close to where they live in Italy.  Well since I have been to Italy, and wanted real Italian food...I decided to give it a try!  Yes, they were right...it was delicious!  I do wish their food menu had more selections, but I LOVE the pizza there. That is all I ate in Italy when I went, and now I can have it here in the ATL. Who would have known!!  After living in NYC for a while and being able to get any type of pizza I want...this will definitely do the trick for me! Grazie Baraonda!Also if you are going to a show at The Fox, make a reservation here before or after the show!", "Date": "2008-12-12", "Author_Location": "Atlanta, GA"}, {"Author": "Maressa M.", "ReviewID": "OAtxlptKKZxjV4_qIE4lMQ", "Overall": "3.0", "Content": "This is a cute little wine bar just down the street from The Fox.  If you want to miss the dinner theater crowd, plan on coming after 7:30.  We had the place practically to ourselves on a Friday night.  The food wasn't bad, but I didn't find anything exceptional or innovative on the menu.  I ordered the white pizza with sun dried tomatoes, and that ended up being better than the other pasta and meat dishes that everyone else tried.     I think the selling point for this place is the location and the romantic feel (low lighting, small space).  The few other people eating dinner seemed to be couples.    Some of the other reviews mentioned poor service, but our waitress was great.  This might have had something to do with her not having any other tables to wait on though...", "Date": "2012-05-26", "Author_Location": "Atlanta, GA"}, {"Author": "Matthew D.", "ReviewID": "oiFkMsurVKXQtS2H5rPP7w", "Overall": "3.0", "Content": "Located right next to the Fox Theatre, mentioned because if you want to actually get a table there check to ensure nothing is playing at the Fox.  I wanted to try out Proof & Provision for some libations across the street, so this seemed like a logical choice to grab a little dinner after my bar exploration.Having never been I went basic with some pizza, the Fra Diavolo ~ tomato sauce, spicy salami, mozzarella.  It was good, Antico isn't going to lose any sleep over it, but it was a fine pie, brick oven style, which always seems to had some character to anything it cooks.  The waiter seemed a little put off to serve the table and a few simple requests were forgotten and when reminded he didn't seem annoyed, he just didn't seem to care.Seated at a little table, maneuvering around the pie was a little more work than it should have been.  The service could have made the experience better, but it did the opposite, not offensive, just apathetic.To Recap:The Good:  The food was worthy of going back, if I was seeing a show at the Fox, it would be the perfect spot to hit prior to. The Bad:  Ho-Hum service.  The wine list was nice, but it was all Italian wines (I know, I know, it is an Italian restaurant), it would have been nice to see a few California wines, just a suggestion, not a knock.The Band This Restaurant Most Resembles:  Ra Ra Riot.  A few things stand out and the location for shows is a hit.", "Date": "2012-09-03", "Author_Location": "Royal Oak, MI"}, {"Author": "Stacey D.", "ReviewID": "nJDqI1Pfuxu5zJG1xZZsig", "Overall": "2.0", "Content": "We went to Baraonda after a movie at The Fox theater on Friday night. We had friends who were already there and luckily we were able to sit at the table next to them on the patio.  In fact the patio was only about 60% full. Since it was not packed out I was surprised to receive the service or lack of, that  we did. Our friends had the same waiter as we did, and he was not nearly as rude or forgetful with them. Maybe we looked funny...Anyway, we gave him our drink order after sitting there for 15 minutes waiting to meet our server. We ordered wine and beer- not too complicated- but yet it took another 20 minutes for our drinks to arrive, in the meantime another waiter stopped to ask us if he could get our drink order... Really? They seemed to be very confused on what table belonged to who. After our drinks finally arrived, our waiter did not ask us if we were ready to order, he just walked off. Another 20 minutes later, we decided to skip ordering food and go across the street. It still took another 20 minutes and me asking two other people to get our check for the wine and the beer.  So in around an hours time, we were able to drink one glass of wine and one beer.  On my way out, I stopped at the restroom, which was dirty and absent of paper towels to dry your hands.I have been to Baraonda before when it was standing room only and have never experienced such a disaster.  I know they get rushed before  events the Fox, but we arrived around 9:30 to a restaurant that was not even remotely full.  No matter what, even when the food is good, if the service is terrible- it ruins the experience.", "Date": "2011-06-14", "Author_Location": "Atlanta, GA"}, {"Author": "Lawson W.", "ReviewID": "pa0gd2qnj7342pUBv7HXfQ", "Overall": "4.0", "Content": "Really good food and ambiance.  The caprese salad and lamb chops were amazing!  The wine selection was great as well.  The service was decent, but could have been better for a restaurant that nice.  Overall a good experience.", "Date": "2014-02-15", "Author_Location": "Atlanta, GA"}, {"Author": "Karen F.", "ReviewID": "p37jUIB8jVtjOG3P7-mPsg", "Overall": "5.0", "Content": "Baraonda Haiku ReviewIs there such a thingas less than great Risotto?Not at Baraonda!", "Date": "2007-02-10", "Author_Location": "Atlanta, GA"}, {"Author": "L F.", "ReviewID": "RmeZi2aQcEQYey0aFIviCQ", "Overall": "2.0", "Content": "Great Food.  Not a great experience.6 of us guys decided to try Baraonda after a networking event nearby.  We were offered a 4-top right away with the expectation that the table next to it was ready to leave ASAP.  This seemed like a good idea until the other table didn't depart as expected.  15 minutes later two of us were still standing there.  A large table in the front window opened up and I asked if we could take it because a new party of 4 was asking if they could have it.  I was assured that the \"other table\" would be leaving any second.  Then two in our party decided to leave because it \"wasn't working out and the place was too noisy.\"  We said our good-byes in front of the hosts who seemed to understand that their ill-fated plan had cost them two customers and split up our party.  I wondered if this  event would possibly earn us a comped bottle of wine or some show of apology.  Nope.  No apology, nothing comped.Then one in our party asked about staying \"gluten free\" and the waiter explained that the kitchen could do a nice piece of fish with a salad.  He ended up ordering the sautéed \"pollo something\" with no flour and pointed to it on the menu. I heard and watched him order.  When dinner was served the waiter brought veal.  My friend, who was directly across the table from me said, \"oh, I ordered the chicken.\"  The waiter bristled and said, \"no you ordered the veal!\" as he came in close in a menacing kind of way.  This seemed like a stereotypical Italian maneuver (aka The Sapranos) as if to say, \"If I say you ordered the veal, you ordered the veal, got it??\"My friend backed down immediately and took the veal without further confrontation.  He seemed to enjoy it but later I got to thinking how unfortunate it was that he was forced to take a meal that he didn't order and that he had been bullied by a waiter.  It made me wonder if the waiter was already in trouble for getting orders wrong and he didn't need one more meal sent back because typically a wrong order would be taken back without any question.Again, the food is good.  The dining room with the bar is too loud for intimate conversation.  Sit outside if possible.  I am writing this only so ownership is aware of what their staff is doing.  I am done with Baraonda.", "Date": "2013-07-18", "Author_Location": "Atlanta, GA"}, {"Author": "Connor L.", "ReviewID": "lL-z4WsA42N8e6AW7KXztA", "Overall": "5.0", "Content": "Location, brick oven pizza and caprese salad are huge hits. Very cool atmosphere... big corner windows and inviting decor -- and VERY FUNNY shirts the staff wears.... make sure to read the quote on the back. Goes something like this:\"HEAVEN is where the police are British, the cooks Italian, the mechanics German, the Lovers French, and it is all organized by the Swiss. HELL is wehre the chefs are British, the mechanics are French, the lovers Swiss, the police German, and it is all organized by the Italians\" :)", "Date": "2012-06-10", "Author_Location": "Chicago, IL"}, {"Author": "Megan E.", "ReviewID": "vX9GZQZe8Pi0L-PXf5Ushg", "Overall": "4.0", "Content": "I've been here twice-once with my husband, and the other time with both my husband and parents when they were in town visiting for a weekend. To keep things short, our first visit wasn't that great. The food was pretty good--although I must say, if you're looking for a traditional margherita pizza with the huge gobs of mozzarella and fresh basil, theirs is not it--but our waiter was mostly MIA and downright weird that it made it hard to enjoy our dinner. Our second visit was 10x better (no sight of the first waiter).  We each ordered something different (the margherita pizza-again, really quite good but not what is to be expected, grilled chicken and fingerlings, ciociare, and veal scaloppine).  Everyone really enjoyed their meals-the flavors were all so great, and the serving sizes are perfect for the price. Our waitress was very attentive and great at giving recommendations. Since it's only a block away from our apartment, I'm sure we'll go here again very soon.", "Date": "2011-11-21", "Author_Location": "Atlanta, GA"}, {"Author": "Christy M.", "ReviewID": "bhumALwLAmXSf2R8fq49Kg", "Overall": "4.0", "Content": "I had dinner at Baraonda on a Friday before catching a movie with the girls. It was my first visit, and I was pleasantly surprised! First, parking, which can be a nightmare in this part of town. Super convenient, validated parking across the street. The atmosphere in the restaurant is really lovely, kind of a wine-cave sort of feel. The server was prompt and friendly...she kind of disappeared in that good way, where things happen as if by magic, if that makes any sense. Of course, the food is the most important thing, right? We shared the calamari appetizer, and it was awesome. Perfectly fried, very tender and crisp. I'd be tempted to make it my whole meal, actually. But since there are so many tasty things on the menu, I'm glad I didn't.I ended up ordering the liguine pescatore (seafood pasta) and it was amazing! They definitely did not skimp on the seafood - several large shrimp, a half-dozen or more mussels, and loads more of the tender, perfectly cooked calamari. The tomato-ey sauce was just right, not too intense, so the seafood really stole the show. It felt like about 2 pounds of food, honestly probably more than a person ought to eat at once (but like I said, we were going to a movie after, so I had to eat it all. Oh darn.). Overall, it was a great experience, and I'd love to stop in at Baraonda again, maybe before a show at the Fox or just for a nice night out. It was moderately pricy (total before tip for 1/4 app, 1 glass of wine, and my pasta was $31), but all in all, a good value.", "Date": "2012-03-26", "Author_Location": "Decatur, Atlanta, GA"}, {"Author": "Ryan C.", "ReviewID": "wyfxlE5-M8AwMJgJG2Gbkw", "Overall": "1.0", "Content": "DON'T EVER GO WHEN THERE IS A FOX THEATER EVENT. Parking is awful and very inconvenient. Also the host is rude and incompetent. She couldn't answer how long the wait would be. Isn't that your job? Back to parking, be prepared to pay $15 in advance then if you are back in 2 hours they will give you your money back. The policy makes no sense. Isn't that what the parking ticket is for, why do they need money? I think it's time for them to pick another parking company. Also the bathroom door doesn't lock so if you want bathroom privacy then I hope you don't have to go. The last upsetting thing that happened was the appetizer and the main course came out at the exact same time. Sad to say, but this will probably be my last time coming here.", "Date": "2014-03-07", "Author_Location": "Old Fourth Ward, Atlanta, GA"}, {"Author": "John H.", "ReviewID": "XrqkW40Q5sD4fnucrB40_Q", "Overall": "4.0", "Content": "This place is part of the reason I moved to Midtown.  Walking distance from my new place.  Close to the Fox for when I goto see live music.  The list goes on.So, I'm going to Ray Lamontagne this past Sunday night and needed somewhere to eat.  Those asses at Antico were not open, so my money went to Baraonda.  I've always heard it was good so it made for a logical second choice.First, we got there at about 5:45pm.  I swear it was perfect timing because within 15 minutes the place was packed.  We saddled up to the bar immediately ordering wine.  I have a weakness for wine.  It seriously is the best conversational beverage out there.  Baraonda's wine list, albeit a bit limited in depth, is pretty solid.Well the bartender (I believe his name was Andraio) was pretty good.  I think he was getting mad at me calling him Fulvio though.  Hey, Fulvio just sounds cooler.  So I kept on doing it.I decided to go into my \"Dumb and Dumber\" routine and ask what the \"Zuppa del Giorno\" was?  \"Fulvio\" responded in a thick accent, \"it's zzzz zoup of zzzz day\".  I said, \"I'll have that\".  It was pretty good to be honest.  I can't really remember it cause it was gone in about 30 seconds flat.Move onto ordering the pizzas.  I do like thin crust.  Love it actually as I used to manage a New York style pizzeria owned by two Italian guys from Brooklyn in my college days.  Oh how I miss thee Clemson.  I do truly appreciate the fact that Baraonda is kind of minimalist in their ingredient combinations.  It allows for you to truly taste 3-4 ingredients incorporated properly without being overwhelmed and dealing with a mess.  I went with the Bianca, adding Prosciutto, while my friend ordered some vegetarian nonsense and then proceeded to coat it with Red Pepper.  I thoroughly enjoyed the pie, figuring out pretty quickly that I could have easily eaten the whole thing if I was feeling particularly slovenly.  It's about that time that \"Fulvio\" asks if we want more wine?  My answer will 99% of the time to yes to such a question.  After that the night got a little hazy watching Brett Favre bitchslap Green Bay again and then listening to Ray Lamontagne be pretty funny between songs.  All in all, Baraonda is better than expected and I do like the fact that I can walk to it easily and sit at the bar.", "Date": "2009-11-05", "Author_Location": "Atlanta, GA"}, {"Author": "Chris S.", "ReviewID": "zUfc1dCKMEptMaXjTcK5ug", "Overall": "5.0", "Content": "This is definitly one of my favorite places to eat.  Great food (got to get the Fra Diavlo), great service.If they only had a better beer selection.", "Date": "2006-03-30", "Author_Location": "Acworth, GA"}, {"Author": "Adam K.", "ReviewID": "Mq-2EPvvT3Wz-9Aai4pImQ", "Overall": "4.0", "Content": "My wife and I have been to Baraonda a few times over the past couple of years, and every time we have gone there it's been a pleasant experience. Their pizzas are baked in a wood fire oven creating a pleasantly crunchy thin crust (If you love only deep dish then you may want to get a pasta dish instead.), and the toppings they use are both high quality and creative. To top it all off their coffee is rich, full flavored, and a nice way to end such a tasty meal.  The service here is extremely friendly, and in fact our waitress remembered us from the last time we were there 3 months ago.  The only warning I have for Baraonda is that you keep a close eye on whether or not there is something going on at the Fox Theater because people like to come here before and after shows. They also validate your parking ticket from the Bank of America lot, but it is about a half block away, so if you have someone with you who has mobility issues, you may want to drop them off at the door first and then park.", "Date": "2008-11-29", "Author_Location": "Atlanta, GA"}, {"Author": "Bootsy L.", "ReviewID": "ppXGJopvaowv73FFKPBH7g", "Overall": "4.0", "Content": "The food is as delicious as the hunks serving it up. Homemade pasta and brick oven pizza to rival Rome. I kid not. You want this.(5 stars if they had backed off on the salt.)", "Date": "2009-01-11", "Author_Location": "Provincetown, MA"}, {"Author": "Joe M.", "ReviewID": "6oMCEzYjrQ9gpikAoLhKDw", "Overall": "2.0", "Content": "The food here has been very good almost all the time, with a few exceptions, like the chicken pieces that taste like pre-packaged chicken. The reason for the 2 stars is the HORRIBLE service! We waited 15 mins one time for them to take our order. Forget about getting bread, plates for the oil or having them take away your plates without asking repeatedly. Sorry but I won't be back!", "Date": "2013-09-12", "Author_Location": "Atlanta, GA"}, {"Author": "Nikkie F.", "ReviewID": "iHNAo2U2AiLO345ufvNJbQ", "Overall": "1.0", "Content": "A small group of friends went here for an evening birthday dinner, but nothing about it struck me as special. Average waitstaff, average atmosphere, slightly crowded and loud... but what did strike me as out of the norm was the food. Horrible! I ordered the chicken, and my husband ordered the fish. Both were dry, overcooked, unseasoned, and bland. And if that were not enough - to pay that much for food that bad?! I don't know if it was a fluke - or perhaps just a bad menu choice... but I won't be going back. It's a nice enough place, and convenient if you're visiting the Fox Theater just down the street - but don't look to be blown away.", "Date": "2009-05-03", "Author_Location": "Atlanta, GA"}, {"Author": "Nique F.", "ReviewID": "VfBTDMLWlDfuWQ3-vLIvIw", "Overall": "4.0", "Content": "Great location near the Fox, or Hotel Indigo if you're a business traveler. Food is hearty, and seems authentic enough. They've got a cozy low-lit dining room, bar area and private dining room. As for their private banquet/ event space, the staff was really skilled at keeping our large group of 30 happy. We especially enjoyed the \"authentic\" Italian waiters who didn't skimp on the charm, \"would you like some more wine, my dear?\"I had the luscious caesar salad, heavy on the anchovy flavor but fine with me. Then came the tender sea bass with sauteed spinach. No complaints - it was on the light side for an Italian meal, until the tiramisu came. Of course I had to clean my plate!Nice spot for a well-rounded Italian menu.", "Date": "2010-11-08", "Author_Location": "Oakland, CA"}, {"Author": "Brian K.", "ReviewID": "076JoUmMskVHpopG8ccCnQ", "Overall": "2.0", "Content": "Disappointing. I've had better Italian fare from fast food joints....in airports....in Asia.Food: Baraonda offers a diverse array of predominately Northern Italian cuisine with an American Continental spin. They taut their pizza on the menu, but I've had far better and more authentic at Antico. Service: Unfortunately, the service is glacially slow. Moreover, on the two occasions I've been here it's seemed as if the servers weren't the least bit familiar with the menu. On one occasion they were out of several different wine options and the alternative recommendations the server was providing were not even close to the options originally ordered (e.g. originally ordered a sweet white and server recommended dry red).Atmosphere: The atmosphere is eclectic and the dress boarders on trendy casual, which I think is due to it's proximity to the Fox.Cost: Moderate. Appetizers are in the $7-$10 range and entrees in the $10 to $20 range.Other: The proximity of this place to the Fox Theater is ideal for a pre or post show dinner/lunch. However, they only take reservations for parties of 6 or more, so arrive early or you might end up eating on a paper plate at the pita joint down the street.", "Date": "2011-03-06", "Author_Location": "Atlanta, GA"}, {"Author": "Dave L.", "ReviewID": "QLDb0OlMXcl83wRlZEYW8w", "Overall": "4.0", "Content": "Great restaurant!Being so close to the Fox you should make sure that you are in the door by 6pm.Two friends and my wife for this venture.Service was excellent.Food was a mix. My wife and one friend found their a bit on the spicy side, so I traded my wife a great penne dish with shrimp for her crab ravioli. It was too spicy for her but I enjoyed it.Desert was outstanding! Terri sue as I love to call it was outstanding, this is a must.Only negative was the two groups of people beside/behind us. We were center restaurant where everything was four table settings, the place was packed with a wait outside the door. There were two tables of four that came in that turned into 16! Next thing our table was up against the door and one of our friends had to move three times. At first nonissue then it became annoying since one little man had to much to drink.One would think the manager would stop this from happening as they were there for a long night, annoying other diners, and most of all the waitstaff who saw their tip opportunity dwindling fast.Less that it was a fabulous time with great food and service!", "Date": "2011-10-08", "Author_Location": "Dacula, GA"}, {"Author": "Trevvor C.", "ReviewID": "Wr3yqhWsvNDrJWz_mri-ng", "Overall": "4.0", "Content": "For a Sunday afternoon wine-and-tapas type of visit, Baraonda nailed it pretty well for my wife and I and our hosting couple. The crowd was light, the weather was very pleasant, and we got a good seat on the patio (until the sun dropped a little lower and blinded half our party for a while). Our waiter was friendly, helpful and attentive without hovering overmuch.Two hiccups in the evening: our wine choice and one of the appetizers we ordered were unavailable. However, there were plenty of other good-looking appetizers to choose from, and our waiter was vigilant enough to have a wine recommendation ready, which we accepted and enjoyed. The calamari was the best I've had--it was thinly sliced, lightly fried, and excellently seasoned with a bit of bite on the end. The steamed mussels were good as well, but those are something I've had far less experience with and thus have little to compare them to.The restaurant has a rustic feel to it with rough-sawn tabletops inside and granite for the patio tables. Bathrooms are in the rear of the restaurant (men's on the right, women's on the left) after passing the bar.I'll definitely shoot to visit again when back in Atlanta.", "Date": "2011-10-17", "Author_Location": "Fultondale, AL"}, {"Author": "Helena W.", "ReviewID": "phpKXjH9iXjZ6dS4HVTvFg", "Overall": "4.0", "Content": "Ive been here twice, the first time was with my Other and the second was a few nights ago with three of my girlfriends.  The atmosphere was great the drinks were wonderful the food was good.  I ordered the special which was chicken ravioli with a gorgonzola sauce.  It was very good but I got 5 raviolis.   It didnt come with a side or anything so needless to say I was hungry afterward.   I have had a pizza and a salad in the past and enjoyed both.  I will likely stick with those in the future.", "Date": "2011-11-17", "Author_Location": "Atlanta, GA"}, {"Author": "Jessica B.", "ReviewID": "1_tvlT_F7RGOvMO0upQYoQ", "Overall": "5.0", "Content": "The first thing I noticed was the warmth of the place as well as a noticeable but not overwhelming smell of freshly cooked Italian food in the air upon entering.  This place seems to go for the epitome of fine dining while keeping it a laid back and friendly atmosphere!  The hosts here are very nice, very bright and warm invitation on in if you are looking for a great meal and prompt to seating.  And though the place can seem busy, I noticed that the staff was very well organized and collected about what all they were doing! The managers will even stop on your way out to wish you a good day. I noticed TWO as we left!  My husband and I were seated closer to the kitchen at a small table, which this part he didn't care for because of the size of the table but I personally found romantic (and glad to have him so close for such a perfect day for a date to the Fox!).  We were greeted by Alan, who was very prompt and had A FLAWLESS WAY of describing and recommending his favorite dishes on the menu (ask for this guy when you go! He is a fantastic server!).  He keeps great eye contact and is very open and friendly, making sure everyone is comfortable on his watch!  The food portion was average to perhaps small to some but as I'd hoped, filled with fresh ingredients and filling, nonetheless! These guys know what they are doing!  I had a seafood pasta and I cannot remember the name, but it was quite delicious!  All in all, though it's a bit on the pricey side, for a great and warm place to stay close with family (or with a date, he-he!), this is the place to go for that special ''Night out on the town''.     Bon apetite!", "Date": "2011-12-29", "Author_Location": "Marietta, GA"}, {"Author": "Roshanda P.", "ReviewID": "QogoBOJc6QJlHqrXTSRKpA", "Overall": "3.0", "Content": "Just happened to try this place out for dinner before heading over to the fox. I didnt get chance to try of any of the pasta's which looked really tasty by the way... I had the chicken cesear salad... and a Magirita Pizza which are really basic items... but all really tasty, it was a not expensive at all I ate there for tax and tip for understand 25 bucks... My waiter was very helpful... and they had quick services....", "Date": "2010-02-19", "Author_Location": "Ellenwood, GA"}, {"Author": "Fiona S.", "ReviewID": "ZR45PwHoocfB21nnfHKgIw", "Overall": "3.0", "Content": "Stopped in for lunch before seeing The Nutcracker at the Fox. First thing to note - great decor. A little rustic, a little cafe-y, a little home kitchen-y, and the bar is just down right cool looking. Servers were very curtious and friendly. I had a spinach salad, which was quite yummy, and a pretty big portion. I need to go back and have a real meal here, but my first impression is that it's definitely worth trying again. For a downtown restaurant, the prices weren't out of control either. Not sure what parking would be like on a regular night, since we parked at the Fox's lot. Need to make a point of going back to try some more things.", "Date": "2009-01-12", "Author_Location": "Atlanta, GA"}, {"Author": "Jessica O.", "ReviewID": "lCj3BnuctcOeNaexpkceHA", "Overall": "2.0", "Content": "The pizza was good - nothing extra special, but pizza is usually pretty yummy.  Service was prompt.  It gets packed when there are events at the Fox.On our second visit, we were there for lunch, and it was quicker getting seated.  However, they don't have a menu with lower lunch pricing (because they're right beside The Fox, they don't have to), which I think is not a good business move at all, as we spent $50+ for two people at lunch, and the food was only so/so.  Don't get the tagliatelle with mushrooms - I didn't eat it, blech.  My husband liked his mixed vegetable ravioli better, but it was a special. The highlight was the mimosa for $3.50.", "Date": "2010-05-12", "Author_Location": "Atlanta, GA"}, {"Author": "AngryYoungMan X.", "ReviewID": "1s_txuZB9KSqE7jmIEP3Ew", "Overall": "3.0", "Content": "I visited this corner tucked A-e-talian restaurant last weekend. On a cursory glance, it seems to have decent inside seating area but  patio seating is much nicer. My visit was for a late dinner so the place was pretty thinned out by then. Generally, I don't pay much attention to music in restaurants as food and drinks take precedence over everything... present company included. However, rocking Top of the Pop Chartbusters doesn't cut it in a dimly lit, Italian restaurant either.  If thats something that bothers you, skip rest of the review and look for another place. Wine selection was a little disappointing. The first bottle had to be sent back... it tasted refermented. Super Tuscan bottle of wine should not be tasting like Champagne! We started with an order of Salumi Affetati - a LARGE platter of cured meats. Salami and speck were especially delicious.  Entrees were tagliatelle with shitake mushroom and garganelli with sausage. Sauce was good on both orders but overall they were nothing extraordinary. Same thoughts for the dessert which was a large slice of Tiramisu. I am not an Italian food snob but I have developed my taste buds eating in some of the oldest Italian restaurants of Chicago so I am a bit spoiled. Baraonda fares better than your regular chain restaurants like Maggianos or similar, but it fell short in meeting expectations. I don't regret the first visit but it's not worth a second round.", "Date": "2011-10-12", "Author_Location": "Rockville, MD"}, {"Author": "Adam W.", "ReviewID": "QFrJQkLdR3DthcrWNipxRg", "Overall": "4.0", "Content": "Man, it was late when we got there and had a party of about 15 people. I did not expect what we got. STELLAR SERVICE! Half my party was drunk, and kind of getting stupid, and they still served us like we were cool. Hopefully the tip we left made up for the spilled beverages and occasional yelling from our party in the back. Everyone ordered mostly pizza and apps. All of which were good. I have already recommended this place to some friends and would again.", "Date": "2011-05-02", "Author_Location": "Atlanta, GA"}, {"Author": "Mea A.", "ReviewID": "pPUcYCQuE3ov2E7xHoo25g", "Overall": "4.0", "Content": "I had my first dinner at Baraonda last night and really enjoyed it. The patio is a little tight but it was nice to sit outside. We love to share meals so our waitress made some good serving suggestions. I thought the food was top-notch. We split the Bianca Pizza (mozzarella, olives, goat cheese, parmigiano) and the Penne Checca (with fresh roma tomato, mozzarella, garlic, basil, olive oil). For the most part, the staff was great. Our waitress was just a little delayed getting to our table so another waiter came over and took our salad order and told us about the specials. I didnt even think we were waiting that long so I wasnt bothered at all. ***DO NOT park at the Georgian Terrace! Before we left we checked the website and it definitely said that you could park there, so we did. The hostess was hesitant to stamp our ticket assuring us that we were wrong and that it wouldnt matter. We ended up paying $9 to exit the Georgian Terrace but when we got home and checked the baraonda website again it definitely said to park there. Today the website says to park at Bank of America and there is a sign outside of the restaurant that also says that.", "Date": "2009-08-20", "Author_Location": "Atlanta, GA"}, {"Author": "Danie D.", "ReviewID": "QY3oyMyUjv2BAy1lkE3Udg", "Overall": "4.0", "Content": "Great food, had a whole Snapper, really too big for one person, but really tasty. The wines by the glass are a great bonus, quality offering at competitive prices. Highly recommended!", "Date": "2013-09-15", "Author_Location": "McLean, VA"}, {"Author": "Kelsey P.", "ReviewID": "0pzOsf-r09I81tG9nxLfcw", "Overall": "4.0", "Content": "I'll admit I've (somehow) never tried the pizza, but I really think this is the best pasta you can get in Midtown. I used to work a couple blocks away, and this was a favorite lunchtime destination for our office.Anyway, every pasta dish I've tried there has been excellent. I'm particularly partial to the Penne Salsiccia -- perfectly cooked al dente penne, a rich cream sauce, and some very flavorful sausage. I'd also recommend the spaghetti polpettine.A couple minor complaints I have are that it can get pretty noisy, and Friday lunches tend to require a wait. Other than that, two thumbs up.", "Date": "2011-02-23", "Author_Location": "Manhattan, NY"}, {"Author": "Bryan R.", "ReviewID": "1Pn4vnCWUZNBM-Sv7lNLlA", "Overall": "2.0", "Content": "Eh. Eh is the best word. It was packed on a Saturday night, but I wasn't sure what all the fuss was about. The food was decent, but nothing MINDBLOWING.  I was disappointed by the lack of menu options... Half the menu is specialty pizzas, and I found the pasta choices lacking for an Italian joint. Also, no joke the bathroom was disgusting... Filthy, unflushed toilets, and what I hope was just water all over the floor.As for the food, I had veal ravioli, it was pretty good, and I was surprised that the portion filled me up. The calimari was also pretty tasty.  Overall, the food was just \"not bad\" but the atmosphere was a little high volume, and the menu a bit small. My suggestion is look up the menu online before you go.Overall: BUPDATE: the ravioli made me extremely ill.  Will not be returning.", "Date": "2011-07-20", "Author_Location": "Atlanta, GA"}, {"Author": "Alice T.", "ReviewID": "PHpFcJ1hwqNp1OHjQWgDHA", "Overall": "4.0", "Content": "Went on a business trip last week and a friend of my coworker took us here for dinner.  Wait was not too long and food was amazing. Starters: Carpaccio ~ raw beef tenderloin, arugula, capers,parmigiano, lemon oil dressing (really really good but the beef was really hard to pick up on the plate because it was super thinly slice)Cozze ~ mussels, garlic, red pepper, white wine (very tasty and sauce was good to dip with bread)Prosciutto di Parma ~ tomato sauce, Parma ham, mozzarella, arugula, parmigiano (topped with a lot of prosciutto and pizza was thin and tasty)For my entree I had the special porchetta.  It's basically a small pig with the skin.  The skin was really crispy and the meat was not dry.  All tasty.  Coworkers had the veal and the lamb chop and I had a chance to taste those too and it was good.", "Date": "2012-02-07", "Author_Location": "Manhattan, NY"}, {"Author": "Ullrich M.", "ReviewID": "DL8QvDgAGw685CwUQ_KhdQ", "Overall": "2.0", "Content": "When my three friends entered on a Sunday at 5:10 before a Fox performance (I was parking the car), they were refused to be seated until my wife loudly talked about writing a bad Yelp review - presto, the sat. The nice waiter said \"Absolutely\" to having Campari, but it was out. The same happened to one of the white wines. My costoletto d'agnelo was so salty that I had to return it - they brought the replacement out in 12 minutes, but did not have the time to put on the sauce. The rest of the food was very nice. I would give the place another chance, but probably only on a Sunday when Publick and and Dogwood are closed.", "Date": "2010-03-09", "Author_Location": "Greensboro, GA"}, {"Author": "Brett H.", "ReviewID": "KuBRr72xV-y5qAVxRRorlA", "Overall": "4.0", "Content": "Ok, I went here a few years ago and it wasn't so good.  Tried again tonight and it was shockingly good!Great portions, good prices, awesome location!  Keep it up guys!", "Date": "2010-04-02", "Author_Location": "Atlanta, GA"}, {"Author": "Sara R.", "ReviewID": "6wzIEfuKE16DNl8xk5Lf0A", "Overall": "4.0", "Content": "I went here for lunch a few weeks ago after not having been in a long time. It was a Friday afternoon and the place was relatively empty so our party of two was seated right away. We ordered a special that day, the crab cake appetizer. The crab cakes were small, but for $5 were a relative steal. There wasn't any filler like you see in some crab cakes. We also got the Caesar salad, which was also great. The dressing is made in-house and you can tell - it has a lemon, garlic, and anchovy flavor that you just don't get from the premade stuff. Finally, the main attraction for me: the pizza. We weren't feeling any of the meat-heavy combinations, so we opted to create our own pizza with the toppings that they offer. I can't remember for sure, but I think we got eggplant, mushrooms, and zucchini on the pizza. It was absolutely delicious! The crust is thin and charred in a few spots, and it stayed crisp even with all of the water-intense vegetables, cheese, and tomato sauce toppings. Service was attentive but not so attentive that you feel like you're being watched. All in all, a wonderful choice for a light and inexpensive meal (it was less than $25 for the two of us).", "Date": "2010-10-11", "Author_Location": "Atlanta, GA"}, {"Author": "Ryan V.", "ReviewID": "xcD8irSAUfRTRmOGUiYQGQ", "Overall": "2.0", "Content": "Went to Baraonda after a movie at the Fox last weekend.  Unfortunately, the experience was not as good as I had remembered from several prior visits.  The primary problem was the service -- slow, inattentive, and unapologetic.  The kitchen lost our order, and we were there over an hour and a half before we even saw our waiter to ask him about our food - to which he gave us a weird look, rather than words.  When he realized what had happened, he said \"sorry\" under his breath, offered nothing to compensate, and said our food would be out \"soon.\"  Another 15 minutes later, we got our food, which was good (Ortomisto pizza, shrimp ravioli) but not good enough to endure the service experience.  No accommodation was made on the bill at all, with no comment from the waiter.  With service, I understand that things happen outside a waiter's control.  It was very busy when we got there, but by 9:45 or so (about 15 minutes after we arrived) the place cleared out considerably.  Nevertheless, our drinks weren't refilled until about 45 minutes into the meal, and by another waiter, despite sitting on a patio in 80 degree heat.When Baraonda opened, it was one of only a handful of places with traditional Italian pizzas, and its location next to the Fox gives it a great platform for success.  I hope their service returns to the levels its food and location deserve - otherwise, the development of the area and the growing gourmet pizza market will threaten what has been a Midtown gem.", "Date": "2011-06-13", "Author_Location": "Atlanta, GA"}, {"Author": "Mike C.", "ReviewID": "C3T8985aVof9S9sx6HkNkQ", "Overall": "4.0", "Content": "I love Baraonda and don't eat here enough. Probably because it's very loud and I like to talk. The pizzas are just delicious. Make sure not to order too much on your pizza. Makes them floppy. Try my favorite the Fra Diavolo and add capers. Not much better can be found my friend. The margherita is pretty damn perfect as well.For pasta try the Penne Salsiccia; italian sausage, onions, and mushrooms in a delicious white sauce. Makes my mouth water just thinking about it. Yikes! As a matter of fact I've never been dissapointed by any pasta dish here.So stop by. And if you see a fat dude at the bar with a liter of S. Pellegrino and a smile on his face, that would be me.", "Date": "2011-06-16", "Author_Location": "Atlanta, GA"}, {"Author": "Bob M.", "ReviewID": "EK90Rtwbp_Oc0hxhgG2AEA", "Overall": "5.0", "Content": "This place has waiters for the single woman to die for!!!!! Dont miss out! Luca is your man.  If he waits your table you are in for a treat!!  I am still sweating from the hot sauce!!:)I have no idea why anyone would be interested in the TV?!", "Date": "2011-07-06", "Author_Location": "Nashville, TN"}, {"Author": "One P.", "ReviewID": "u8zv7hPF8ZbI92MErgmcvg", "Overall": "3.0", "Content": "A port in a storm. Have eaten here 2x on two separate business trips.arriving late after a cross country flight. food is solid and price is good.", "Date": "2011-08-13", "Author_Location": "San Francisco, CA"}, {"Author": "ERIC B.", "ReviewID": "pLRBYocBNUi3a-iQ-TFobQ", "Overall": "4.0", "Content": "Our friends from Athens took us to Baraonda for a quick dinner before the Ringo Starr concert at the Fox. We quickly realized, from all the Beatles T-shirts, that no show at the Fox theatre is complete without first grabbing a bite at Baraonda.We all had brick oven pizzas, but 4 different kinds. I chose the Capricciosa and couldn't have been more satisfied. The crust was thin and just the right combination of crispy and chewy. The ham was savory and plentiful. The mushrooms and olives were a perfect complement to the artichokes. I washed mine down with a glass (ok, two glasses) of the house Cabernet.We all agreed it was the best pizza we'd ever had and have been drooling at the memory ever since.", "Date": "2012-07-12", "Author_Location": "Charlotte, NC"}, {"Author": "Cristine T.", "ReviewID": "YbrFbDFVEpEZ7s_Kd7jEhg", "Overall": "2.0", "Content": "The food is reliably good, and because of that, this place has become a regular part of my husband's and my rotation -- we eat there about once a week.But we've decided to stop because the service is so bad. For awhile, I wrote off the snooty waiters, but our last few experiences there have really pushed this place to the point of no return. Servers are overtly hostile. You say thank you and they stare at you blankly. You ask for something and they look offended. They plow through the restaurant, running into patrons without saying so much as, \"excuse me.\" I have never seen the hostess smile. I have never, not once, received a refill on my drink. We usually wait 10 to 20 minutes to get the check because the servers disappear. Also, there's a weird issue with pepper here. Baraonda hordes pepper like it's a valued commodity. There is no pepper on the table, and the only way to get it is to have your server pepper your food. Which, of course, means hoping (praying?) the server comes to your table and doesn't give you a load of attitude. It's pretty clear that it's company policy to employ nasty, snooty servers because, in dozens of visits, we've yet to get a polite server. We won't be back.", "Date": "2013-04-28", "Author_Location": "Decatur, GA"}, {"Author": "Shaun K.", "ReviewID": "MjfQ72uB0CDplkiuWAdI3A", "Overall": "3.0", "Content": "I've worked next door to Baraonda for years and it is pretty much the only restaurant  in the neighborhood that my boss will eat at, so we come here All. The. Time. for lunch. Like, sometimes I want to shoot myself because we're going to Baraonda AGAIN... but then again, when the boss is paying... but I digress.The pizzas are generally excellent. Pastas can be hit or miss. Proscuitto de parma panini is great.Finally made it over for dinner the other night, and it was as I expected. Pretty much the same as lunch, but a slightly expanded, more expensive menu.I feel like the quality of the server pool has been diluted a little bit since the owners opened Publik, though, as several folks moved over there and they have a lot of new people now.", "Date": "2010-05-31", "Author_Location": "Atlanta, GA"}, {"Author": "Jason R.", "ReviewID": "K2Rbcd2-S82QSypOvZrsnA", "Overall": "4.0", "Content": "Great Carpaccio, very talented staff! This place is a staple of Atlanta's Italian offerings, and now I know why. Everything from the decor to the wonderful wine list is stylish and authentic.  The bartender Justin was so charming!Definetely will be back.", "Date": "2011-04-13", "Author_Location": "Atlanta, GA"}, {"Author": "Jerry N.", "ReviewID": "vJpw_pMg1crMlQttop3vHQ", "Overall": "4.0", "Content": "I had dinner here last night with a few colleagues and it was very pleasant - we found it on Yelp but didn't really read any reviews beforehand. The food was excellent and very moderately priced. For starters we had bruschetta and calamari - both were very fresh and flavorful. The caesar salad was excellent and I followed up with a Penne Checca which was excellent. I asked the waitress to have the chef spice it up a little and they did with no problem whatsoever. My colleagues had the Lasagna Casalinga and Garganelli Pugliese and gave great reviews for those dishes.This place has an extensive wine list of decently priced wines (mainly Italian as you would expect)...we enjoyed a Reserve Chianti and it paired nicely with the dishes we had. Great, friendly wait staff and I will return on my next visit to Atlanta Midtown!", "Date": "2012-05-10", "Author_Location": "Colorado Springs, CO"}, {"Author": "Linda R.", "ReviewID": "uBzTND69pMTl4gT8MJdVlQ", "Overall": "2.0", "Content": "Food was by and large good but couldn't make up for the awful service.", "Date": "2014-02-02", "Author_Location": "Jasper, GA"}, {"Author": "Michael G.", "ReviewID": "CqHdjgCJpfqBkr03HAQbXQ", "Overall": "4.0", "Content": "Really good. Went there on a quick business trip to Atlanta; front desk recommended this place and once we found it, which took a little longer than you'd expect, we were not disappointed. Food was great, typical Italian, but genuine, with the usual big portions that you get at an Italian place, but not too much. I got the lasagna and finished the entire thing, enjoying every bite.We got the bruschetta for an app., and again, really good, made with some Italian love. Most importantly, was no more expensive than an Olive Garden.", "Date": "2010-12-17", "Author_Location": "Newington, CT"}, {"Author": "Michael H.", "ReviewID": "Tidri25M_eyDkgdxWUmauQ", "Overall": "5.0", "Content": "Good food, good service, and the prices are actually pretty reasonable.  Overall, I think this this place is worth going to if you want to find a place right in the middle of midtown to try.  Their wine list is quite extensive.", "Date": "2013-04-11", "Author_Location": "Atlanta, GA"}, {"Author": "Katie S.", "ReviewID": "MEyT8ujf3OjPCsNHvVaDAg", "Overall": "3.0", "Content": "This was my second trip to Baraonda. I don't really remember too much about the first (too much wine I guess :)  I like the atmosphere here and the fact that it's a quick walk from my house. We sat at the pizza bar so it was cool to see them making the pizzas while we ate. I ordered the Mushroom Ravioli and my husband ordered the Chicken Picatta. I thought the Chicken Picatta was a better dish but overall both were pretty good.  I would recommend dining here for shows at the Fox or just a night out on the town.", "Date": "2012-12-13", "Author_Location": "Atlanta, GA"}, {"Author": "Chris Z.", "ReviewID": "TOG6I3LCUnx0l7UFQvtJLw", "Overall": "3.0", "Content": "This place focuses on Neapolitan pizza.  Although there are many other traditional Italian options.  I had the daily special that included meat from a game hen.  The toppings were good.  The dough was freshly made but a little burnt on the bottom for me.  Service was awesome.", "Date": "2012-11-15", "Author_Location": "Kirkwood, MO"}, {"Author": "Foodie Buddha F.", "ReviewID": "GdwrU3h428IdZWN1az24Kg", "Overall": "2.0", "Content": "Lois Griffin: So, Peter, where shall we go for your week off? Peter Griffin: Well, I... I was thinking we could all go to Purgatory like we did last year! [it switches to the Griffins floating in front of a plain white background] Lois Griffin: This isn't bad... it's not that good, but y'know... it's not that bad. Brian Griffin: It's so-so. Peter Griffin: Yeah... more or less...Ah yes, my neighborhood Italiano.  Though Baraonda is a very popular eatery, it is a spot I find distinctly \"so-so.\"  The restaurant puts itself out there as an upscale casual Italian eatery, but I find the experience is often mediocre at best.  There are a number of decent things about it; unfortunately, I just can't get too excited about this place anymore.  Now that La Pietra Cucina is just up the street - I will forgo Baraonda anytime I need my Italian fix.With that, let's talk about some of the good things and the things that are neither promoters nor detractors.  The atmosphere and vibe are decent.  At lunch time, Baraonda does good business serving the local business folk looking for a nearby lunch spot.  At night, the crowd is made up of theatre goers and casual dinners.  It's definitely a popular spot anytime there is an event at the Fox (okay - maybe not if the event is Widespread - but you get the idea).  You may consider that good - or you may consider that bad - what it does mean is that it will be crowded.  The restaurant seems to like \"organized chaos,\" as they leave you feeling like they have no idea who is waiting for what.  However, they always seem to figure it out.  Personally, this type of experience gives me an anxiety attack.  Service is usually nothing more than \"existent\" as it is neither particularly good nor particularly bad.Though the kitchen is hidden away in the back, the pizza oven is on full display.  Viewable pizza arenas are passé.  Unless the restaurant tosses the dough (and I'm pretty sure this one doesn't) - there isn't much to see.  Now when customers have a full view of the kitchen - then I get excited; unless of course we're talking about a pizza restaurant that doesn't toss the dough.   I'm not going to deduct points; but, the open pizza oven does not inspire me to eat here.  I find the menu is diverse but not overwhelming.  Though I have felt they should pair it down a bit - the offerings are streamlined, and your options fit neatly on one page.  They do a great business, so it's got something going for it.The cuisine here is a general failure in my opinion.  In all honesty, it alone does not necessarily warrant the 2-star score; but I've eaten here enough that it is a fair description.  They try way too hard.  I feel that the restaurant truly thinks of itself as a culinary treat... far from it.  I find the employees are taught to carry themselves with an aura that does not fit.  This extends to the food itself as the ingredients are basic.  You will not find any exotic dishes here; and that would be just fine - if they only knew it.  I wish the kitchen would just focus on making good simple food.  Instead, they make simple food that they think is exotic.This is the mass marketed type of Italian that is anything but authentic. People have spoken highly of their pizzas; but I don't think most in this city had the pleasure of eating a really tasty pie.  As a result, it is hard to differentiate between good pizza and rubber turf.As I've told people - I am not a big fan of the 5-star system that you are forced to use on Yelp.  I find that does not allow you to differentiate the nuances of a given experience.  I've eaten at Baraonda enough to know: Everything they do, they do \"okay\" Nothing is good and occasionally, it's bad.  I leave Baraonda feeling like I just spent 90-minutes in purgatory.", "Date": "2008-11-29", "Author_Location": "Atlanta, GA"}, {"Author": "Stephanie H.", "ReviewID": "gtmoDTbhS2yGHnHPHM9KzQ", "Overall": "4.0", "Content": "My coworkers and I come here for lunch every so often and every time I have been satisfied with what I have gotten. This last time I had the Pollo Parmigiana. Yum. I thought it came with pasta because it was in the pasta section, but it was a huge chicken breast with a nice side of salad greens with a light dressing. It was quite good and nice portion for lunch. I've had the Pollo Panini and the pasta with meat sauce too. The pastas have huge portions. Try the Focaccia. Mmmmm. It can get pretty busy at lunch, but the service has been good even then.", "Date": "2013-02-27", "Author_Location": "Dallas, TX"}, {"Author": "Michael M.", "ReviewID": "FVHW4rl2fugvA1HSM_juag", "Overall": "5.0", "Content": "Take it from this 100% Italian guy from New York..This is the best italian food in the city. Excellent Pizzas, pastas and wine selection. Great place to go out with a group....This is where me and the boys from the Italian club meet..that should say it all.", "Date": "2007-07-15", "Author_Location": "San Francisco, CA"}, {"Author": "jacqueline b.", "ReviewID": "Ixp2tHtZxDmIHkQLxHCdTg", "Overall": "4.0", "Content": "Love the four cheese thin crust pizza from a brick oven. And there is validating parking in a nearby garage. As someone who resents handing my car over to a valet, that alone takes this pizzaria above the rest of the downtown venues. I was intially introduced to Baraonda by an finicky Italian and he compares it favorably to places back home. Be prepared for a wait if you go before a show at the Fox is about to start.", "Date": "2008-12-05", "Author_Location": "Atlanta, GA"}, {"Author": "Lindsey R.", "ReviewID": "S_cx7K0R3jFtgUnu_BJelw", "Overall": "4.0", "Content": "I went  here on my first date with my (now) fiancé. The atmosphere was very nice and the service very good! I can't remember what exactly I got, but my fiancé always gets the lasagna...BEST I've ever had! I've decided now, the next time we go, I'm ordering the lasagna, so I don't have to steal bites from him ;-) Now, the part where they went above an beyond the call of duty. My fiancé set this up as our \"night of engagement\" dinner place. This was in December and since it's near the Fox, they were booked because of the Nutcracker. He called the week of to reserve a table and they told him that he wouldn't be able to get in...well, then he told the lady that he was planning on proposing to me. She replied, happily \"Let me see what I can do.\" He gave her a little run down of where he was planning on proposing to me - it was outside the restaurant. She didn't have to say anything really, but she asked for details and he told her he wanted to do it under the canopy walkway across the street (which leads to the parking garage, where you can park if you dine here). She told them that place was fenced off and had been for a while bc it's under construction.  She even offered to take pictures of it and text it to him, which she did! He made a plan b, but we were still  able to have dinner there that night. The waiter almost spilled the beans, but I was completely clueless haha so I thought he was congratulating us on our 1 yr of dating, with that, we got two shots of lemon cello and a dessert on the house.", "Date": "2014-04-10", "Author_Location": "Atlanta, GA"}, {"Author": "Jerry C.", "ReviewID": "RhYsEoLOU4T8-Gqg2F9MNg", "Overall": "2.0", "Content": "I just have a few things to add.  Granted, we stopped in before a sold out show at the Fox (Mumford and Son- awesome), but Baraonda bills themselves as a place to go before or after a show at the Fox.  And  they weren't even slammed.  We were offered immediate seating on the patio then promptly ignored.  Eventually we wound up with warm beer and cold pizza- both resulting from an inattentive server not getting the product to the table.   The pizza came before the salad  which they took off the check.  Nobody seemed concerned as to whether we would have enjoyed a second beer (except us) until we had finished eating, with empty glasses. The pizza's had a nice char on the outer rim but was soggy in the middle by the time we got it. Possibly the crust was a bit undercooked.  They must rely on the fact that people who stop in before a show are reluctant to send a dish back due to time constraints.  We sat under a speaker which was blasting a techno loop that appeared to have no beginning nor end but lots of thump.  Annoying.On the positive side, the spicy salami slices on the  Fra Divolo are really good.   And the guy who fills the water glasses did a great job!", "Date": "2011-06-17", "Author_Location": "Roswell, GA"}, {"Author": "Emily H.", "ReviewID": "OG5scvogEbOPvVpbbwINIw", "Overall": "4.0", "Content": "Great place for dinner, very intimate and dark. I enjoyed their pizza (many different kinds to choose from) and wine. It wasn't too busy when we got there around 7PM, but it definitely picked up later with only standing room available. I would recommend reservations if possible.", "Date": "2008-04-14", "Author_Location": "Grand Rapids, MI"}, {"Author": "Rhonda C.", "ReviewID": "iMmgWaLDwX9fuKWm8aBvRg", "Overall": "4.0", "Content": "I love to swing in here after a show at the Fox.  I've had quite a few different pizzas here and I've enjoyed them all.  Good drinks, great wine list, and the atmosphere is cozy with dim lighting.  I do have to say that during one of our visits, we had to suffer through service that was sub-par, but overall I've had great experiences at Baraonda.", "Date": "2008-04-19", "Author_Location": "Atlanta, GA"}, {"Author": "Naveen D.", "ReviewID": "drlY-roFVtBWIApUw7tKtQ", "Overall": "4.0", "Content": "The pizzas are good - Fritti is better. But, the lamb chops here were awesome!!", "Date": "2007-06-16", "Author_Location": "Alpharetta, GA"}, {"Author": "Lisa B.", "ReviewID": "MiRvOTTzYm3gf26NbrYqhw", "Overall": "4.0", "Content": "Went here for dinner on Friday night before \"Dream Girls\" at the Fox. We had called ahead of time to see what time we would need to arrive to make it to an 8:00 show at the Fox. They told us that if we were there by 6:00 that we'd have plenty of time to get to the Fox. So that's what we did - when we arrived just be 6:00 the place was pretty much empty, by 6:30 the place had filled in nicely and our entire area was full.  Note: They do not take reservations unless your party is 6 or larger.First impression of Baraonda was it was a much larger place than it looks from the outside. There are three different areas - the main dining room, a smaller dining room and then the bar area. There is also a small patio off of the bar.  We sat in the main dining room which was dimly lit with wood tables and chairs. If you have a hard time seeing you may want to bring a pocket flash light or request to be seated elsewhere.Our server came over immediately and was attentive at first. As he had more tables seated his attention to us began to fade and he seemed more rushed with every interaction. Service wasn't terrible but it was a little slow. I started with the Casa salad which consisted of field greens, carrots, cucumbers and a vinaigrette dressing. My only complaints about the salad were 1. it only had one itsy bitsty teenie weenie cucumber and 2. there was barely any vinaigrette on it. It's not like I want a salad that is swimming in dressing but there really was like none on this salad. Oh well. For my entree I went with the penne checca pasta - penne pasta, tomato, garlic and olive oil - and I opted to add grilled chicken per our server's suggestion. The pasta was good, the tomatoes were full of flavor but I wish I had skipped the chicken. It was really dry and just seemed processed, not like fresh chicken breast hot off the grill. Next time I may try a pizza instead of pasta because they looked REALLY good. For desert I ordered the sorbet - two scoops of blood orange, one scoop of wild berry. The wild berry was great and the orange blood was good but too tart for my taste. I'm going to try the tiramisu if I ever go back...it looked amazing! Overall I enjoyed my meal at Baraonda. I highly recommend it if you are going to the Fox because it's really convenient - you only have to park once! The food was good and the service was average. I would definitely come back and try some of their other offerings.", "Date": "2010-10-18", "Author_Location": "Woodstock, GA"}, {"Author": "Lori F.", "ReviewID": "Y75viunudrnRCTrNdDz0kg", "Overall": "5.0", "Content": "Amazingly good pizzas, tasty house cabernet, and it's right next to The Fox.", "Date": "2007-06-12", "Author_Location": "Atlanta, GA"}, {"Author": "Monika D.", "ReviewID": "2EFZVrhEENlGounL4-2f5w", "Overall": "1.0", "Content": "This place picked the wrong person to mess up their order. After being seated and waiting 20 minutes with no service, I got my order to go. The WORST Chicken Piccata, yes they screwed up CHICKEN. Browned and beautiful, while raw fat and dry on the inside, bland potatoes, and I spent 20 dollars for that culinary equivalent of dog crap in a to-go box.", "Date": "2013-04-04", "Author_Location": "Atlanta, GA"}, {"Author": "Jen K.", "ReviewID": "ymokTVBDnGlKOt05TMChQg", "Overall": "5.0", "Content": "This is our go-to pre-Fox Theater dinner date place.  I truthfully think this place has the best pizza in Atlanta.  The only runner up in my opinion is Fritti, which can't beat Baraonda's perfect Peachtree location.  Baraonda also has great outdoor patio seating, which they close in and heat during cooler weather.    I have had about 10 different pizza combinations, and must say that each and every one of them has been excellent.  Thin, crispy, real Neapolitan style pizza cooked in wood burning ovens.  I've also tried a good selection of their appetizers (beef carpaccio, calamari, salad caprese, and bruschetta stand out in my mind) all of which met my expectations.  It is prettty rare that I have gone to a restaurant so frequently and not had at least one or two things I didn't like. Great wine list which offers a lot of affordable options.  One thing to note:  the service.  If you are coming on an evening when there is a show at the Fox, be prepared for mayhem!  It is usually packed to capacity, although the servers have always been very good about getting us served and checked out in time for the shows.   Give yourself plenty of time though and it won't be any stress at all.  Other evenings are much more chill, so keep that in mind if that concerns you.  Overall, we have always had great experiences whether we there during busier or slower services.", "Date": "2010-03-22", "Author_Location": "Atlanta, GA"}, {"Author": "Blissful G.", "ReviewID": "kpaXCYOoW9_xwJ1uN5K9jA", "Overall": "2.0", "Content": "I really think the quality at this place has slipped over the past couple of years. Their pizzas are just not the same...", "Date": "2007-09-12", "Author_Location": "Atlanta, GA"}, {"Author": "M M.", "ReviewID": "kjviE64W6xpWAxNdKi3Zeg", "Overall": "4.0", "Content": "one word, YUM! been wanting to come here for a while and now Im upset I took this long to frequent this wonderful Italian restaurant. Divine pizza's, great starters and a cozy atmosphere. The server was friendly , service quick and all the dishes (for the 5 of us) arrived on time. If you are a thin crust fan, this is the place you want to go to, highly recommended ! (oh and dont forget to try the deserts!!)", "Date": "2008-08-02", "Author_Location": "Atlanta, GA"}, {"Author": "Sudhanshu K.", "ReviewID": "I1Yq2FZrtwq6udTBykNZWA", "Overall": "1.0", "Content": "I really don't understand how this place received so many good ratings. When I looked up Italian on yelp this place recieved almost exclusively 4 or 5 star ratings. So I assumed this place was going to be great if not really good. But, I was extremely disappointed.First, we made reservations, but somehow, the hostess didn't note it, despite us calling her twice to make sure, and we ended up having to wait an additional 20 minutes. Then when she sat us down, she was not sincere at all, dropping the menus on the table and running off. Our waiter seemed like she was in a real rush, and that we were not important to her at all. Seriously, she was walking away from us while we were ordering.Now the food, to be honest first, I am not a big Italian food fan, but this place was as bland as they come. We first had the Calimari, which was average at best. Then for main course we split a Pizza and the Ravioli Special they had that day. The pizza had no taste, well cooked but lacked any substance. The Ravioli, was as bland of a ravioli as I have had, the Ravioli in a can has more taste. The crab meat was hard to taste, the only way I knew it had crab meat was by texture. But the crab taste was overpowered by the sauce they had. Maybe I went on a bad day or something, but this place did not live up anywhere close to the standard Yelp reviewers gave it.", "Date": "2007-12-14", "Author_Location": "Norcross, GA"}, {"Author": "Jamie M.", "ReviewID": "DPEsE7JA9BzbsOY60_aQxw", "Overall": "4.0", "Content": "This place is the embodiment of midtown Atlanta.The food is top notch, the waitstaff is perfect, and the view of Peachtree Street is a nice backdrop. Make sure to try the taramisu, and you will thank me.", "Date": "2012-10-20", "Author_Location": "Roswell, GA"}, {"Author": "D L.", "ReviewID": "N_cG3CAyg9KRZ-_gViQKCw", "Overall": "3.0", "Content": "I remember the first time I had arugala was here. We were complaining about the salad dressing, that it had too much... something :) Haha. Pizza was good. The night I went it was super busy and the place was filled with all kinds of people. I am going again next week and hope to become a fan then.", "Date": "2008-10-19", "Author_Location": "Atlanta, GA"}, {"Author": "Lizette C.", "ReviewID": "yqD6InmHvi1ed3p9Rvv3-Q", "Overall": "5.0", "Content": "Went here before a concert last year at the Fox Theater. This place was right next to it so we just went to get a quick bite to eat. I wish we had more time because it was such a nice experience. We all had pizza (Margherita). Superb! Wait staff was freidnly and funny. Nice and quaint. Wonderful for a date or small gathering. Kind of pricey, but what do you expect for an Italian restaurant next to the Fox on Peachtree? But there are ways around that. Order an app. Having ordered pizza apps, we saved money (only cost $11-$13), and the meal was satisfying but still light and pleasurable. The perfect start to a perfect night. Go here!! It's worth the money!", "Date": "2013-09-09", "Author_Location": "Lithonia, GA"}, {"Author": "Marie P.", "ReviewID": "ahbOT-DAPs5jPkMLbY55KA", "Overall": "3.0", "Content": "I'm usually pretty reluctant to try a lot of the restaurants on Peachtree in Midtown because of the sheer volume of people. So, I was a little skeptical about eating here but after a friend's rave, I decided to go for it.I came here with an old friend for dinner. The space was packed because of a show going on at the Fox but there was only a 10 minute wait. While waiting outside (it was a perfect spring evening) we actually debated going to Enoteca because there was NO ONE there. But we stuck it out and waited for our table. We were seated outside on the small patio which was surprisingly loud. So much for a quite dinner. Our server took FOREVER to come to the table and when he finally did, the first thing out of his mouth was \"Know what you want?\". No \"How are you\" \"Welcome\" \"Can I take your drink order\" or anything polite and welcoming. It was jarring and it totally threw me off. After being completely stunned by that, we ordered the Caprese to start with before we decided on entrees. It's pretty difficult to mess up tomatoes, basil and mozzarella cheese and this one was enjoyable. Decent mozzarella and the roma tomatoes were perfect. We decided on a pizza and went with our server's suggestion of the Specialita - mozzarella, goat cheese, arugula and cherry tomatoes. Our server suggested adding chicken but we decided to skip it. And the pizza was excellent. The pizza dough was so yummy. It reminded me slightly of naan bread, which I'm always a fan of. Overall, the food was pretty good and I enjoyed it. But the service really turned me off. About 10 minutes after being seated, everyone left for the show at the Fox, so the restaurant was empty. Plus, it was a Thursday night. But that's besides the point. The restaurant was empty! Yet the service just sucked. There was no excuse for our server being so rude and absent. I still can't get over how he greeted (or didn't greet) our table! Ugh...", "Date": "2009-04-20", "Author_Location": "Atlanta, GA"}, {"Author": "Broderick S.", "ReviewID": "YRdraBCUmhyVYJXDXV8SlQ", "Overall": "4.0", "Content": "It's just a couple of blocks down from me but I always seem to forget it's there. I went with a couple of friends and ate at the bar. The bartender was friendly and had a great time. I chose the caprese -- the pizza not the salad. They actually brought the salad, as I didn't specify that I wanted the pizza, but they gladly returned it and the pizza came out very shortly after. The Moretti beer on draft was cold and tasty. They closed at 10 on Sunday but we didn't leave til after 10:30 and were never rushed. Keep an eye out for the schedule at the Fox Theatre nearby as it will definitely impact availability, the pizza was excellent (the salad looked delicious too) and I'll definitely be back.", "Date": "2009-04-22", "Author_Location": "San Diego, CA"}, {"Author": "T. Murray -.", "ReviewID": "DPQZ25Gj27CKNvdFLcZZuA", "Overall": "5.0", "Content": "What more can I say. Pizza, Italian food, and all things saucy. This one can't go wrong in my book because we are talking about my favorite type of food. I've had all sorts of things off the menu and have never been disappointed. I used to go here alot for lunch when I worked in the area. A cheese pizza with a little grilled chicken topping ordered here will never fail.", "Date": "2007-03-05", "Author_Location": "GA, GA"}, {"Author": "Karl H.", "ReviewID": "o3cy6E3daE5Q_Z593eKdGg", "Overall": "4.0", "Content": "LOVE this place!  My $12 pizza was awesome -- I'm so happy I finally checked this place out.  I'll be going backa a LOT.", "Date": "2009-10-04", "Author_Location": "Atlanta, GA"}, {"Author": "Tom W.", "ReviewID": "hYVM5JFG6qVRtcg-LfWUzA", "Overall": "4.0", "Content": "Great food and pizza.  Service is usually good.  Stay away during theater nights.  It gets too crowded.", "Date": "2013-11-22", "Author_Location": "Atlanta, GA"}, {"Author": "Ray A.", "ReviewID": "ppBzG7MOIagwN4aXGWOPFA", "Overall": "4.0", "Content": "Great spot for lunch.  The waiter was friendly and knowledgeable. Attentive, but not overbearing.  I had the Cesar salad, which was perfect. Just the right amount of dressing. I particularly like the enclosed patio.  It gives the sense of being outside without the 90 degree sun and traffic noise.  I'll be back regularly.", "Date": "2008-07-23", "Author_Location": "Atlanta, GA"}, {"Author": "Stephanie S.", "ReviewID": "_2Ygg7-H3op6Eq0H_CkwtA", "Overall": "1.0", "Content": "Food was good. Waiter was good. Hostess and restaurant owner/manager horrible. Hostess was extremely pretentious and treated my fiance like garbage (after my table spent almost $400.00). The manager was throwing his arms up at us as if he was attempting to pick a bar fight. Horrible customer relations. They did NOT make me feel welcomed in my neighborhood eatery. I most likely will not spend another penny here.", "Date": "2012-08-18", "Author_Location": "Atlanta, GA"}, {"Author": "Vida D.", "ReviewID": "21urL__fLWYBnkZbc7CDOQ", "Overall": "3.0", "Content": "I've eaten here a few times, none too recent. I've always had some sort of pasta, and it's always good. Nice ambiance.", "Date": "2008-09-29", "Author_Location": "Atlanta, GA"}, {"Author": "Christopher P.", "ReviewID": "KFTZHa3k0Zi6uA4bCnuE8g", "Overall": "3.0", "Content": "proximity to the Fox + crispy thin za + kind of pudding-like tiramisu = the only place I pre-game for the Fox.the pizza is always baked nicely.  the ms. and i ordered the specialita sp?, cherry tomatoes, goat cheese, and arugula.... yumservice was decent.  i'm not a big fan of dessert but I've never had a pudding consistency tiramisu....most events at the fox start around 8.  we got there at 630 and were finish in time to be early....", "Date": "2010-10-07", "Author_Location": "Atlanta, GA"}, {"Author": "Margo R.", "ReviewID": "relj5-yLrjCi5HNo_HAJmA", "Overall": "5.0", "Content": "Completely divine. This is a great date place - impressive location, nice lighting and a menu that would please almost anyone. Delicious drinks and rich Italian dishes color the menu at this tiny restaurant. I loved the Carfuncella - a pink sauce with tomatoes and mozzarella cheese. I am picky about pasta, and I adored this dish! Definitely recommend this place to fans of Italian food and those in search of a romantic spot.", "Date": "2007-01-26", "Author_Location": "Atlanta, GA"}, {"Author": "Diana S.", "ReviewID": "zJqZJvoPJ-OOBt0j6XH0CA", "Overall": "4.0", "Content": "This is a cute little place with some nice little romantic nooks. We went on a Monday night and had one of the wines for $15. It was....ok. What can you say, it was a bottle for $15. The calamari and salad were both great. My tilapia was on the salty side, as was the side of sauteed spinach. However, my friends really loved their dishes. I'm giving this place the benefit of the doubt and hope that the over salting was a one time thing.", "Date": "2009-02-08", "Author_Location": "San Mateo, CA"}, {"Author": "April T.", "ReviewID": "iufT1UPB7tRdkXMpfr0LKQ", "Overall": "1.0", "Content": "We took my inlaws here on their recent visit. We recently moved to the neighborhood and it was our first (and last) visit. The only saving grace is that the food was actually good. Our waiter was rude and especially condescending to my father in law...who is 85 years old. The restaurant was not busy at the time we went for dinner. The nicest employee we encountered was the busboy. I usually give a place a second even third chance but with the endless options available in this area I will gladly dine somewhere nicer.", "Date": "2013-03-03", "Author_Location": "Atlanta, GA"}, {"Author": "Erich F.", "ReviewID": "ovJFEryJcY8UdUUpH9tvog", "Overall": "4.0", "Content": "Spinach and cheese pizza is awesome. The thin crusts are amazing on all their pizzas.", "Date": "2012-11-26", "Author_Location": "Woodstock, GA"}, {"Author": "James H.", "ReviewID": "SFbyubn17DQuSVTPfBSnYw", "Overall": "1.0", "Content": "Met a large group (12) of friends specifically for what they promote as \"Apertivo! Italy's happiest hours\" which promotes complimentary appetizers. The person organizing it called ahead to check on the happy hour and told it was a go - but when we got there - because there was a show at the Fox - they said no free apps. There were cards at the bar promoting it - and was written in chalk on the front door. The bar tenders told us we could talk to the manager - which just ruins the mood of the gathering and shows poor customer service. Don't plan to be back.", "Date": "2013-11-08", "Author_Location": "Atlanta, GA"}, {"Author": "PC S.", "ReviewID": "ZttT65EwDDnNUXV9D7wXQA", "Overall": "5.0", "Content": "On the rarest of occasions I found myself actually ignoring my workaholic tendency and ventured out to have a social life for a few hours with random strangers I barely knew.  While it would be highly entertaining for me to review my companions for the evening, for those with weak stomachs or lacking the ability to appreciate accurate stereotypes, I will stick with reviewing Baraonda.  I pass this place daily when trekking past the eager homeless and the downtrodden derelict, but this was my first time venturing inside.  For an appetizer we split the calamari which was fantastic!  I mean, who doesn't love squidrings! I also liked how their calamari doesn't come with the little, sad looking fried baby squid that makes me feel like a total cruel and heartless barbarian as I devour its friends.  Weirdo #1 ordered a pizza which looked impressively like what you imagine pizza would look like if it wasn't delivered in a cardboard box and was made by someone truly Italian.   I ordered the Linguini Pescatore, which  is a pasta tossed with shrimp, clams, and crab in a tomato sauce, mostly because Weirdo #2 also ordered pizza and I felt like one of us had to be daring enough to order something other than some variation of my regular Friday night meal.  It was really, really good!  Too good in fact, as I gorged myself on the meal.  Granted this is due in part to my tendency to avoid all things carb laden now that I am in the post-lard, semi athletic phase of my life (see my reviews on my personal trainer for more on how I found muscles), but still I devoured it like it was my last meal on earth.  The flavor was distinctly authentic tasting and is right now causing my stomach to rumble as i post this review.  The Weird Ones then insisted I have something called tiramisu (sp?) for dessert, as apparently my redneck tendencies that I thought I kept buried deep down enough not to give me away, sold me out when I gave them a funny look when they asked if I had tried it before.  SIgh.I confess, I didn't know what it was...I have so much to learn to become cultured.  I still don't know what it is to be honest, but it was worth the harassment I'd receive if I ever admitted I now secretly love...whatever it is.  While normally I'm not much of a wine fan, there was a really good wine they forced upon me, the name of which escapes me.  I'm pretty sure it was something fruity and spicy.  It was great. In fact, it made me rethink my hesitancy to choosing wine over beer.   You should ask for that wine..specifically.  The fruity spicy wine drink that goes great with squidrings, pescatore, and tiramasu..tiramisu..tiram....that really good italian dessert.  I'm sure they will know which one I'm misremembering.  Food was awesome, service was prompt, atmosphere was appropriate and on target.  The next time I miraculously find myself actually going a date, I'm seriously gonna have to upgrade from Taco Bell to Baraonda.  My transformation continues.....waaaahaaaahaaa.", "Date": "2009-07-14", "Author_Location": "Atlanta, GA"}, {"Author": "Luj W.", "ReviewID": "IJ_hhzxhyBCjDD-SQMcSLg", "Overall": "4.0", "Content": "My husband and I took our 4 and 6 year old kids for a special dinner before Peter pan the play. We were in a bit of a rush and let our server know right away. We put in a pizza and pasta order for the kids and in less than 3 minutes the pizza and pasta were on the table! I have never seen food come out that fast even in mcdonalds! The pizza was amazing and we all devoured it almost as quickly as it came out. We immediately ordered another one, this time we tried the margarita one. It was the cheese pizza with a few shreds of basil. Certainly NOT a true margarita! Pasta was a bit firm and undercooked, drenched in butter. Even worse, each \"side order of plain penne w/ butter\" was $10! Total rip off. My husband and I split a clam appetizer, casa salad and the fish of the day. Clams were delish. The broth was perfectly seasoned. The basket of bread was stale. Salad was a small mound of field greens with 2 slivers of cucumber. Only plus was the yummy dressing. Fish dish was on the small side with a tiny mound of spinach on the side. It was drenched in red sauce and should have been in a bowl. It needed a side of pasta and not worth the $24 price tag! Luckily, the 2nd pizza was all we really needed and we left most of the fish on the plate. I'm being generous with a 4 star rating, because we will definitely be back for pizza and salads and was great for the entire family. Here's the breakdown:Service: greatPrices: besides the pizzas overpriced and small portionsPizza: fabulousOther food: good, not greatAmbience: warm cozy upbeat and fun; great pre-theater meal", "Date": "2011-03-06", "Author_Location": "Atlanta, GA"}, {"Author": "Joelle G.", "ReviewID": "Au21qTqHete7sXki0hYJ5A", "Overall": "5.0", "Content": "Excellent food. Excellent service. And the wine list is superb! Would highly recommend :-)", "Date": "2012-05-05", "Author_Location": "Lawrenceville, GA"}, {"Author": "Aimee B.", "ReviewID": "YdmWOaPJmbbrXlC629rj1Q", "Overall": "4.0", "Content": "I love Baraonda and suggested it for dinner before we five saw Beauty & The Beast at The Fox. I ordered lasagne and the caesar salad - delicious!! Two others shared a pizza with prosciutto, sundried tomato and onion. They said it was a bit soggy and too salty. The other 2 shared a margherita pizza with mushrooms. The taste was great but it was very soggy. My daughter had grease? dripping off it. Not so pleasant. We did share the chocolate almond cake with vanilla gelato for dessert, another yummy item. The atmosphere is great and the service was very attentive.", "Date": "2012-12-01", "Author_Location": "Fayetteville, GA"}, {"Author": "Neil S.", "ReviewID": "HUDSAdzJVk20Na2Np_wzKg", "Overall": "1.0", "Content": "First and last time here. Terrible service and food. The bar ran out of clean glasses so we waited almost an hour for cocktails. They eventually arrived - near the end of the meal. Lasagna was reminiscent of Chef Boyardee, and the mushroom fettuccine was inedible because of dirt/grit.  No effort was made to resolve the problems. And then there are the wonderful South Midtown criminal element hanging out by the front door and along Peachtree from the parking lot....", "Date": "2013-10-09", "Author_Location": "Atlanta, GA"}, {"Author": "tracy r.", "ReviewID": "d9d3zmZzR_1OOb01ROcwBQ", "Overall": "5.0", "Content": "Lady at the table next to me accidentally spilled wine all over me.  The restaurant bought me dessert - how nice was that.  Overall great eats for a good price.", "Date": "2009-11-03", "Author_Location": "Chicago, IL"}, {"Author": "G. C.", "ReviewID": "ZrbywBWAnVqkwnbrykCYbQ", "Overall": "2.0", "Content": "Here's the heartbreaking thing about Baraonda:  you cannot enjoy their truly delicious Italian cuisine for the techno-beat pumping through the restaurant. As other reviewers have noted, this dimly-lit, perfect date/anniversary/business lunch or dinner locale is completely ruined by the head-thumping music. The couples sitting to either side of me tonight had to yell to talk. My friend and I heard their entire conversations (made easier, of course, because we could not have a conversation at all due to the music and subsequent yelling.)This restaurant is obviously prouder of its sound system than its food. Truly, it's sad.", "Date": "2012-03-02", "Author_Location": "Atlanta, GA"}, {"Author": "Jimmy B.", "ReviewID": "PG5xln9taMmXplY_k1jqkA", "Overall": "5.0", "Content": "Hands down the best italian food & brick oven pizza in metro Atlanta.  I've been here for 11 years, tried virtually every recommended Italian eatery around & they still always come out on top ...", "Date": "2011-09-07", "Author_Location": "Atlanta, GA"}, {"Author": "Lucy W.", "ReviewID": "j7BxaZ2HkVs37eAw6q3ChA", "Overall": "3.0", "Content": "Pre-theater choice for restaurant- I went here before going to a show at the Fox Theater about a block away.  I sat at the lively bar, and got a delicious and generous-sized pizza- ham, artichokes, mushrooms, fontina cheese.  The bartender recommended a great wine to go with it.  Overall, convenient, pretty tasty pizza.   It's crowded pre-theater so make a reservation if you are on a time schedule.", "Date": "2009-05-09", "Author_Location": "Atlanta, GA"}, {"Author": "Carrie B.", "ReviewID": "-AtFpbHNkBkez99cqxKIXg", "Overall": "4.0", "Content": "Somehow it escaped me to review one of my \"old-faithfuls\". The hubby and I love popping into Baraonda for a pizza and salad or antipasto and rarely have any issues. When the weather is nice the little patio is cute and cosy and reminiscent of a little cafe in Key West or New Orleans. It's a great place to grab a quick bite or grab a bunch of friends and make a night of it. They generally take reservations for 6 or more, but when there's a show at the Fox they won't take them until after 8pm.", "Date": "2010-10-29", "Author_Location": "Atlanta, GA"}, {"Author": "Kenneth N.", "ReviewID": "zHleq9YNYwy_n8Mgnf2eaw", "Overall": "4.0", "Content": "Friendly staff, Good Food, Try the Calamari, it's tender and lightly breaded. Not a large beer selection but you can probably find something you like in a pinch. Like the Peroni, or Abita Jackamo.", "Date": "2011-07-27", "Author_Location": "Sandy Springs, GA"}, {"Author": "Dave B.", "ReviewID": "VfNSzPJ0f8VXhoqiLdDkqw", "Overall": "4.0", "Content": "Baraonda is a new delight. I've had the Penne Salsiccia 3X in the past week. Customer service is A+.", "Date": "2012-08-10", "Author_Location": "Lawrenceville, GA"}, {"Author": "Christian B.", "ReviewID": "uWI6NncMtbI3iVJvB3R20A", "Overall": "3.0", "Content": "Good, but pricey. One of the few places to get a decent meal before a show at The Fox.", "Date": "2008-10-12", "Author_Location": "Austin, TX"}, {"Author": "Dustin W.", "ReviewID": "c4KnVROkh-pQmhExBgoEkQ", "Overall": "4.0", "Content": "I use to live in Midtown for a while and have been working downtown for years and never have had a desire to stop at Baraonda. I only wish I would've stopped here sooner. Probably the only Pizza I've eaten in Georgia that I haven't been disappointed with. I really enjoyed the food and the atmosphere.", "Date": "2010-12-16", "Author_Location": "Atlanta, GA"}, {"Author": "Heather I.", "ReviewID": "9l9IjGXOFKvI47uxd6Vyqg", "Overall": "4.0", "Content": "Another one of those places that I have driven by for probably 10+ years and have never been and for that, I am sorry. I have usually shied away from Italian restaurants due to my dairy allergy because usually the ONE thing on the menu that I can actually eat tastes like Chef Boyardee...but that SO wasn't the case at Baraonda! We ordered the calamari and Bruschetta as an app and the portion sizes were large enough to feed four people easily. My entree was the penne with vegetables and WOW I just want to rub this stuff all over my face it's so good. It even had eggplant in it, of which I am not a fan on Facebook, but they did something to this eggplant to MAKE ME LOVE IT! Our server, Han, was awesome; very attentive and made sure we had copious amounts of fresh ground pepper. The ambiance was sexy and fun and I definitely can't wait for another reason to come here again!", "Date": "2010-08-18", "Author_Location": "Atlanta, GA"}, {"Author": "David G.", "ReviewID": "MwYtyhXDkC2-DNicg8fRmg", "Overall": "3.0", "Content": "I had the Costelette d'Agnello - sauté lamb loin chop, orange mint gremolata, mashed potatoes, green beans.  The lamb was nice and tender.  I found the green beans to be a bit well done.  I like a bit more of a snap to my green beans.  The potatoes were cooked well, but I found both the potatoes and the green beans to be too salty.", "Date": "2010-09-13", "Author_Location": "Largo, FL"}, {"Author": "Cricket B.", "ReviewID": "g7xCiZhdmSRyhvz5aP4qlw", "Overall": "2.0", "Content": "Food was tastey but the service was lacking...in fact I felt our server was quite rude.  Enjoyed the gorgonzola salad and the ravioli of the day was very good but the overall experience was just not good, unfortunately.  Again, the server, just rude.", "Date": "2011-11-21", "Author_Location": "Atlanta, GA"}, {"Author": "Paula S.", "ReviewID": "2yYAjdnYI-sXdD3DJJCAKw", "Overall": "1.0", "Content": "Went to Baraonda Saturday night to pick up a Caprese pizza and a Gorgonzola salad. The place is nice but the quality of the food is BAD! First of all the pizza is not big enough for 2 people. They threw a whole bag of Arugula on the pizza and it wasnt cooked at all. There was hardly any basil or mozzarella cheese and they didnt cut the pizza for us. The salad was just big chunks of lettuce and a little cheese and nuts. Not impressed by the food. Would not go back.", "Date": "2013-09-18", "Author_Location": "Charlotte, NC"}, {"Author": "Starfish_Coffee M.", "ReviewID": "HehehOUita_P9bPYYmxDdA", "Overall": "4.0", "Content": "Good stuff...the pizza's are the best and love the decor.", "Date": "2009-08-06", "Author_Location": "Atlanta, GA"}, {"Author": "Jen U.", "ReviewID": "tAyKQ2UeWRSoGyPKSHgGYw", "Overall": "4.0", "Content": "Good pizza and ravioli! Worth the trip.", "Date": "2012-05-21", "Author_Location": "Henderson, NV"}, {"Author": "Barry B.", "ReviewID": "uECy8uaXnnMspSgxn7gDGQ", "Overall": "4.0", "Content": "On a busy night service was attentive and prompt. Wine was a nice Montepulciano d'abruzzo. Entree was a wonderful papperadelle with lamb ragu. Flavorful with large juicy chunks of lamb. Very tasty meal- when back in Atlanta I'll visit again!", "Date": "2012-07-02", "Author_Location": "Schenectady, NY"}, {"Author": "Chris T.", "ReviewID": "g98RoOdgV4zzIPnKlRN7jg", "Overall": "4.0", "Content": "Outstanding. Maybe my expectations were low based on the other options I was seeing on Peachtree st., but this place was really excellent. Highly recommend. Lasagna was so good I was actually slowing down to savor.", "Date": "2010-02-11", "Author_Location": "Brooklyn, NY"}, {"Author": "Christina B.", "ReviewID": "KG1xoZrAMszu60y6JaY5-g", "Overall": "4.0", "Content": "We went here for a business lunch and it was great.  The space is very pleasant and charming, the waiter was attentative and gave frequent refills, and my prosciutto panini was delicious.  It might have been better on foccaccia rather than sourdough, but it was still great--especially the addictive homemade chips.", "Date": "2012-05-14", "Author_Location": "Brooklyn, NY"}, {"Author": "Ethel F.", "ReviewID": "u-t5L2Onkgc8_wX9DrofEw", "Overall": "5.0", "Content": "BEST BLUE CHEESE OLIVE MARTINI'S IN THE USA!!!I stayed across the street at the Indigo last November for a few nights.  The first night I came here ate at the bar.  I watched the bartender playing with an olive and making a cocktail.  He told me it was a blue cheese olive martini.  It looked so fabulous, but I could not have one that night because I had to drive somewhere, so I came back the next night and had 2!  The food was fabulous!  First night I had the Minestrone Soup and a Gorgonzola Salad.  The soup was so delicious it just melted in my mouth.  The second night I brought my children with me and we had a Caesar salad, Penne Checca with Angel hair, Ravioli, and a Margherita pizza. For desert we had creme brulee and a tira misu.  We fought each other for the last bite! The service was amazing.  They customized the pasta dish for my picky eater son and he gobbled it up.  The bartender came over to check on my martini.  The ambiance is so romantic, even if you are alone you feel romanced.  The wine list is also superb!  I keep ordering those blue cheese martini's all over the US now, but very few restaurants come close to Baraonda.  I would fly back to Atlanta just to have another, as a matter of fact...I will be there next month with my boyfriend so I can enjoy the wine list as well!  I can't wait!", "Date": "2013-08-10", "Author_Location": "LA JOLLA, CA"}, {"Author": "Dan R.", "ReviewID": "8Ux--r0jxDxgeuAFBflvNQ", "Overall": "2.0", "Content": "Ordered the antipasto and mussels appetizers which were very good. The entrees we ordered however, lasagna and veal masala were definitely not worth the price. Very very salty, not tasty at all.", "Date": "2008-02-17", "Author_Location": "Atlanta, GA"}, {"Author": "Cousin D.", "ReviewID": "X3BQ8uAjqxc8MJ04Zdtq_Q", "Overall": "3.0", "Content": "Been here a couple of times.  Loved it the first time and was not so impressed the second time.  Service was good.  Casual, which I like but just not a place you think of going when you are thinking of a good place to have dinner.  Sorry, don't love it.", "Date": "2010-01-06", "Author_Location": "Atlanta, GA"}, {"Author": "Josh B.", "ReviewID": "oJBgr-EHytpVTh2L0wNTRA", "Overall": "1.0", "Content": "I sat at the bar , ordered the Clam appetizer, they where ok. The bartender was friendly. I ordered the Pollo alla Picata - chicken breast,capers,lemon,white wine topped with poached cherry tomatoes,potatoes. I have had a similar dish several times & this was the worse. It was awful ! The pizza's coming by me looked good, but I would stay away from the plates .", "Date": "2010-03-15", "Author_Location": "Atlanta, GA"}, {"Author": "Lee P.", "ReviewID": "9zi-GbI2SueXQOZ3Qutigg", "Overall": "4.0", "Content": "Plan on going after the show starts at the Fox. Then tables can be had pretty quickly. The pizzas are excellent!", "Date": "2010-03-22", "Author_Location": "Atlanta, GA"}, {"Author": "Stricky T.", "ReviewID": "92ldFIf7-LEuB1pSiIdUYw", "Overall": "3.0", "Content": "This used to be our weekly Italian lunch cuisine (from work); its location was perfect and accessible. I recommend asking for the daily specials (a surprise awaits)........I have a favourite........... Linguini Pescatore - shrimp, clams, calamari, white wine, garlic, red chili, cherry tomatoes. The brick oven is a bonus and I must admit I was a little excited about that, fresh baked bread; good olive oil and nice parmesan reggiano (crushed black pepper)........tidy. Anyway, an Italian meal that is not too pricey this is a very nice place and you will enjoy the food.....................", "Date": "2010-09-16", "Author_Location": "Atlanta, GA"}, {"Author": "Ginger W.", "ReviewID": "XsjIwstj5_zdyZuMnua-3Q", "Overall": "3.0", "Content": "This is usually my choice before events at the Fox. I believe that they do the best job possible trying to seat tables when they are busy. They always have plenty of servers and food comes out fast. This place is good, but not great. It's maybe a touch overpriced. I have probably eaten here 20 times. I usually get a salad and split a pizza with my friend. I have never eaten here on a non-Fox event night. They do have a great patio area that stays warm even during winter months. If you are headed to the Fox, arrive about 90 minutes early and give Baraonda a try.", "Date": "2009-04-26", "Author_Location": "Atlanta, GA"}, {"Author": "Ryan S.", "ReviewID": "l6inkiihWUltGh0jJl8ArQ", "Overall": "3.0", "Content": "We came here for lunch and were in a bit of a hurry. No worries. The staff was friendly and the food came quickly. The olive oil for the bread was a little thick, not what we were expecting. The vegetable pizza was fresh and quite good. For a \"nice\" restaurant, we were able to get in and out quickly, which was to our advantage since we were heading to Turner Field right after.", "Date": "2009-07-01", "Author_Location": "Chicago, IL"}, {"Author": "Andrew D.", "ReviewID": "ju1OS1e5-LAE8MOmhcinGg", "Overall": "3.0", "Content": "Baraonda I think was fair, its decent italian food, the drinks are good and the price is reasonable. I wasn't a big fan of the pizza but the calamari was good", "Date": "2009-09-04", "Author_Location": "Atlanta, GA"}, {"Author": "John N.", "ReviewID": "C9PnnK3RJHdnJCGzEkFEjw", "Overall": "4.0", "Content": "We ate here last night after not finding Enoteca Carbonari...  Which was a bummer since they didn't have carbonara in the menu (my wife's fave).  That was the end of our disappointment however since we loved everything else.  The chianti hit the spot.  The foccacia was really more of a flatbread, but delicious.  Cesar salad was fine and the vongole had a great kick.  She had a tasty feta pizza, but wasn't fond of the ...  My eggplant pasta was delicious.  Finished with a light tiramisu and we were quite satisfied!", "Date": "2010-08-11", "Author_Location": "Corvallis, OR"}, {"Author": "Liz S.", "ReviewID": "n_mvGv2bha4x2RIfg9tNvQ", "Overall": "4.0", "Content": "Great atmosphere and service. They asked if we needed faster service due to our show and gave us a table promptly. My chicken dish was amazing! To die for - pollo something under the secondi - really recommend it. Excellent excellent excellent. Our waiter was okay, forgot our bread and came by every so often, could've been better.", "Date": "2012-01-27", "Author_Location": "Peachtree City, GA"}, {"Author": "Chris H.", "ReviewID": "P87Hnm8EL7ycqrf7YZNHiQ", "Overall": "2.0", "Content": "The host started the meal badly by seating us at a bad table when there were several good tables available. The food was overpriced for the quality and service.  I would avoid if you can find something else.", "Date": "2012-04-21", "Author_Location": "Atlanta, GA"}, {"Author": "Raymond H.", "ReviewID": "-WpxIayF5SjaP2lcfUXTfw", "Overall": "3.0", "Content": "Awesome food...poor service.", "Date": "2012-04-30", "Author_Location": "Waynesville, NC"}, {"Author": "anya g.", "ReviewID": "om0kIvFslpv3aOt6MajtDA", "Overall": "4.0", "Content": "Great Italian food for good prices and very nice waiters.", "Date": "2009-07-15", "Author_Location": "Atlanta, GA"}, {"Author": "Nadia B.", "ReviewID": "f_9W-OA_WQKubHbvhp88wA", "Overall": "1.0", "Content": "Very bland food. Could be what we ordered--ham, potato and ricotta ravioli and the chicken picata. So disappointing and overpriced. Service was fine and the gorgonzola salad was okay, but nothing to go back for. Will not return.", "Date": "2011-05-01", "Author_Location": "Atlanta, GA"}, {"Author": "Leann B.", "ReviewID": "FCKmXGQjbvHXBI4XlS4ICw", "Overall": "5.0", "Content": "Fusilli Zucca and Penne Checca were both outstanding. Bruschetta to start was very fresh and full flavored. You won't go wrong here.", "Date": "2011-10-11", "Author_Location": "Powell, TN"}, {"Author": "Christina O.", "ReviewID": "GiTmEwmJvtTpmhPgNmbYug", "Overall": "2.0", "Content": "This restaurant came highly recommended to me when I asked friends about a place to go that is near the Fox. I was a little let down (as were my two girlfriends), though, mostly due to the lack of courtesy shown by our waitress. She acted annoyed by our menu questions, did not refill our drinks, we were not given silverware, bread was late and not brought by the waitress, she did not ask how we wanted the check divided and when we put three cards in the book, she chose to simply split it three ways without knowing whose cards were whose. It was really unfortunate because the restaurant truly has a charming atmosphere and the food was wonderful. The servings are not large, so I was hungry an hour later. I would go again, but I certainly expect better service for a restaurant of this caliber.", "Date": "2011-12-11", "Author_Location": "Fayetteville, GA"}, {"Author": "Jamie P.", "ReviewID": "VTsOI5TZ_wk7EQdvSfJRiA", "Overall": "4.0", "Content": "Great atmosphere and wine selection. Loved the pizza!", "Date": "2012-03-30", "Author_Location": "Louisville, TN"}, {"Author": "M. C. C.", "ReviewID": "cYCkQHdoiUGnnw_FyZIviA", "Overall": "5.0", "Content": "My favorite pizza in Atlanta.  The pasta is also excellent.  Great ambience and the staff is awesome.  My husband and I have been going there since they opened and it is always exceptional.  Great wine list, very good cocktails.  You won't be dissappointed in Baraonda!", "Date": "2013-06-12", "Author_Location": "Atlanta, GA"}, {"Author": "K R.", "ReviewID": "wPKGdcZNo25ysGlZ-fjLBA", "Overall": "4.0", "Content": "The Chocolate Turtle caramel cake is a 5/5 the food however 3.5/5 was ok I got the ravioli of the day.  The server was very friendly and very receptive.  I would recommend trying this place if you want a simple date night but you must get the turtle caramel cake", "Date": "2013-07-17", "Author_Location": "Smyrna, GA"}, {"Author": "Travis W.", "ReviewID": "rC1N-eekR6ZghFlynydOUw", "Overall": "5.0", "Content": "This was an overall great restaurant! Everything we ate (lasagna, Gorgonzola salad, and margherita pizza) was prepared nicely and was delicious. I really liked the atmosphere of the place: fancy enough to have $200 bottles of wine, but casual enough to spend under $20 on a meal and go there in jeans. I would recommend this restaurant to anyone in Midtown, or in Atlanta for that matter. Definitely deserves the 5 stars!", "Date": "2012-03-14", "Author_Location": "San Antonio, TX"}, {"Author": "Michael H.", "ReviewID": "2gvD98oQzTeusvLnPFXJqQ", "Overall": "5.0", "Content": "This place is great...for lunch, for dinner, for wine and for dates (if you're secure enough).  The lasagna is huge, cheesy goodness (maybe a little too cheesy), and the personal-sized pizza's have a wafer-thin crust, with several interesting options - I tried the specialita recently and loved the heaps of arugala and goat cheese (I think it was goat cheese).  For lunch, lots of corporate types during the week (but they're OK, they can't help it), and for dinner the place is always full of loud people eating, drinking and enjoying themselves...an authentic Italian experience, or people on their way to the Fox.  Someone commented on the hunky waitstaff -- yeah, the hunky male waitstaff will hit on your girlfriend as though you're not there; no worries, the waitresses are all super cute too with a bit of european attitude.  The Italian dominated wine list is killer, and reasonable (which may explain the volume and happy vibe of the place at night).  For the thin-crust pizza, its 5-star -- the best you'll find in ATL, for the wine and lunch its 5 star for the value...not the best you'll ever get, but good value, especially for the location.", "Date": "2009-01-12", "Author_Location": "Atlanta, GA"}, {"Author": "Amy G.", "ReviewID": "BR7NDpvAs3GYhBWa6rQqog", "Overall": "2.0", "Content": "I've eaten here at least 10 times because it's so convenient to my hotel when Im in town. And it's never good. Seriously, I always think that this time it'll be better, (cuz what's so hard about Italian food) and it simply never is. The wine list is ok, the Pinot grigio by the glass is rank. The sauces and pizzas are pretty flavorless. And the service is REALLY hit or miss.  And by all means don't bother going in when there's a show at the Fox, whatever food or drink they finally do get you will be subpar. The pastas are probably fine if you have small children with bland palates to feed.", "Date": "2013-03-14", "Author_Location": "Atlanta, GA"}, {"Author": "Denise W.", "ReviewID": "KFxSdf6V5eNEFxhZTcxL9g", "Overall": "3.0", "Content": "I had the Italian sausage pasta dish. Like some of the other reviewers, I thought the food was bland. The other people in my party felt the same way. However, the ambiance was nice as well as our server.  Based on the reviews, I was expecting terrible service from the hostess and waiter; but both were very courteous.  I will probably visit this place again because of the proximity to the Fox Theatre and because I would like to try their pizza which looked scrumptious.  Overall, the food was just okay. I like Carrabba's a lot better.", "Date": "2013-04-28", "Author_Location": "Hampton, GA"}, {"Author": "Kelly H.", "ReviewID": "tFZPCiZFVGl0lxn95_8TCw", "Overall": "4.0", "Content": "I have to agree with everyone...this pizza is AMAZING!!! the ingredients were soooo fresh and tasty. I ordered the fra diavolo which had tomato sauce, spicy salami, mozarella, and i paid 1.50 extra for them to add chicken. I called in my order since i would be eating my pizza alone :(. I went to pick it up and there was no parking.....little did I know that there is free validated parking in the bank of america bldg on 3rd street. so i drove around for 30min till i finally found one lil parking spot. I went in and the people weren't too friendly. I waited at the bar while the bartenders stared at me which pissed me off....then they finally decided to ask if they could help me and i got my pizza. I went home warmed it back up and hmmm hmmm hmmm......delicious....right amount of cheese...tasty spicy salami..the chicken i paid extra for was WELL WORTH IT. I will definitely be going back to experience eating at the restaurant.", "Date": "2008-10-14", "Author_Location": "Saint Louis, MO"}, {"Author": "Joe M.", "ReviewID": "qzw4UB4t13spf5G2gxPnIQ", "Overall": "3.0", "Content": "Went on a theater night so of course it was packed and noisy. Food was 4 stars, maybe even higher, but service was pretty average.", "Date": "2013-04-10", "Author_Location": "Peachtree City, GA"}, {"Author": "E W.", "ReviewID": "UUvoPF5h6VFN-hYatpjQDw", "Overall": "1.0", "Content": "Unfortunately I cannot give Baraonda a great review. The service was horrible!  From the time we entered the door, to the hostess to the bar.  The staff was rude!  We even asked for the manager who had the same attitude.", "Date": "2013-03-18", "Author_Location": "Atlanta, GA"}, {"Author": "TotallyZen J.", "ReviewID": "cpGzYs7Rbg-sVc50pCVTkA", "Overall": "2.0", "Content": "Warning! Check your bill.  I have been to Baraonda on numerous occasions before theater at the Fox.  Last week our waiter overcharged me for my glass of wine again.  This has happened before.  On another occasion he added an extra glass of wine to my bill. I'll continue to go because the food is pretty good and I like the atmosphere, but I'll stay on my guard and check the bill carefully.", "Date": "2013-02-11", "Author_Location": "Atlanta, GA"}, {"Author": "John H.", "ReviewID": "fX6D5OtfNrZn_ONP8Q9NVg", "Overall": "2.0", "Content": "The food was ok but the service was very bad.  The waiter treated us like an inconvenience or interruption in his day.  There is much better Italian food, with significantly better service, right up Peachtree at Cucina Asselina.", "Date": "2012-04-29", "Author_Location": "Atlanta, GA"}, {"Author": "Michelle C.", "ReviewID": "MvPdYSUeOP44nZQH0loM0A", "Overall": "2.0", "Content": "I was underwelmed for the price paid. We went here because we were going to the Fox and I've always heard decent things about the place. While the atmosphere and decor were fabulous, the food wasn't up to par.  We ordered the calamari to start and it was definitely the frozen kind with no flavor and slightly too chewy.  We also got two of the pasta dishes and the portions were small!  Mine tasted fine, but wasn't anything I couldn't make at home and was not worth the $16 price tag.  We enjoyed a nice bottle of wine, but once again it had a screw cap and was overpriced at $32.  The shot of limoncello ($6) was worth the price and super delicious.  I doubt we will be back though.", "Date": "2011-09-21", "Author_Location": "Atlanta, GA"}, {"Author": "Robert K.", "ReviewID": "KAD5Kuv_RywH3OuFXyVIhQ", "Overall": "4.0", "Content": "Went with large party (26) with a table of ten 16 year olds. We got all our food and seperate checks within an hour. The food was excellent, I had the gorganzola salad and cariosa pizza. Both excellent quality. Others had the lazagna and bruschetta. While at first it appears like a small portion, it actually was enough and filled you up. The pizzas are big enough for two to share. Atmosphere was nice with enough light and a wine cellar decor. Very happy with the choice and was an easy walk from the Rennisance Hotel (10 min).", "Date": "2013-01-25", "Author_Location": "Chula Vista, CA"}, {"Author": "Greg P.", "ReviewID": "rKNd_C31ypoeS2_xltXI4w", "Overall": "2.0", "Content": "Atmosphere is ok.  My friend liked her pizza but the Place clearly needs a chef. The chicken piccata was the worst I've ever had and the lasagna was no winner either. Even the Martini was served warm. Add inattentive server just to top it off and it was pretty much the worst place I've experienced in quite a while.  There are way to many decent places in town to bother with this place again.   Beware.", "Date": "2013-01-12", "Author_Location": "Decatur, GA"}, {"Author": "Tiffany N.", "ReviewID": "H2rz_4H7Uy17GKt7d9sEaA", "Overall": "4.0", "Content": "my grandma loves this place. there's a guy that works there that she is completely in love with, haha. i believe i ordered the margarita pizza (i know there's an \"H\" somewhere) & it was good! the service was on point too.", "Date": "2012-07-06", "Author_Location": "West Covina, CA"}, {"Author": "Gina C.", "ReviewID": "Dl0sDgQQaiTz4zTu6BRhXg", "Overall": "4.0", "Content": "Baraonda is fab place to eat before grabbing a show at the Fox. It does get crowded during show times, so plan accordingly. Also, they don't seat you until your whole party arrives. I've been here before and I didn't like it too much, but this time around I really enjoyed it. For starters we ordered the calamari. It was a little bland and the marinara was spicy! The batter didn't overpower the calamari so you can actually taste it. I also ordered the cesare salad and it was fresh and not soaked with dressing. Just tell them light on the dressing. I ordered my fave, the margherita pizza. I love oven baked pizza! My friends ordered the lasagna and fettucine funghi. They seem to enjoy their meal as well. For dessert we ordered tiramisu and raspberry cheesecake. I'm not a cheesecake fan, but it was so light that I couldn't stop eating it. The tiramisu was delish too. Dessert was the best part of the meal for me.", "Date": "2009-12-31", "Author_Location": "Atlanta, GA"}, {"Author": "Meghan A.", "ReviewID": "MghPGqX86V408mobvY9XkQ", "Overall": "2.0", "Content": "I am in town on business and was really excited to try this restaurant which is adjacent to my hotel. I called and placed a take out order and was told I'd be called when it was ready. After 45 minutes had gone by I called to check on my order and was told it was ready and had been sitting out. When I asked why they didn't call me they said they wait at least an hour before calling.... this didn't make too much sense to me but I still asked the hostess who answered if my order would be hot or cold. She said she'd check  on my order and came back to say it was fine. I walked promptly over to the restaurant picked up my order came back to eat it at my hotel and it was practically inedible. I had to force myself to eat it because everywhere else had closed. I really don't think this is the best policy regarding take-out orders and feel I should have been told the food was cold or the restaurant should have warmed it up or made a new one for me.", "Date": "2012-01-11", "Author_Location": "Berkeley, CA"}, {"Author": "K B.", "ReviewID": "b26u9o2iwiz5mKdcv1cRnQ", "Overall": "3.0", "Content": "Can be a little loud but a great date spot. The grouper is amazing, but I was not impressed by the lamb. Also our waitress was inattentive at best. The martinis were good as well.", "Date": "2011-12-23", "Author_Location": "Chicago, IL"}, {"Author": "Joelle G.", "ReviewID": "BbLjLKf8MiVh3X744AQeuA", "Overall": "5.0", "Content": "Excellent food. Excellent service. And the wine list is superb! Would highly recommend :-)", "Date": "2012-05-21", "Author_Location": "Atlanta, GA"}, {"Author": "Amanda D.", "ReviewID": "1a-h9RQn_AohIgRWMdj-FA", "Overall": "4.0", "Content": "Delicious, yet limited food menu with extensive wine list and yummy cocktails!  Reservations recommended.", "Date": "2012-07-12", "Author_Location": "Tulsa, OK"}, {"Author": "Winnie H.", "ReviewID": "YCuQEqw3f9qztO_Z4NU8Tw", "Overall": "1.0", "Content": "We ended up here by accident on a Saturday night.  We decided to leave after one drink (the place was dead) but the bartender coaxed us into staying to try one of his drinks, as he was \"trying to develop a following.\" So, being the overly polite people we are, we stayed.  Not only were lavender infused sweet concoctions inflicted upon us, but when we tried to make a polite exit, we were each charged 10 dollars for these drinks. Needless to say, we will never, ever be back.  if you want to go sit in an empty bar, and drink crappy drinks that reek of lavender, then this is your place.  Otherwise, go elsewhere or just stay home.", "Date": "2012-09-08", "Author_Location": "Atlanta, GA"}, {"Author": "MN L.", "ReviewID": "UNBkbOUWpi328Tg93DdBOg", "Overall": "5.0", "Content": "Great food, great atmosphere, and friendly people...always!!!", "Date": "2012-02-15", "Author_Location": "Atlanta, GA"}, {"Author": "Jen L.", "ReviewID": "huAP3-UC0GvJCBLtE4oy_g", "Overall": "4.0", "Content": "I thought this place was pretty great! The Calamari is AMAZING! It has a VERy slight kick to it because the put red pepper flakes on it - they are very lightly breaded so its not greasy or anything. I had the pasta meal - it was great fresh pasta. My only thing that kept me from giving them a 5 was that they were SOOO busy that it was harder to get service - but our server (when she had time) was amazing - super friendly!! Great time - will go again!", "Date": "2012-06-08", "Author_Location": "Tampa, FL"}, {"Author": "Stephanie G.", "ReviewID": "pulHH1ApwXhRr7KL5UBMXQ", "Overall": "4.0", "Content": "Just had their shrimp pizza and it was great.", "Date": "2011-11-14", "Author_Location": "Guilford, CT"}, {"Author": "David K.", "ReviewID": "8TOuN04KlT26JSZ8bztQ8g", "Overall": "1.0", "Content": "Six of us stopped in after an evening at the fox for a night cap. No hostess so we seated ourselves. Sat for about 5 to 10 minutes while being ignored by the wait staff. Finally asked the bartender if we had to order at the bar. He said no someone would take our order. Waited 10 more minutes then left. Is the food good? Might be but I'll never come back to find out.", "Date": "2012-05-25", "Author_Location": "Augusta, GA"}, {"Author": "Nicole G.", "ReviewID": "6AJSUbNnt8qqkKlk6DtyYw", "Overall": "1.0", "Content": "UGGGGH! It is a beautiful place with great seating outside and very close to the Fox. We were going to a show at the Fox and tried it out. The bruschetta was ok...it wasn't bad, but I've had better at many places. I orderd the seafood pasta...the menu didn't say much other than it was in the pasta section and listed clams, other seafood, and wine. I would assume then that it was a wine sauce. But it came with a spicy red sauce....too strong to be able to taste any of the seafood and misleading because the menu didn't say anything about the sauce other than it mentioned wine. My mother got a smoked salmon salad that was arful in how it was displayed on the plate, but it wasn't that great. The service wasn't great either. In my opinion, this is another restaurant trying to be fancy in presentation and in atmosphere, but the food just isn't very good. From reading other reviews, it looks like the people that ordered pizza gave it a good review and the people that ordered anything else gave it a bad review. I'd rather go to a whole in the wall with great food or just sit home and eat a box of mac and cheese then spend the money to get food here again...just wasn't worth the time or the money. I'm not hard to please and have never taken the time to write a bad review....just sayin'....", "Date": "2011-10-15", "Author_Location": "Oxford, GA"}], "RestaurantInfo": {"RestaurantID": "5lALLFsMC3OG6DR_kZrjRA", "Name": "Baraonda Italian Restaurant", "Price": "$$", "RestaurantURL": "/biz/baraonda-italian-restaurant-atlanta", "Longitude": " -84.38498140000000", "Address": "710 Peachtree St NEAtlanta, GA 30308", "Latitude": " 33.774027400000001", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/rJPkQ4amNwHetKk2tZ8VxQ/90s.jpg"}}