{"Reviews": [{"Author": "Ali Y.", "ReviewID": "FYFHHlWdjPkt-ZB7rLOcWA", "Overall": "5.0", "Content": "I come here with my co worker for lunch almost weekly.The Alambre is a good first timer's lunch special. Remember to ask for the fideo soup.As for dinner, I have had the guisada and I can wholeheartedly recommend it.Also, the salsa sometimes seems spicier than previous visits, you've been forewarned!", "Date": "2014-04-30", "Author_Location": "Houston, TX"}, {"Author": "Ash M.", "ReviewID": "FqXOoVrWNG_B7rniDjeR0w", "Overall": "4.0", "Content": "Being a native San Antonian and living in the Castle Hills area for a good chunk of my life, I must have drove past Guajillo's thousands of times.  Thought it was just a typical taqueria until Elizabeth R. enlightened me that I was missing out on some delish grub.  After my first visit, I was hooked.  Here's why:1.  Micheladas.  I know, I know, I've given people who drink them serious sh*t the past few years but recently, I've come to appreciate the hell out of them.  Guajillo's does them PERFECTLY.  (if it's in shouty capitals, it must be true!)  Warning however, they are super, duper, crazy, freaking spicy.  But it's that good burn where you just wanna keep taking gulp after gulp until you realize you're drunk on a Monday at 5:30.  2.  Salsa.  Same level (if not a tiny bit more) of heat as the michelada but the flavors!  It's garlicky with a hint of lime that compliment the almighty Guajillo.  Another warning, if you order the michelada and eat the chips and salsa while drinking it, you will be caught in a never-ending cycle of pica. 3. Guajillada.  It's nothing fancy, basically a quesadilla but using pita bread instead of a tortilla and steak with actual flavor instead of bland beef fajitas.  Simple but oh-so addictive.  I'd recommend one (or two) to soak up all that booze.Only negative about Guajillo's is the ceviche.  I've tried the fish and shrimp ceviche, shrimp cocktail and the campechano.  While all came with a healthy serving, they tasted kinda store-bought for the most part.  The serrano in the campechano was the only saving grace so if you have a craving, it's the best option.", "Date": "2014-07-11", "Author_Location": "San Antonio, TX"}, {"Author": "Sheri C.", "ReviewID": "2a3j3VKT4Cb2EKRnzPuaqA", "Overall": "4.0", "Content": "Authentic Mexican tacos and soups. Get the Caldo de Cameron if you can handle the spiciness! It's a simple broth with about 6 pieces of shrimp, but that broth packs a punch that keeps you coming back for more. If you're sick, it's the kind of soup that'll clear your sinuses. It could use some toasted buttered bolillos to stop up the broth.The fideo soup is a favorite and the frozen margaritas hit the spot on a hot Texas day.", "Date": "2014-06-30", "Author_Location": "Oak Cliff, Dallas, TX"}, {"Author": "Tiffany D.", "ReviewID": "j52kbA7wpBS5Lpl4Z9SAIA", "Overall": "4.0", "Content": "I came across Guajillo's from a Yahoo! article entitled \"Top 10 best taco places in America.\" So of course I was sold. The tacos are the bomb dot com, and the horchata is great! Their other dishes that aren't tacos come highly recommended, and you don't get much closer to authentic Mexican dishes. Guajillo's is probably the only reason for me to come to San Antonio. Staff is nice, and their housemade salsa is the best. GO GO GO!Disclaimer**If you are used to the americanized tex mex cuisine you find anywhere else, Guajillo's is NOT for you so avoid this place if that's what you're expecting!", "Date": "2014-06-22", "Author_Location": "Houston, TX"}, {"Author": "George M.", "ReviewID": "6uS4Ax7SvpEozqe3NLZfsg", "Overall": "1.0", "Content": "I've been going there for years.  I felt the owner and I were friends from my numerous visits.  I'm a local San Antonian of Mexico decent.  I've never complained.  They changed the lunch menu some and I had  the worst experience yesterday.  I complained about my Fideo soup being all broth and asked for some noodles from my waiter. He returned to tell me owner said if I wanted more noodles I'd have to buy an additional soup.  I felt it disrespectful...especially since the owner never made an effort to ask me what was wrong. After asking to speak to someone several times I saw the owner leave.  So, I did the same and left my $20 lunch on the table after tipping the waiter $5.  Owner lost $20 bucks and a long time customer over 40 cents worth of noodles.  It was disrespectful that no one asked me what was wrong. On a side note, their rice and beans have always been bland.  After posting on my FB, several friends commented they also have noticed a decrease in service and the quality of food. Hope that's not the case on your visit.", "Date": "2014-07-22", "Author_Location": "San Antonio, TX"}, {"Author": "Angela F.", "ReviewID": "OgNA5K9dnHINxIDFCWeacg", "Overall": "3.0", "Content": "I love the story behind Guajillo's that I heard...or read, don't remember...not sure if it's true, but it's owned by two brothers whose father is from Mexico...thus spawned Guajillo's, to honor their father's heritage. They recently also opened Speisen, which is European cuisine but heavily Austrian influenced for their mother/her heritage. Cool! Anyway, Guajillo's is not Tex Mex...it's more like what I found on the street corners in Mexico, authentic. Being from San Antonio, I'm obviously partial to Tex Mex....it's my comfort food. But I like good food in general & Guajillo's is pretty good...We went for 2nd lunch (Luly & Pete...y'all crazy!) so my appetite wasn't up to snuff, I admit. The salsa is superb: pica, smoky yet kinda vinegary, complex. The chips aren't bad, but they're not good. We ordered an agua fresca...it's not homemade but from concentrate. It really had no flavor whatsoever but a fake sweet. It was sent back in exchange for another beverage. To eat, we ordered tacos de alambre, frijoladas (think I messed this up), and cochinita pibil. The tacos de alambre were good: small pieces of pork with bacon (sold!) & chargrilled peppers atop corn tortillas. It is crucial that you squeeze lime juice & put fresh cilantro & onion on top! The cochinita pibil was just ok....salty, not much flavor, kind of dry. I think it needed time to sit in the pot & the flavors shake up cause when I ate it the following day, it was much tastier! The pickled red onions that come with it are a must! I also generously topped it with fresh cilantro & onions. The beans are good. The rice is terrible: overly salty, not much flavor, mushy. The frijoladas were my favorite! If you don't like beans or refried beans, you're out of luck on this dish. It's a giant plate of refried beans atop a thick masa tortilla then topped with raw chopped onions & a dollop of sour cream. My first few bites were curious/unsure, but then I really started getting into it. Service was attentive & nice. The crowd was filling in when we left about 1pm. Most everything was good, not great. This was my second time at Guajillo's and, just like I felt years ago, I'll go back but not rush back....", "Date": "2014-06-06", "Author_Location": "San Antonio, TX"}, {"Author": "Mal F.", "ReviewID": "2OjH2v-tq0jeA4wLhauJtw", "Overall": "5.0", "Content": "The fideo is amazing and simple. I like the tinga de pollo and the bistec tacos. The souce is awesome too! And the migas are different but very good. Only complaint is that I think the beans are canned because you cannot order them any way other than refried.", "Date": "2014-07-12", "Author_Location": "Houston, TX"}, {"Author": "Rachel R.", "ReviewID": "1d1TcDZ1Jeu0PRnV2lzxJQ", "Overall": "4.0", "Content": "Great, authentic Mexican food. The salsa is pretty spicy, the Al pastor tacos might be the best I've ever had. The staff is super friendly, overall a great, casual spot to grab some great food!", "Date": "2014-06-18", "Author_Location": "San Ramon, CA"}, {"Author": "Just K.", "ReviewID": "nEp5abbbP8cbTavXuJjYDw", "Overall": "2.0", "Content": "This place is always busy & I'm not sure why.  The salsa & corn tortillas were very good but that's not enough to go back for.  Guacamole was basically avocado smashed with tomato, no spices or lemon juice.  Poblano quesadilla was lacking flavor as was the mole verde with chicken breast.  I did try my friends chicken in ranchero sauce & it was excellent.  I heard the fideo is good.  Agua frescas were pretty good", "Date": "2014-07-06", "Author_Location": "Dallas, TX"}, {"Author": "Mario R.", "ReviewID": "fV7i0e14RZHe3MeX9JJnkA", "Overall": "2.0", "Content": "Disappointed,  For an authentic Mexican place I expected hone cooked Tortillas and better made guacamole.   The green sauce on Mole verde was runny and not much taste.  The chips were lacking flavor, dry and no taste, but the salsa was really good and had a spicy kick to it.", "Date": "2014-07-06", "Author_Location": "Allen, TX"}, {"Author": "Don G.", "ReviewID": "5pitCic6EoUW-Jw-x9MnBg", "Overall": "5.0", "Content": "The mole verde con pechuga de pollo is quite simply superb. It really is quite nice to find authentic interior Mexican, and reasonable prices to boot! Check it out soon!", "Date": "2014-06-18", "Author_Location": "San Antonio, TX"}, {"Author": "Olga A.", "ReviewID": "Dm84h9xaFG_UOoPOyFg5eA", "Overall": "2.0", "Content": "I was unable to give it the authentic Mexican stamp.  Even though they say tortillas are home made , it's not true. Mole came with off white rice.  Beans do not taste authentic. Salsa is very hot but not that tasty. Chips taste like store bought. Beers were very cold, waiter was pleasant.", "Date": "2014-05-24", "Author_Location": "Houston, TX"}, {"Author": "Christopher T.", "ReviewID": "hAKSlDjtWHr_ostKxrJ4pg", "Overall": "4.0", "Content": "Guajillos is the home-feeling good stuff. Ultra friendly service and sound mexican food. If you're lucky, you'll meet the hospitable owner who tells you about his motorcycle travels in various countries. Well, I hope that was the owner I was listening to. This atmosphere is built for family or friends. It's strictly casual and there's no tomfoolery, gourmetization with the menu. It's just straightforward Mexican food with a slight bend away from tex mex. A negative could be that the sides don't enrapture you. They seem to be there because they're supposed to be there. Beans nor rice really add anything. But the actual focal points of a dish, the proteins and sauces, the stuff you are meaning to order, are done well. The pibil, soups, and bacalao are all satisfying. Salsas are fine.The food is cheap and the portions are sizeable. The service is standard San Antonio friendly. It's not head over heels better than other mexican food places in mex food capital of Texas but it's solidly good and worth casual return trips.", "Date": "2014-04-15", "Author_Location": "Dallas, TX"}, {"Author": "Melanie K.", "ReviewID": "REhF0663V3nMdHXtgL3UrA", "Overall": "4.0", "Content": "Such a great place to stop in and grab a bite . Fresh ingredients and lots of hot melted cheese added to various menu items. I love the surtidos. I have it smothered in cheese and add fresh onions , cilantro, and avocado slices. Hot hot sauce is yummy", "Date": "2014-05-30", "Author_Location": "San Antonio, TX"}, {"Author": "Amy T.", "ReviewID": "BPz5hfQoqYdeyRVSbHVTzQ", "Overall": "3.0", "Content": "We came here when i was in town to see my doctor. I ordered the chicken mole poblano, the love ordered the mole verde and he said I won. He said his had no flavor. But mine did! in fact it got all over my shirt. Sad but true. Luckily I had some lemon and salt, added it to the shirt and yes It came out with soap and water, with resolve!... word the wise..t reat it with citrus and salt immediately so it doesnt set!The fiancee ordered a michelada.. nope. not very good.. very disappointed in it to tell you the truth. The chile/chips were pretty good. I'd return but not running here..", "Date": "2014-03-04", "Author_Location": "Round Rock, TX"}, {"Author": "Theresa H.", "ReviewID": "Gi7jI8HAvJs3LrKAV8UjeA", "Overall": "4.0", "Content": "On the advice of a friend, we checked out Guajillo's for a mid week dinner. We were greeted by friendly staff and seated immediately. I asked for a wine list; they do not offer wine but they do have horchata which is one of my favorite things. I ordered fish cooked with tomatoes and chilies. It was served steaming hot and had a nice spice to it. I'm used to spicy food but if you aren't, I'd inquire about the spice level.  My table mates got street tacos and tortillas smothered in delicious beans. The food was all served up quickly. We all enjoyed what we got and have collectively decided to work Guajillo's into our regular restaurant rotation.", "Date": "2014-01-26", "Author_Location": "San Antonio, TX"}, {"Author": "Antonio G.", "ReviewID": "EQudi-WfubSy6989UfgOFQ", "Overall": "5.0", "Content": "Ate At many Mexican restaurants in my life and I must say this place is as Authentic as it gets. Food is delicious, fresh, and tortillas taste great not that stuff other places get at the grocery store. Service is pretty friendly and the Decor of restaurant is very beautiful inside. Definitely would recommend this place If you want to bring guests, family, or friends or even pick up orders and enjoy food at home. This place will be on my Top 3 fav Mexican restaurants in San Antonio", "Date": "2014-04-24", "Author_Location": "San Antonio, TX"}, {"Author": "Will T.", "ReviewID": "C5_Ni5s8wsCMKKm5DHhXHw", "Overall": "4.0", "Content": "Place is pretty damn good !! Different taste than the regular Mexican food you'll find around the area.", "Date": "2014-07-03", "Author_Location": "Newport Beach, CA"}, {"Author": "Meredith A.", "ReviewID": "MUwv81DWUe7p05unh_Ef7Q", "Overall": "5.0", "Content": "Best beans in San Antonio! And they're vegetarian! Chilequiles, enfrijoladas, sopa Azteca are all so good, kids love the fideos and horchata. And the service is always prompt and friendly", "Date": "2014-03-22", "Author_Location": "San Antonio, TX"}, {"Author": "briana c.", "ReviewID": "dqmb6lF4AbehNIQCp_1EVA", "Overall": "5.0", "Content": "In a town that is systematically diluting it's culture this place is the real deal. Don't ask for mild salsa here, if you can't take the heat, go to canada. Yummmmmmmm.", "Date": "2014-05-17", "Author_Location": "San Antonio, TX"}, {"Author": "Manuel B.", "ReviewID": "OqPg-U-OEoNClZ6hXOHyWQ", "Overall": "5.0", "Content": "Try our awesome home made tamales put them on your menu and see people come back for more. you can sell them with 2 tamales and Spanish rice , beans with your own sauce on top of the tamales with some yellow cheese on top for $7.50 per plate or add some extra tamales at $1.00 for each tamale people will love the taste and will always come back for more with their friends and family , go o this web site thetamaleking1.com or call 361-249-4299  you will be happy you did because this is something a lot of restaurants don't serve this type of food plus this is what a lot of people never heard of tamales and will be amazed. and they will at the same time know what South Texas Mexican Food is all about. I am  located in Refugio Texas just  North of Corpus Christi Texas . Thanks The Tamale King , Manuel Brown", "Date": "2014-06-27", "Author_Location": "Refugio, TX"}, {"Author": "Hoa L.", "ReviewID": "pF-tEg6u96m3O-w1KjymWQ", "Overall": "3.0", "Content": "I really enjoy the variety of food they have here. There's authentic food and meals you cannot order at your typical Tex Mex restaurant. On the other hand, I have tasted more flavorful, better quality Mexican food. I would compare this restaurant to a quick stop restaurant as opposed to fresh, quality ingredients. The spicy level is definitely what draws me to this restaurant. They can make food at the spicy level you crave! Well, actually, I think everything on the menu is spicy even if it's labeled mild. There are pretty cheap lunch specials, but the free soup they offer tastes rather cheap and low quality. Others in my group love it, so it varies by opinion. I ate the chicken mole and it was good, but not as flavorful as other places I have visited. But, the next time I crave it I will definitely consider coming back.", "Date": "2014-02-18", "Author_Location": "San Antonio, TX"}, {"Author": "Edward T.", "ReviewID": "wQ2dKVzuJ0cVcH9r6_ggPg", "Overall": "5.0", "Content": "One of my favorite restaurants! It is always a safe bet! The owners are usually there and making sure that service/quality is great. Guajillos is my safe bet and my go to. Sometimes when I experiment at new restaurants and the food isn't great I wish I would have just gone to old faithful!The salsa is amazing! I usually get cochinita pibil or if I'm having a cheat meal chilaquiles. The ceviche is a little sweet but other than that it is hard to go wrong!", "Date": "2014-05-12", "Author_Location": "San Antonio, TX"}, {"Author": "Donna V.", "ReviewID": "LMgsP0FgL_deyPBBNxRx5g", "Overall": "3.0", "Content": "Whoa, what happened in just a year?? I've moved out of state but was able to visit here for 3 days and was so excited to get back to Guajillos. Well, imagine my surprise when the chips were stale and food tasteless. I kept going for the salt to try and bolster some flavor. The 3 stars are for the Guacamole, which thankfully is still fresh and delicious but that was the only saving grace today. Not a happy memory.", "Date": "2014-03-20", "Author_Location": "Clarksville, TN"}, {"Author": "Vickie S.", "ReviewID": "v51huc-n6FXFqz2lbFAmOw", "Overall": "1.0", "Content": "I have had some really good Mexican food seeing as my mother in law is Mexican. The food was so bland! I was in the mood for al pastor so I looked for the best in San Antonio and this is where it sent me. I was super disappointed because this was my 1 cheat meal for the week. Actually I was pissed, I felt like I wasted my calories! My in laws also complained about the mole and my husband was unimpressed with the  Meixcana chicken. I really wanted some good food, so sad!", "Date": "2014-05-03", "Author_Location": "San Antonio, TX"}, {"Author": "Irma I.", "ReviewID": "1ONEPEvmMGTEMBhMtXJ0AQ", "Overall": "3.0", "Content": "First I have to say that Guajillo's is probably a solid 4; however, the one most disappointing thing is their chips. You can't advertise that you are the \"shortcut to Mexico\" and serve chips straight from the bag plus they were on the stale side (minus 1 star for that). Come on fry some  real corn tortillas up for totopos- like the real ones.Anyway on to the food, the salsa that is served with the chips was pretty good. It had some heat but not overwhelming for the typical San Antonio palate. We started with the shrimp cocktail-  not my favorite. The shrimp were a little fishy & the sauce lacked some flavor- it needed some more lime juice, a little more \"something\". I wouldn't recommend. I had the tacos de bistek. These were really, really good. They had that flavor that is so hard to find & remind you of street tacos in Mexico. They are served with chopped onion & cilantro. The onion should be finely diced so that you don't have these large pieces in your tiny taco but I think I may be a little picky about stuff like that. The plate has six little bitty corn tortillas covered in the tasty  bistek (chopped steak of some sort). They should be served with some lime wedges but luckily they served some with the chips. They don't serve enchiladas but I had seen enmoladas on their menu on the web. When we got there I didn't see these on their current menu so when I asked they obliged (the waiter said they don't offer them only if customers request). So when these came I was pleasantly suprised- I felt like my grandma (rest her soul) was whipping these out in the kitchen. You see when I grew up, these were the only \"enchiladas\" we knew of (besides the \"delightful\" school cafeteria ones) there were no green ones or any other kind- just mole- but enough of my childhood.  Its really hard to find a place that makes enchiladas with mole sauce & then use queso fresco with diced onion- oh me! Oh MY! This is definitely the place.Okay selection of Mexican beer & they frozen margarita (1/2 lime/ 1/2 mango) was very good- even though the waiter thought I was nuts. Bypass the shrimp cocktail, avoid the bag chips, but stay & try the real food.", "Date": "2013-09-28", "Author_Location": "San Antonio, TX"}, {"Author": "Steven G.", "ReviewID": "DSph6T3Hwzt-P6CmgR7NBg", "Overall": "4.0", "Content": "Wow, I really want to skip to the end but let's go in order here. This place gets 4 stars for the semi-difficult parking arrangement and nasty restroom. (Hopefully it was just an off day for them). Now that that's out of the way, on to the good stuff. Started with the shrimp cocktail, which has a unique taste I can't quite place it, I think it's chili powder. Can't remember the name of  what we ordered but both dinner plates had their own great individual flavors. Rice and beans were good and best of all cooked without lard or oil, like the rest of their food. For dessert my wife had the flan and I had the arroz con leche. The flan was great but the arroz con leche was amazing and foreign to my taste buds. Service was top notch, so over all a really great experience!", "Date": "2014-02-14", "Author_Location": "San Antonio, TX"}, {"Author": "David G.", "ReviewID": "DDZ5eTvMxOcJc_lsk7QL_g", "Overall": "5.0", "Content": "Every time I come here the service is 5 star and the food is delicious. I love the Alambre tacos. And the Caldo de Cameron if you need to clear your sinuses out. Delicious and spicy. Not Tex Mex . Authentic cuisine from Mexico. Always a lot of internationals here so you know it's good", "Date": "2014-02-15", "Author_Location": "San Antonio, TX"}, {"Author": "Jorge C.", "ReviewID": "6I9LU3iLd9EORKnSNEz_RQ", "Overall": "2.0", "Content": "Well, another case of success going to their heads.Now they hiked the prices again and also started charging you a mandatory 15% tip.A lunch for four costed me the same as lunch at the Gristmill in Gruene...go figure...", "Date": "2014-02-17", "Author_Location": "San Antonio, TX"}, {"Author": "Tamara M.", "ReviewID": "C8r2EisgkO3T56poDutEZw", "Overall": "4.0", "Content": "This is truly an authentic Mexican restaurant!  Nothing is watered down to fit the American palate.  The salsa is probably the hottest restaurant salsa I have ever had.  I'm a huge fan of spicy foods so it wasn't a problem, but some people may be overwhelmed!The service was quick and attentive (and we were there on a busy Saturday night!). The food was super tasty.  It was nice that even the beans were prepared with as much care as the main ingredient of the entree. I really enjoyed the veg option of zucchini with green mole. There were a number of other mole options I'd love to try in the future. Tortillas were top-notch as well. I'd definitely go back to Guajillo's next time we are in San Antonio!", "Date": "2013-08-08", "Author_Location": "Norcross, GA"}, {"Author": "Rick O.", "ReviewID": "H0dsrG26tgGIYlGuW6nNbA", "Overall": "5.0", "Content": "This is my favorite restaurant in San Antonio, I've had everything on the menu the food is excellent and the family that owns it top-notch.   It says a lot when the owners spend more time there, then home.", "Date": "2014-04-20", "Author_Location": "San Antonio, TX"}, {"Author": "Mark M.", "ReviewID": "w9vOxp0uEEkpO4wGOncGgA", "Overall": "5.0", "Content": "This was my first time here and it was all true. Great food, good service and for the amount of customers that were their( full house) it did not take long to get our food. Good stuff. I had the Tacos de alambre. My co-worker ordered the mini tacos Al Pastor and that looked really good. I am going back tomorrow to give them a try.", "Date": "2014-04-18", "Author_Location": "San Antonio, TX"}, {"Author": "Elizabeth R.", "ReviewID": "W55cEtIjPWnk-AmFYmc8Qw", "Overall": "4.0", "Content": "I wrote an entire essay in high school about the Guajillo pepper. Why? Because that's what happens when a lazy teacher gives a clueless teenager \"creative freedom.\" Anyway, I'm a Guajillo expert you guys. And after moving to San Antonio I'm a Guajillo's fan. I'm not sure about the whole \"shortcut to Mexico\" tagline. But hey, kudos to whoever can be transported to Aztec land simply by eating decent tacos. Guajillos has nailed their salsa. It is superior to any other salsa I've tried in San Antonio. In fact, it is superior to the one I make. I've heard a lot of people comment on how spicy it is, but guajillos are one of the more mild chile peppers varieties and have more of a smoky, tangy, rich and warm flavor. Give their salsa a fair try. You won't be disappointed. If I were you, I'd skip the soups. The tortilla soup is strange. The fideo soup is super salty. The Birria is... Listen, you'll want to leave as much room for tacos anyway.Their lunch specials are amazing. The Tacos the Alambre and the Bacalao a la Mexicana are the stars of the lunch menu in my humble and knowledgeable opinion. Also worth trying are their Enrfijoladas, Mole Poblano (the best in town), Mole Verde (also the best I've had in SA) and their Cochinita Pibil (Johnny Depp's favorite). Top it all off with Arroz con leche and a Rochata. Love yourselves. The ambiance is pretty generic, so warn your date if they're snooty.  Or dump them and take me. I'm not snooty.", "Date": "2013-07-26", "Author_Location": "San Antonio, TX"}, {"Author": "Marva C.", "ReviewID": "szAyTlpzYOoPY9Ch4XVKSA", "Overall": "2.0", "Content": "On our trip to San Antonio recently, we wanted Mexican food. This was not totally what I expected but my girlfriend was satisfied. I ordered the fajita taco's. The meat was cold, hard and piled on top of 6 mini corn tortilla shells. The meat was so hard that I could not enjoy the flavor which was blah at best. My girlfriend ordered the mole and she said it was just ok....not near any other Mexican food that she has had. We will not be going back.", "Date": "2014-02-12", "Author_Location": "Houston, TX"}, {"Author": "Marisol M.", "ReviewID": "OUkyamIaWemEvo740317ZQ", "Overall": "4.0", "Content": "It is very hard to find a place that is more authentic than Guajilios!  The food is fresh and oh so tasty!  Be aware when they say something is spicy... they mean it!  But it is also very addictive!  The atmosphere is not the best in the world so I wouldn't choose them for a romantic spot but the food and service definitely makes up for it all!", "Date": "2013-06-26", "Author_Location": "San Antonio, TX"}, {"Author": "Jessica E.", "ReviewID": "I6Dntg7IS2Y0I-yHnT693g", "Overall": "4.0", "Content": "Great service.  Really reasonable prices.  Totally casual.  The salsa here is so unique and tasty.  I was not in the mood for meat, BLASPHEMY-I know. But hey, you can still eat well at a Mexican joint if you are feeling carniphobic.  I had the fideo soup and the avocado cocktail.  The soup was basic but satisfying.  The portion is small so you may want a little something extra.  The avocado cocktail was good too. It's basically like a shrimp cocktail without shrimp. They did not skimp out on the avocados. I've never had it this style. It was different. Not sure I'd order it again. Not because it wasn't good because it was.  I was in a specific food mood that day.   The prices are cheap. You can have a meal for under 10 bucks per person.  Would love to come back for some tacos next time!", "Date": "2014-02-23", "Author_Location": "Austin, TX"}, {"Author": "Sean H.", "ReviewID": "LVFbs_buV0p74goEats4QQ", "Overall": "4.0", "Content": "One word - Authentic! You won't find enchilada's here, but rather true cuisine from Mexico City. We Spoke with the owner for quite a while (knowledgable and friendly fella) and he walked us through the menu. Guajillo's takes pride in cooking all meals from scratch and using fresh ingredients every A.M.The food is excellent, not your typical Tex-Mex, you'll see!On a side note: If your not a fan of spicy salsa w/ your chips go ahead and ask for the mole poblano sauce with rice...Delicious.", "Date": "2013-06-11", "Author_Location": "San Antonio, TX"}, {"Author": "Kevin K.", "ReviewID": "xLUVmaP3rS8hJVQmvXfqYw", "Overall": "5.0", "Content": "I wasn't a fan of authentic Mexican food restaurants until I fell on this place.  Truly one of my favorite places to eat.  Tinga de Pollo is to die for.  I love hot salsa and this place delivers.  It's one of the only places a can't finish off multiple bowls myself due to the heat, but still has amazing flavor.", "Date": "2013-08-08", "Author_Location": "Wichita, KS"}, {"Author": "Kimmie T.", "ReviewID": "waWGUed2ANACM1U6le8yRw", "Overall": "5.0", "Content": "Their salsa is totally to die for - thought the limes was for water but the wait staff told us to squeeze the juice on top of the chips and you eat it with the salsa. Oh yes we highly recommend this place - great place awesome food and excellent service !", "Date": "2014-01-10", "Author_Location": "Dallas, TX"}, {"Author": "Christy D.", "ReviewID": "RBOlzku9AcibNfD_lSn1rw", "Overall": "4.0", "Content": "We came upon this place via yelp while searching for Mexican food...one with a lot of reviews and rated well, so we were convinced to check it out.The chips and salsa differ from your average Tex-Mex restaurant...I wouldn't classify this place as Tex-Mex anyway.  I didn't see a single enchilada on the menu.  Anyway, the chips look like white corn tostito's, but they're not as salty, and are pleasantly thin...basically so much better.  The salsa is nice and hot, kind of a murky brown peppered with lots of chile flakes.I had the bistec tacos, which were 6 tiny things on corn tortillas (I'd recommend getting a side of queso fresco for $1.35 more; cilantro and onion are free).  They're small, but deceivingly filling.  I also tried a few bites of my husband's tostada plate which had carrots and pecans mixed in with the meat.  It sounded unusual, but ended up being my favorite plate.  Another friend ordered the saucy abondigas and really enjoyed them.  Very filling as well.The service was friendly and helpful, and even teased my friend for pronouncing the 'H' in horchata (good to know).  I had the melon aguas frescas and found it to be a little sweeter than I've had elsewhere, but still liked it.  Overall, I'd return for the tostadas and the chips and salsa.", "Date": "2013-05-14", "Author_Location": "Houston, TX"}, {"Author": "Melanie G.", "ReviewID": "8JaBhpa_JQHZiMMXTa166A", "Overall": "3.0", "Content": "Very basic authentic Mexican food. No frills, it's all about the food. The shrimp cocktail and ceviche are very good and reasonably priced.   If you're in town for a convention it's a long way out so you might give this a miss. If you have wheels and GPS it might be worth the drive for the experience.", "Date": "2013-09-26", "Author_Location": "Hurst, TX"}, {"Author": "Karolina A.", "ReviewID": "_3Z4ynD4xF_TnJpkX8gJHw", "Overall": "5.0", "Content": "It was really good food. You are not going to find fajitas or burrito if that's what you are looking for. But you will love it. The owner and the waiter were really friendly and helpful", "Date": "2013-12-30", "Author_Location": "Amelia, OH"}, {"Author": "Hecate F.", "ReviewID": "sySQYt9gHPYvIFLB0K3JsQ", "Overall": "4.0", "Content": "Exit Blanco whenever you're stuck in that Hwy 410 traffic and have yourself some tasty Mexican food.I was craving street tacos and ordering AL PASTOR tacos hit the spot. Our waiter was so friendly and the atmosphere is cozy. I was happy to see they had \"ENSALADA DE NOPALITOS\", not a popular dish to be offered. More importantly the Nopales where clean and fresh, Nopales is a key ingredient that need to be cleaned correctly in order for them to be tasty and not slimy. Will be returning for a quick craving fix :)", "Date": "2013-06-29", "Author_Location": "New Braunfels, TX"}, {"Author": "Nichelle L.", "ReviewID": "I6k1LSQVKLJlHmtHKdQMmQ", "Overall": "4.0", "Content": "Was in San Antonio for the weekend - couldn't go back to Dallas without experiencing some \"good\" mexican food.  As we know there's a Mexican restaurant on every corner in SA, but thanks to my Yelp family, I located this spot. YAY it was right on - had the guacamole, refried beans w/cheese, and a taco dish (Alambre).  The combo of pork, onions, peppers, and bacon was delish!! Everything was fresh and service was even better.  I'll put this on my \"to do\" list each time I visit SA. By the way...judging by the crowd they have a loyal following.  Count me in!", "Date": "2013-01-26", "Author_Location": "Dallas, TX"}, {"Author": "Adrian Z.", "ReviewID": "76quNz8lIuSvvSYoGCn2-Q", "Overall": "5.0", "Content": "Wanna try Mexican out of the box? Have no doubt your will get delicious Mexican food like no where else in town. ALBONDIGAS spicy meatballs are the best! They also have heart healthy dishes and the beans are awesome and have no fat!", "Date": "2013-11-29", "Author_Location": "San Antonio, TX"}, {"Author": "Desiree D.", "ReviewID": "_EC7aVK-ABurnJ1PqoSq6w", "Overall": "5.0", "Content": "Truly authentic and reminded me of something I would get in my grandma's kitchen! Service was excellent! Chips and salsa were AMAZING! And the fideo was also great!", "Date": "2014-01-25", "Author_Location": "San Antonio, TX"}, {"Author": "Robert L.", "ReviewID": "SdYh5UistIpC-Wqvu-TMRg", "Overall": "4.0", "Content": "Best authentic Mexican food in the city of San Antonio the restaurant is run and owned by a family and started by two brothers whom it's hard not to run into during your visit.Realize this is not the place for tex-mex, a mex, or breakfast tacos but the place to go for albondigas, chilaquiles, and fideo. If your in town and want to try the good stuff this is a MUST. Also save room for the desert made by the mother of the brothers at home the Rice pudding and pastel will rock you out of this world.This restaurant can be summed up in one word ENJOY.", "Date": "2013-01-04", "Author_Location": "Lake Mary, FL"}, {"Author": "Aron T.", "ReviewID": "DOgVeWqCJLQp7RCG7jz6ag", "Overall": "5.0", "Content": "One of my favorite places to eat in San Antonio! Been coming here two, three times a year for the last 5 years!", "Date": "2013-11-29", "Author_Location": "Hattiesburg, MS"}, {"Author": "Alli F.", "ReviewID": "eD87tdtBfBzshO5HEDd6fQ", "Overall": "5.0", "Content": "Authentic (inner) Mexican cuisine at its BEST. Unbeatable flavors, great service and amazing prices for lunch specials- a bit on the pricey side for dinner. Highly recommend chicken enchiladas verdes (lunch special only), Al Pastor, Chuleta, Ceviche Campechano, and tortilla soup. House salsa has incredible heat and flavor- chips are disappointing (bagged) but I'm able to overlook that considering this place has so much to offer as far as flavors and variety. I visit San Antonio about once a month on business and I make this place my regular stop.", "Date": "2014-01-29", "Author_Location": "St Louis County, MO"}, {"Author": "Russ M.", "ReviewID": "rO06u9Pq8tWU5ryQkX1RQg", "Overall": "3.0", "Content": "I love getting recommendations from people when I'm on the road. Our hotel van driver was gushing over how wonderful Guajillo's is. Now, at this point I was more than a little skeptical for two reasons. 1. Texans generally think whatever they have is the greatest thing ever. 2. TexMex=Taco Bell. My driver assured me that Guajillo's was not TexMex, so my partner and I decided to give it a tryFirst off, the staff was very friendly and did a great job. We had margaritas on the table before we knew it. There were lots of great looking items on the menu but I was torn between the Mole Verde Con Pechuga de Pollo and the Tinga de Pollo . I opted for the later and my partner chose the Mole Poblano. Unfortunately, the food did not measure up to the positive experiences we had prior to our getting out meals. Don't get me wrong, it was good just not great.I'd definitely go back, but my expectations will certainly be tempered next time.", "Date": "2013-01-27", "Author_Location": "Los Angeles, CA"}, {"Author": "Keven W.", "ReviewID": "FVPVt9VooNwg_FOEiBO7UA", "Overall": "4.0", "Content": "I ordered the catus salad which is very good and tasty.  The salsa and chips were very good, but unfortunately, it was quite hot too that the big glass of water did not help at all :(  But the prices were cheap and decent. I wish I was more hungrier, but after the chicken fried steak I was not so :(  but good anyways :)", "Date": "2013-10-19", "Author_Location": "San Jose, CA"}, {"Author": "Chris C.", "ReviewID": "YFGmIBxzmTTCcDWvu9RRhQ", "Overall": "5.0", "Content": "Guajillo's might be the best authentic mexican food in San Antonio - I deftinitely don't know of another place that is as consistently excellent across as large a menu.  The corn tortillas they use here are my favorite of any restaurant in town.  The fideo and the tortilla soup are awesome - as is the salsa.  They always give you lime wedges - I squeeze them on the tacos - the lime juice really goes well with the earthy corn tortillas they use.  I also squeeze some into the salsa - it really goes well with that, too - kind of balances the heat.The mole and the green mole are both fantastic.  The rice and beans and gaucamole are great, too.  The only thing I have tried there that I didn't like was one of thier aguas locos . .tamarind and tequila.  It was kind of wierd tasting and not very strong, either.", "Date": "2012-10-19", "Author_Location": "San Antonio, TX"}, {"Author": "Elena G.", "ReviewID": "ZuvqU0Oqp7cwCmK_RcMbZw", "Overall": "5.0", "Content": "Great things:-the salsa -sopa azteca (a really big serving that can be comfortably split) -alambre tacos -enfrijoladas-chilaquiles -mole poblano Misc: be aware taco plates don't come with rice or beans", "Date": "2013-02-24", "Author_Location": "San Antonio, TX"}, {"Author": "Melissa S.", "ReviewID": "tovuz7JPMk9NdGbG71a1-A", "Overall": "5.0", "Content": "I'm way too much of a gringo to comment on authenticity, BUT this place sure isn't like any of those tex mex places! I'm a big salt shaker user and I've never had to touch it here. Every dish is packed with flavor. The alambre tacos are my standard for tacos everywhere. They have a steak plate with stewed tomatoes that tastes like it was stewed in love all day long just for me. The atmosphere is easy going and family friendly.", "Date": "2013-11-20", "Author_Location": "San Antonio, TX"}, {"Author": "Sea J.", "ReviewID": "bZHla8AGZxEozRy6SWeS2A", "Overall": "5.0", "Content": "I love a good find. I was turned on to this place by a local from San Antonio who pointed it out as the best Tex-Mex place around and I have to agree. I find that Mexican food is easily done satisfactory, but to be spectacular you must be creative and daring. This place does that. The salsa is a secret recipe, the dishes are authentic yet original, the service is always there when you want, and the price is right. In fact the price was so reasonable I had to order a couple of shots of fine tequila to absorb my per diem...I agree, the rice is boring and plain but I wasn't going to eat the rice anyways but it reminds me that for utopia to exist there has to be a martyr...I don't give a 5 star review often but this place is in fact \"As Good As It Gets\"If you're browsing for some good Mexican food to try while in San Antonio, I implore you to try this place.", "Date": "2012-11-05", "Author_Location": "Renton, WA"}, {"Author": "Jennifer T.", "ReviewID": "yIWANahh9QL8sWAzMlqoAg", "Overall": "4.0", "Content": "Don't go here if you're looking for Tex-Mex. it's authentic Mexican food. The chips and salsa were delicious. I got the tacos al pastor which were great. The service was a little slow but friendly. I would definitely go back to this place.", "Date": "2014-01-18", "Author_Location": "Lake Highlands, Dallas, TX"}, {"Author": "Candy R.", "ReviewID": "23_Zu0s00r1-YJQLXF4omA", "Overall": "5.0", "Content": "This is our go-to place for authentic Mexican food.  I love that when I go in, most of the patrons are speaking Spanish.  A good sign in a Mexican restaurant!  I also see my Mexican national friends dining here. We have sampled much of the menu and have been happy with every single thing we have had, from apps to entrees to dessert.  Personal favorites:  Chicken Mole Verde and very good refried beans topped off with the Rice Pudding.  I also often enjoy eating vegetarian, and Guajillo's has a couple of excellent options.  Guajillo's prepares many of their dishes with no oil, so this is a great place to go for the health conscious diner who wants to have fabulous food. I leave there feeling comfortably full.  This is the antithesis of greasy Tex Mex food.We have also always had very polite, helpful, attentive waiters.  I love that I can ask questions about menu items and be treated with respect .  It's obvious that the staff eat the food there and love it--not always the case.  Very reasonably priced.  Terrific value.", "Date": "2012-12-06", "Author_Location": "San Antonio, TX"}, {"Author": "Brian F.", "ReviewID": "24lPxA2b19AqC5ht1igHqQ", "Overall": "3.0", "Content": "The parking here is scarce, but they have 3+ little parking lots surrounding the restaurant.  The servers and staff are really nice and make the dining experience delightful.  Food is good, but not the best (in SA).  Maybe for that area, but I can't verify that.  LOL  My g/f really likes this place, so I'll probably be back.", "Date": "2013-10-29", "Author_Location": "San Antonio, TX"}, {"Author": "Tony T.", "ReviewID": "YAjOwenUSPNWY7oWEL59gQ", "Overall": "5.0", "Content": "We are visiting from out of town and wanted to find a more authenic mexican restaurant, trying to avoid the typical Tex-Mex chain. We were lucky enough to happen upon this small establishment. The service was prompt and friendly enough and we were treated with essential chips and salasa to start. If you like a mild to spicy salsa then you'll love it. I had the Bistec a la mexicana and my girlfriend had the Bistec taquitos. We could tell our dishes we made from the authenic food traditions and we loved it. If we lived here locally this would be our go to place weekly. We wish Guajillo's all the best.", "Date": "2013-12-30", "Author_Location": "Cincinnati, OH"}, {"Author": "Frank S.", "ReviewID": "btFhT_ZBRkMAjvlihMWMjg", "Overall": "5.0", "Content": "Simple menu with delicious Foods and aguas frescas. Can't go wrong with the tacos and fideo. Friendly service and great food time and time again.", "Date": "2014-01-17", "Author_Location": "Five Points, San Antonio, TX"}, {"Author": "J. Francisco P.", "ReviewID": "Eyb9_mu66rcgP37KJnEprg", "Overall": "5.0", "Content": "This place is definitely the closest you'll get to real Mexican food, not that Tex-Mex nonsense made for the weak gringo's stomachs that can't stand spices and good food (no offense intended).There is not a thing on this place that I won't say I love, but I specially recommend the following:Soups:1.-Tortilla Soup.2.-Fideo Soup.3.-Birria. (This one is a specialty plate from Jalisco, very filling, where Tequila and Mariachi were born)Lunch Specials:1.-Chilaquiles & Carne Asada2.-Bacalao a la Mexicana3.-Tacos de AlambreRest of the Menu:Mole is very good, the tacos are good, the Tinga and the Cochinita Pibil are awesome. Try any of the desserts, if you have a sweet tooth you'll thank me, but my all time favorite is the Arroz con Leche.My sincere congratulations to Guajillo's for keeping it delicious.Happy Yelpping!", "Date": "2012-10-23", "Author_Location": "San Antonio, TX"}, {"Author": "Kayal J.", "ReviewID": "_vevF4pA6gdfjuizFF844A", "Overall": "3.0", "Content": "Fideo soup is too salty and fatty.  Overall the food is OK but on the unhealthy side. Lot of flavor created with fat. Not exactly fine Mexican  home style cooking.Now with Mexico topping the obesity charts this is the kind of food to expect in most restaurants across Mexico.", "Date": "2013-09-19", "Author_Location": "Plano, TX"}, {"Author": "Vanessa S.", "ReviewID": "qzM107KYTtFHb44vQyWXrA", "Overall": "5.0", "Content": "The greeter and wait staff are wonderful. I feel like I just walked into my grandma's or mom's house the way they make you feel at home. I'm a border town girl (NOT the valley) and my family are from Mexico,  so I'm very familiar with how Mexican food looks and tastes like. In a city full of tex-mex restaurants, it was great to stumble upon a truly authentic Mexican restaurant.", "Date": "2014-01-08", "Author_Location": "San Antonio, TX"}, {"Author": "Rudy R.", "ReviewID": "vM7qNh7K4AwVQgpMFjmwRg", "Overall": "3.0", "Content": "I love bistec tacos I get them whenever I go to the Rio Grande Valley and Mexico. When I heard Guajillo's sold them I had to stop by. My wife and I both ordered the bistec tacos; with avocado slices and sauteed onions, goat cheese. I thought the tacos were alright not the best I have tasted. Since this was the first time I had eating bistec tacos in San Antonio; I was just glad get them. I did notice a few things that was not up to par with what I was use to getting in the Valley/Matamoros MX, the corn tortillas were not as good, the tacos were not prepared for you the meat was just thrown on top a plate of tortillas. One other thing that was a downer about Guajillos was that they didn't sell Mexican flavored sodas in a bottle; which go great with bisec tacos. The bistec tacos may not have been up to par by Rio Grande Valley or Matamoros MX standards, but It will fill the carving for them. There's also a coupon/gift certificate for Guajillo's on restaurant.com which comes in handy. I know I will return back to Guajillo's for their bistec tacos. I give 3 stars to Guajillos for having bistec tacos in San Antonio. It sure beats driving 5 hours to Valley and having to deal with checkpoints. Check my local photos and compare Guajillo's bistec tacos to Taqueria Y Antojito's Rico's in Brownsville you'll see the difference.", "Date": "2010-05-26", "Author_Location": "San Antonio, TX"}, {"Author": "Kendal F.", "ReviewID": "qoS-tQlfeU_3vZXY8hGUJg", "Overall": "5.0", "Content": "Simply put, this place has the best, freshest, most authentic Mexican food in Central Texas. The BEST tacos al pastor you can find-- don't even TRY to tell me anything in Austin can hold up.Runners up: Gringas, agua de melon/mango/horchata, and tortilla soup.", "Date": "2012-01-08", "Author_Location": "Austin, TX"}, {"Author": "Liz C.", "ReviewID": "IxKfd3bWUv1woyc_80yfhQ", "Overall": "4.0", "Content": "I went to Guajillo's with 3 other people after seeing all the great reviews on yelp.  Between the four of us, we got 3 tacos as an appetizer and 4 entrees.  The tacos we chose were al pastor, alambre, and guadillada. The al pastor was awesome with the addition of pineapple. The others were pretty tasty too, but paled in comparison to the al pastor.For my entree, I got the mole poblano. It was thick, slightly sweet, and the chicken was huge and juicy. The beans and rice were regular fare. My boyfriend got the albondigas en salsa chipotle, one of our friends got the enmoladas de queso, and the last friend got the cochinita pibil. I tasted all of the dishes and they were all pretty good. My favorite were the meatballs and least favorite were the enmoladas because I'm not a huge fan of cheese. Apparently, the food was pretty close to authentic Mexican rather than being tex-mex, which I think is pretty cool.  To say we left stuffed is a huge understatement and it was all very well priced.", "Date": "2013-02-18", "Author_Location": "San Diego, CA"}, {"Author": "Julie S.", "ReviewID": "XgoKgQ_St96V8bHRYyObjA", "Overall": "2.0", "Content": "I was craving for adobado tacos one afternoon remembering my trip to Tecate, Ensenada, and where ever I went  in Mexico for street tacos. My mouth watering just looking at the marinated pork spinning on the pole wearing a pineapple bikini with all the fixings on the side. There's got to be a place I can get something similar? I'm not a huge fan of TexMex either. I googled and searched...until I found this place on The Best of SA or probably city search idk.... but I read a lot of good reviews and trusted them. I would have to say this restaurant is true to its title, the short cut to Mexico cutting corners serving shrimp ceviche with already cooked shrimp(I don't even want to know about the fish) looks like cocktail or watered down tomato sauce was poured over the ceviche. Didn't taste like fresh shrimp cooked in lime at all. Now I wondered how the al pastor tacos was cooked & prepared?! You can't see what goes on in the kitchen... the pastor tacos tasted all right not great, it comes with six mini corn tortillas topped with lightly marinated not so thinly sliced pork with the toppings on the side onions, cilantro, and canned pineapple bits. Missing the red radish. I asked for a spicier salsa, but they only had one salsa for everything. So, you can't choose what you want.If you're looking for authentic, it is not here. If you like lengua tacos then stop at the door it's not on their menu. I would tell you where, but I don't know where to go for the best tacos yet...", "Date": "2011-04-17", "Author_Location": "San Antonio, TX"}, {"Author": "Lacey J.", "ReviewID": "bBanKapO4WMNxWJ2crnN1w", "Overall": "5.0", "Content": "Guajillo's...ah my sweet haven for chiles and ceviches!Guajillo's was the first Mexican restaurant I tried when I moved here. How friggin' lucky was I???So authentic, so friendly, so close to the Alamo Drafthouse. Perfection!", "Date": "2013-01-17", "Author_Location": "Lafayette, LA"}, {"Author": "marc s.", "ReviewID": "3hvSzNwtzLucgfw6m-MaeQ", "Overall": "5.0", "Content": "\"Short cut to Mexico\"? Your dad probably told you to never take shortcuts, but as you got older, you realized your dad wasn't right about everything.This is Mexican from the heart of Mexico.  Great margaritas made with fresh lime juice, my steak in padilla chile sauce was a taste sensation, the sauce was dark and had a taste all it's own. My friends had the mahi mahi and were equally impressed. If we only had this back home in Austin. This is a San Antonio gem!Menu items are nicely marked for which ones have no added fat. Light and bursting with flavor, this is hard to beat. As a kicker, the price is extremely reasonable.This is worth a road trip.", "Date": "2012-03-16", "Author_Location": "Austin, TX"}, {"Author": "Kane T.", "ReviewID": "0EoD7a-4eSiMTRuoTDL_3g", "Overall": "5.0", "Content": "The most authentic Mexican food in town.", "Date": "2013-11-14", "Author_Location": "Galveston, TX"}, {"Author": "Andrej B.", "ReviewID": "6xkWt2h_V1SwsPc-tW1QFg", "Overall": "4.0", "Content": "Great authentic Mexican food.  A friend who knows Mexican took me there and it was a great experience and the food was fantastic.Try the tomato soup and any of the Taco's!!", "Date": "2012-10-10", "Author_Location": "Bethlehem, PA"}, {"Author": "Brian D.", "ReviewID": "Et6aqaWhAgVKodnhSX5Bpw", "Overall": "4.0", "Content": "I don't get the 5-star reviews, but this place isn't bad. Good, reasonably-priced food, and super hot salsa. Our server was very friendly, but we never saw him from when our food came until we'd been sitting around staring at empty dishes, wanting to hit the road back to Austin. Would have been nice, as we didn't all have silverware (we had to share), and they gave us enough cilantro and onions for maybe 1 person.We had the Al Pastor and the Alambre tacos. The Al Pastor was so-so, the Alambre were pretty tasty... I'd go that route.", "Date": "2012-12-03", "Author_Location": "Austin, TX"}, {"Author": "Cliff B.", "ReviewID": "oZisS_YIthcZZyTpJgOHzQ", "Overall": "5.0", "Content": "Finally, amongst all the Tex-Mex restaurants in San Antonio I find one Mexican restaurant.  This place is just awesome. The salsa is delicous  and someone unexpected.  So many good things on the menu!  I always order the \"Sopa Azteca\" and the \"Chochinita Pibil\",  but there are so many great dishes on the menu.  Everything seems somewhat healthy-- no heavy or greasy dishes.  As I read in one of the reviews, the rice is very Uncle Ben's-- not really my style. I usually just order extra beans instead of rice because they're so darn tasty!", "Date": "2012-06-28", "Author_Location": "New York, NY"}, {"Author": "Billy H.", "ReviewID": "Vo90HN06Pdcx8wHY9qGKuA", "Overall": "5.0", "Content": "Holy Mole!   This place is incredibly good!  The pride of San Antonio! If 5 stars means \"As good as it gets\", then this place deserves 5 stars!  One of the best Mexican restaurants I've tried. Warning on the salsa: it is as hot and as good as they say.   I tried the mole poblano, which is chicken covered in a chocolate-based mole blended with two different peppers.  Just incredible.  The beans are even better than other places.  Got to agree on the rice being Uncle Ben's, but they're either just being picky or are some serious rice eaters.  Everything else is phenomenal.  I went back the second day and tried the tacos al pastor.  They were also very good and came with pineapple.  They weren't the absolute best tacos I've ever tried, but they are up there.  Overall, this place is an easy 5 stars, IMHO.  Oh, and if you never tried horchata - give it a try here!       Heading back to San Antonio this weekend and will be back there again!", "Date": "2012-08-22", "Author_Location": "Willowbrook, IL"}, {"Author": "David C.", "ReviewID": "Z3U3TlM7f9KEAZxniDtXpA", "Overall": "4.0", "Content": "GO! This is Mexican food...NOT Tex-Mex...so don't ask for \"queso,\" or you'll get the snotty look from the waiter that you are some dumb gringo (which I am).  This is Mexican food (as in Mexico City), so don't look for the Pancho's or Pico de Gallo (downtown) menu.Preliminaries:Location: easy to find.Parking: no problem at lunch rushAtmosphere: casualAmbiance: genericWaitstaff: great except the one guy who hates to see another stupid gringo (you know, the guy with money who is going to tip you)Price: almost so cheap that you suspect something. But don't. Not Austin prices, thankfully. Austin restaurants should be sent to Guajillo's to learn a new food costing paradigm: well priced quality. Foodies can go suck a cactus.Salsa: fantastic! I even got a pint to go.  Have to ration it...otherwise might be tempted to drink it.Shrimp Soup: NASTY.  Tasted like they tried to use shrimp paste common in Thai food (nam-pla prik). Two whole shrimps in the soup. Avoid.  I should have tried the Tortilla Soup which has gotten great reviews. Guacamole: fair. wouldn't be surprised if a gringo made it.  That's right, I just made a comment on how white people can't make guacamole like Mexicans. Piece de Resistance: the Poblano Chicken. This had the best MOLE I have ever eaten. Better than my 3 times in Mexico city with real Mexicans who pride themselves on knowing their own cuisine. Rich, chocolate, earthy mole with levels of taste. Pico De Gallo, are you listening? This is how it's done.  This one dish, served with beans, rice, and 2 corn tortillas is enough to split with your lunch companion unless you are one of those fatties that can be seen waddling all over Texas. I had the brown mole. Jefe at the register suggested I try the green mole. Too bad I was already full. I would have gotten something with green mole to go. Yes, it is that good. I suspect the other entrees are as excellent. I will have to investigate. Bottom line: if you want real, unbelievably good Mexican food, you have to go. Try and pressure them to start selling their mole at Central Market.", "Date": "2011-11-27", "Author_Location": "Austin, TX"}, {"Author": "Ingrid M.", "ReviewID": "hSru6_ZUw6r8iURhs8paZA", "Overall": "4.0", "Content": "I am officially obsessed with Guajillo's.  Not only is the food incredibly tasty and fresh, but it is also cheap.  The portions are just right, the place is big enough that you won't have to wait too long (if there is even a wait), and all of the servers so far have been very attentive and friendly. Although I have thoroughly enjoy many things from the menu except one thing (Beef in Pasilla sauce), I highly recommend the Tacos Al Pastor, Cochinita Pibil entree, Sopa de Fideo, and the pickled red onions.  Their refried beans are made with water instead of lard and yet they have a nice seasoning and texture to them; I crave them constantly.  They also have specials during the week that include a choice of two soups and a full size entree.  I wish they had homemade tortillas, better parking and the restrooms need some serious attention.", "Date": "2011-11-08", "Author_Location": "San Antonio, TX"}, {"Author": "Brady S.", "ReviewID": "iNixdIFLVww1I1orb6X0uQ", "Overall": "3.0", "Content": "Entree was very good. Guajillo's had horchata which is always a plus for me when visiting Mexican restaurants. Salsa is damn hot even for a spicy lover. The chips, rice, & beans r blah & not authentic, meaning they were bought from somewhere else by the restaurant and do not present a homemade taste or feel.  I did not have one but the margaritas looked good. I was also happy to see they had tres leches, but the texture of the cake portion of this desert was all off. However, the milk flavor and consistency was perfectGuajillo's is really nothing fancy but does appear to have a visual style of it's own. They have many awards posted at the front from various places. The service is friendly & fast. I would not mind eating at Guajillo's again because it is close but would not go out of my way for a visit.", "Date": "2010-07-07", "Author_Location": "Austin, TX"}, {"Author": "Liz S.", "ReviewID": "a9HjRfHNt2U4MHZ2WX7IYQ", "Overall": "5.0", "Content": "I came here for the first time and I got to say this is not Tex Mex it is Mexican all the way. It reminded me so much if the food my mom cooked for me when I lived in California. I would defently come back now that I know how good their food is. The nopales were great and so was the fish. Great food! Great quality!", "Date": "2013-10-29", "Author_Location": "San Antonio, TX"}, {"Author": "Sheryll M.", "ReviewID": "Q_kzogrN5wAjs74FLeKDng", "Overall": "5.0", "Content": "Ate there last night.  Very yummy!  Salsa was too hot for me, but I'm a wuss--great flavor.  Hubby had  tortillo soup, meatballs  dish and really liked it. I had the mahi mahi.  It was awesome in a red cilantro yummy sauce.  And it is very healthy, no lard. Not a connoisseur of Mexican food, but such a nice alternative to what I've had before. Felt like a home cooked meal versus #13 combo.As one of the others said, it wasn't the cleanest looking place, looks like a remodeled Pizza Hut with the tiffany lamps  (converted to wicker) hanging over the booths. There were bits of trash on floor & a wet caution sign that never went away, but quality & price trumped.  We will definitely revisit!", "Date": "2012-03-20", "Author_Location": "Canton, GA"}, {"Author": "Dolph M.", "ReviewID": "yEOVq9ZCncSvoP_L9s-BZA", "Overall": "4.0", "Content": "The tortilla soup ($2.40 by itself, or included with the $5.95 lunch specials) is reason enough for me to return: very basic ingredients but amazingly flavorful. My lunch entrée (Chuleta) was also flavorful but too dry to completely enjoy.My table also went through several bowls of salsa... everyone loved it on/with everything.One guy in our group of six didn't enjoy his meal; he's also the guy that believes Taco Bell is the gold standard of authentic Mexican food. Personally, I appreciate places that don't have \"queso\" on the menu. Condiments are not food.", "Date": "2010-04-15", "Author_Location": "San Antonio, TX"}, {"Author": "Eugene L.", "ReviewID": "RXyGGLQe7_9mHZXlZmAgkQ", "Overall": "4.0", "Content": "In a sea of compromised, dumb down cookie cutter Tex Mex restaurants in San Antonio that constantly pander to out of towners and tourists lies alone a sanctuary from the ordinary and its name is Guajillo's.The salsa served here is the kind of salsa as I remember from when I was younger and avoided chips and salsa due to the spiciness of it in most Mexican restaurants here. It is made from pure habanero peppers and believe me, it will put hairs on your chest regardless of whether you've just hit puberty like Justin Bieber or if you're a female.  Your tongue will be on fire I swear!  It's a good thing the U.S. government hasn't found out the secret recipe to the salsa otherwise they would use it against prisoners in Guantanamo Bay as a form of punishment.You're limited to a variety of dishes like tacos and specialty plates and have plenty of options for drinks, alcoholic and non-alcoholic.  It's a shame they're tight with the agua fresca refills though.  The corn tortillas are among the best I've ever had and go good for dipping into the salsa.  I don't care much for the rice.  Service was pretty friendly.", "Date": "2012-07-09", "Author_Location": "San Antonio, TX"}, {"Author": "Patrick H.", "ReviewID": "cs065LLhz0qi_h__u5dGEw", "Overall": "5.0", "Content": "I recently went to Guajillo's with my fiance.  It sounds cliche, but it was refreshing to have some \"real\" Mexican food in Texas without the TexMex.  The food was outstanding and the service was great as well.   I loved the Tortilla soup and the quesadillas were a steal at $6.00.Bottom line:  CHEAP and GREAT food.  A winning combination.", "Date": "2009-01-08", "Author_Location": "Summit, NJ"}, {"Author": "Trey T.", "ReviewID": "ZhHZq16zLoc8lA-C-W5sbQ", "Overall": "3.0", "Content": "Unique food, definitely the little tacos  like you get in Mexico. It is my son's favorite - he would give it 5 stars because he likes the little tacos with grilled meat, cheese, lime, cilantro. I rank it a little lower because there is not much in the way of fresh veggies and the salsa is about a 3 out of 5 on my scale of flavor and spice.The picadillo tostada is my current favorite. I recently tried the tortilla soup - unlike any I have ever had. Lots of red chile. Spicy. Not sure if I liked it or not.But, here is a little secret just between you and me....The margaritas? 5 stars!!! I am not kidding. The bartender uses lime juice and they are as good as any margarita I have ever had. [Updated note: the last time I went in March 2010 I got a generic margarita. Maybe you have to ask for the good ones?]Go. Have a taco. Make sure you get a margarita!", "Date": "2009-08-21", "Author_Location": "San Antonio, TX"}, {"Author": "Sarah P.", "ReviewID": "N-gLlbBTajAITmpuno-Cnw", "Overall": "5.0", "Content": "Try the mahi mahi... it's to die for, one of my alltime favorite dishes.  Yummy!", "Date": "2014-03-17", "Author_Location": "Pennington, NJ"}, {"Author": "Justo C.", "ReviewID": "08JakuK9-Qi8hMDqz0SA2g", "Overall": "1.0", "Content": "The written reviews about this restaurant got me curious to check it out so last Friday, my wife and I went there around 3pm,right after the noon crowd had left and before the dinner crowd comes  barging in. Good news and bad news. First, the good news, their guacamole is out of this world delicious! We almost licked the little bowl. Chips could have been more generously served but I guess they were saving them for the dinner crowd. They had sacks of them lined up along the back door. The bad news. Puerco Milano was like a battered and fried cardboard. IT was so dry it was hard to cut and swallow. Did I mention it had no taste? I had built up much anticipation of a tasty meal and it crashed and burned. I should have asked for a refund but my nice wife convinced me to just leave. My wife had one of the vegetarian dishes (grilled zucchini with green mole sauce). She said it was OK.  We were hoping for another top notch restaurant to add to out list here in San Antonio but it did not happen with Guajillos. That shortcut to Mexico in their name is more like a shortcut to bad food to me. They are doing a disservice to Mexico City cuisine!", "Date": "2014-03-17", "Author_Location": "Houston, TX"}, {"Author": "Lucas B.", "ReviewID": "N8_8YpEyvz0pwmd2ylUprA", "Overall": "4.0", "Content": "I am a gringo tourist, but I think Guajillos is great, and so far every driver I've had has know exactly where it is if they have to get me there or pick me up. It is clearly a local favorite. I had the Pasilla again and it was just like I remember: spicy dark, bitter, coffee, chocolatey sauce over a thin cut steak, supplied with tortillas, rice and beans. It is a different taste for me that I definitely can't get back home and I  welcome it. I'd also recommend the Cochinita - a pulled pork delicacy with a spicy pickled onions side. Throw them all on a tortilla and relish it. I've also been told the Bacalao is a must. The salsa rules my world. It looks a little different every time I come in, which says one thing...fresh. Send it to NY for me, if you have a heart.", "Date": "2012-03-10", "Author_Location": "Buffalo, NY"}, {"Author": "Ed S.", "ReviewID": "fNwdHO7aIbRATckvtoQKiA", "Overall": "5.0", "Content": "This place is great for the very reason that it isn't your typical Mexican. It's in a non descript building in a city full of Mexican restaurants - and yet the parking lot is always packed.So finally we decided to stop. And we're glad we did. We recognized very little on the menu (and had to ask for help from the kind waiter) but enjoyed absolutely everything. Ex. The meal was preceded by soup, which I normally don't like - but I couldn't get enough. The flavors were so good.This is authentic interior Mexican food. In addition, everything is prepared freshly. So when you're feeling adventurous, this restaurant is definitely worth a visit. It may become a favorite.", "Date": "2008-07-18", "Author_Location": "Austin, TX"}, {"Author": "Heather H.", "ReviewID": "0jg1ZVJ3udJ0Aq051AtYEg", "Overall": "3.0", "Content": "The other reviewers have already elaborated on the type of food that is served here, so the only comment I will add to that is how healthy the food seemed to be.  This meal was definitely more guiltless than any other Mexican meal I have had in this town, and tasted great as well.The service was wonderful.  The owner talked to me and my husband frequently throughout the meal and made great recommendations.  He sent us plenty of free food to try out and even sent me home with some free mole sauce.I would give the food and service 4 or 5 stars, but the building and facilities were so unhygienic that I had a lot of trouble enjoying the experience.  There was a cockroach IN our booth and the restrooms were in atrocious condition.  My husband and I joked that this must be Guajillo's way of being as authentically Mexican as possible.I am surprised that no other review of this restaurant mentions how unsanitary it seemed.  Maybe I just made my first visit on a bad night?", "Date": "2009-03-12", "Author_Location": "San Antonio, TX"}, {"Author": "Gerardo D.", "ReviewID": "1aSYk82p74gzRiAkAHwO7g", "Overall": "5.0", "Content": "As good as authentic Mexican gets! Seriously, this is one of the best places I have tried in the US. We tried the Sopa de Tortilla, Sopa de Fideo, the alambre, the ceviche, albondigas (meatballs), Jamaica water, steak tacos - man, we ate a lot! it was all really really delicious. Guajillo's gives us an excuse to go to San Antonio. I have to drive down to San Antonio next week and looking forward to it because I can eat here.It is not a fancy place. The menu is not sophisticated nouvelle Mexican or anything you would expect from an upscale restaurant. It's simply really good, authentic, delicious Mexican. Not Tex-Mex, not touristy Mexican. This is the good stuff. Try it.", "Date": "2011-05-08", "Author_Location": "Austin, TX"}, {"Author": "Rick E.", "ReviewID": "DqNeUvnMJ6dCz1FYGAY4iQ", "Overall": "3.0", "Content": "Good but could be great! I started off with the Shrimp soup and was warned that it was spicy. I could not stop sweating and the one napkin they provide was not enough. They do not mess around and that soup should be a challenge. It did have a good flavor but the shrimp they placed in the soup was boiled shrimp and had non of the soup  flavor what so ever. Big disappointment. Michelada was ok and can be improved. I had the Al Pastor tacos and they were good. A bit too much cheese on the tacos so I recommend asking for lite cheese.", "Date": "2013-10-09", "Author_Location": "San Antonio, TX"}, {"Author": "Nathan W.", "ReviewID": "KyO8wXLWxZ_BgpNgT2RlQg", "Overall": "5.0", "Content": "This place was delicious.  All I could find in San Antonio is texmex restaurants.  Finally, someone told me about an authentic Mexican restaurant and this was it.  I will come back here for sure!", "Date": "2013-10-30", "Author_Location": "Grand Forks, ND"}, {"Author": "Tara H.", "ReviewID": "5Iho34_OkVa7K_Ff5ZowPw", "Overall": "3.0", "Content": "\"Shortcut to Mexico\"\"The Mex, without the Tex\"Guajillo's is something of an anomaly among San Antonio Mexican restaurants. My very Texan dining companions asked for queso two times (no one said they were smart!) and were met with a very polite response from our very patient waiter. Guess what? No queso? No enchiladas! Nothing that resembles the \"Mexican\" food you Texans have gotten used to.We both finally settled on Chilaquiles con Carne Asada which is tortilla chips in tomato sauce, onion, sour cream and cheese served with a thin sliced steak. I thought it was delicious and after poking it with his fork and asking what it was, so did my friend.We also enjoyed a very decent Tres Leches cake.", "Date": "2008-04-16", "Author_Location": "San Francisco, CA"}, {"Author": "Dean H.", "ReviewID": "8TVHkZzV4kBARSkrVWwEqg", "Overall": "5.0", "Content": "I would go to Guajillos to literally drink their salsa.  The rest of the menu doesn't disappoint either - both moles (green and poblano) are phenomenal, as are the tostadas de picadillo.  Horchata is well worth ordering as well.  My buddy swears by their Albondigas.Some folks may prefer more yuppified authentic Mexican options in SA (La Gloria, etc.) but for folks who just want good, authentic Mexican with more emphasis on food than ambiance, Guajillos should be your go to place.", "Date": "2010-11-21", "Author_Location": "San Antonio, TX"}, {"Author": "Carlos J.", "ReviewID": "u59dnbV-YlGheADVGNw_rQ", "Overall": "4.0", "Content": "I love this place.  I can't believe I've only been here twice in the last five years.  My last visit was after the last UTSA football game this year.  I had the albondigas en chipotle.  The meatballs were very good, and the sauce very spicy.  Not as good as my mom's albondigas en chipotle, but I'll still rate this dish a 4.5 stars out of five.  It's nice to eat at a Mexican place with a menu that doesn't contain the usual Tex Mex fare.  I'm not going to wait as long before my next visit!", "Date": "2011-11-22", "Author_Location": "Castroville, TX"}, {"Author": "Keith M.", "ReviewID": "t4bqWKTgDaVttSi2JLCxVg", "Overall": "3.0", "Content": "This place offers authentic mexican dishes for those wanting something different from tex-mex. I just went with my grandma and had the Bisteces a la Mexicana, with a serrano pepper sauce. It was outstanding!!! I could have had a bowl of just the sauce. The rice was ok, beans were solid. The Fideo was may be the best in the city. The salsa is good but add lime juice to it, makes it better.Very good place, I definitely recommend going by for some different from the norm of Texas Mexican food.", "Date": "2011-12-23", "Author_Location": "San Antonio, TX"}, {"Author": "Megan O.", "ReviewID": "gDgrQC-u4WDR2wqG3uIijg", "Overall": "4.0", "Content": "Authentic food. Great salsa. No queso, of course. The location is kind of hard to access from 410.Although the food was great and authentic, the tres leches was terrible.", "Date": "2012-03-24", "Author_Location": "San Antonio, TX"}, {"Author": "Sunay P.", "ReviewID": "JN3hOzWA2uyZ8KiD1pM__w", "Overall": "4.0", "Content": "Guajillos is a very unassuming little place on Blanco and the 410 service road.  We had observed this bright yellow building for a while and finally decided to go there based on a recommendation from someone who said they are authentic Mexican and don't use lard in their beans... a major selling point for the vegan spouse.On our visit we were among the first people there and greeted by the friendly owner (and we are glad we got the early, because this place filled up!).  We got the whole spiel about why their food is authentic and how they don't use grease and lard or margarine etc. etc. He then asked us what we generally like to eat and recommended the grilled zucchini with green mole for my wife and really really wanted me to try the albondigas in chipotle sauce.  At this point our waiter showed up with a bowl of salsa and etherially light chips (not home made..but thin, crispy and a perfect sturdiness to them).  I also ordered a cold Indio which by they way was among the coldest beers I have had in a long time. Which was a good thing on that hot morning.  The salsa was a perfect meld of tomatillos, cilanttro, garlic and a bit of chile.  You could taste the tangy tomatillos, the herby cilantro and all brought together with the slight bite from the garlic and chile.After a pleasant interlude the food arrived.   Now the only critique of sorts is that the plates looked quite messy..but hey this was home cooking! The grilled zucchini with the green mole was fabulous with the slight char of the zucchini perfectly complimented by the smooth green mole with a tinge of heat, the warming allspice that we could taste and the richness of the pumpkin seeds that tamed the tangy heat of the roasted poblanos.  I had ordered the albondigas which were a perfectly sized tender meatball with rice and chopped eggs mixed into the meat (very traditional). The meatballs where tender and coated with a deep flavored chipotle sauce which was not too hot and had the tangy, slightly sweet, spicy hit expected from the sauce.  We were served corn tortillas to go along with this and they were ideas pockets for smearing with the beans, dabbing the flavorful rice and pieces of albondigas with the chipotle sauce.  Perfect bites followed by the perfectly cooling beer made for an outstanding first meal of the day.To keep the sensation going we also took a fideo to go which was consumed that evening to cap off the homage to Guajillos!", "Date": "2013-03-03", "Author_Location": "San Antonio, TX"}, {"Author": "Alethea A.", "ReviewID": "AOCGxFi-UOVZBk3MfujEpg", "Overall": "5.0", "Content": "I really, Really REALLY LOVE Guajillo's!!!I am not a fan of tex-mex and had all but given up on mexican food until we came here. Our friend from Mexico City turned us on to Guajillos... he says this is the only restaurant he will eat Mexican food at, and I can see why.For starters, the ceviche de pescado is very delicious! It has a very clean flavor. The nopalitos salad is great as well.The tortilla soup is tasty... not like the tortilla soup you get at other restaurants. The fideo is AMAZING!! It took me back to my grandmother's neighbor's kitchen who would cook for me when I was little and didn't speak a lick of english.For entrees  i like the tinga... very tasty and very spicy and the alambre, the al pastor and the tocinada tacos are great!Fantastic lunch specials during the week. Oh yeah,,, DULCE de LECHE!! The owner told me that his mother makes it every morning and MAN, it is DELICIOUS!!", "Date": "2012-02-12", "Author_Location": "San Antonio, TX"}, {"Author": "Amy Y.", "ReviewID": "IC6aEKON2W2hB1PjLd1l3Q", "Overall": "3.0", "Content": "Unique Mexican food experience; I believe it when they say that this is a taste of authentic Mexican food.  The ingredients were fresh and kept well a couple days later indicating the quality of the food.  When you walk in, you seat yourself.  My waiter took a little while to get to us, but otherwise, the service was decent.What I ordered/thoughts:- Tortilla Soup (simple ingredients; good when you get the cheese and soup at the same time - gives it a more full taste.  Be prepared for the soup to be oily, as I believe it is in its authentic form)- Chips & Salsa (salsa was spicy, but nothing exciting)- Albondigas (meat balls in chipotle pepper sauce that were pretty unique - never had something like this before!  the sauce is definitely spicy, but in a delightful way)- Al Pastor tacos (enough to feed one person, meat was pretty tender, but I wasn't too impressed)Overall, it was a unique experience, and the place was packed.  Had to go into the back to park (be prepared to park in the back).  There are always people coming and going, and I suppose that's a testament to its popularity.", "Date": "2010-07-16", "Author_Location": "San Antonio, TX"}, {"Author": "Shirley F.", "ReviewID": "pCSr9pYTXtsOgn-xjVxFwQ", "Overall": "1.0", "Content": "I like both interior Mex and Tex Mex, but I don't care for this place. The food was mediocre.The chips were perfectly fried, but the salsa managed to be both spicy and tasteless. How did they do that? My mouth burned, which I normally like, but there was no other flavor. The fideo was all right, but tasted a bit watered down and seemed to be missing some fundamental flavor.  The mole poblano consisted of underspiced mole sauce (it was also seriously missing something, but I still can't identify what) ladled over an flavorless piece of flat and dry grilled chicken. The dish was served with rice and pinto beans. Some of my rice was undercooked and still overly firm, but had a nice citrus flavor to it that almost made up for it (but not quite). They proudly made their beans without lard or oil, but instead dumped a massive quantity of spices into them to try to make up for it. I was not impressed by the overwhelming flavor of the beans, but I guess it made up for the lack of flavor in the main dish. The corn tortillas were not fresh and tasted like they had been sitting out all day. After all the hype for this place, I was extremely disappointed. The food was so boring - it's the Cracker Barrel of Mexican food. We also waited a long time for a waiter to take our orders and the place wasn't crowded. I don't understand what everyone else sees in this place.", "Date": "2013-08-21", "Author_Location": "San Antonio, TX"}, {"Author": "James S.", "ReviewID": "GzJUeWMz9x3ErKX9iYkCHQ", "Overall": "5.0", "Content": "Some of the best Mexican food in town. Their salsa and chips is great but spicy. If you like horchata (rice milk and cinnamon drink) this is the best in town. I usually get chilaquiles and steak special. Service is good and prices are great.", "Date": "2013-05-25", "Author_Location": "San Antonio, TX"}, {"Author": "deshunda m.", "ReviewID": "6GB1ae_4EhbJPifNdxPfcg", "Overall": "5.0", "Content": "My family and I visited over spring break last week and absolutely loved it! The hot sauce is so authentic and good not like any other I've had.  This will definitely be on our to do return list.", "Date": "2009-03-22", "Author_Location": "Dallas, TX"}, {"Author": "Mar J.", "ReviewID": "3Rmaxu_m9cgYxpvNQRtuJg", "Overall": "5.0", "Content": "Waitress- awesome, understanding of kids (my 2yo knocked the salsa on the floor under the table), put together a good little meal for the kiddos since they don't have a kids specific menu. Margaritas- strong, but not overwhelmingly soAlambre- INCREDIBLE. Don't miss this!!", "Date": "2010-08-01", "Author_Location": "Cedar Park, TX"}, {"Author": "Han P.", "ReviewID": "Z0zmjFPylaR9mkOhLuS2Xg", "Overall": "4.0", "Content": "This is the second time I've been to this place.  I went there for lunch the first time and dinner the second time.  I like this place because they don't serve your normal Tex-Mex style of food.  It seems to be a more authentic style Mexican food, but I'm not sure what region of Mexico.To start, they bring chips and salsa which seems to be made fresh.  I really liked the salsa as it had quite a kick to it.  I can't really say how spicy it was because I eat a lot of spicy food, but it had a nice zing to it.  The person with me doesn't normally eat spicy food and said that it was a little too spicy for him.    For my entree, I had the Cohinita Pibil (Yucatan Style Pork).  It comes with rice n beans, veggies, and tortillas.  What you would typically expect with this type of meal.  Overall, it was pretty good.  Nothing spectacular, but this type of food isn't meant to be.  Pretty standard fare, just the way I like it. Oh and the service was great.  Our waiter was very attentive and provided prompt service.  I don't think our drinks were ever half empty.  Also, our food came out very quick.  It felt like 5 minutes after we ordered it.  This may have been because the restaurant wasn't overly crowded.  I think it was about half full.", "Date": "2010-09-23", "Author_Location": "Philadelphia, PA"}, {"Author": "C P.", "ReviewID": "-yz5BwsCi74knn2t7oYfGg", "Overall": "1.0", "Content": "Don't expect to find a single dish with Guajillo chile in this place. Also, they served me Uncle Ben's Rice!! Nothing Mexican about it. Awful.", "Date": "2012-08-12", "Author_Location": "Boston, MA"}, {"Author": "Joe N.", "ReviewID": "Dy7mHRRDsRhwzzczmKvNJg", "Overall": "5.0", "Content": "Once upon a time there was a restaurant called Taco Inn. The restaurant, owned and operated by the Father and Uncle of a close friend of mine provided me with a job to do during lunch as a high school senior. I actually ended up meeting my wife at this restaurant and loved everything about it. Fast forward a little more than a decade and Taco Inn has closed in order to open Guajillos. Guajillos is by all accounts everything that made Taco Inn a great place, but with so much more to offer. The same family owns and operates Guajillos so I have the familiarity and comfort of feeling like I'm back at Taco Inn. The food is excellent and always has been. I've eaten almost everything on the menu and every once in awhile my close friend who manages the place offers me up something special that is not on the menu. Everytime I've been blown away by the speed of which the food arrives and more importantly, the flavor that it brings with it. Having a wife from south-central Mexico its hard to find authentic Mexcan cuisine in this town. Its funny because you would think it wouldnt be that hard considering the large population of Mexican restaurants. The only problem is that 99% of them are Tex-Mex...a bad combination of hard taco shells and made up dishes that do not even exist in Mexico. Guajillos provides the a meal experience that is so authentic that its hard to remember that we are sitting on 410 and Blanco and not in a taco shop in Mexico City. Bravo is all I can say....bravo indeed!", "Date": "2011-02-13", "Author_Location": "San Antonio, TX"}, {"Author": "Candice B.", "ReviewID": "TGgNSCTaVWaba-D5xSHcwg", "Overall": "2.0", "Content": "We went here our first week in San Antonio, before we even moved into our house. I wasn't used to Tex Mex yet and it was very strange. We have the Fideo different but good flavor. Haven't been back since. I am warming up to TexMex, but I still have really hard time with the poor quality meat.", "Date": "2013-04-30", "Author_Location": "Alexandria, VA"}, {"Author": "Paolo S.", "ReviewID": "mDZPc_8ylKJmGmDWsKnEiA", "Overall": "5.0", "Content": "For the last five years, Guajillos has been the #1 place to visit when I need a break from tex-mex fare and something spicy. I suggest visiting during lunch, when $7.00 will get you a bowl of tortilla soup or fideo and an entree. I've tried the mini tacos and the carne asada chilaquiles, which have always been tasty. Also, the chips and salsa are to die for. The habanero salsa with a squeeze of lime is absolutely delicious with the chips and entree. Definitely try this place if you want a quick, delicious lunch with good service.", "Date": "2013-05-19", "Author_Location": "San Antonio, TX"}, {"Author": "Leila S.", "ReviewID": "rB8bk437noJvCzg4hX-0vQ", "Overall": "5.0", "Content": "I was in San Antonio for a short vacation, and was completely disappointed by the restaurants that my friend and I had been too. Well we needed to get something before my flight back and I had read the reviews on this restaurant and they were really good so we went. The food, was priced really low, and we both truly enjoyed what we ordered and each other's food. I ordered the Alambre (not sure if that's spelt correctly) and she ordered some kind of meat with mole sauce which was really yummy. Our waitress was so nice, and she didn't charge for our refills or the side of beans and rice I ordered. So I made sure to leave a nice tip. Nice restaurant and people.", "Date": "2011-04-04", "Author_Location": "Henderson, NV"}, {"Author": "kelly j.", "ReviewID": "8SoFp9VKRIF9IsgTcJaUcg", "Overall": "5.0", "Content": "Everything here is DELICIOUS.  This is saying alot because I am from San Antonio and there is a mexican food restaurant on just about every street.  I find it so endearing that on their menu they have \"vegetarian\" section.  Mostly because mexican food is based on meat!  The enmoladas are what I get everytime.  The staff is nice, and quick... they don't keep you waiting for drinks, chips or salsa. My family and I randomly visited, and kept adding on people who came by to dine with us, so they were cool with the large, last minute, adjustments.  The dining area is clean and has nice seating.  I love the booths, but you can't always get those.  The parking lot is small, and you are never alone in that.  It seems as if you go once, you will go again and again.  This place does not disappoint.", "Date": "2011-10-06", "Author_Location": "San Antonio, TX"}, {"Author": "Eric C.", "ReviewID": "Hh3ttVbckm5cEZUBCSZukQ", "Overall": "4.0", "Content": "Stopped by Guajillo's for lunch during a business trip to San Antonio.  I ordered the Tacos de Alambre from the lunch menu and was not disappointed.  The chips and salsa were tasty, the fideo soup was a perfect way to warm up from the cold weather that day, and the tacos were full of flavor.  The beans were good and the rice was average, but I'm almost never satisfied with restaurant spanish rice.The best part of the experience?  Everything on the lunch menu is under $6.00 and comes with chips & salsa, soup (fideo or tortilla), rice, and beans.  Because I ordered water, my bill was $6.30 after tax...a MUCH better way to spend six bucks than bad, mass produced, fast food!As for the service, the waiter was friendly and the service was fast even though I went during the lunch rush.  The soup was delivered almost immediately after I placed my order and I was less than halfway through it before I had my tacos .  I'd definitely return!", "Date": "2011-10-28", "Author_Location": "Alamosa, CO"}, {"Author": "Jason R.", "ReviewID": "PFGeL3bxtidxVAcTrPivlw", "Overall": "4.0", "Content": "I have been several times and enjoyed each trip.Most recently had the mini bistec tacos with a side of beans. Not adventerous but defenitly delicious! Maybe it's TMI but these are the only resteraunt beans I've ever eaten that didn't cause me gas later on. The family had milanesa de puerco and mole poblano of which both were recommended. The staff is great and the salsa actually has flavor (unlike most of San Antonio). Quick with refills and don't hover but keep on top of things.There is also a small patio seating area.So why not 5 stars you ask? The only thing that killed it for me was the noise level, which for not at a peak time, was high. Nothing they can really do about that though.Give em' a try.", "Date": "2011-11-06", "Author_Location": "Travis County, TX"}, {"Author": "Ashley D.", "ReviewID": "-ohgEF6ymIRUvcc3j4H2bg", "Overall": "5.0", "Content": "You can't pass up Guajillos, affordable and delicious! Chips and salsa are awesome if you like spicy salsa, just add some lime and it's delicious! The fideo is not your typical fideo with meat and picadillo, but it's still very tasty and makes the meal!The tacos de alambre are the bomb.com! They have thin slices of pork loin and sirloin steak, covered with melted cheese, sauteed onions, bacon and poblano peppers. Simply amazing! Also comes with rice and beans which are very good, but not your typical spanish rice. Everyone should visit Guajillos, I make a weekly trip because it is addicting! Don't come here for tex-mex food because it is far from it. Come here for great service, affordable dining and authentic, delicous mexican food!", "Date": "2012-03-29", "Author_Location": "San Antonio, TX"}, {"Author": "Michael R.", "ReviewID": "USRdWc-aYNJqv6exA8fZZg", "Overall": "5.0", "Content": "Once again, props goes out to my fellow Yelpers with another great suggestion. I had dinner here last night and enjoyed everything about this place. The food is great, service was wonderful and accomodating, and the prices are a bargain. This is more what is known as \"Mexico City style\" Mexican food, meaning these are dishes that you are more likely to be served south of the border rather than at your standard TexMex places. So if you are looking for cheese enchiladas covered in chile con carne you won't find that here; however, what you will find are faithful renditions of time-honored dishes in all of Mexican gastronomy. My little boy and I arrived and were able to seat ourselves, which as I found out later was fortuitous. We were immediately greeted with chipsand a very delicious salsa that delivered a nice kick. I ordered the cochinita pebil,which is one of my very favorite Mexican dishes. it came with of course the obligatory rice and beans and a relish of spicy picked red onions,and let me tell you,spicy was the operative word. Their pebil was perfectly cooked, and well speasoned. It had it's own bit of heat too,but with the onions it builds on that heat. Though they didn't have akids menu they  were more than happy to fashion him a quesadilla with shredded chicken. They really loaded the chicken on there too. He loved it and so devoured it. We split a piece of tres leches cake for dessert and that was good. we got a bowl of fideo for Momma who was at home under the weather, and she told me it was wonderful. In all our bill after tax and before tip came to just over 20 bucks. What a great value! I'll definitely go back, there's so much more on their menu that I want to try. I am glad that they have my favorite dish there though. It's always good to have a usual. So if you are a fan of authentic dishes from the Mexican Interior, or wanting to try it instead of going for the usual TexMex then give it a try, I'm confident that you'll like it.", "Date": "2013-01-17", "Author_Location": "San Antonio, TX"}, {"Author": "Kurt R.", "ReviewID": "_0GjVoGgNxW7bo0L9ZPXwQ", "Overall": "4.0", "Content": "Always enjoy this place, but the parking is so bad I don't get here often.  They have the best Albondigas en Salsa Chipotle that I have ever had.  Be careful though, it packs quite a bit of spice to it!", "Date": "2013-05-19", "Author_Location": "San Antonio, TX"}, {"Author": "Alejandra M.", "ReviewID": "aDI8iR1PuCalmJoCsvpt1g", "Overall": "4.0", "Content": "Guajillo's is the closest I can get to Brownsville's mini tacos. Although they are styled differently, they do have the bistek chopped up pretty finely. They smother cheese on top of the bistek and bring you cilantro and onions finely chopped so you can dress your tacos as desired. The best part of Guajillo's is the hot sauce you get with chips while you wait for your food. It is very tasty so the spiciness sneaks up on you. I think it is so good, I wish they would bottle it and sell it to the public.The tomato fideo soup is very good.  I hate to go to places where they claim to have fideo, and it's really thick like spaghetti. This fideo is the really thin fideo. The way it should be!! It tastes great with lime on it. Definately a place I visit frequently! I am a fan!", "Date": "2012-09-27", "Author_Location": "San Antonio, TX"}, {"Author": "Pete S.", "ReviewID": "vJnLuP0WVxkxUE_S0McZPw", "Overall": "5.0", "Content": "This place is spot on fantastic. The owners are from Mexico City. This is really authentic Mexican food. It is great. Service was great. I understand that they don't use lard in any of their cooking. And to get the flavor with no lard. Wow. We are not from San Antonio but will make this a regular stop when we are in town.", "Date": "2012-11-04", "Author_Location": "Lubbock, TX"}, {"Author": "Michelle M.", "ReviewID": "cGHZfODg8LwVg94sfVP8xA", "Overall": "5.0", "Content": "Authentic mexican food! Not much of a scene though, definitely not fancy. Great if you know what you want/ know your sopa azteca!", "Date": "2013-04-12", "Author_Location": "Deer Park, NY"}, {"Author": "Sean M.", "ReviewID": "PzP9FHwuUTchaoH9tUcy7g", "Overall": "4.0", "Content": "Been coming here off and on for about 4 or 5 years and it definitely remains a favorite. I've sampled most of the tacos, apps, and soups, but still have yet to get over to the specialties side of the menu, although it looks delicious. I just can't seem to tear myself away from the tacos alambre. Today's visit featured the delicious and simple fideo and aforementioned tacos alambre obsession. It returned me to life after a crappy morning.A couple of warnings for the faint-hearted: the tortilla soup is not the usual stuff your abuela made or that you can get at Taco Cabana or Chilis. It's dark, it's spicy, it's flavorful, but it will definitely be a surprise if you're expecting the lighter version. Also, as some reviewers have pointed out, and something that also remains a mystery to me, despite the authenticity of the food and overall great flavors, the rice is so terrible. Like utterly bland and dull and unexciting terrible. I'm sure it starts off with the greatest of intentions, and I'm aware that even simple dishes like rice have their own territorial or familial recipes and variations, but at the same time, could ya get a little more flavor there? Maybe a bit of garlic and more chicken stock? It really is a generic Mexican Tio Ben's rice there and it leaves me dumbfounded every time. I expected that in New England, but not in Texas.One last gripe: the parking. I don't think it's been covered, but the parking situation can be a little weird. The parking lot itself is too small for the restaurant, so if it's a peak time, you're going to be navigating driveways and sharp turns behind the restaurant. There are signs warning everyone about NOT using the overfill parking, and although we've yet to be towed for using the closer lot on the side, I'm still about erring on the side of caution at times. So be prepared for a hike in the back parking lot if it's lunch or dinner rush.Next time I go back I swear I'm ordering a specialty dish. And good riddance to the people who thought Taco Bell was better.", "Date": "2012-08-17", "Author_Location": "San Antonio, TX"}, {"Author": "Heather L.", "ReviewID": "-tVY_ykgoxsDwXUov1uwBQ", "Overall": "5.0", "Content": "Guajillo's is a great place to get authentic mexican dishes. Their salsa is mouth watering and spicy. I also love their tacos and fideo soup. Lots of flavors and spice here.", "Date": "2013-04-09", "Author_Location": "San Antonio, TX"}, {"Author": "Eddie G.", "ReviewID": "DnnUvPl5tfFNqzioaA-EYQ", "Overall": "4.0", "Content": "I always try to make a stop here on my trips to SA.  Delicious, authentic Mexican food. Margaritas and micheladas are great too.", "Date": "2013-03-21", "Author_Location": "Stafford, TX"}, {"Author": "Erik F.", "ReviewID": "vqCxYbEdtiGultBHhyK_rQ", "Overall": "4.0", "Content": "Authentic Mexican!!!  Tacos were the best!!", "Date": "2013-04-25", "Author_Location": "Denver, CO"}, {"Author": "Diana D.", "ReviewID": "1Rdhp3eKp3loSw7StA5j8g", "Overall": "4.0", "Content": "Yup, good one if you want to get close to real mexican food. Let's be honest, you can't get the authentic taste of a kind of food if you are not in the REAL place!!  Who's with me?  Anyway, Guajillo's is good, really good.  My favorite is the chilaquiles de pollo and fideo soup, and the salsa almost like my mom's salsa, yum!    The Agua Frescas are  not the best approach to the real thing but close enough.  And to response to Heather's (one of the earlier reviewers) we not only have roaches in Mexico's restaurants, but so much better you can get a rat to bring you your drink and stir it for you!   Freaky huh!  Enjoy....", "Date": "2009-07-04", "Author_Location": "San Antonio, TX"}, {"Author": "Lina R.", "ReviewID": "pOM0t_Gnr0X7_b-cyPQ0ww", "Overall": "5.0", "Content": "AMAZING. Service wasn't bad and the food was great! I hate corn tortilla, but this place made me like it now. This is authentic as it gets.", "Date": "2013-04-07", "Author_Location": "Carrollton, TX"}, {"Author": "Hari N.", "ReviewID": "9aCTZ8azN36b-JddoOfu9w", "Overall": "5.0", "Content": "Salsa is straight from heaven...So nice with right amount of spices to create a full body flavor. It has infact won the best salsa award. They just have one salsa unlike many that carry 2-3 types of sala. This is one of the few places that serves Cochinita pibil. Their soup is decent, and Chilaquiles is very nice with the salsa. Surely a must go place. The staff was very nice and the food came out so fact, that you were not kept waiting for anything.", "Date": "2011-10-22", "Author_Location": "San Antonio, TX"}, {"Author": "Lin C.", "ReviewID": "y3E8u7jiCBQE-p2cqk-wVg", "Overall": "5.0", "Content": "Not your typical Mexican food...or what you think is authentic Mexican food. I'm not a big fan of Mexican food (too oily for me), but the food here is amazingy good that I'd eat here again and again. My friend brought me here and had promised me that they served authentic Mexican food. It's not your average Tex-Mex place. I had a steak taco, and was surprised that the taco didn't look like what I had expected. I mean it came with a few small tortillas and beef on top of it. You can add cheese for an extra charge, but my taco tasted fine without it. The beef has so much flavor. The prices are reasonable and the service/staff are so friendly and upbeat.", "Date": "2009-01-25", "Author_Location": "San Francisco, CA"}, {"Author": "Adri H.", "ReviewID": "1rhb2zbBKBHcxRnftOuX_A", "Overall": "5.0", "Content": "When I have gone more than a few weeks without it.....my mind wanders to their hot sauce and guacamole constantly until I have my fix.....First timers must try their albondigas (meatballs of goodness served with rice and beans) and their tacos (be sure to add cheese and no rice or beans come with).  Their fideo is the soupy perfect kind that you will also dream of later.  Do not think San Antonio typical Tex Mex when you come here or you will be disappointed.  Their margaritas and cheladas are awesome and so are the prices.", "Date": "2013-05-06", "Author_Location": "San Antonio, TX"}, {"Author": "Gerardo B.", "ReviewID": "qfsl2DQTCLh6bp4rD-bACw", "Overall": "5.0", "Content": "Take it from a Mexican, if you want authentic Mexican tacos this is as close as it gets in this side of the river. Simply delicious.", "Date": "2012-02-23", "Author_Location": "San Antonio, TX"}, {"Author": "Elle H.", "ReviewID": "ebt_fX30MJJihUmrkwdUEA", "Overall": "4.0", "Content": "The service was fast and friendly. I tried the enfrijoladas and due to them not using lard and other additives it didn't feel like a bowling ball in my stomach after the meal was over. This also is the reason I think it sort of lacked flavor. I will say that the salsa that came with the chips and salsa at the beginning of the meal has an amazing flavor and a nice kick (salsa is very important). Maybe I should have poured the salsa onto my meal...another huge plus is that I paid $6.95 for my plate rather than the usual $9 plates at most other restaurants.", "Date": "2012-06-23", "Author_Location": "San Antonio, TX"}, {"Author": "Derek C.", "ReviewID": "vkK0_YVlJLboJNxanfRDwA", "Overall": "5.0", "Content": "Who am I to say whether or not a Mexican restaurant is \"authentic\". I always tread lightly when I see people with limit experience in a country declare a restaurant serving food from that country \"authentic\".  But on the merits of the taste of the food, this place is a wonderful surprise. It certainly isn't the Tex-Mex we are used to. The Tortilla soup was a simple broth with tortilla chips mixed in. Not the chicken and alvocado variety, but delicious and simple. The salsa that came with the chips is fantastic...once enough taste buds on your tongue die and you can actually sense the flavor of this HOT concoction. And the tacos. Once again....simple. 6 mini taco shells topped with marinated pork. They include a plate of onions and cilantro on the side for you to  add to the taco. Delicious. Americanization and watering down of ethnic foods, like Chinese and pizza, is very American. And now they are commonplace we take these foods for granted (ever hear the saying that there's no such thing as bad pizza?). By keeping things simple and supposedly close to the real deal, Guajillo's makes you rethink Mexican food and develops an appreciation of all the wonderful cuisines the made their way to America over the years. Don't take the word of some hipster (or me, for that matter). Come and try for yourself.", "Date": "2013-08-27", "Author_Location": "Bellingham, WA"}, {"Author": "Sarah M.", "ReviewID": "-KY1v0WhU1-TmaFIeG9bzA", "Overall": "4.0", "Content": "I've gotta say that Guajillo's is the closest to true Mexican food that I've had on the north side. The thing I love about the menu is that they combine tradition seafood dishes with tradition beef and pork dishes. So no matter who you're with they'll find something tasty to eat. When I went I got the Chilaquiles de Pollo which was outstanding. Thinking about it now makes me want to go there right now. I also love getting the little tacos. It reminds me of this great taco stand I used to go to. As far as drinks are concerned I agree with Trey. The margaritas are ridiculously delicious and strong. I would HIGHLY recommend going to Guajillo's.", "Date": "2009-09-12", "Author_Location": "San Antonio, TX"}, {"Author": "Alex A.", "ReviewID": "FlJmV-pj7wOB_yTbMOH7Jg", "Overall": "5.0", "Content": "Hands down the best hot sauce and tacos de bistek in town and possibly beyond.  I've never had a bad meal here since I first learned of the place several years ago.  This is not Tex-Mex so don't expect greasy enchiladas on the menu.  The beans, made without lard, also are my favorite in town and I've eaten a lot of beans in my day.  Micheladas and fideo are also very good.  I've had several other dishes but just can't remember then names right now.  In terms of authenticity and the quality of food, I'd have to say this is one of the better places in town.", "Date": "2010-10-04", "Author_Location": "San Antonio, TX"}, {"Author": "Juan N.", "ReviewID": "xWfRSDhRXpKHf8mvXjRiPQ", "Overall": "4.0", "Content": "I really like Guajillo's.  The food is really tasty.  I love the sopa de fideo and the cochinita pibil.  Inexpensive and tasty.", "Date": "2011-06-11", "Author_Location": "San Antonio, TX"}, {"Author": "James H.", "ReviewID": "ZHKqmLtojkOWGSmT2RIzZg", "Overall": "4.0", "Content": "This is a great place for old school tacos, they have the best salsa and chips in San Antonio I recommend the Al Pastor. Great for the price.", "Date": "2011-12-13", "Author_Location": "San Antonio, TX"}, {"Author": "Monica M.", "ReviewID": "fapTI_CdIH0IuIPOHF899A", "Overall": "5.0", "Content": "Do not come here if you are looking for Tex-Mex.  These are MEXICAN dishes from the south of the country.  I have had almost everything on the menu and can't recall a dish I didn't like.  My absolute favs are the albondigas, mole, and cochinita pibil.  If you are coming here and want the best out of it, order a traditional plate.  You can get tacos with meat anywhere!  The food is fresh and I never get a plate dripping in grease.  Great, fresh combination of flavors that you do not have in Tex-Mex cuisine.  The staff has always been extremely friendly and accommodating.  My favorite Mexican restaurant in SA so far.", "Date": "2010-11-13", "Author_Location": "San Antonio, TX"}, {"Author": "Karla H.", "ReviewID": "QerUVpGhtapeKuMvKmPacg", "Overall": "4.0", "Content": "Thank goodness for some authentic food!  Growing up with homemade Mexican food and then moving to SA for university proved very difficult. The restaurants here always had bland (non spicy) salsa, and offered a limited number of things. I love their Sopa de Fideo and their Aguas Frescas, especially because they have Jamaica. They offer queso fresco and their beans don't taste like they were from a can. It reminds me of home and I am now in love with this place!", "Date": "2011-07-28", "Author_Location": "San Antonio, TX"}, {"Author": "Derek S.", "ReviewID": "YAx_rMHXQ4P8tYsB3xOo7g", "Overall": "5.0", "Content": "GREAT FOOD, GREAT CUSTOMER SERVICE.  When we pulled up we were unsure as the place looked a little run down, but once you walk in the front door, you will know you made the right decision.  Very clean place.  Best Mexican food I have had in years and I live on the border.  English speaking staff provided great customer service.  Every time my 18 month old dropped her spoon, they were their within seconds to provide a clean one.  I don't usually write reviews but felt this place really deserved another one.  This restaurant will be a regular stop on our San Antonio trips for now on.", "Date": "2011-10-08", "Author_Location": "Laredo, TX"}, {"Author": "Mark W.", "ReviewID": "krbbiDTeBEZKLhSy8xUGrA", "Overall": "5.0", "Content": "I absolutely love this restaurant. I discovered Guajillo's on a Wednesday for lunch just after arriving into town. I ended up eating dinner there on Thursday and then brought 4 customers there for lunch on Friday prior to heading back to the airport. Everyone absolutely loved the food. The service was great and the prices are very reasonable. If you are in San Antonio, check it out, you won't be disappointed.", "Date": "2009-03-16", "Author_Location": "Madison, WI"}, {"Author": "Bronwyn W.", "ReviewID": "ppTHSrJdj5b8mamWZMAh5g", "Overall": "2.0", "Content": "I'd been hearing for a while that this place was pretty good. I needed a quick and cheap dinner option one night and talked my bf into this place (he'd been before and seemed to enjoy it). Glad I had a coupon... Chips and salsa... good, but not noteworthy in a city full of free chips and salsa. I got the soup with the shrimp and guajillo pepper-- totally tasty (spicy!) broth but shrimp were obviously large salad shrimp as opposed to anything of entree quality. Those were the only 2 components to the soup... so one being lacking makes the dish suffer tremendously. I then moved on to enfrijoladas--not awesome. The beans had good flavor and the cheese was good (I got one with white and one with yellow), but the whole plate was room temp at best. I didn't want to be bothered with flagging down my waiter again, so I just ate cold food. Dessert was rice pudding, which was okay, but nothing to write home about. Better than Kozy Shack cups from the store, but not by too much. Margarita was drinkable, but not something that I'd order again for flavor or buzz-catching purposes. Service was totally late-night dive style--not too bad or good. Would be back only if others in a group really wanted to go.", "Date": "2010-09-08", "Author_Location": "San Antonio, TX"}, {"Author": "Marisa P.", "ReviewID": "sAC-W9DiOGfo5HEgLlf7Aw", "Overall": "4.0", "Content": "Guajillo's makes some amazing tacos.  The gringas are more quesadilla style with just enough pork greasy goodness to soak into the tortilla.  The bistec taste great with lime, cilantro, and onion.  The taco servings do not come with any sides, and are more like \"mini tacos\" with 6 to a plate.  Plenty of spicy soup selections to nurse a hangover.  The aguas frescas help rehydrate.", "Date": "2012-05-06", "Author_Location": "San Antonio, TX"}, {"Author": "Kristina M.", "ReviewID": "Y3VvYIOBQpERR2-IR-n5Gw", "Overall": "4.0", "Content": "Sick of the usual Tex-Mex? Guajillo's forgoes the usual San Antonio staples and offers some delicious specialties from interior Mexico.  Although I try to sample more things off the menu, I typically order the Chicken with Mole Verde (also available as a vegetarian item with zucchini substituted).  It is absolutely incredible and served with lard-free, but very tasty refried beans.  The house salsa is flavored with habaneros and has just the right heat.  Chicken Tinga, served with pickled red onions, is another favorite, along with their LA style al pastor tacos.", "Date": "2012-05-08", "Author_Location": "San Antonio, TX"}, {"Author": "Sara Z.", "ReviewID": "KGzuADNCUExfjQLUpyOSDg", "Overall": "3.0", "Content": "Found out about this place on a list of best tacos in America.  Well, we have had better, Tacodeli in Austin was on the list and should have been on the list.  This was the worst of the best that we have had.  Had we never had the best we would have loved it.  Confusing?  In other words, it was pretty good, but definitely wont be your favorite taco.", "Date": "2012-05-11", "Author_Location": "Springfield, NJ"}, {"Author": "Jeffrey H.", "ReviewID": "YvaB53LUYY_vAtIExuncxQ", "Overall": "4.0", "Content": "Fantastic food from the interior of Mexico.  The tortilla soup is excellent along with the selection of lunch specials.  One of the best lunch bargains in town.  I love that there is no yellow cheese this is real Mexican Food not Tex-mex!", "Date": "2010-09-21", "Author_Location": "San Antonio, TX"}, {"Author": "Matt M.", "ReviewID": "rLSvBhoCQBN1obfM_EbGhA", "Overall": "3.0", "Content": "This place was just 'aight' for me, I probably just ordered the wrong dish or went on an \"off\" day.  The chips and salsa were tasty, the corn tortillas did not seem homemade (for a place that bills itself as truly authentic Mexican food, you'd expect homemade everything).", "Date": "2011-05-09", "Author_Location": "San Antonio, TX"}, {"Author": "john g.", "ReviewID": "cZ64nZY4vU_nwHieD_FaQA", "Overall": "2.0", "Content": "First visit. Service was excellent. Waiter was very friendly and attentive, even though busy with lunch crowd on a Saturday.I ordered the Chicken A La Mexicana and my friend ordered Bistec (mini tacos). I also ordered a small bowl of fideo soup as an appetizer.Ouch..the fideo soup was very, very salty which was a shame, because the broth flavor was great. I can usually handle oversalted food, but this was a bit much.Now for the main entree. I was disappointed with the chicken flank. It was dry and had burn marks on it, which led me to think it may have been reheated. The salsa on the chicken was okay and didn't have any \"heat\" factor, even though menu describes sauce as having serrano peppers.Plate includes rice and beans. The rice was disappointing, as it was too light and not much flavor. The refried beans were just fine, as they were fresh and had good flavor. The corn tortillas were not good, as they tasted like bulk pkg style. My friend  who is never critical of anything or anyone, briefly opined that the bistec tacos were not good, so I can't elaborate on her opinion without any further detail. As we exited the restaurant, my friend told me that she noticed a sign stating that they use \"healthy\" style cooking and ingredients. Maybe that explains the shortcomings I observed. The best part of this experience was the waiter. He was awesome and I tipped him very well for his positive attitude towards all customers and efficient delivery. Unfortunately, I don't plan on returning. There are just too many other choices in this great city for great Mexican or Tex-Mex.", "Date": "2010-09-19", "Author_Location": "San Antonio, TX"}, {"Author": "stephanie w.", "ReviewID": "9fTktJlQCV0WRhBiPI8BvA", "Overall": "4.0", "Content": "I recently came here with a girlfriend after a small splurge at the mall. We were looking for something easy, quick, delicious, and inexpensive. Not an easy task. Then Janie remembered Guajillos and their inexpensive taco plates. We immediately turned the car around and headed in their direction. Upon arrival we were immediately seated and promptly tended to. Our waiter (I did not ever catch his name) was nice enough and very attentive to our needs. The place itself is nonassuming and very plainly decorated; however, they were not crying for business. I knew I would be in for a good meal. The chips and salsa, oh the chips and salsa. What a heavenly combination! Thick cut, freshly fried tortilla chips sprinkled with salt and lime. Smokey, delisciously spiced salsa.... oh, it was like walking on sunshine! I could have eaten a few dishes all by myself. In hindsight I wish that I had asked for some to go. I ordered the bistec tacos and Janie had the pork carnitas with cheese. When Janies arrived she was slightly disappointed that the cheese on the tacos was more of a runny sauce than shredded cheese, but they looked good none the less. The one thing I did find somewhat strange though was that the meat was cooked separately from the onion and cilantro. Instead, the condiments are served on the side. For this reason I felt that the meat was a little undereseasoned. The plate consisted of six corn tortillas and a heaping pile of thinly cut beef. The beef was also slightly dry/chewy which I chalked up to the lacking of prep time with the veg. With the addition of all the acoutrmonts (to include the heavenly salsa), they made for some extraordinary bites :) Janie's pork carnitas were scrumptious but I made her scrape off the cheese sauce. By the time I tasted one the cheese had developed an odd, congealed texture which did not look particularly appetizing. The meat was very flavorful as hers had been cooked along with onion and peppers.  I also ordered a side of refried beans. They were a little salty, and heavier than I'm normally accustomed to; I ate them all none the less. For under $10 this was truly a fantastic meal... I will be back again.", "Date": "2010-11-26", "Author_Location": "Dallas, TX"}, {"Author": "sara c.", "ReviewID": "eoDcEiI9UA1ORhf50ON_JQ", "Overall": "4.0", "Content": "fantastic food: excellent guacamole, salsa, bistec, pastor.service is a little off and the place could be cleaner.i wouldn't recommend any mixed drinks but grab a mexi beer and some mini tacos!also try the fideo soup. So flavorful and unlike the texmex fideo casserole. This is an actual soup that is so tasty!", "Date": "2010-07-29", "Author_Location": "San Antonio, TX"}, {"Author": "Jonathan S.", "ReviewID": "F6RoZi2SaBg8oYnkB81HIA", "Overall": "5.0", "Content": "Great place.  Very good margaritas.  The green mole chicken is off the chain.  Salsa is quite spicy, but good.  Highly recommend as a departure from Tex-Mex crapola.", "Date": "2010-07-22", "Author_Location": "Olmos Park, TX"}, {"Author": "Wes K.", "ReviewID": "uZi8wYj69ItkLAwUYxW3fg", "Overall": "5.0", "Content": "This is one of two my favorite places in SA. I always get the chilaquiles, they are awesome. The tortilla soup is the best I have had. The salsa is really hot but I can't get enough of it, my favorite salsa. Half the time I get some to go. I miss this place living in CA now.", "Date": "2009-12-27", "Author_Location": "Waco, TX"}, {"Author": "Vol T.", "ReviewID": "4K_JpeDPut2YAcXelx-7uQ", "Overall": "4.0", "Content": "The salsa is so tasty! It's unique and stands out in a city oveflowing with salsa. I like the chips as well. I have only been to lunch, and what I've had I've really enjoyed. The fideo that comes with lunch entrees is so delicious! Citrus-y, whifch I love. Servings are quite small (I like manly portions), but it's perfect for those days you want to eat more healthy. The owner tells me they make everyhting from scratch with quality and fresh ingredients. I believe him! Because I can certainly taste it in the food. I think this place is unique, and the food as well. I take their word for it that it's shortcut to Mexico since I've never been. But I imagine it would taste like Guajillo's.", "Date": "2010-10-15", "Author_Location": "San Francisco, CA"}, {"Author": "Foug C.", "ReviewID": "Cpw87xFfJQ9mM-FVXRsesA", "Overall": "5.0", "Content": "This place is awesome, go there.", "Date": "2010-11-10", "Author_Location": "San Antonio, TX"}, {"Author": "Ronda L.", "ReviewID": "iFZdkm3S4xXGamw-tWEHLg", "Overall": "5.0", "Content": "Had the mole verde, chicken and chipotle dish, and tacos. Awesome! The \"refried\" beans aren't fried--aren't even cooked in lard--and they're amazing! The tacos are like taco cart or street tacos i've had in Mexico. The place may not look like much, but it's incredible. Probably the best authentic Mexican food I've had in San Antonio, and that's saying something.", "Date": "2011-02-25", "Author_Location": "New Braunfels, TX"}, {"Author": "Ene K.", "ReviewID": "l1AQuUJpWowOfVKhf8DY1A", "Overall": "4.0", "Content": "The Enmoladas were awesome. We're LA transplants and this place does Mexican right!!", "Date": "2011-08-14", "Author_Location": "San Antonio, TX"}, {"Author": "Ron B.", "ReviewID": "viIoU3jvVsb-jP1nYDTVQg", "Overall": "5.0", "Content": "Excellent Mexican food and not Tex Mex.  The chilaquiles with steak were great. Salsa is spicy and very good as well, I'd have to say some of the best salsa I've had.", "Date": "2012-01-28", "Author_Location": "Portsmouth, NH"}, {"Author": "Megan R.", "ReviewID": "1P3pmNqvy2Upw3uABgCCJQ", "Overall": "3.0", "Content": "I love authentic mexican street food, and this place was a little disappointing.  For starters, the person who recommended it made it seem like a San Antonio Tex-Mex joint, so my family who hates really spicy food, was a little frustrated when we sat down and everything had some unfamiliar spices they weren't willing to dive-in and try.  We were sat in a back room all by ourselves and the waitstaff didn't speak any english, which is usually a good sign for authenticity, but this was just an overall failure in communication as our orders weren't exactly what we ordered.  Meh.", "Date": "2012-02-06", "Author_Location": "Dallas, TX"}, {"Author": "Cassie H.", "ReviewID": "chsG6NrJqFKk-K7FAmuZhw", "Overall": "4.0", "Content": "The tortilla soup is delicious. Also, the Gringa tacos are pretty good, too. Tasty food for a great price!", "Date": "2011-04-25", "Author_Location": "Santa Monica, CA"}, {"Author": "Angela P.", "ReviewID": "IOT1FTX6WPwwdefAZzlMIw", "Overall": "5.0", "Content": "Seriously sublime! Everything is fresh and amazing; but the fideo is out of this world. Superior value; great service and tasty mango margarita's make this a frequent destination for me and my husband.", "Date": "2012-01-25", "Author_Location": "San Antonio, TX"}, {"Author": "William C.", "ReviewID": "b8ushtiGgfkCkTqZJWxZoQ", "Overall": "5.0", "Content": "Salsa will clear your congested sinuses! Just the way i like it. Bistec tacos are great and pollo tinga is good with a little bit of a spicy kick", "Date": "2013-07-30", "Author_Location": "San Antonio, TX"}, {"Author": "Angelica G.", "ReviewID": "Vw0ZrPYaWkJMGdRtUlZirQ", "Overall": "5.0", "Content": "Absolutely ridiculous delicious food!!", "Date": "2012-10-28", "Author_Location": "Converse, TX"}, {"Author": "Dov H.", "ReviewID": "l0G9te_bzUEAX39Zw4appw", "Overall": "4.0", "Content": "The Mole Verde was very good. Not mild, but not overly spicy either. A nice mid range of fire. The tortilla soup was a bit on the salty side.", "Date": "2010-03-21", "Author_Location": "Brooklyn, NY"}, {"Author": "Jeremy O.", "ReviewID": "zVVfWpuHVWNqaQ9-XKdFEQ", "Overall": "5.0", "Content": "Good price and great food, must try", "Date": "2011-03-09", "Author_Location": "San Antonio, TX"}, {"Author": "Kate G.", "ReviewID": "eS0z0KeiR1MtM88FDBOKYQ", "Overall": "4.0", "Content": "Came here after getting a rec from our server at Dough, and I had such a good meal! Their salsa is hands down one of the best and by far the spiciest I've ever had. I couldn't stop eating it and ended up putting it all over my food. It was a bit too hot for some at our table but that just meant more for me. It even helped spice up the guacamole we ordered, which though delicious, lacked any heat. I ordered the poblano quesadilla on homemade corn tortillas ($2.95). I groaned audibly multiple times during my meal. It was plenty spicy on its own but crazy spicy with the delicious salsa piled on top. In spite of my burning mouth, I ate every bite of fresh tortilla, melty white cheese and charred poblanos topped with some fresh-squeezed lime juice. I also ordered a side of rice and beans which were way more than I needed for one person, but the rice was sooo flavorful, I was glad I ordered them. I mixed the rice, beans and salsa together for a spicy, yummy and very messy plate. So so so good. I can't wait for a return trip and I will try the fideo soup when I'm back and hopefully the tacos. And margaritas! This is definitely authentic Mexican and not tex-mex, and that was just what I wanted.", "Date": "2012-11-19", "Author_Location": "Denver, CO"}, {"Author": "Margaux G.", "ReviewID": "o5irhnKl2t24kbe8e0lY8g", "Overall": "5.0", "Content": "We go to Guajillo's at LEAST once a week! the tostadas de picadillo, salsa, and fideo are AMAZING! Also, the waitstaff remembers what you like.", "Date": "2010-10-05", "Author_Location": "San Antonio, TX"}, {"Author": "Allix S.", "ReviewID": "cuUYom0oN_J--WyVw-jwGA", "Overall": "4.0", "Content": "In San Antonio there's a TON of Mexican food to be had.  As a northerner, I probably wouldn't be considered qualified to determine what is authentic Mexican food.  However, this place was f*cking amazing!!  My husband got the chicken with green mole, which was spectacular, and a mango margarita that was so good I wound up stealing half of it from him.  I don't remember what I ordered was called, but it was absolutely delicious and actually felt like I was eating something that was good for me! Everything was really fresh and the flavors were intense (fair warning the salsa is really hot).  It was the first time I've walked out of a Mexican restaurant not feeling like I need a good workout to balance it out!  The only reason Guajillo's isn't getting a perfect rating from me is that the service was a little spotty.", "Date": "2012-03-18", "Author_Location": "San Antonio, TX"}, {"Author": "John W.", "ReviewID": "8eC7d-eW9Z__3Kh9XBhKVg", "Overall": "5.0", "Content": "Good food, good service.  I had the  Mole Verde Con Pechuga de Pollo, which was fantastic.  My wife had the Enmoladas de Queso and that was great too.  We are looking forward to going back and trying other items on the menu.", "Date": "2012-06-16", "Author_Location": "Canyon Lake, TX"}, {"Author": "Quinlan E.", "ReviewID": "fsC69ahCMwfnYd-aXsUH9w", "Overall": "5.0", "Content": "1st night in San Antonio traveling from SF and the food was amazing.  The real lime juice margaritas and the chicken mole were incredible.  The ceviche and the pork soft taco (el pastor - 1st one on menu) was delicious too.  Love the service. Definitely going back.", "Date": "2012-06-23", "Author_Location": "Brooklyn, NY"}, {"Author": "Nancy D.", "ReviewID": "Bi46o-1kddOJ_a_LuBpGWg", "Overall": "5.0", "Content": "UPDATE: After our last return, I must hand out 5 stars, and I am stingy with my stars!  Once again service was very attentive and helpful.  At the owner's suggestion, I ordered the chicken in green mole; husband had the Mahi Mahi again (we have been feigning for it!). The sauces this place puts out are so complex and fresh they put fine dining establishments to shame.  I am not a fan of mole but this sauce was nothing like your traditional, chocolatey fare.  It was seasoned with cilantro, pepitas, green peppers, and secret goodness.  The owner also brought two soups to our table: fideo and tortilla soup with additions of cheese, roasted peppers and avocado on the side.  How do they get so much flavor in there without the usual suspects of lard, bacon, etc?!  Until next time, visions of sauce and soup will dance in my head.......", "Date": "2012-07-07", "Author_Location": "Houston, TX"}, {"Author": "Cate W.", "ReviewID": "qCioVaIrqWkjhUWMY9S8_Q", "Overall": "4.0", "Content": "Definitely a great place for mole and other treats!  It's a nice break from the usual Tex-Mex fare, with all sorts of authentic Mexican dishes.  The \"shortcut to Mexico\" is a great description...a few minutes drive gets us to a place that reminds me of the Mexico I remember (Yes, remember when it was a beautiful, safe place to travel without worry?), with food that never disappoints.", "Date": "2012-07-19", "Author_Location": "Canyon Lake, TX"}, {"Author": "Jean C.", "ReviewID": "3__NjhY7sabrTjmpR228Sg", "Overall": "5.0", "Content": "Service was amazing.  The food was VERY tasty as was the salsa.  If you are expecting the normal TEX-Mex food-do not go here.  But if you are looking for something a little different and not bland this place is great.", "Date": "2013-08-17", "Author_Location": "Waco, TX"}, {"Author": "Sarah D.", "ReviewID": "P8-KmqKZlddoVmodJ5B37w", "Overall": "1.0", "Content": "If you're not a fan of traditional mexican food (not tex mex) then you should stay away from this place. I went to meet up with a friend here, and having passed it more than once, I was excited to try it. The chips and salsa were good, but the food was not. I'm not used to traditional Mexican food, so please don't rely too much on my review. However, I thought the food was bland, tasteless, and quite possibly, the worst thing I've ever eaten. I will not be visiting here ever again.", "Date": "2012-05-26", "Author_Location": "Castle Hills, TX"}, {"Author": "Marisella P.", "ReviewID": "s3j2G0DxrR7Qv7yTQ84_5w", "Overall": "5.0", "Content": "Where do I begin.. We LOVE guajillos! Everything! The fideo, the spicy shrimp soup ( can't think of the name right now). I always order the enmoladas, as a mole lover you can't go wrong. Also, how can I forget.. Their salsa is amazing!! Tortilla soup is yum, my boyfriend always gets the tacos de alambre and they are great too. Guajillos is a must!", "Date": "2012-05-27", "Author_Location": "San Antonio, TX"}, {"Author": "Paul N.", "ReviewID": "SsYqxJvz_dZssWkTJMWbYw", "Overall": "4.0", "Content": "Omg the salsa is hot. This is the first time I ever had authentic Mexican food. the food was good but we prefer Tex Mex.", "Date": "2012-06-29", "Author_Location": "Broken Arrow, OK"}, {"Author": "Marc A.", "ReviewID": "jlsm9MedRLDCYv8slk2K5g", "Overall": "5.0", "Content": "Nothing Tex Mex about this place. I eat at Guajillo's when I am hungry for real Mexican food. The food is spicy but oh sooo good. The menu has all authentic dishes from throughout Mexico. Kuddos to the wait staff who provide excellent service. Guajillo's ranks as one of my favorite San Antonio restaurants.", "Date": "2012-07-20", "Author_Location": "San Antonio, TX"}, {"Author": "Shannon M.", "ReviewID": "4k3K_IMXpcJpKP5OqPwB7w", "Overall": "5.0", "Content": "I want to marry the fideo. So good.", "Date": "2013-06-14", "Author_Location": "San Antonio, TX"}, {"Author": "Ana P.", "ReviewID": "IGqvxi8cdzcOYvLYGwqC-g", "Overall": "5.0", "Content": "My absolute FAVORITE restaurant in all of San Antonio! Seriously. I came here after running the Rock n' Roll Marathon a few years ago, come here on birthdays, dates with my boyfriend, family lunches and dinners, most special occasions in my life are celebrated here! Here's why: BEST and most AUTHENTIC Mexican food you will ever have in your life, FRIENDLY and FAST customer service, and owners who genuinely care about and remember their customers. It's a family owned business! Favorite things on the menu are the Enmoladas (enchiladas made with queso fresco and mole sauce) **ask for them with chicken! it's not on the menu, but you can order it** and also love the Bistec Tacos w/Cheese (thinly sliced steak, topped with cheese, served on about 7 small corn tortillas, with a side of cilantro and onions that you can add to your tacos as you eat). Their SALSA is the BEST in all of San Antonio--SPICY, just how I like it! LOVE THIS PLACE.", "Date": "2013-03-03", "Author_Location": "San Antonio, TX"}, {"Author": "Patty C.", "ReviewID": "TSDoO7lzc1M9z-h49dc5eg", "Overall": "5.0", "Content": "Hands down one of  the best authentic Mexican food restaurants in the city!   I love Guajillos because there is nothing like it anywhere in the city. Too much of San Antonio caters to the traditional \"Tex-Mex\" styles of enchiladas, fajitas, chalupas..etc. Guajillos gives you something different and truer to the tastes of central Mexico.  Their salsa is unlike any other.  Its tangy and hot not overrun with tomato sauce like most salsas.  They have great lunch specials that come with your choice of soup tortilla or fideo and a entree for a very fair price.  I personally have had everything on the menu and no one this has disappointed.  My favorite and what draws me back is their tortilla soup.  It is an absolute favorite. It has no bells and whistles but is absolutely mouthwatering.  Its just broth, tortilla chip strips, and cheese. Very unique compared to what you get everywhere else that serves it anywhere.  The alambre tacos are also very very good just sprinkle a little of their hot suace and they are perfection.  My second favorite it the cochinita pibil which is spicy tender stewed pork dish.  Warning its a little on the spicy side if you do order it.  For dessert they have one of the best tres leches cakes I've ever had.    They are family operated and really nice group of people.  Have always offered opinions on what to try next. Overall I highly recommend a visit if you want something off the tradional \"Tex-Mex\" blah you find too often here in San Antonio. Really good Mexican food at a family owned establishment.", "Date": "2011-10-06", "Author_Location": "San Antonio, TX"}, {"Author": "Sandra L.", "ReviewID": "lPQhFEcOHGLeUYsu3dJM3Q", "Overall": "2.0", "Content": "Food is good, not great.  The price you pay for so little food is almost insulting.", "Date": "2013-01-14", "Author_Location": "Los Angeles, CA"}, {"Author": "Dave B.", "ReviewID": "2cdTn9Z5fXil6VnAKLgMVA", "Overall": "5.0", "Content": "Yesterday on a whim my Wife and I left the house on a mission to \"eat at a place we have never been to\".  After a frustrating drive around town we finally came accross Guajillo's \"The Shortcut to Mexico\".  Immediately upon entering we were welcomed by our waitress with an entire breakdown of the menu, including recommendations... each one of which sounded more and more delicious.  Next thing we know we were greeted by the Owner of Guajillo's who graciously took the time to detail the background of his recipes, his ingredients, and made suggestions which we did not hesitate to take.  I ordered the Mole Poblano (Chicken Breast with Real Poblano Mole Sauce and Roasted Sesame) and my Wife ordered the Tinga de Pollo con Tostadas (Shredded chicken, onions, and chipotle sauce).  AMAZING.  The Mole Poblano sauce is one of the most different and DELICIOUS sauces I have ever had, it's complex yet smooth.  I highly recommend.  My Wife's meal was just as delicious and authentic - we swapped plates several times!  Big thank you goes out to everyone at Guajillo's!  WE CAN'T WAIT TO GO BACK!!!", "Date": "2013-07-03", "Author_Location": "San Antonio, TX"}, {"Author": "Chris D.", "ReviewID": "rtgAuyxxiMhVPRtaJ0TCcA", "Overall": "1.0", "Content": "My lady and I dined here this past Sunday night (9-5-2010).  She ordered tortilla soup, which was delicious.  I ordered the poblano pepper and shrimp soup, which smelled HORRIBLY unfresh.  I took one bite, and could not eat it.  I asked if they could take it back to the kitchen and give me the tortilla soup instead.  The waiter told me the manager would not refund me for the $3.50 soup I had ordered, but he would be happy to give me anything else I wanted.  Our alambre tacos were very good, and the tortilla soup was great, but the whole issue with the other soup and the management's unwillingness to refund me for a measly three and a half bucks left a bad taste in my mouth.  It's too bad because this place came highly recommended by a friend who lived in San Antonio.  We don't live in San Antonio, we were only here for vacation.  Needless to say, when we come back, this place will definitely not be on our list of places to visit.", "Date": "2010-09-08", "Author_Location": "Houston, TX"}, {"Author": "Scott A.", "ReviewID": "nUSY24uin-IXs7c1_6Jpjg", "Overall": "4.0", "Content": "First time visiting Guajillos; overall good experience.  Food was definitely  not typical San Antonio Tex Mex.  If you like Taco Cabana (and you shouldn't) you will probably not enjoy this food. $5.95 lunch special includes tortilla soup or fideo. DRINK NOT INCLUDED.  I bold this because the coke i ordered was around $2.00. I had the tortilla soup; good, but not the best i have had.  My colleague had the fideo and she loved it. Main course was CHILAQUILES CON CARNE ASADA and it was great! I would definitely recommend trying this plate.  The only negative I have is the tortillas, they are not homemade, the waitress said they are factory made.  A place that advertises as \"a shortcut to mexico\" should have fresh tortillas. Aside from the tortillas, a great place, it will definitely get more of my money.", "Date": "2010-09-28", "Author_Location": "San Antonio, TX"}, {"Author": "Don V.", "ReviewID": "Z-qRmrZ1kKilKDcwLeY0mA", "Overall": "3.0", "Content": "I was impressed I usually don't like authentic Mexican but this wasn't bad. Would I go back probably not. Salsa was really good but hot the way I like it and the menu didn't have Burritos etc. I wish that they would add a mild salsa also for some people because I noticed a lot of people stay away from the salsa.", "Date": "2012-08-07", "Author_Location": "Roscoe, IL"}, {"Author": "Mark B.", "ReviewID": "C_TSTIZkjJoD6mpCIN7_zw", "Overall": "5.0", "Content": "Guajillo's is one of the best Mexican(not Tex-Mex) restaurants in San Antonio.   The tortilla soup is excellent.  The Mexican style tacos (bistec, al pastor etc.)are also very good.", "Date": "2011-08-07", "Author_Location": "San Antonio, TX"}, {"Author": "Carlos G.", "ReviewID": "ezFXE7EYy4KQWwp5Fqs3HQ", "Overall": "5.0", "Content": "Go there for lunch. They have good lunch specials and they are quick at getting your food out in time. It may look busy but don't let that discourage you. Oh and try their fideo!!!!", "Date": "2012-04-13", "Author_Location": "San Antonio, TX"}, {"Author": "Bruce J.", "ReviewID": "oWAimn9XmDH7sCWEjX30-A", "Overall": "2.0", "Content": "When we sat down i got the manditory chips and salsa and the salsa was really good.  So I figured at this point the food was going to be special... well not so much.  The fiedo soup led me to believe that there are a bunch of yellow boxes in the kitchen to be opened.  The tortilla soup was ok but it was all soup and not much else.  When the food arrived I was ready for a diffrent kind of mexican food and It was diffrent.  I have been to many taco restraunts in SA and I have never had mexican rice like this.  This rice could only be matched by Rice-A-Roni.  The meat was ok and the corn tortillas were above average.  I can now see how the lunch special was $6.95.  When they call it a shortcut to Mexico I had no idea that the shortcut was store bought prepared products rather than fresh made product.  Concept is good, price is ok but we want homemade not shortcuts.  Thats the last time I take a New Yorker's opinion about whats good in Texas.... Get a rope or get fresh", "Date": "2012-05-21", "Author_Location": "San Antonio, TX"}], "RestaurantInfo": {"RestaurantID": "5lOlKG8RwubHJmsL_4stIQ", "Name": "Guajillo’s The Shortcut to Mexico", "Price": "$", "RestaurantURL": "/biz/guajillos-the-shortcut-to-mexico-san-antonio", "Longitude": " -98.50698300000000", "Address": "1001 NW Loop 410San Antonio, TX 78213", "Latitude": " 29.521187999999999", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/6AiGfP_0jUJrHWYalTG7Hg/90s.jpg"}}