{"Reviews": [{"Author": "Cynthia L.", "ReviewID": "BNiFDyGLCU1QJ9tm0c6fGg", "Overall": "4.0", "Content": "Summary: Good food, do not bring a first date hereThis review is long overdue. I've been going to this place for years. Kim Tar is a hole in the wall Chinese restaurant with some damn good noodles and BBQ. Not expensive, good portions. Good if you just want a warm decent meal.++ Roasted duck with egg noodles++ House chow fun (I like to add a little black pepper and Sriracha for a kick)+/- There's free parking, but it can get crowded during rushes.Conclusion: Try it. If you don't like the decor, get to-go.", "Date": "2014-07-10", "Author_Location": "San Jose, CA"}, {"Author": "jason t.", "ReviewID": "6hJ4LS08OslqO-1DZHPAYg", "Overall": "4.0", "Content": "I live right around the corner of this place, eat here at least once a week.Steam chicken is Delicious with zinger .Service is fast , especially to go", "Date": "2014-06-18", "Author_Location": "Milpitas, CA"}, {"Author": "Andy D.", "ReviewID": "dDfX2z0heabIU5YTxS1hGw", "Overall": "4.0", "Content": "A friend asked me to come here for duck mien which I never had before so I said sure, let's try it out.She's a regular at this place and says it's quite decent. It's a traditional Chinese BBQ shop but they do serve other popular Chinese restaurant style dishes as well such as fresh seafood.We had the noodles served dried and it came with the broth on the side. The portion was just right and they weren't cheap on the meat. All in all I was quite satisfied, I was filled and the food was pretty good. I'll probably come back and try out their other dishes next time, definitely a good choice.", "Date": "2014-06-13", "Author_Location": "Sunnyvale, CA"}, {"Author": "Jordan D.", "ReviewID": "W4PTKCjUGejxIFQls1ODIQ", "Overall": "4.0", "Content": "been here quite a few times The food is good, they may not look like waiters, but the service is good. This time I ordered from the phone and the service is fast. Even though the food looks greasy, I would recommend this place.", "Date": "2014-07-12", "Author_Location": "Penngrove, CA"}, {"Author": "Michelle M.", "ReviewID": "YVe6VdrsPjku3MHWR6sLDA", "Overall": "3.0", "Content": "Chow fun is good. Also like their fish with black bean. Their Mongolian beef lacked the spicy flavor and pepper, it was just meat like the beef that comes in beef with broccoli and lots of green onions. Didn't see any peppers. My fiancé likes their fried rice but to me it's just ok. To go food is fast though. Fresh meat like duck and pork usually hanging in the window. The inside isn't nice though so we always order to go.", "Date": "2014-07-06", "Author_Location": "San Jose, CA"}, {"Author": "Long N.", "ReviewID": "5N78uQ-yR1yNR0MwvBs_Wg", "Overall": "3.0", "Content": "The portions are big. What I see most ppl do is eat the meat and veggies, but leave the rice as the leftovers. Also, free soup if you order the rice plate.", "Date": "2014-04-08", "Author_Location": "San Jose, CA"}, {"Author": "Stephanie B.", "ReviewID": "vqHs6eubnzqXVnXaSwA2VQ", "Overall": "4.0", "Content": "The best place in North San Jose to get asian style bbq pork/duck. And I'm not talking about a sweet, caramel bbq... I'm talking about that asian style crispy, cracked skin bbq. Nommy.Their soup dishes are also worth trying, but everything else is questionable. Stick with their specialties.Oh, and the service is lackluster. Expect a mild communication barrier if you do not speak chinese/vietnamese. Also, you will not get a bill brough to your table. You must go to the cashier at the end of your meal :) So the horrendous parking lot with crazy asian drivers + mediocre service could be enough to deter you from trying this place, but it all comes down to how much you like your poultry and crispy skin :D", "Date": "2014-03-19", "Author_Location": "San Jose, CA"}, {"Author": "Jimmy K.", "ReviewID": "aAnw2FDOSxJhV04U890sgA", "Overall": "3.0", "Content": "I would have given this place 4 stars for the taste but have to deduct a star due to the fact that the place is not very clean.", "Date": "2014-05-24", "Author_Location": "San Jose, CA"}, {"Author": "Philip H.", "ReviewID": "atL4FNzy9bLUeQehTMUU0A", "Overall": "5.0", "Content": "The best fried pork chop in town. Hands down!! I grew up in this area and have been coming here for over 14 years. I just visited again today and one thing I realized is the workers remain the same. They may look like mean, stuck up old guys but they are actually friendly when you start joking with them. Lol, good ol'guys! So the food...  Their fried pork still can't be beaten...  Fried, crispy pork chop glazed with MSG(yes you ca see the msg on it), combine it with the sweet and spicy sauce and their chili sauce win my heart anytime anyday. Their chili sauce is so good. 2 or 3 of my friends can finish the whole container and we sometimes stole our neighbor's chili. Many of their dishes are also good but i usually just get the pork chop and seafood chow fun(both gravy and dried) I bring different people to eat here and it never disappoints. Keep it up guys!WARNING: Sore throat and cough may occur after eating the porkchops. Make sure to drink plenty of water and hot tea.", "Date": "2013-12-18", "Author_Location": "Fremont, CA"}, {"Author": "Joshua M.", "ReviewID": "bt3HcGs1otSmmtZl87SPJQ", "Overall": "5.0", "Content": "Been there many times. Food and service are always great. Always be coming back.", "Date": "2014-06-13", "Author_Location": "San Jose, CA"}, {"Author": "Jessica C.", "ReviewID": "o0--7u-TvvA41i0g-gYPsA", "Overall": "5.0", "Content": "Birthday dinner here every year. :) This restaurant has been here for at least twenty years and still gets tons of business! Open late for anyone who wants real food for late night munchies. Everything on the menu is delicious, but try to stay away from any dishes or soups made with fish. Favorite item on menu: Hot and Sour Shrimp Soup", "Date": "2013-10-15", "Author_Location": "San Jose, CA"}, {"Author": "Brittany D.", "ReviewID": "jXgE-jZJ16f7GqJqwC2brg", "Overall": "4.0", "Content": "My family loves to come here when we crave Chinese food. It's close to our house & we always take food to go. And it never seems to disappoint. I love their vegetable chop suey & the fried chicken. The food stays warm by the time we bring it home & even tastes good the next day, granted it's been refrigerated. Their service is quick. Their menu offers a lot of different kinds of food from pork to vegetarian dishes. It is cash only so make sure you have some on you if you decide to stay & pay for your meal. This is me & my family's go to Chinese restaurants bc the food tastes good & fresh, prices are decent & food is prepared quickly.", "Date": "2013-11-30", "Author_Location": "San Francisco, CA"}, {"Author": "Gabriella T.", "ReviewID": "HR5xg4f9iDVQ0cY0LWn0fQ", "Overall": "3.0", "Content": "Good place to eat if you want big portions for a reasonable price. Decent and authentic Chinese food. Only bad thing- it's cash only.", "Date": "2014-04-18", "Author_Location": "Mission Valley, San Diego, CA"}, {"Author": "christy l.", "ReviewID": "JygV1kxHkqDJp5l7nXT4QA", "Overall": "2.0", "Content": "In the past, I've bought a roasted duck and BBQ pork here to go (which were good), but today was the first time I ate in the restaurant with the parents and kids.  My mom said she used to love coming here for noodle soup.  I think the cook might have changed because the parents were totally unsatisfied with their soups (a #1 and a #2).  They said the kidneys were missing and overall there wasn't much flavor.   I got the beef chow fun, which was decent.  My son wanted the fried chicken over rice... Chicken was mainly breast meat and dry.  We also got the taro egg rolls, which was good, and fried fish cake, which weren't so good.  (The fish cakes had consistency of a fluffy light fish ball, not what we were expecting.). I would give 3 stars for the roasted/BBQ items up  in the front, but the noodle soup and fried fish balls left more to be desired.Probably won't chose to eat here again.  This is a cash only place.  They do have an ATM near the restrooms.", "Date": "2013-10-27", "Author_Location": "San Jose, CA"}, {"Author": "Helen L.", "ReviewID": "Csoz4zRcqRX1REWmxpXAHA", "Overall": "3.0", "Content": "Their roast duck and bbq pork are good too.  Other are okay.  However it is a good place for lunch and the price is reasonable too.", "Date": "2014-02-08", "Author_Location": "Fremont, CA"}, {"Author": "Donovan T.", "ReviewID": "shRFizBW663Y25tf9jhDdg", "Overall": "4.0", "Content": "Solid place for a meal!  From the outside, its your typical Chinese BBQ joint with the roasted pigs, ducks, and chickens in the front window.  However, when you enter you see that it is also a sit down restaurant with a very extensive menu.Most entrees run around $8-$12 and they are VERY generous with portion sizes.  I went with 4 people and ordered 4 entrees and was left with plenty of leftovers for the next day! Pretty good deal I should say!The rice plates have a ton of meat and rice on them and they also range about around $8-$10.  They do have noodle soups as well but I didn't try them out. Probably better for a cold day!Service and decor is nothing to write home about either! Annoying thing is that it's CASH ONLY so just be sure to have a $20 bill or two handy! Overall I liked Kim Tar. Def. check it out if you are in the area!", "Date": "2013-07-08", "Author_Location": "San Jose, CA"}, {"Author": "Josh S.", "ReviewID": "3Ji0e1ET7VGYOvDe7iaPuQ", "Overall": "5.0", "Content": "Im currently eating here as I write this.I got the most stereotypical asian restaurant greeting when I got in. Like, no smile, no hi, no form of happiness whatsoever lol. My \"waiter\" literally looked at me, said \"one?\", pointed at a table, then dropped the menu on the table before walking away. But since I automatically lower my standards for service in asian restaurants, I did not let this affect the yelp score. In fact, its almost part of the experience at a lot of asian places.Now on to the food. Fried pork over rice. $7.99 and omg this was so motherfucking good. I bit in and it fucking exploaded in awesome. The batter or whatever the they dipped it in was perfectly crunchy with a hint of sweet while the inside was just the juicyness u expect from well cooked meat. It was like they put so much love and happiness into their cooking that they had no more left for their service. Lol.Therefore 5 stars. Plus open until midnight so extra win.", "Date": "2013-04-04", "Author_Location": "Vallejo, CA"}, {"Author": "Tee K.", "ReviewID": "xjQDFBB-p_5CRbl6AyZxFA", "Overall": "1.0", "Content": "Bad.  All their noodles soup dish so bland, no flavor...like eating broth water.  Other dish not good.  It don't seem like the food was put together well.  Seasoning nadda,  noodles always overcook.   Other fry items over fry. Wtf.   Seriously this is a messy job of cooking. Their bbq items, go over to the area n u see what I mean.  It's so messy! I wonder how old those ducks n other bbq items r. Jeez,n please please don't order their vietnamese items OMG it's nowhere like vietnamese food. Service,  I dunno typical hole in the wall Asian styles.   I seriously want to bring a horn or a bell so I can actually be heard to get service.  For the price they charge at least have eatable food!", "Date": "2013-11-12", "Author_Location": "Milpitas, CA"}, {"Author": "Wilfred A.", "ReviewID": "S1-uSkCvNAQMxKqlK-9Czw", "Overall": "5.0", "Content": "Very good food.Amazing service.Reasonable price.My favorite:Roasted pork and RicePork chop and rice", "Date": "2013-09-29", "Author_Location": "Campbell, CA"}, {"Author": "Christine N.", "ReviewID": "K4Svb8o0TAwL9ohtzSy0XA", "Overall": "4.0", "Content": "Total diamond in the rough. I love going to outdated Chinese restaurants with tasty BBQ and noodles. Me and my mom walked in here because there was a line out the door during weekday lunch, that always means good food. We shared the roasted duck over yellow noodles and seafood fried vermicelli noodles. Both were delish and came out quickly. The fried pork chops and fried squid looked popular among the other tables, which I really want to try. Sure, some of the little sauce dishes were dirty, but whatever, I expect that at Asian restaurants. Come here for the food, not the decor, cleanliness, or service. No frills means the price of food can stay affordable.", "Date": "2013-04-12", "Author_Location": "Campbell, CA"}, {"Author": "Vivian H.", "ReviewID": "j7R1xMijdIwJDlylzxn4Tw", "Overall": "3.0", "Content": "my coworkers would order from here for dinner when tax season was killing all of our time and make me pick up the food with my horrible viet/canto. My parents would make me come here too, so they recognize me sometimes ....and make fun of me.I'm not a big fan of this place just because i've eaten a lot of places like this in my super asian parenting childhood... Their house noodle soups are pretty good -- fam and i usually get the pork intestine/kidney or the reg rice stick. Beef chow fun is always a childhood fav for my brother and me. but i do love their crispy pork intestines and their yummy roasted duck. I recommend the soups and duck because my mom told me thats what they're pretty much known for. their take out for lunch/dinner is mediocre and their rice is kinda bleh. parking should be easy enough, but around lunch it gets a bit crowded.cash only", "Date": "2012-11-26", "Author_Location": "Los Gatos, CA"}, {"Author": "Francesca L.", "ReviewID": "FX2y5EmgvmY_-rKYdeuvhw", "Overall": "4.0", "Content": "DEEP FRIED PORK CHOPS = DELICIOUS. Not very healthy for you though.The shrimp chow mein is good too.  It comes with a bunch of plump shrimps and many vegetables as well.When I order the deep fried pork chops and the shrimp chow mein to-go...the total bill is $20 flat and the order is ready in 10 minutes.  The portions here aren't tiny either.  Good place to get tasty Chinese food for cheap!  Just make sure you bring cash!!", "Date": "2012-11-30", "Author_Location": "San Mateo, CA"}, {"Author": "Benny N.", "ReviewID": "7MGAUvL0WuSn2zBV2pUd7g", "Overall": "4.0", "Content": "Pretty decent Chinese food, and they open LATE!!! I find myself here more than I care to admit. I order off menu a lot, and they just go with the flow. No fancy decor. Cash only.But the food is tasty, and comes out FAST!", "Date": "2013-03-23", "Author_Location": "Dublin, CA"}, {"Author": "Wendy T.", "ReviewID": "qQr47g0QU3a_4aKNPaOvXg", "Overall": "3.0", "Content": "From the window, you wouldn't be able to tell it's a restaurant - it looks like a butcher shop with greasy red ducks hanging by their feet and men with cleavers. Enter from the side!I'm always up to try more Trieu Chau style food, which is the BEST style of Chinese food. My dad loves the House Special Chow Fun (Trieu Chau style, the best style of chow fun), so that's what I had too. The noodles were flat and soft with nice texture, but you will need some red vinegar and soy sauce would fix the mediocrity of flavor that I am not used to for Trieu Chau chow fun.We also ordered roast duck, but it tasted a little funny, nothing to write home about. If you gotta have your jasmine tea, you're going to be disappointed that they didn't try to refill the teapot.", "Date": "2013-03-18", "Author_Location": "San Jose, CA"}, {"Author": "Diana M.", "ReviewID": "HfC8FG0kKFd4qta0Uh4ftw", "Overall": "3.0", "Content": "We nicknamed this place 12 o'clock cuz it opens that late. Typical Chinese restaurant that you'd find in the sunset district of SF.  My favorite items on the menu are:#1 soup.....with the request of soup on the sideOngchoy Salt n pepper pork ribsHonestly, you can't complain about this place.  Service is fast.  The food is decent and of lots of choices.  And, it's cheap!!", "Date": "2013-02-20", "Author_Location": "Dublin, CA"}, {"Author": "Matt V.", "ReviewID": "Q-1Ww94eKeiQpyepHh7gEw", "Overall": "3.0", "Content": "It does the trick if you're looking for a quick fix.  Nothing amazing, nothing bad.  I will say though that I am a fan of the BBQ pork.  That giant roasted piggy in the window?  Yeah.  That's mah sh!t.Cash only.", "Date": "2012-12-15", "Author_Location": "Milpitas, CA"}, {"Author": "Dorothy N.", "ReviewID": "LEH3HEgcKrsgkR8PueC2Qg", "Overall": "3.0", "Content": "Average to below average Chinese food, but pretty cheap. Lunch for eight people came out to under $70. Com ga hai nam (boiled chicken with chicken flavored rice) is my fave. However, I prefer Boda because there's more variety and the food's better (slightly).", "Date": "2013-01-06", "Author_Location": "Milpitas, CA"}, {"Author": "Anna K.", "ReviewID": "8dPiNY-QWPBUrIk9Gal1vw", "Overall": "3.0", "Content": "My husband decided he wanted soup for lunch after church and visiting with his dad. I've never had soup at Kim Tar before so this was a first for me. The restaurant was busy and full of people. Most of the tables were occupied. We were seated immediately with menus in hand and tea on the table.We look over the menu and decide what we wanted within 5 minutes. My husband did the ordering (but of course! =P)- House Small Yellow Noodle Soup- House Rice Stick Soup- Lean Pork & Preserved Egg Porridge- Half order of roast duckThe soups were flavorful and HOT in temperature the way we like it. Well the kids didn't like it hot but they managed OK with their porridge. The roast duck was yummy. Not as greasy as other places we've been to. The service was OK not bad but food was good and prices were reasonable. They're pretty generous with their portions. I'd come back again. I'd also recommend the seafood chow fun. It's YUMMY and with sriracha it's even BETTER. My mom use to order it all the time when we lived in the area.", "Date": "2009-06-02", "Author_Location": "Milpitas, CA"}, {"Author": "Lien T.", "ReviewID": "c39II6LwDsVDT4_2vSBaHA", "Overall": "4.0", "Content": "Small casual restaurant that serves authentic Chinese food. Their roasted duck, salt and peppered fish, and barbecued pork are my favorites. The roasted duck is always perfectly roasted, resulting in crispy skin and juicy meat. I think it's freshly made everyday too. The salt and peppered fish is nice and salty. It's perfectly battered and goes very well with rice. The barbecued pork is always super flavorful. They also have a good variety of combination lunch plates that are all very tasty, fulfilling, and inexpensive. The waiters are all friendly and quick on their feet. They are open fairly late too. I like that I can come here for a quick lunch or for a very casual family-style dinner. Unfortunately, it's cash only here so don't forget to bring the green.", "Date": "2010-12-08", "Author_Location": "San Jose, CA"}, {"Author": "Vera L.", "ReviewID": "YY1KIsVwXz3dlg2osl5SXg", "Overall": "4.0", "Content": "I usually get the roast duck and bbq pork which is always excellent. My group also ordered beef with vegetables thst was good as well. The eggplant with pork was just ok and not to the level of the other dishes. Soups are another thing they do well. Service is very friendly and prompt. Parking is usually crowded so you might walk a little farther.", "Date": "2014-04-09", "Author_Location": "San Mateo, CA"}, {"Author": "Walter P.", "ReviewID": "R2XK82l6yYURCZXjFKtiLA", "Overall": "3.0", "Content": "This has become the go to place for cheap Chinese BBQ lunch plates.    RJR and I have lunch here quite often.  Its probably the best lunch place inside the Ranch 99 plaza.   Directly next to Golidlocks, this cash only restaurant is good for:BBQ....- Pork (Lechon style)- Duck (if you're not ready to get a whole duck at Ranch 99 you can order smaller portions here)- Chicken- Spare RibsPlates range from $5.99-$7.99.   Remember cash only.   Ambiance:  Mom and PopsNot ideal for romantic dinners in case you're wondering.  Perfect for cheap lunch!   Afterwards you can get a halo halo dessert next door !", "Date": "2008-06-05", "Author_Location": "Honolulu, HI"}, {"Author": "Huy N.", "ReviewID": "qC88gSDh_EWaemf9wSPUcg", "Overall": "4.0", "Content": "To be fair this is just a 3 or 3.5 star place, but their Chinese Translation Jukebox gave them an extra star.We heard these Chinese versions of American songs during dinner:\"All Out of Love\" by Air Supply\"Right Here Waiting for You\" by Richard Marx\"Careless Whispers\" by WhamThe rice dishes are huge.  The noodles are pretty bland and not worth remembering.  My two favorites here are the deep fried pork chops with salt and the deep fried pork intestines.Really, those fried pork chops are crunchier than hell and QUITE tasty.  Their deli is pretty good.  Good xa xiu (BBQ Pork), Roast Pork and Roast Duck.BTW, go to the bathroom before you come here.  Or hold it until you get home.  Just don't go in the bathroom.  You've been warned.", "Date": "2007-07-11", "Author_Location": "Santa Clara, CA"}, {"Author": "Kim N.", "ReviewID": "2tEfpbJp5vYKHsSMkNLljg", "Overall": "4.0", "Content": "I actually really like this place and realized I had eaten here years ago when one of my co-workers took me back then. Doesn't look like the place has changed much and I think the guys who work there are still the same too. The time to go here is lunch. Everything is fresh and the chefs are in full gear. Although they're open late I've never been for dinner or late hours and can't vouch for the quality then. Good for a quick meal, they specialize in Chiu Chow (or Chaozhou depending on dialect) /Vietnamese cuisine. Roast Pork, Duck, Chiu Chow Beef Stew, Satay Beef & Egg Noodle Soup are among some of my favorites. A friend told me to try the Singapore noodles which he highly recommends.Not much in the area of ambiance, and the customers are a mix of local business people and laborers. In the vast oasis of Asian cuisine in the 1 mile radius here, I think Kim Tar definitely stands out as flavors go.", "Date": "2006-10-13", "Author_Location": "Mountain View, CA"}, {"Author": "Ron Jeremy R.", "ReviewID": "eurv43pu4-rAndUdI7r4XQ", "Overall": "3.0", "Content": "==============RJR - ISSUE #30==============Sometimes, after work when I want a quick fix that is not a fast food hamburger joint combo - - I'll stop by this place on Hosteter Road for some quick cheap eats.Walter P. and I came across this place a while back - and we've had few deep conversations about the struggles of our lives at this place.   And since then, from time to time, I'll stop on by my own for one of their rice plates which is usually either:~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\"Roast Pork & Roast Duck over rice\"\"BBQ Pork, Roast Pork & Roast Duck over rice:~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*TAKE NOTE*- Don't expect kick ass Chinese gourmet food that will rock your world.- Don't expect a dinner setting that will impress - where you take a hot first date to - because it is so not such a scene.  More than likely, she'll roast you're ass like the duck hanging on the wall if you do. It is what it is, a hole in the wall with good food that will do when you want it quick & cheap.", "Date": "2007-09-29", "Author_Location": "Cupertino, CA"}, {"Author": "Randy T.", "ReviewID": "Nb82fRS-Ub0UV7ZSX-lE0Q", "Overall": "1.0", "Content": "Perhaps you're sitting there eating some of their pork ribs and can't quite figure out what that unique component is in their glaze. It's not something I've ever had before. Is it something they import to incorporate in that glaze? Well I've found the secret answer. It's that ever-popular mist of GLASS CLEANER! That's right, GLASS CLEANER! I discovered upon this secret component as I was waiting for my to-go order of fried rice. One of the workers was cleaning the front panel of the duck case with glass cleaner, while still leaving the tray of pork ribs in the case as he was doing it. Mind you, he took the appropriate caution of shielding the tray with a handful of paper towels in his other hand as he was spraying down the front panel. BUT he was spraying the panel down with such vigor, I don't believe his undoubtedly quick reflexes would have caught each droplet of glass cleaner.  One would think of actually taking that tray of pork ribs from out of the case to prevent any of this. Not Kim Tar though. They say that glass cleaner provides the extra component that customers come back for. Hmm, not this customer.", "Date": "2008-03-16", "Author_Location": "San Jose, CA"}, {"Author": "Sally T.", "ReviewID": "-hNPrPtCBKKnXQORjOHPaw", "Overall": "1.0", "Content": "I ordered to go.  Cuz the last time I ate in, everything felt sticky.  I ordered a bbq pork fried price and a plain jook/porridge to go.  I would've went to Cafe 97 yelp.com/biz/EeshTsZZXkM… in the plaza across the street, but I was craving a watermelon boba drink at 11pm at night... and the Hello Dessert next door was open.  Given the choice tho, I wouldn't have come here.  Cafe 97 food is better and cheaper by the way.So with my wallet robbed by a $4 boba drink, $6.75 fried rice, and $3 plain jook, I go home to finally have my late dinner.  I miss SF.  I miss cheap SF food.  I even miss SF Chinatown... I never thought that I'd say that.  My fried rice - crunchy bits?  What the hell is crunchy in fried rice?  I took a piece out of my mouth... well of course... Egg shells!  Can't have fried rice without eggs now.  And it wasn't like just one bite, I must've scored and got the ENTIRE egg shell in my batch of fried rice.  Sweet.  I guess they don't watch Ray Cha Ray and crack the egg first in a separate bowl.  Nope! They just throw the whole egg into the pan with their EVOO - Eggroll'd Very Old Oil. And the jook?  When I ordered plain, I didn't know it was gonna be that plain.  There was like absolutely no seasoning in it at all.  Like zero salt.  It was just straight rice and water topped off with a bit of chopped scallions.  I actually wished for some MSG.  Instead I dumped like a bottle of soy in there to make it not taste like I was eating glue.  Man, this plaza is filled with some crappy, dirty mofo Chinese restaurants making us Chinese ppl look bad.  This is not representative of my mother-land, people!Well, at least this place isn't as nasty as ASJ yelp.com/biz/GfuVZvOJ0Hx… which takes the prize at this plaza.  And Grand Palace yelp.com/biz/Kut2NIX0caG… is at least cleaner.", "Date": "2007-10-16", "Author_Location": "San Francisco, CA"}, {"Author": "Linda N.", "ReviewID": "2bKcrx1_xehcysHKqn-LsA", "Overall": "5.0", "Content": "Always a good spot for some awesome Chinese food. This place is open pretty late which I love because I have a bad habit of eating late. It's not a fancy place but very consistent and I've never seen it empty. The clams sauteed in the black bean sauce is a definite must. The battered salt and pepper fish was delicious, very moist fish on the inside with a crispy warm batter on the outside. The yellow chicken curry with potatoes wasn't my favorite, probably will pass on that next time. Very decent prices as well.", "Date": "2012-12-16", "Author_Location": "San Jose, CA"}, {"Author": "John-Michael C.", "ReviewID": "4G8L5ftyYWIFeKLXJj_mYw", "Overall": "3.0", "Content": "BBQ everything!!Oddly I came her at my friends insistence that their noodles are something to check out. After checking out their menu I was some what at a loss when trying to decide between one of the pan fried noodles and the crispy noodle. I was unsure as to the difference and thought to be adventurous and try something new. After trying the crispy noodle I have come to the conclusion that I have to try out their pan fried noodle because I believe that they just be the same thing but I'm hazarding a guess that it's in the actual noodles themselves that are the difference. Otherwise the place is known for the bbq animal which I'm inclined to try the next time i'm there. While I waited for them to figure that my order had nothing to do with bbq meat or poultry I was passed by customer after customer asking for bbq this or bbq that. Though my rating is based solely on what I ate I thought to myself that I should try their specialty next time. And not to forget to bring cash because it's cash only. ;D", "Date": "2009-12-30", "Author_Location": "Santa Clara, CA"}, {"Author": "Vicky H.", "ReviewID": "Nhvg8B8Uh3jWu6sNxEjiWw", "Overall": "4.0", "Content": "Cash Only!remember to bring some if you decide to go here.This place is pretty good! I love their food and choices they have here. It kind of reminds me of grandma's home cooking. :)It is kinda small and the presentation in the restaurant isn't so pretty, but its comfort food from hong kong. !", "Date": "2010-04-05", "Author_Location": "Milpitas, CA"}, {"Author": "Nguyen L.", "ReviewID": "LLNcZFZlDihjtBT4pRLaQw", "Overall": "3.0", "Content": "This is my second go the places with my buddies at work. We have the usual round table in the back and the guys here always knows what we want. I usual rotate from the #2 noodle which is the thick rice stick noodles with fish balls, chicken and pork. Then there is the Fried pork chops over rice. The pork chops are crispy and good but there are a lot of fat on some of the pieces. Then there's the Beef Steak over rice. Very tasty. We used to get it over fried rice but found out that they were charging us $1.50 extra we we stopped. It wasn't really fried rice, just rice stir fried with sweet soy sauce to give it a brown color. All of the rice dishes come but a side of soup so that's a plus.This place is cash only so stop by the ATM before.", "Date": "2012-02-02", "Author_Location": "Mountain View, CA"}, {"Author": "Vera L.", "ReviewID": "YY1KIsVwXz3dlg2osl5SXg", "Overall": "4.0", "Content": "I usually get the roast duck and bbq pork which is always excellent. My group also ordered beef with vegetables thst was good as well. The eggplant with pork was just ok and not to the level of the other dishes. Soups are another thing they do well. Service is very friendly and prompt. Parking is usually crowded so you might walk a little farther.", "Date": "2014-04-09", "Author_Location": "San Mateo, CA"}, {"Author": "Irish P.", "ReviewID": "iISpyG85dTfue_TsgGft0w", "Overall": "5.0", "Content": "Our waiter greeted us with a smile and it was funny because we're lightweight regulars that come to Kim Tar and he's like, \"Fried rice and chow mein with extra sauce, right?\" We laughed at that. It was pretty funny.We also ordered the walnut shrimp... it was sooooooooooooooooo good! Try it, Yelpers!I bumped my rating up one star because of the friendly waiter and the shrimp! Nom nom nom.", "Date": "2010-10-17", "Author_Location": "San Jose, CA"}, {"Author": "Sonnia K.", "ReviewID": "ibm8uOYVzgLhVkJPGGc2NA", "Overall": "4.0", "Content": "Another cash only place and luckily I had cash when I went. This was quite a hole-in-the-wall place. I ordered their Combo BBQ Pork and Roasted Duck over Fried Rice and it was delicious. I'm probably not going to be a fan of the Roasted Duck because there were more bones than meat. I did love their BBQ Pork and the pickled cabbage that went with it.The place was packed with the lunch rush. It was full. I wouldn't eat in here though because it's too small and cramped. I just don't tolerate fire hazard incidents. Anyway, taking food to-go was not prohibited. I happily ate at work. The chef preparing the to-go box was very friendly. He was so eager to help me out since I told him it was my first time there and didn't know what was good. The cashier guy had a weird frowny face but spoke good English. He understood my order right away and it was an easy transaction. He did know how to smile at the end. HeHeWell, I would definitely go back and try other stuff in their menu. Lunch to-go is definitely what this place is all about.", "Date": "2012-04-17", "Author_Location": "Newark, CA"}, {"Author": "Geomar R.", "ReviewID": "6v1gnIOdzI-hizH5O6v5-A", "Overall": "4.0", "Content": "My best friend recommended that we eat here after his experience beforehand.  All I can say about this place is that it resembles a Jackie Chan movie.  I could see Jackie Chan ripping off the hanging ducks and use it to defend himself.  I also could see the waiters ripping off their clothes to reveal that they are the from the Northern Triads Clan as they try fend off Jackie Chan from total victory. Anyways, back to the restaurant.  You'll notice how the gloomy, sad setting matches the service.  These waiters have no facial expressions at all and are not that friendly.  The food, however, is the complete opposite.  We ordered the bbq pork fried rice, fried pork chops, and honey walnut shrimp.  The fried rice was better than expected and tasted really fresh.  The honey walnut shrimp was drenched in some type of sweet mayonnaise in which it brought life and flavor out of the shrimp.  I was most surprised at the fried pork chops.  I'm not really a huge pork fan, but this entree is to die for.  The breading they used to coat the pork chops is similar to what they used to fry chicken. The fried pork chops were crispy and tender with little specs of hot oil.  This may not be healthy for you, but when you get a chance to spoil yourself, get this!Overall, the food was great.  This is typical in a hole in the wall joint, and it's great to see that this restaurant is strongly supported by the locals.  Give this place a try.", "Date": "2007-12-19", "Author_Location": "Santa Clara, CA"}, {"Author": "Brit C.", "ReviewID": "5cdjhRb1QZGtHodTnQkyug", "Overall": "1.0", "Content": "Not the best...the duck still had wing stuff stuck in the skin but was pretty meaty and tender.  The soup was bland and had way too much garlic.  The fried pork chops are okay, but i found chunks of MSG stuck to the chops and actually ended up eating a big clump of it.  Eww.  The saving grace here is the roast pork.  Pretty damn good.UPDATE:  Dont eat here.  My bf got food poisoning.", "Date": "2007-09-23", "Author_Location": "San Francisco, CA"}, {"Author": "Angelic L.", "ReviewID": "zqaO3sIIrWcNryJ6yw9WOw", "Overall": "4.0", "Content": "For years, my mom always got our barbeque pork from Kim Tar. According to my mother, if you come later in the day, they'll give you a little more if there's some leftover!More recently, I've been coming to Kim Tar for late night munchies. It's a good place to get some quick food for a cheap price although it is cash only (as is expected for an Asian establishment). One thing I really like is that they have Banh Lot as a noodle  soup dish. Not many restaurants serve this type of noodle soup. In fact, I think the only other place I've been able to get Banh Lot is at home when my mom makes it. The noodles are reminiscent of udon noodles since they're white and thick, but they differ in the fact that they're shorter with a \"needle\" shape. I would definitely recommend this dish to those who want to try something a little different from the typical Hu Tieu or Mi!", "Date": "2012-11-19", "Author_Location": "San Jose, CA"}, {"Author": "Lan N.", "ReviewID": "m1iM8pWY8Y3dvmurvcC0Cg", "Overall": "4.0", "Content": "Good for chinese bbq. Roast duck, roast pork, bbq pork, etc.There is a rice dish portion on the menu where you can choose a variety of the BBQ meats over rice. Good deal and good portions. The house special wonton noodle soup was okay, but seems like too much stuff in it. I think next time I would ask for wonton soup with maybe some bbq pork instead. Simpler. They also have your typical variety of chinese dishes as well, but I usually go here for the BBQ.Cash only.", "Date": "2011-05-24", "Author_Location": "San Jose, CA"}, {"Author": "Lucy D.", "ReviewID": "xr5VhZZ7KiryyhlC46d4zg", "Overall": "5.0", "Content": "This place may not have the best customer service, but they offer some bomb ass bbq meat. Definitely must try the roasted duck and roasted pork, it may be fatty and high in cholesterol, but it is delicious! They have a wide selection of noodles soup, rice dishes, and porridges. Place is good for individual meals, eating family style, or take out. And these items are very inexpensive! so its all good for students chilling within the plaza. NOTE: they do not accept any cards, so remember to bring cash or hit up an ATM before arriving.  And don't be intimated by the Asian male workers, they always may seem to appear pissed off, but they're chill!", "Date": "2011-01-05", "Author_Location": "Milpitas, CA"}, {"Author": "Julisa L.", "ReviewID": "8e-cJk0aFY_xx0Xlb1wQKQ", "Overall": "5.0", "Content": "Hidden gem! Food is delicious and perfect spot for big group get together for some late night chinese food! Hot and Sour Shrimp Soup, Sizzling Shrimp Soup, fried pork chop, walnut shrimp, fried rice are our usual. Affordable and big portion!", "Date": "2013-09-12", "Author_Location": "San Jose, CA"}, {"Author": "Rosiella I.", "ReviewID": "8bTYsBDGxpIks0gVVyWhVQ", "Overall": "4.0", "Content": "It's the typical hole in the wall restaurant with above average food. Yes the ambience is not great... but their cook is pretty darn good. We rarely order the noodle soup but the dishes we love are:1. Salty Fish and Chicken with Tofu Claypot- Served steamin' hot. The tofu is silky and soft with small bits of salted fish and tender chicken. Hubby and I can finish the entire pot in one sitting (even if we order 5 other dishes)2. Eggplant w/ Pork- fresh chinese eggplant cut on a bias stir fried with ground pork and mushrooms all served with a garlicky sauce. Yum.3. Freshly Fried Oysters- large oysters fried in a spicy salt batter served with a light sweet and sour sauce4. Cha Siu Porridge with Fried Bread- pure white porridge with bright pink cha siu which sweetens the porridge. The Fried bread is crispy and so yummy when it soaks in the porridge.We're not chinese but love to try new things. We don't order the normal brocolli beef; egg rolls etc. So... this place is great; cheap and good food.", "Date": "2007-07-24", "Author_Location": "San Jose, CA"}, {"Author": "Janis V.", "ReviewID": "AoZ5gXFmo6xsuCmWr_iHww", "Overall": "5.0", "Content": "Ok, it's time I gave Kim Tar a well-deserved review and write an update because my last review didn't do them justice for all the times this place has satisfied my family's growling tummies with their delicious food.Kim Tar makes some delicious Chinese food that my family and I come back for over and over and over again, especially those late nights you don't feel like making dinner or grabbing fast food, but you want something that will hit spot. Most of the time, we order the following items a la carte:- Salt and pepper pork chops, extra crispy with their sweet chili dipping sauce- Hong Kong style noodles- House fried rice or steamed rice (depending on how we feel)- Walnut shrimp- Ma Po tofu (soft tofu with minced pork in sauce)- Pea sprout with garlic clovesThese are usually our staples, but we'll try other things here and there, too. We almost always finish everything on the table because it's just that good - we always leave satisfied. I'm telling you.... if you're looking for a good, affordable Chinese restaurant that definitely delivers on TASTE, come to Kim Tar. They're open late. On top of that, the waiters are really friendly.One thing I don't like is that they're STILL cash only, but they have an ATM machine inside.", "Date": "2010-11-15", "Author_Location": "San Jose, CA"}, {"Author": "Roenna N.", "ReviewID": "-AWo_zNszQVWraGukKFrIw", "Overall": "3.0", "Content": "Kim Tar is my quick and easy go to spot when it's too late for a restaurant, but too early to be eating crispy tacos from jack in the box.The food is like your typical chinese food.  Greasy, but hits the spot, and has big servings.This isn't your fancy chinese restaurant, so the ambiance is mediocre.  It's there to feed bellies and not to impress the impressionable.", "Date": "2012-02-24", "Author_Location": "San Jose, CA"}, {"Author": "Tram N.", "ReviewID": "-DV1hxMuH6dKXKmXZKZnZw", "Overall": "4.0", "Content": "I haven't been here in years- my ex husband and his family used to frequent here a lot. I remember the food being very good but I did not come in to dine.. I came for their roast pork, I originally wanted BBQ pork spareribs but they were out.. I got a pound for $10 which I think is pricey but in all honesty I have never paid attention to how much I pay for these things when I did buy them! If you want the BBQ pork, BBQ chicken, steamed chicken, soy sauce chicken and whatnot, go early! I came in around 6-7pm and by that time I got the rejects. Service was friendly and the only flaw is that they accept cash only.", "Date": "2011-03-21", "Author_Location": "Santa Cruz, CA"}, {"Author": "Toshinobu K.", "ReviewID": "TVEyzO65xL8YnXbtH6K0LA", "Overall": "2.0", "Content": "Man, I used to have such good memories of eating here late at night, after drinking with friends and getting a belly-satisfying meal. I came back here with some friends today to try to relive some of the old memories, and the food isn't so anymore. The BBQ pork was bland, and that's pretty hard to do. I mean, you marinate the meat first, and then BBQ it slowly for hours; how can it not have taste? The duck and the roast pork was equally tasteless. We also ordered Mapo Tofu, and while the sauce was decent, the dish looked like it was prepared by a rookie (peppers chopped in different shapes and sizes, and some onions uncooked). The deep fried spareribs was the most interesting of all; instead of the regular thin coating we typically see in other Chinese restaurants, this place puts a \"tempura like\" batter around the meat and hence, traps the oil and makes the meat quite hard to eat. I had so many fond memories here in the past, and I don't know what happened. I am sad to see another one of my favorites go down the drain.  *sob*", "Date": "2011-01-01", "Author_Location": "San Jose, CA"}, {"Author": "Angeline H.", "ReviewID": "WnNsWyICyUFh9jxGVDp9Ow", "Overall": "4.0", "Content": "CASH ONLY!The seafood or beef chow fun dry is a large portion. Also try the roast duck with rice. YUM!", "Date": "2012-03-01", "Author_Location": "San Jose, CA"}, {"Author": "Anny P.", "ReviewID": "Zyiw7LXJBXuZNvZx-HggNw", "Overall": "5.0", "Content": "I'm extremely picky on my Vietnamese and Chinese food growing up eating homemade, but this place warms my heart. Whenever I get a craving to get in touch with the Asian in me, I come here, mainly because I live right there and they open late till midnight. So whenever I come home I get a nice whiff of yummy food in the air. I also like the BBQ they have there nice and fresh off the hanger =) Lots of food, great price. Service is typical of a little joint like that but friendly, a couple of the guys there have come to know me personally and we joke whenever I come in with a different guy.Cash only, complimentary tea, complementary soup (with a rice plate), and great late night eats =)", "Date": "2008-11-30", "Author_Location": "San Jose, CA"}, {"Author": "Cherryl D.", "ReviewID": "x9u1ukOTxFImdKyHP-Xz3Q", "Overall": "3.0", "Content": "My Ratings:Quality of Food - 4 StarsQuantity of Food - 4 StarsPrice - 4 StarsLocation - 3 StarsParking - 3 StarsService - 1 StarsSpeed - 3 StarsMy Story/Opinion:Cash Only.  Food is good, service is ok, fast and cheap.  The food is just like your typical chinese place where it's tasty but greasy.  Its cheap and they serve it fast.  The service is ok.  They like to serve you and go.  So don't expect them to be refilling your glasses every 5 minutes.  The place is a little run down but clean.  I will keep coming back for more.", "Date": "2008-11-17", "Author_Location": "San Jose, CA"}, {"Author": "Stanley C.", "ReviewID": "O0LTbOj4Xcdc8pUu5I8bUw", "Overall": "3.0", "Content": "KIM TAR RESTAURANTGood noodles here, but way overpriced compared to other Chinese restaurants. One good thing is that they have a full BBQ counter in the restaurant for all your meat lovers. If you're craving for Chinese BBQ like roast pork, BBQ pork, salty chicken, roast duck, etc., come here and order your cuts over rice or take home a few pounds! If the market(s) are closed, come here to order your meats, but be warmed, you're paying for it!", "Date": "2012-11-20", "Author_Location": "San Jose, CA"}, {"Author": "Mimi T.", "ReviewID": "ApNebvx0GtRcP6jYBZuP8Q", "Overall": "3.0", "Content": "the food is not bad, you just need to know what to order off the menu. chow mein with the skinny noodles is good.... i ordered fried chicken and rice..... the chicken was really moist and tender. I never had anything from the to go section, but i hear its pretty good.Another plus is they're open late...", "Date": "2007-09-23", "Author_Location": "Santa Clara, CA"}, {"Author": "jerry h.", "ReviewID": "_nuzn9AwASiH_lXYCDk1zw", "Overall": "4.0", "Content": "For late night dining, this place is consistent.  I really like coming here because I haven't had a dish go wrong on me.  If you can make your way into the restaurant without a look of the BBQ innards hanging in the window, you made your way across the land mines.Place ain't too fancy and your shouldn't expect the service to be top notch either.4 stars for above average tasting Chinese and dependability.", "Date": "2008-09-13", "Author_Location": "Santa Cruz, CA"}, {"Author": "kent c.", "ReviewID": "CbA7z9iZYuNpNb88V_THEQ", "Overall": "4.0", "Content": "Cheap and quick - If your a fan of BBQ pork this place is the best. ($7) for a few cuts of BBQ pork over rice along a small side of chinese kim chee (sweet and sour pickled veg). The most tender and full flavored taste of bbq I have grown to love.They have their fair share of duck, chicken, pork, all types of internal organ cuts to go weighted and sold.All the other stuff is average. The prices are fair and the service is decent. Note I am not adding in cleanliness points to my evaluation of this place, it is all based on their  bbq pork for this 4 star review. if it they did not have that then it would be a 3 star place.", "Date": "2010-02-09", "Author_Location": "San Jose, CA"}, {"Author": "Tiffany H.", "ReviewID": "vYVWgNhf2yqHnPsQ1gPapQ", "Overall": "3.0", "Content": "This place has been around since I can remember. The quality of some of the food has gone down, but the selection of ducks,pigs,and BBQ pork has staid the same. They are still very tasty. Kim Tar is my favorite place to get Duck and BBQ pork. I'm not a very pig fan of pig. My dad seems to enjoy it. Kim Tar offers a trio including those three types of meat. YOU SHOULD GET IT. The Seafood Hot pot here, is the only seafood hot pot, I have ever had. The hot pot includes mushrooms,fish,fish balls,squid,shrimp,etc. It's not an item you have to try, but you should if you are a seafood lover.Chow fun, what can I say? I use to like it more. The quality of the chow fun has gone down over the years. Pretty sad, I use to go here every week just because I wanted their chow fun and grab a green tea ice cream from Hello Desserts after. Now I just go when my dad wants dinner here. Let me tell you that's not a lot of times a year anymore. These 3 items, the meat trio, seafood hot pot, and the chow fun was my latest dinner here Sunday night. I'm not very confident to review anything I have ate in the past because I'm sure the food has changed a lot.", "Date": "2010-10-14", "Author_Location": "San Jose, CA"}, {"Author": "Henry C.", "ReviewID": "Ba_EXeiv8gaqGDYj6FywNw", "Overall": "4.0", "Content": "My go to place for Chinese bbq. Partially because I don't know anywhere else to go to close to home. I usually get the BBQ pork and the roast duck. The Roast pork isn't that great. I want juicier and crispier skin. I always take it to go because I feel like its more authentic eating it out of a take out box. Make sure to scoop some of their hot sauce into your take out box before you leave. It's not really hot, it's kinda nutty and slightly sweet?...I dunno just try it.", "Date": "2012-09-25", "Author_Location": "San Jose, CA"}, {"Author": "sonya h.", "ReviewID": "-aLPsoB8D_3GwVX4F2mF_w", "Overall": "1.0", "Content": "Saw a rat while having lunch here one day.  It ran accross the dining room.  I was not aware of it until another diner screamed and climbed on her chair.  I also then screamed a lil and lifted my legs up in mid-air.  The waiters looked really embarrassed after we screamed but what could they do? If I didnt see that rat, I would have given this place a 3 stars for alright tasting food because I used to buy a lot of their BBQ items there to-go.", "Date": "2008-09-12", "Author_Location": "San Jose, CA"}, {"Author": "A C.", "ReviewID": "7pfbIp-5PWDdUwAhdw62Ug", "Overall": "2.0", "Content": "Used to be good quality for the BBQ pork, roast duck, and roast pork and rice. Now, the meat quality isn't fresh and they don't provide enough food to fill your stomach.I used to love this place, but now its gone downhill.", "Date": "2012-12-30", "Author_Location": "San Jose, CA"}, {"Author": "Moistnchewie L.", "ReviewID": "uutlnaDRyf2U0tgVvkpV2A", "Overall": "4.0", "Content": "I lived around the corner from this restaurant in HS.  It's one of those Chinese BBQ restaurants that serve delicious foods but there are ducks that are hanging out by the front door/window.I would have to say that it is cleaner than most of the other Kim Tar's/Sam Woo's I've been too.My favorite is the black bean sauce with chicken in chow fun.  Everything else is pretty good.  My family use to come eat here twice a week.You can't expect much as far as service, but the waiters are relatively friendly.", "Date": "2007-11-20", "Author_Location": "Orange, CA"}, {"Author": "Nic P.", "ReviewID": "elSDkxBRk4GXnzCUPoeikQ", "Overall": "5.0", "Content": "Favorite Chinese food place ever.They're CASH ONLY, so make sure you bring some cash along with you. They have an ATM there but it's one of the no name ones that charge you all kinds.My family and I are always here, it's down the street from my house and they're open late.. So it always works out. I love all their food here. You can never go wrong with anything on the menu.The servers know us by name and it's just a nice little place to go. I love it.", "Date": "2010-05-11", "Author_Location": "Austin, TX"}, {"Author": "Lan N.", "ReviewID": "qZBWgsV2CKwHk2LOY9qHnA", "Overall": "2.0", "Content": "At least this place is open late.Only reason I think anyone eats here :). My dad gets the soups with the wontons and the bbq duck or pork or whatever. He seems to enjoy it, and it's more authentic than your Tung Kee Noodle. Around #7? They always get it to-go.Stay CLEAR of the sweet-and-sour stuff. It's horrendous.They also accomodate a hungry group of people, like my family of 8 at 1 AM. Then they serve family style, and you get a pick of traditional vegetables and the basic Chinese stuff, including shrimp with walnuts (AWESOME!). Everyone gets their bowl of noodles and is happy..except for me. Vegetarians? Pescatarians? You are left with expensive and salty fish, scrambled eggs and rice (pretty decent), tofu and shiitake mushrooms (2/5, not impressing me), and the tofu stir-fry stuff (2/5).", "Date": "2008-04-23", "Author_Location": "Milpitas, CA"}, {"Author": "Jay J.", "ReviewID": "1_R3YQoqD2FhQupQ9XtqtA", "Overall": "2.0", "Content": "Worst tasting fried pork chop and rice I have ever had. No flavor at all and tasted as if was fried early in the day then microwaved. Chicken cream corn soup had no salt and little amounts of tiny pieces of chicken and the consistency was also very very thick and heavily laden with globs of corn starch. Roast duck/chicken was ok though. Hell no return", "Date": "2013-10-20", "Author_Location": "San Jose, CA"}, {"Author": "Pearl V.", "ReviewID": "vU8dym_Y4BNp2fW8gUzs1w", "Overall": "4.0", "Content": "I recently had the pork chop rice plate everyone seemed to recommend on here. It was pretty good, even though I don't think it was worth the $8 price tag considering that it's just served with white rice and some pickled veggies. I didn't get a picture because i was so starving and didn't think of it until it was already too late. Oh well.", "Date": "2009-10-04", "Author_Location": "San Jose, CA"}, {"Author": "Jackie S.", "ReviewID": "KpGcoKlR-vAQ99fdfnM94A", "Overall": "1.0", "Content": "Worse Chinese food ever. Poorly executed food that is overpriced and with no flavor. I make better food at home.I do not understand why there are so many people who eat here. Maybe their taste buds are dead.", "Date": "2012-09-02", "Author_Location": "Milpitas, CA"}, {"Author": "Stephanie B.", "ReviewID": "NrSFEDD9n0yX0OJOercEbw", "Overall": "4.0", "Content": "Seriously?  I'm barely going to try this for the first time?If it wasn't for the BF, I probably would've never walked through those doors.  I've never had roasted duck before, so my boo decided to order the first thing on the \"over rice\" menu.  This came with chicken, duck, and pork.  I ordered the mongolian beef over rice since I didn't want to order something I might not like.   For $7.95, you get fresh chinese food, a huge portion of your dish and rice, and some tea.  I thought it was a pretty good deal. My mongolian beef was tender, tasty, and just plain good.  They put a lot of onions on it, which I didn't know.  Other than that, I enjoyed my meal.  My boo let me try his duck.  I was actually quite surprised!  It was very tasty and you can tell it's full of flavor.  I guess it's all the fat that's on duck and I thought duck would be lean! hahaI can't wait to come here again and try something new.  Their porridge sounds so yummy, so that's my goal new time.  I have one issue, CASH ONLY. I star docked off because this is a sit down place and it's cash only?  It doesn't make sense.", "Date": "2011-08-24", "Author_Location": "San Jose, CA"}, {"Author": "Man L.", "ReviewID": "dalsjwAJcF8WPEm_ZG87fg", "Overall": "4.0", "Content": "This place is one of my go-to spots for quick, affordable and decent Chinese food. The prices might be a little on the steep side but the portions they give you are worth it in my opinion. Order the fried porkchops to get an idea.Their chow fun is probably my favorite thing to get since the gravy is delectable, thick and they throw in a couple scrambled eggs for an interesting but awesome twist. I also recommend the fish fillet noodle soup. The broth is subtle, the fish tastes fresh and it's excellent during the cold season. Try it with the chinese donut which is actually fried to order instead of being heated or toasted up.Another plus is that it's open quite late and my friends and I often head here after a night out. I'm not a big fan of the porridge though so steer clear. The BBQ here is alright but not the best. I'm pretty picky when it comes to that. If you really want some good Chinese BBQ, head over to New China Station BBQ right next to Lion Supermarket.", "Date": "2013-01-08", "Author_Location": "San Jose, CA"}, {"Author": "Venesa C.", "ReviewID": "WAChm6hIt3TPHDE7Xn2k3g", "Overall": "4.0", "Content": "I'm drooling as I'm trying to type this review.Must try: Fried pork chop with rice. The porkchops are so tender! I always request a side of fried egg to go along with the meal. YYYUMMMM! It's always the same guys working there, and they are usually friendly..I've also tried the Hainan Chicken dish twice, it is good due to the chicken always being very tender, but the rice lacks the aromatic flavor and texture that a Hainan chicken dish usually has...but they give you a side of fish sauce..............Bf always gets the Chiu Chow noodle soup...and it is good, but i'm just not a noodle soup-y person :). Comforting for a hangover though!Good location as I always go next door to get either boba or froyo. What can I say, i'm a fat kid at heart...CASH ONLY!", "Date": "2012-05-04", "Author_Location": "San Jose, CA"}, {"Author": "Bao N.", "ReviewID": "VnuicGRYkhNncfndCSw_1Q", "Overall": "4.0", "Content": "What do they put in their chili paste - the condiment at each table? It is super addicting and I found myself eating like half the jar when I was there.  It wasn't super hot, sweet, and had a ground texture like peanuts or something in it.  It was yummy.  I put the chili paste  all over my rice and meats and chowed down.  For $8, you can get roasted duck, bbq pork, and roasted chicken with some delicious pickled veggies over steamed rice.  Pretty good deal.  It was very simple, but tasty.  To deal with the Cash Only situation, I ran to ranch 99, bought a stick a gum to take care of my breath after eating hella chili paste, some Pocky sticks for my daughter, and got cash back.  Saved ~$3 on service charges which paid for the gum and Pocky sticks AND got my breath smelling cool like polar ice when I returned to work after lunch.", "Date": "2012-06-14", "Author_Location": "San Jose, CA"}, {"Author": "Tu D.", "ReviewID": "09esAD6ysA7ldM1TvpAHXw", "Overall": "5.0", "Content": "Good, Cheap and Open late.  If service is not your main concern, than eating here will be worth your while. I enjoy the food here, from noodle soups to BBQ pork & duck to their rice plates. Very good chinese food at decent prices. And they open late too. Again, dont come here if you want service. You will be disappointed.", "Date": "2010-03-21", "Author_Location": "San Jose, CA"}, {"Author": "Rhona R.", "ReviewID": "0rv_CHxuP7ud3RSSL6ZZLw", "Overall": "4.0", "Content": "4 words deserves 4 stars! \"Salted Pepper Pork Chops!\" It's a must when coming here. Mouth watery, savory, and delicioso!", "Date": "2012-09-20", "Author_Location": "San Jose, CA"}, {"Author": "Jenny O.", "ReviewID": "1ICp_5Q0Vyzxfi-2e5jIdg", "Overall": "3.0", "Content": "I've eaten here a few times, and I've never been disappointed by any of the items I got--except for this spicy beef noodle soup. I think the prices are a little higher than other Chinese restaurants, but it looks like they give pretty big portions. The salt pepper fish and squid is delicious! Beef stew with fried rice? ALSO GOOD. And the seafood noodle soup? Wow, felt like I was at sea because I have never seen so much seafood in a bowl of noodles before. Okay, that was lame, but seriously, there were fish balls, fish cake, shrimp, squid, fish, and more! There's multiple pieces too, not just a mere one or two. They also have really quick service!", "Date": "2009-04-22", "Author_Location": "San Jose, CA"}, {"Author": "Kenny L.", "ReviewID": "2CGa5rAZAMR9pKjztHQFJw", "Overall": "4.0", "Content": "This review is based on to-go orders only.I love the traditional chinese food and i'm so glad they have roast duck and bbq pork and all that good stuff.Well I was sick and felt like crap and I needed some porridge so bad. I didnt know where else around here had some so I found this place. I've seen it a few times since I always come to the plaza to go to ranch 99 so i gave it a try.Ordered: Preserved Duck and Pork Porridge, $6.00 out the door.YUMMMMI've had cheaper porridge but for $6.00 this was some flavorful porridge. It wasnt bland and wasnt too watery. I dont like my porridge too thick either so this was great. The service is decent. They didnt remember me for ordering the porridge so i had to repeat myself but its ok. I'm coming back here again one day to try their huge menu of stuff. thanks for helping me feel better with the porridge yo", "Date": "2009-11-17", "Author_Location": "San Francisco, CA"}, {"Author": "Linda P.", "ReviewID": "iv4ovEVRyGSJkvexC4zscA", "Overall": "4.0", "Content": "Good food for late nite Chinese food dining.  It's great when everything else is closed and you're hungry.  I went there about 11pm Sunday nite and 2 people had soup but I had Salty fish with chicken fried rice and an order of roasted duck.  There is a lot of variety also. The duck was greasy and yummy but in a way I feel like I got jipped.  The roast duck order is supposed to have more meat than the roast duck with rice which was 25cents cheaper.  But somehow seems like might have been same amount of meat.  For the $7.50 we paid I'd rather order half a duck for $8.50 instead of with rice for $7.25.Salty fish and chicken fried rice is salty so if u don't want that then choose another dish.Tip: we were last customer leaving about 11:40pm and although they close at midnight they left early and closed when we left so try to come early don't ride on the place to be open a few minutes before closing especially on a slow nite.", "Date": "2010-11-30", "Author_Location": "San Jose, CA"}, {"Author": "Johnson C.", "ReviewID": "MmZ-WohMv6b6gGx1HfqiXA", "Overall": "3.0", "Content": "Cheap and good food.  Love their roast duck rick-stick noodle. my wife loved their deep dried pig intestine but not my cup of tea.Clams in ginger and scallion is great too.overall reasonably priced and consistent quality that bring me here for past 8 years.", "Date": "2011-01-05", "Author_Location": "Palo Alto, CA"}, {"Author": "Anh D.", "ReviewID": "vhbK7z8dxJ7HVobMtfvH3Q", "Overall": "4.0", "Content": "Cash only! The combination lunches are good, the best plates to get are the specialties of the house: any plate with their roasted duck or barbecued/roasted pork. Delicious. It comes with rice and pickled vegetables, and it will be delicious. I also really like their soy sauce chicken. I also tend to get the beef chow fun, because it's really good here, and for some reason, excellent chow fun is getting harder and harder to find. My favorite time of day to come here, though, is for dinner, which can extend to 11 pm or 12 am at night! I'm not sure on the hours, but it's open pretty late. We always get:1. Barbecued/roasted pork, if still available2. Salt and pepper squid -- my favorite! The squid is battered with a light (compared to American batter) batter and salt and pepper to be tossed with scallions and jalapenos. I have dreams about it. I've tried salt and pepper squid at a lot of different places, and this place has some of the best.3. Salt and pepper fish, prepared similarly4. Salt and pepper pork, prepared similarly but is saltier and fattier than the barbecued pork. 5. On choy sauteed with garlic6. If the on choy is out of season, we get the pea sprouts sauteed with garlic7. Shrimp with walnuts and mayonnaise -- not classic, but my grandma adored it. 8. The fluffy tofu with the big mushroomsSo good. This is a nice neighborhood joint that is super-casual and delicious without all the fusion and pretension. The staff here are really nice, but be sure to bring cash.", "Date": "2011-03-02", "Author_Location": "Milpitas, CA"}, {"Author": "Lan T.", "ReviewID": "4G56LNvGE0ygFHq6imBjZQ", "Overall": "4.0", "Content": "Got the roasted duck and fried pig. Both were really good and flavorful. The duck was perfectly roasted and was super juicy still! & the pig was super crunchy and tastes great with or without sauce. Yum!! At first, I thought it was just a place that sells fried pig and roasted duck, but they it's actually a restaurant where you can dine in and enjoy your meal. They take cash only, but they always have an ATM machine in the restaurant. Super friendly workers, and they open late (until 12am). **Here's a helpful tip, if you order the fried pig to go leave the to go lid open (the skin will stay crunchy longer) or else the skin gets soggy.**", "Date": "2012-03-12", "Author_Location": "Fremont, CA"}, {"Author": "Rachel V.", "ReviewID": "msvNWq24YYUzmuIDe1AqLg", "Overall": "2.0", "Content": "Okay honestly, I feel so bad for giving them two stars but how can I not... I mean, their food is just OKAY... not even delicious even if I was hungry.  The fried porkchops were the only thing that kept me from giving up and taking everything to-go, then throwing it out at home where they wouldn't be able to see that I threw it out... just because I feel/felt so bad. -_- As I was saying, the food is okay but the thing I didn't like the most was how my fried pork chops had pretty much 2 pounds of rice underneath and a skimpy amount of pork chops on top... (Wait what...?)  I can't eat that much rice with skimpy amounts of pork chops! It's good that they do good business because when I was eating there for the first (and last) time, all the tables were filled.  It's definitely up to you to try though!", "Date": "2012-09-10", "Author_Location": "San Jose, CA"}, {"Author": "Joey L.", "ReviewID": "tzZsqa9p22_GGnwYIymIVg", "Overall": "4.0", "Content": "I'm truly glad this place is cash only and that I hardly have cash on me, because I could see myself here EVERY night for some rice and BBQ pork.Now personally, I don't like their duck for some reason, it just wasn't my thing.  But I'm a HUGE Chinese BBQ pork guy, PIGS BEWARE!!  This place serves BBQ with some pickled veggies and some rice for less than $8...now it is kind of pricy for the lack of work to make this and how cheap rice really is but this place is seriously my favorite thing to eat.  It's so simple, it reminds of home cooking and it's delicious.Now I will admit, sometimes the pork is dry but sometimes I get the fatty pieces that are extremely succulent and tender and...I stopped to wipe the puddle of drool i just created.  A HUGE plus is that it's open til midnight, which is great for a night owl like me.This place isn't all boojy and if you bring a date here trying to impress her, i'm pretty sure you won't be getting laid, unless she LOVES chinese bbq pork as much as I do, but this place will satisfy you in other ways...by that I mean your hunger.If you choose not to give this place a try, I could care less, MORE PORK FOR ME!!! :)**CASH ONLY**", "Date": "2011-02-04", "Author_Location": "Visalia, CA"}, {"Author": "Anthony C.", "ReviewID": "ye5ULdfzRWFYXAsRYdtfkQ", "Overall": "3.0", "Content": "This place is regular chinese restaurant. We always get the salt and pepper fried tofu, the chicken canh chua, walnut shrimp, and the chow mein. Its pretty affordable place and quite tasty as well. I enjoy coming here for the family style dinner. Service is just like any other asian restaurant. Nonexistent.", "Date": "2013-02-17", "Author_Location": "San Jose, CA"}, {"Author": "Priscilla L.", "ReviewID": "r_brPMabJu5quVe5qlyDnA", "Overall": "4.0", "Content": "4 stars for the food but I give 2 stars for their service. I go here every so often, even when I'm ordering to go because their combination chow mein is the best chow mein I've ever had.  I've tried a few items on their menu..and I've enjoyed every single thing. I have to honestly say that this is the best chinese restaurant in san jose. I'm a big fan for family owned restaurants, and Kim Tar will always be my #1 chinese restaurant.Their service sucks, but I've gotten used to it that I don't really care anymore. For example, I always have to ask for water. And sometimes the workers just walk right pass you when you have a question or if you need something. Many asian restaurants don't know the meaning of excellent customer service, but their food always makes up for it. The thing that I don't understand is that I always go here with my family and the staff always recognizes us...yet they still do not provide the excellent customer service! Maybe it's a racial issue? Or maybe they're mad because I give them a $2 tip everytime I go there. The $2 tip I always give them everytime I eat there reflects on the two stars I give them for their crappy customer service.", "Date": "2009-09-09", "Author_Location": "San Jose, CA"}, {"Author": "Tammy D.", "ReviewID": "WAAPHXarXdj05FJRZfrmaw", "Overall": "5.0", "Content": "A few friends and I came here late on a weekday night. Only 2 other tables in the entire restaurant were occupied. We were pleased with their great service! Everyone were friendly and accommodating. We ordered fried rice, soup, and noodle soups. Everything was excellent. They made sure we were satisfied, that's for sure! I was happy that they were generous in food portions, with the price, it was even better! Even though we sort of held them back a little because they were about to close and we were still sitting and chatting, they were extremely patient with us. :) Thanks, we'll be back!!", "Date": "2011-02-03", "Author_Location": "San Jose, CA"}, {"Author": "jazzy l.", "ReviewID": "xQUUu80RA9VtNTCPc7gRgg", "Overall": "2.0", "Content": "This also use to be a neighborhood joint my family would visit.  I came back to try the usual dishes I would order and I was disappointed  with fish and vermicelli soup dish.  The fish use to be fish stripes/fish balls not fish filet.  The broth is the same consistency.  The noodle was too rough.Note to self: I need to try the hainan chicken dish with rice again. (The same serves still work there..after all these years!)", "Date": "2012-06-06", "Author_Location": "San Francisco, CA"}, {"Author": "Me K.", "ReviewID": "IJA3jckmNjKOhcwUJPTO6Q", "Overall": "4.0", "Content": "Good open place. Been there PLENTY of times.Near hello desert, yogurt twist, and barcode. (PLUS POINTS)Service is nice. I LOVE their food!Deco is A-okay. Spacing is good.For all Ages.A good Chinese restaurant.i say...GO  CHECK IT OUT! (:(Staying is so much better then ordering to go)", "Date": "2009-07-10", "Author_Location": "San Jose, CA"}, {"Author": "tee w.", "ReviewID": "6satAPkIYO5qrr7zp7SLgw", "Overall": "3.0", "Content": "I like this place for quick lunch or for a quick take out. The servers are always super nice and smiley to me, despite my super broken chinese. I dont know, but I think their service is better than other chinese restaurant in general although it doesnt seem like it from other reviewers. The roast pork is a little chewy sometimes, not crunchy, I wish they would let me taste the crunchiness first before deciding if I want to buy their roast pork or not. I come here mainly for roast pork, roast duck, and their fried pork chops. You can tell i live a very healthy diet (not)", "Date": "2009-07-14", "Author_Location": "San Jose, CA"}, {"Author": "Jess M.", "ReviewID": "zmrfQkC8yZPEQzGIok7Vbg", "Overall": "4.0", "Content": "If only this place accepted Credit Cards! But, other than that this place is DELICIOUS! An awesome spot to hit up especially if you get the late munchies.They're good with Pick Up Orders... your food is ready super fast.When you eat inside your food comes out within 5 minutes.The Staff is OK.", "Date": "2010-04-03", "Author_Location": "San Jose, CA"}, {"Author": "Hummer W.", "ReviewID": "FIIyt28UhWs0ymP08QBAew", "Overall": "4.0", "Content": "People riding Anthony Bourdain and Andrew Zimmerns jock would appreciate what we have here.  Living in North San Jose / Milpitas has its benefits in that you don't have to get a passport and couch surf in order to eat around the world.  For those wanting to live out their No Reservations and Bizarre Foods fantasies, make your way to Berryessa and the Pacific Rim malls on Lundy Avenue.With over a gazillion items on the menu, it would be hard pressed to find something not to like at Kim Tar BBQ.  That is if you're not into Chinese food.  As the name suggests, they do Chinese BBQ.  They do good window business with the requisite duck, pig and chicken dangling from the windows.  Want ofal?  Just take a look at the counter.The usual suspects for any visit is the ducky.  They do a decent duck and bbq pork over rice with a side of 'kim chi' (pickled veggies actually).  The noodle soup version is better.  They take Daffy's leg meat and crisp it up in the wok with some shallots and then present with yellow noodles and broth.  Other standouts are the pork chops and sauteed pea sprouts.For those of you wanting adventure, well hey, they're open late.  Just bordering San Jose's East Side, you can have your own adventure at your peril.  Really, its not that bad.  Just watch yourself.", "Date": "2011-05-22", "Author_Location": "Milpitas, CA"}, {"Author": "Joy A.", "ReviewID": "gc3kyv4xoPTzfakRV1BMUQ", "Overall": "4.0", "Content": "This is our \"go to\" place for quick, reliable chinese food. Specifically, I am a big fan of the roast duck (make sure you pick out a nice chubby one from the window!). Other notables: kidney with green onions, salt n pepper chops, sizzling oysters in black bean sauce, bbq pork and house beef stew. So-so choices: fried rice.It's a hole in a wall - so don't expect 5 star cleanliness (I would only go to the bathroom if you really had to). But, the food is consistent and service is on point.", "Date": "2012-05-21", "Author_Location": "Santa Clara, CA"}, {"Author": "John L.", "ReviewID": "hUCT2sg0czfTzsP4_Eapig", "Overall": "5.0", "Content": "Listen to me people.... especially you meat eaters... specifically pork.Top Dish: Get the small yellow noodle with bbq pork. its not on the menu, its a custom. ask for it. it'll be something to write home to mom about. throw on top the chili paste and you'll be coming back again. Backup Choice: bbq pork fried rice. its solid.Can you tell I like pork? Awe yeahhhhh....", "Date": "2010-09-19", "Author_Location": "San Jose, CA"}, {"Author": "Bryan N.", "ReviewID": "oC48_zoQRtFWdzrD18GE0g", "Overall": "4.0", "Content": "I absolutely love this joint!  I do believe I'm addicted to their soups... In fact, I've ventured here from Santa Cruz just to get the beef soup on countless occasions lol.It may not look like much, but give the place a shot.  You'll stumble outta there full and with plenty of cash in your pocket for gas to get you back home.", "Date": "2011-12-07", "Author_Location": "San Jose, CA"}, {"Author": "Terry Y.", "ReviewID": "zD_m2lqDbhgqwaHHdwhwlA", "Overall": "1.0", "Content": "This place is horrible.  I knew trying BBQ places out of SF was a big mistake and I paid dearly for it.The BBQ pork was just average at best, like the ones you can buy at the Ranch 99 deli (which ironically, is pretty much next door).Roast duck is just a tad better than Ranch 99s.  Just a tad.The roast pork was horrible.  The skin was so hard you can use it as support beams for the Empire State building.  It will break your teeth!The servers there looks at you as if you owe them money, and that by serving you, they are doing you a favor.  This may fly in places in SF that serves absolutely godly food, but here?  F that!  No tip for you!I will never come back here.  This place makes A&J (the restaurant a few spaces over) taste like a 5 star restaurant (and it is not).", "Date": "2012-07-01", "Author_Location": "San Francisco, CA"}, {"Author": "Kimberly M.", "ReviewID": "__QoVfWUgNdUVMmaRzvDRA", "Overall": "5.0", "Content": "Omg their fried porkchops are amazing! They don't use a lot of oil in their food and everything on the menu is delicious and you could never go wrong!when it comes to prices it's decent and the portions are huge for the amount that you're paying! The service here is amazing. My favorite waiter is a guy named Randy! He's so nice!", "Date": "2012-09-02", "Author_Location": "Hawthorne, CA"}, {"Author": "Tony N.", "ReviewID": "gpY2j1J8guE3ydjVkbZ2Xg", "Overall": "4.0", "Content": "This is not a fancy place but it is comfort food for me. It's always safe to say, I come here when I don't feel like cooking. Take outs is another options if you have some rice and veggies at home and need a good dish to compliment it.The BBQ pork is a staple in my diet when dining here. The salty fried shrimp is a must try, eat the head if you dare, it the best part.", "Date": "2008-08-28", "Author_Location": "San Francisco, CA"}, {"Author": "Samson W.", "ReviewID": "a0b280QXie9bwOS527cT4w", "Overall": "5.0", "Content": "I agree with several others who have previously reviewed this place that it is good, cheap, and open late. And oh yes, quick. Very quick. I was there for dinner at around 8:45 or so and there were a few tables occupied, besides mine. Several take out orders. Very good Chicken Chow Mein. It definitely tastes like what you would get, if you were back in Hong Kong. Finally, the service. Of course, the service is so-so. What do you expect? It is the same, if you were at a similar type of place in Hong Kong and China. So, I'm shocked that several gave negative reviews, just because of horrible service.", "Date": "2010-03-31", "Author_Location": "Milpitas, CA"}, {"Author": "Abigail S.", "ReviewID": "uUSN1agDLki-VepJItjb4w", "Overall": "4.0", "Content": "For years now, my family has come here for many family functions and dinners. And we've enjoyed their food every single time! Their food is awesome! This is where I first discovered the delicious Walnut Prawns, years ago!!! MMmmMmMm! Soo good, but soo bad for you, OH FRICKEN WELL! We specifically came here for their family style menu, where you choose several dishes for a very good price, but unfortunately, they no longer have this option. Minus a star for that...Their dishes are mainly family style, and are large enough to share with at least 4 people per dish, but now I guess they decided to charge by plate. Regardless, their food is great! Some dishes you should try are:-The Roast Duck, ESPECIALLY with the buns!!! OMG-House Fried Rice-Salt & Pepper porkchops-Walnut Prawns- Mongolian Beef-EVERYTHING! hahaThis restaurant is CASH ONLY, but they do have an ATM available, and they're open pretty late! Service is quick, you get your food fast, but one thing though, I never understood why they always give us the steam rice last? We always have to ask for it beforehand.The restaurant itself isn't super big, but it's big enough. After coming to this restaurant, I'd think they'd want to upgrade and improve the looks inside, but guess they haven't. The interior's nothing special, but its clean and tolerable.Just come and try their food! You won't regret it! I haven't, thats why I keep coming back!", "Date": "2011-03-06", "Author_Location": "San Martin, CA"}, {"Author": "Angela T.", "ReviewID": "rVKgg-rB-ZpkmnsRtMy78g", "Overall": "5.0", "Content": "Reminds me of the typical Chinese restaurants in Oakland Chinatown with the butcher shop in the front. Outdated decor but good food and lots of attentive staff members. Me and my husband ordered the kung pao chicken, beef chow fun, and bbq pork over rice. All the dishes were huge and very flavorful, and the best part was they were less than $10 each! Solid place to go to whenever I'm in the area!", "Date": "2013-07-29", "Author_Location": "Milpitas, CA"}, {"Author": "Antoinette A.", "ReviewID": "AYc7a5yQKztYY4_4rduY5Q", "Overall": "5.0", "Content": "Not a particularly nice, cozy place but the food makes up for it. It's made very fast with good portions for a great price. My personal favorite is the fried pork chops. And the house chow mein. And the sweet and sour pork (: haha. Overall everything is delicious!I've been here more than a dozen times. WAY more actually. My family is in love with the place and every time we eat out, it's never a surprise when we end up going here. We especially stop by when it's late at night. It's either Kim Tar or Denny's. We pick Kim Tar 80% of the time. If you're looking for good quality service, this is not the place to go, but who cares? The food is what you're coming for. Anyways, when you become a regular, they treat you much nicer.***For a tasty dessert, go next door to Hello Desserts. I personally get the smoothies that are $3.95. A bit pricey to me but not compared to the other items on the menu.", "Date": "2009-02-19", "Author_Location": "Lathrop, CA"}, {"Author": "Douglas P.", "ReviewID": "qDuRylmR13ROLaFQ7QoFfA", "Overall": "4.0", "Content": "Lots and lots of food,Their Roasted duck soup noodle soup has a lot of noodles, which is good and bad, it is a little expensive and i wish they would reduce the portion and the price.My favorite is the roast duck and pork over rice, it's amazing and there is a lot of food for 8 dollars.Cash Only, they speak Vietnamese also.", "Date": "2011-12-03", "Author_Location": "Milpitas, CA"}, {"Author": "Kelly T.", "ReviewID": "Cts0ZiJ_OidopjsO7-SmPQ", "Overall": "5.0", "Content": "5 stars all the way - Okay well maybe not for the service but the food definitely made up for it.I guess everyone knows of this spot except for me (well all my boy's group does, at least) and it is supposed to be the \"go-to\" spot. So we were seating around on Saturday night just finishing the Charger game and were starving at 9:30pm - What could be open in our area (Hostetter, Lundy, Berryessa area) - mostly only Asian places but that's fine by me. H and D mentioned this place and I felt, why not? We came in and surprisingly, there was a lot of ppl in there so late. We ordered the Calamari, Roasted duck and Chicken platter, A beef rice plate and I ordered the House Chow Mein. WOW! Everything was great! The chow mein rocked my world - I now have found the best gosh darn chow mein of my life - I don't have to look any further...So I'm sure the boy's plates were great too since they scarved them down but I was too concentrated on my plate to taste test anything - Oh and the calamari was good but I wish it would have come with a sauce of some type to dip the pieces in. I recommend this place to any chow mein lover in a heart beat!", "Date": "2009-01-05", "Author_Location": "San Jose, CA"}, {"Author": "Donna Y.", "ReviewID": "FONVWzPU94nEkb_JB4iRXA", "Overall": "3.0", "Content": "I always pass by this place but never went in.  I read some great reviews on Yelp but have not gotten a chance too.  Since Walter was on a duck kick, we decided to get dinner here.  This is the next day after the Bulut eating the night before.  So he had the Mom or Dad that night for dinner.  I end up ordering the Beef Chow Fun.  Overall the Beef Chow Fun was good but then again you can't really mess up this dish to badly.  I would like to come back and try other dishes.", "Date": "2009-03-24", "Author_Location": "San Jose, CA"}, {"Author": "Cynthia C.", "ReviewID": "IJEEh8KU3R_9aDy98jvHqA", "Overall": "3.0", "Content": "This place is alright. My bro comes here on a weekly basis and orders their famous pork bbq. We ate here at lunch today and it was decent but nothing memorable. I had the won ton noodle soup which was a less oilier version of Tung Kee. But it's also a little bit more expensive. Roast duck was good but there wasn't much meat on it. :p Service was ok... place wasn't very clean but still edible.. what can you expect from a cheap chinese restaurant? not much! :)", "Date": "2009-04-04", "Author_Location": "San Francisco, CA"}, {"Author": "Jennifer n.", "ReviewID": "OE5a3ORI2reftIupQx8B6Q", "Overall": "3.0", "Content": "LM and I dropped by here for dinner and ordered their BBQ rice plate. It was about $8 for rice and 2 items :( Sad to say the food just was not as good as it used to be. Thank goodness we ordered the salt and pepper pork to go and LM loved that. But overall, I was disappointed.", "Date": "2010-12-21", "Author_Location": "San Jose, CA"}, {"Author": "Lily L.", "ReviewID": "gAK_Nj1ZUTQWbqd-WaxbvA", "Overall": "3.0", "Content": "This is a dependable place.  If you don't know what to eat, you can depend on this place for its variety.  And also depend on the food to be pretty good and for sucky service.  But who cares, just come in and don't expect people bowing down to your feet.", "Date": "2008-04-08", "Author_Location": "San Jose, CA"}, {"Author": "Karen N.", "ReviewID": "n-jyGxHjnjaNbfPMpoD6Uw", "Overall": "5.0", "Content": "The duck here is superb!  Crispy on the outside and juicy on the inside.  The flavor is just right.  A bit on the pricey side but if you want delicious duck, go to Kim Tar.", "Date": "2010-11-26", "Author_Location": "San Francisco, CA"}, {"Author": "Julie T.", "ReviewID": "5XgQnJPvr36qkmIWjJSugA", "Overall": "5.0", "Content": "I went out to dinner with my mama tonight and this place is delicious. This is one of my favorite chinese restaurant.  You want authentic, this is a great place to go. The service is not five star because these people are about delivering food to you fast so you're fed, these people work hard for their money because I see them everytime I go and they are super friendly if you ask them for water or tea. I don't mind the asking as long as they are friendly.  This is another one of those mama papa shops.  I love it here. It is also cash only, so remember to bring cash. I love their roasted duck with rice dish, I've had their hot and sour soup and my mom had a plate of noodles. Y-U-M-M-Y!", "Date": "2008-09-22", "Author_Location": "San Jose, CA"}, {"Author": "Lena D.", "ReviewID": "lzd7yxgwr-qTkuHlRe3gUQ", "Overall": "3.0", "Content": "3.5 stars based on to go orders onlythe fam usually picks kim tar or jade china for dinner when a home cooked meal is not feasible.what we like: house chow mein. this is a favorite because it comes \"wet\" and has that gravy that you sometimes have with chow fun. you can also order chow fun but we always order the chow mein. the shrimp is plump and the chicken is juicy. the veggies are plentiful but not overwhelming where you feel like you ordered a veggie chow mein with bits of meat. its a good combination. pook likes the fried rice here over jade. he likes the house fried rice which to me is standard. i dont think ive ever had amazing fried rice unless it was thai style so i'll leave this alone. we've also tried the mongolian beef.. which btw is NOT spicy. i think that is the first time ive ever seen a restaurant with non spicy mongolian beef. it looks and tastes more like satay beef. and whats funny is their satay beef is listed as spicy. i havent had it. i would not order the mongolian beef again. tonight we ordered the salt n pepper squid. i give it 1 star. it was missing the salt and pepper it seemed. it had absolutely zero flavor. i will not order this again.we also had the beef with broccoli which was quite tasty. juicy, and there was alot of beef and the broccoli was cooked well.good but not great but better than most. PS.. if you didnt order over the phone.. go next door to yogurt twist while you wait for your food. or go to hello desserts for a mango moo.", "Date": "2009-11-15", "Author_Location": "Milpitas, CA"}, {"Author": "Dana P.", "ReviewID": "2kFeJekK4eu-oYbca58cHw", "Overall": "2.0", "Content": "The service here isn't all that great but the food is good.  Sometimes I mistakenly order the wrong type of dish because the server(s) won't mention that there are options to how they can cook the dish.One thing I must also mention, I once order Shrimp Fried Rice.  During the time I was devouring the spoon full of fried rice, one of the spoon consisted of a chunk of salt, which then made me spit out the content.  That was not a good experience.I also do not like that they only take cash.", "Date": "2011-03-11", "Author_Location": "Sunnyvale, CA"}, {"Author": "Anna V.", "ReviewID": "VZdiHP71kKO-6yMUaHvZ4Q", "Overall": "4.0", "Content": "Kim Tar is home style Vietnamese/Chinese food with an extensive menu, cheap prices, and large portions.  I love their BBQ Pork and sauteed vegetables to eat with rice.  There definitely will always be something off the menu that would make someone happy.  This place is great with a group so you can just order a variety of dishes and share.", "Date": "2011-04-15", "Author_Location": "Milpitas, CA"}, {"Author": "Tony T.", "ReviewID": "_0qtPzlrGULuimyCSUvVWA", "Overall": "4.0", "Content": "This place is always our favorite Chinese restaurant for dinner.  They're very friendly as we have been coming here for several years.  The food is excellent and the size is plenty for family sharing.  I'd recommended this restaurant.", "Date": "2011-02-19", "Author_Location": "San Jose, CA"}, {"Author": "Katie W.", "ReviewID": "e3HuKf_j-k9ar4b-t4CzAg", "Overall": "2.0", "Content": "Place isn't that bad, most of the time their duck is good.. until they run out.. but sometimes its shady and all you get are bones. Also, don't substitute anything, they charge an arm and a leg for it.", "Date": "2006-06-02", "Author_Location": "San Jose, CA"}, {"Author": "Kevin N.", "ReviewID": "wScgdcOgsTVy_RkbXrbmow", "Overall": "5.0", "Content": "This is a great place for authentic chinese/ vietnamese food. It's not a fancy restaurant that you would bring your bf on a first date. Service is always fast and foods are always fresh. You have to try deep fried pork spare rib.  There are also good dessert places next door.", "Date": "2012-06-10", "Author_Location": "San Jose, CA"}, {"Author": "Jessica T.", "ReviewID": "qJ7MlXWUJIPyJzvrk2RZgQ", "Overall": "2.0", "Content": "this place isn't good. I was there last spring break I think with my mom, and my aunts and we all ordered noodles soup. THe noodles were ok, but the soup was terrible. Their soup was SALTY and there was WAY TOO MUCH ground beef in our soup. Trust me don't ever eat in there. The only good is the bbq deli. Their cha seu meat are pretty good...", "Date": "2007-01-06", "Author_Location": "San Jose, CA"}, {"Author": "Caroline L.", "ReviewID": "t2T_Oq8HCnplKMdCYNmPhQ", "Overall": "4.0", "Content": "Probably 3.5 for food, extra .5 for opening late! I love the fresh bbq pork rice noodle (chow fun) soup the best. Cheap, late night dining and huge menu selection.", "Date": "2011-10-01", "Author_Location": "Orange, CA"}, {"Author": "Tony T.", "ReviewID": "ndhGPfEjsxKWVJ0CuDGe4g", "Overall": "4.0", "Content": "There food is great but just a little heavy on the MSG. Their crispy backed pork is awesome! The service at times not the best but the food makes up for it. I like their Dry Beef Chow Fun in black bean sauce. I also like that they are open late.", "Date": "2013-01-01", "Author_Location": "San Jose, CA"}, {"Author": "Lei L.", "ReviewID": "LUofHI1SnBM1S_RdSYbtPw", "Overall": "3.0", "Content": "I like this place because it's some what clean, fast, and very affordable. I haven't tasted everything on their menu, but this is where I do all my large party catering for my kids birthday parties, and people usually ask where I ordered from - so that has to be a good thing. Here are my recommendations #1 Beef Chow Fun \"WITH BLACK BEAN SAUCE\" you have to change the regular sauce and request \"WITH BLACK BEAN SAUCE\" it's good in Seafood, Chicken, doesn't matter as long as you ask for \"BLACK BEAN SAUCE\". #2 Chinese Brocolli with Oyster sauce, I'm sure this is typical for any Chinese restaurant, but they serve it super hot and fresh, LOVE IT! #3 They have good sweet & sour pork! I'd highly recommend your party catering here! Otherwise you and your homie can go try personal portions...im sure they're the same hahahahah!", "Date": "2009-02-10", "Author_Location": "Milpitas, CA"}, {"Author": "Albert W.", "ReviewID": "-xk67xLA8210vjnGSA9w6w", "Overall": "5.0", "Content": "Kim Tar has been a restaurant of my childhood. I literally GREW UP eating here. I suppose that Kim Tar has been around for a long time. The food here was always praised by my parents, and im guessing thats where i get my critique-ness comes from. The food here REALLY resembles food cooked directly from Canton. I really tastes like the food they cook back at home. This is why it is very popular among the chinese community. All my chinese family friends know this fact. I grew up here eating the House Fried Rice and the mixed meat rice. These are still my favorites. The meat here is hung in the window like those in china do it. Its flavors are REALLY succulent and juicy. I recommend it to anyone who comes here. I also recommend the fried rice. This is something else. I have eaten it all my life, and up till this day, i still love it nonetheless. Its cooked with eggs, peas, carrots, bbq pork, and shrimp (along with some other herbs). The mix of flavor that they have here really brings out the inner flavor of the rice itself and i LOVE it. The last thing is the Spicy sauce they have here. For some reason,  i would be fully content with just coming here and eating the sate sauce with rice. Its got this peanut-like flavor/ texture that i can't seem to figure out. It goes great with just rice, fried rice, porridge, noodle soup, pretty much anything that they serve here. I grew up coming here, and i will always just keep coming back.", "Date": "2010-07-10", "Author_Location": "San Jose, CA"}, {"Author": "Linda N.", "ReviewID": "cwVCwgY2PyQ4vyQBdx3xSw", "Overall": "4.0", "Content": "pretty good Chinese food...if it wasnt because it is CASH ONLY, I'd probably go more often..highly recommend their seafood hot pot, sizzling beef and bean curd paste veggie.. yummss", "Date": "2011-06-05", "Author_Location": "San Jose, CA"}, {"Author": "Kimberly L.", "ReviewID": "_CTLUGaT_dTnOjoig9B77w", "Overall": "3.0", "Content": "Large portions for decent food. I typically order their deep fried pork chops with fried rice. It's not the best tasting food, but it sure hits the spot when you are hungry. It's not the cleanliest place, but the portions and proximity to my house makes me keep going back.", "Date": "2013-09-03", "Author_Location": "San Jose, CA"}, {"Author": "Joel S.", "ReviewID": "80_LXd7bKMNFT0OzBnxeQA", "Overall": "4.0", "Content": "Excellent food, excellent prices, horrible service, horrible ambiance.  But like others said don't let that scare you.  I actually think the hanging pigs adds to the feel of this place.  It is as authentic a Chinese restaurant as it gets.  You get a lot of food for what you order...if you get your correct order.  The guy taking our order couldn't understand very much english and was deaf to boot.  Not saying its a bad thing but we got one of our orders mixed up, no harm, no foul because the other order was actually pretty goood.  I'm not sure of the pricing for take out but I would recommend this place if only for the Fried Pork Chops.  These things are a delicacy.  I also love the honey walnut shrimp.  Give this little hole in a wall a shot...but be sure you have cash on hand, they don't accept credit cards.", "Date": "2007-03-02", "Author_Location": "San Jose, CA"}, {"Author": "Vivian L.", "ReviewID": "rf0BIIFCgshx3oCzN0kY5g", "Overall": "2.0", "Content": "This place wasn't  very good. I am fine with the restaurant looking like a hole in the wall but the food wasn't very good, either. We got the BBQ duck and pork with rice. It's one of the specialties and it was just oily with not a lot of flavor. Then we also got the beef chow fun which also, didn't have a lot of flavor. I just drank a lot of tea so the oil wouldn't make me ill but I wouldn't go back here again.", "Date": "2007-11-05", "Author_Location": "San Mateo, CA"}, {"Author": "Megan C.", "ReviewID": "7dEwPSeo76Wgft8JZO2Grw", "Overall": "3.0", "Content": "They're kind of mean to me because I don't speak mandarin/cantonese, but they're nice to my dad perhaps because he can communicate with them better. Eh it's an okay place..like an every once in a while thing. Usually not my top choice pick of chinese food..but that's just because I'm americanized. My family always orders the hainan chicken there. I like it because of the rice. Their add flavor to their rice. It's sweeter and meaty and oily tasting. I love it. But eh I don't really go here a lot. It's just an okay whatever place.", "Date": "2009-07-14", "Author_Location": "Milpitas, CA"}, {"Author": "Nasser D.", "ReviewID": "H7vuMFAD_SWRcwCiWy8q5g", "Overall": "2.0", "Content": "OK, i know this is a Chinese restaurant but please do not have your employees blow their nose in the front of the food. This was a while back but i was sitting down waiting for my food togo. As i sat there they have displays of their hot food behind the glass. So the employee, blows his noses and doesn't bother to wash his hands and puts a customer's food together. Bad bad bad..", "Date": "2009-12-06", "Author_Location": "San Jose, CA"}, {"Author": "Tiffany W.", "ReviewID": "Pqqqs-Ts8O1Fnp5UGeUr9A", "Overall": "4.0", "Content": "so the long awaited review for this place is finally here. when my special friend and i first met, we shared our love for our favorite food places, and Kim Tar was one of his. its a great little place to eat at especially if you're craving Chinese food. the price is cheap, and the food is very delicious. it tastes a lot better than your typical Panda Express which is Americanized Chinese food. it's cooked by legit Chinese-y people. haha, and by that, they all seem to have that origin. the food was great. i ordered the sweet and sour pork, and it tastes amazing like the restaurants in SF (:definitely coming back here if i'm craving Chinese food (: NOMS.", "Date": "2011-04-28", "Author_Location": "San Jose, CA"}, {"Author": "Kenny N.", "ReviewID": "UARrrM2pbymA-uZXExChaQ", "Overall": "4.0", "Content": "I come here a lot with my family, sometimes they order family style, you know, where we just order a bunch of plates and share it among each other, but today I came in and got my fixing of yellow noodle soup with wonton, fish ball, and many other great fillings. It's a great bowl for only $7.50 and filled me up a lot. I came here with my Grandma today, and she only finished half the bowl, giving the rest for me to finish tomorrow :). But they do have a ton of great things on their menu, just beware coming by this place if you don't like watching barbecued animals being chopped up in front of you. I'm always down to come back! It's right next to Hello Desserts and Yogurt twist too if you still have the stomach for that after that massive bowl of soup.", "Date": "2011-07-15", "Author_Location": "Milpitas, CA"}, {"Author": "Johnny J.", "ReviewID": "Xe3Eb-6IEFichAdhBvKaGA", "Overall": "3.0", "Content": "Not the worst hole in the wall Chinese food but not the best either.", "Date": "2007-08-02", "Author_Location": "San Jose, CA"}, {"Author": "Hoa Q.", "ReviewID": "X6V-DtWfP7GpskiSUXNg3w", "Overall": "2.0", "Content": "I love indiscernible bits of bones in my soup and old, greasy rice.  My friend got the sweet and sour pork and the wonton house special.  I ordered the hieu tieu Trieu Chau, which was the exact same as the wonton soup except with noodles, but you wouldn't know that unless you could read Vietnamese or actually read the menu.  I asked for my soup on the side several times in both English and Vietnamese.  The waiter understood me.  I got my noodles with soup.  I wouldn't be complaining except that the food wasn't good enough for me to finish.  And I never leave food on my plate.  Ask my bf, who thinks I'm a little piggy and wonders why I'm not fat.  On the positive side, the servings are decent to large and the menu is in at least three languages:  English, Vietnamese, Thai, and, I think, Chinese.", "Date": "2008-08-03", "Author_Location": "Santa Clara, CA"}, {"Author": "LuvFood S.", "ReviewID": "_6boXLwZlKmINdVR3pSpDQ", "Overall": "3.0", "Content": "Roast pork is alright...good portion of lean meat and the fatty parts with crispy skin...although the piece I snatched from BF's plate was a bit on the chewier side than crunchy.  BBQ pork was a bit hard/dry...flavor was okay.  Soy sauce chicken did not have any flavor.  Chicken was a bit dry...and there wasn't even any soy sauce drizzled on the chicken.  I like the pickled cabbage that came with the pork & chicken over rice.  I had a little extra something in my dish...a piece of plastic wrap from something...flicked it off my plate of food and didn't make a fuss over it.  Food came to the table super quick.  If I eat at this place again, I'll try either the noodle soup dish or something else.", "Date": "2007-11-18", "Author_Location": "Sacramento, CA"}, {"Author": "karenina c.", "ReviewID": "8g98mXZ1pL53C-3h7Rt9Sw", "Overall": "4.0", "Content": "I like the place, me and my family have been going here for as long as I can remember. We use to go every Sunday, the parking is a bitch on the weekends, but I think its worth it to eat here. and we always have left overs to take home..I love the calamari, seafood chowmein, and the walnut shrimp!! MMMM DELICIOUS. The prices are cheap, and they have fast service!", "Date": "2009-04-15", "Author_Location": "Milpitas, CA"}, {"Author": "Babbess C.", "ReviewID": "_7ipj5lE4Ur3vz9G8-b7Eg", "Overall": "4.0", "Content": "ahh my boyfriend loves this place... lolol! recommend the rice plates; fried pork chops over fried rice...sweet and sour pork over fried rice ( never fails!) beef steak over fried rice...salty fish fried rice is goooddd... but pretty fatty...open till 12am! we come here all the time... sometimes its really good... and sometimes its just okay...", "Date": "2009-06-08", "Author_Location": "San Jose, CA"}, {"Author": "Joey N.", "ReviewID": "pjgqekWhTptARu3vPN196g", "Overall": "4.0", "Content": "Place rocks man - we had it a few times as food to go with hello deserts. but then we actually had it. Beef chowfun - one of the best i've ever hadbeef chowfun wet style - this was suprisingly good. fried rice combo - i think seafood is better but it was good bbq pork fried rice - yumbasil/mint clams - yum yum - sometimes a little too much fish sauce but still yumchinese brocalie was ok - i guess i like the oil that dim sum places putRoast duck - yummy..hungry right nowthere was other stuff we ordered that", "Date": "2009-10-05", "Author_Location": "San Jose, CA"}, {"Author": "Catherine C.", "ReviewID": "aY6AWZSIPtGnOIZ8xvPpEA", "Overall": "3.0", "Content": "I've been coming to this plaza for years and I haven't tried this place out until today. My family and I came here at around 1:00PM and it was very busy. We waited for about 15 minutes in the cramped lobby area, due to the big parties. During this time, my mom and I looked over the menu and were looking at what to get. I saw one of the workers cleaning a table and wiping it down with the left over tea and a rag. Is this how they clean their tables? I thought that was a bit odd.. Anyways, after Yelping this place, I saw that the duck and the BBQ pork were very popular items. When we got seated, we already knew what to order, but it was hard to track down a server. Once we got hold of someone, we ordered the Salty Fish and Chicken Fried Rice, the BBQ Pork and Duck combo, and the Seafood Chow Mein. I was super hungry and once the food arrived, my family and I pretty much inhaled the food. The rice was salty and tasted like Nuoc Mam (Vietnamese Fish Sauce). The chow mein had way too much cornstarch in it and wasn't all that great. But then the bbq pork and the duck were AMAZING! Overall, the service sucked and the food was mediocre EXCEPT for the duck and the bbq pork. The restaurant was grimy, there were no toilet seat covers in the restroom, and they only accept CASH!", "Date": "2010-05-10", "Author_Location": "Fremont, CA"}, {"Author": "Christine M.", "ReviewID": "g2GDcgcJLtrVdZly-9oFBQ", "Overall": "3.0", "Content": "we were looking for a quick bite to eat before goin out.  This was one of few places open late in the area. We ordered the salted fried chicken, chicken fried rice and the crab fried rice and shrimp porridge.  The chicken is something I would probably order again and the fried rices were decent nothing really stuck out or wowed me.  Another fail of ordering the porridge It was bland and the shrimp didnt taste so fresh. Oh how i miss my joy luck cafe in san mateo. I am still heartbroken that they closed down and I still havent found a place to get my porridge fix.", "Date": "2011-07-08", "Author_Location": "San Mateo, CA"}, {"Author": "Christopher U.", "ReviewID": "AJzHfS5FPCudhLIpRrGTvQ", "Overall": "4.0", "Content": "Service isn't their selling point so I guess it must be the food. I go there for lunch and usually go for something over rice. They give plenty of rice so usually one lunch is good for two meals. My coworkers order the chow mein often and there's a lot of food piled in that styrofoam container. But cash only!", "Date": "2007-03-20", "Author_Location": "San Francisco, CA"}, {"Author": "Brian S.", "ReviewID": "N8YFyyLCTo8uvQ9YSHpYWw", "Overall": "4.0", "Content": "I can only say the fried rice is good here. I haven't really tried anything else. Service was quiet - they just take your order without saying anything and flee to the kitchen... I found it amusing.", "Date": "2009-03-16", "Author_Location": "Sunnyvale, CA"}, {"Author": "Jillian S.", "ReviewID": "is_Hbiqar1c5KrzQNj4i2A", "Overall": "4.0", "Content": "There have been months where I'd be here at least once each weekend. Been coming here for as long as I can remember with my family.  The waiters would always remark on how I read all the time(which is rude to do at the table now that I look back on it...).Anywho, the thing we alwayyys order is the House Special Fried Rice, read Albert W.'s review under this one. He gets it. Mm, Salted Pepper Pork Chops are deliccccious, but you might want to tap off some of the msg crystals before taking a bite haha. I really just like everything here. Particularly though I will recommend the Heinan chicken(white, comes with ginger sauce which you will want a second bowl of), Salted pepper fish(request the fish sauce concoction instead of the sweet and sour sauce), onchoy(green leafy vegetable cooked with garlic, not always in season though), fish and chicken fried rice(As smelly as it is delcious, very much that is), roast duck(personally not a fan of duck but my family loves this, especially in the egg noodle soup), and the beefstew. Oh ! And the chow fun(add the red oil and pepper from the condiments!) and the mongolion beef. And I will declare the salted pepper dquid skippable, just go to Bo Da. Service is quick. The waiters are all very lax but polite. And the tea is free which I always like.So if you are a-lookin for some affordable legit chinese food. This is where it's at.Damn, I'm hungry now.", "Date": "2010-08-30", "Author_Location": "San Jose, CA"}, {"Author": "Aldouse H.", "ReviewID": "TfBP3Jp-YyNfSgkv_2UUuQ", "Overall": "4.0", "Content": "Great Chinese food!  Im here to order their BBQ Pork plate and their Salted fish and chicken fried rice.  I love the food and service is pretty decent.  only bad feedback i'd have of this place is that its cash only.  other than that, definitely worth being a regular at.", "Date": "2011-06-14", "Author_Location": "Milpitas, CA"}, {"Author": "Amy T.", "ReviewID": "iGvQiPUg_-J-MPELcuDRDQ", "Overall": "4.0", "Content": "This is a really convenient place if you're in the mood for some Chinese/Vietnamese food, especially if it's late because I believe they're open until midnight. The bf and I come here when we don't cook or want something simple-comfort food of you will. We usually get the beefsteak over rice. The take out portion is enough for two people, unless you're a growing boy or have a huge appetite. They do have a dining area and roasted meats in the front. Haven't had a problem with service here, they have always been nice :)", "Date": "2011-07-19", "Author_Location": "Milpitas, CA"}, {"Author": "Rae A.", "ReviewID": "RDxhWrkfNteICa1EdXy-rw", "Overall": "1.0", "Content": "First Impression: OK, I have a few things positive and negative comments about this place... When I first laid my eye on this place I immediately noticed the ducks hanging on the windows. This place is pretty hidden if you never been in this complex. This place doesn't look very sanitary, it's pretty dirty and really needs a major fixer-uper! I just have to comment on their rug because it doesn't seem they ever cleaned it, with stains and gum that already turned black because of dirt... just awful! Their food is OK, nothing amazing besides their Crispy Pork Chops and their Duck Yellow Noodle Soup. The price is pretty average, I mean it better be because I don't see any reason why they would make this place above average because everything here doesn't reach my standards. The service is also FAIL, they always seem to take your order quite fast so they could either sit back down or continue talking to the other workers or even finish eating! I just find that pretty rude when customers like me are still coming here and if you ask me that's a pretty important reason why their still working.Last Impression: I do admit I come here a few times only because I crave for their Crispy Pork Chops but other than that, I can always go to another Chinese Restaurant to satisfy my tummy. This place is FAIL!Check out my photos I posted!", "Date": "2011-09-01", "Author_Location": "San Jose, CA"}, {"Author": "Tim L.", "ReviewID": "5cRHdr6Pqw4bLg5D1Cii3A", "Overall": "3.0", "Content": "This place is really close to a lot of my favorite drink places. Eat here then go get a drink at bambu or barcode. You can also get take out bbq like the bbq pork and duck. When i come here i always get a rice dish with bbq pork. Its my favorite. Its a cheap restaurant and is very asian. Don't expect outstading service or anything, but just a meal that will fill you up.", "Date": "2008-09-01", "Author_Location": "San Jose, CA"}, {"Author": "Angie L.", "ReviewID": "dLmTdc_MWZf-gowVPwVkWw", "Overall": "3.0", "Content": "this place is just average chinese food, nothing really all that special. but its yummy and affordable, so i like it :] whenever i'm feeling blue or like i'm gonna get sick or i'm already sick... i'll go here to get porridge and youtiao (fried bread). the serving is really big and i always leave feeling better. they only take cash here though, so be prepared. they do have an atm machine in the back of the restaurant... but it sometimes doesn't work. oh and the waiters all speak mandarin, cantonese and vietnamese! i don't know why thats important but i always found that to be impressive, haha. this place is also open pretty late and thats always a plus :]", "Date": "2008-09-15", "Author_Location": "San Jose, CA"}, {"Author": "Sabrina D.", "ReviewID": "xYLA4oFSk30DtzsC2bKP-Q", "Overall": "1.0", "Content": "We ordered food to go last night. We picked it up and brought it home. We ordered honey walnut prawns, beef tomato lo mein, fried pork chops, and broccoli chicken. The food was alright. I've had better honey walnut prawns. Around midnight my hubby started feeling weird! He started getting fever and chills, then the diarrhea came! He got food poisoning! I had to take him to the emergency at 4am and he still has diarrhea today! He told me he ate a piece of meat that was still red, but when he noticed it, it was too late and he'd already swallowed a piece! Be careful! Don't eat here! I'd rather go to China Stix, Phu Lam on Story, or Wing's in Japantown! We live right behind Kim Tar too, but the proximity is not worth it!", "Date": "2009-04-16", "Author_Location": "San Jose, CA"}, {"Author": "Huy D.", "ReviewID": "h2dhs2vsBNT3oLbQDdheBg", "Overall": "4.0", "Content": "I like this place since it's convenient and it's close by. They're open very late as well. Overall all their dishes are very good and the prices are pretty good as well.", "Date": "2010-12-05", "Author_Location": "San Jose, CA"}, {"Author": "Michael W.", "ReviewID": "Lm9xUI0fWtBITJ9U26Us2Q", "Overall": "3.0", "Content": "Kim Tar is a pretty out of this world name, at first I thought it was tri lingual", "Date": "2011-12-14", "Author_Location": "San Jose, CA"}, {"Author": "Reaksmey L.", "ReviewID": "m_f4RSfQejNTsdOuGjjvww", "Overall": "5.0", "Content": "I live down the street from here and this is one of my favorite restaurant to go to. Customer service is great and the food is as good as it gets. It's also right next to many dessert places.", "Date": "2012-09-07", "Author_Location": "San Jose, CA"}, {"Author": "Quanghuy L.", "ReviewID": "hHZhfQGQwpQDtKXApNpRog", "Overall": "4.0", "Content": "Great for late night dining.  I've gotten the beef stew over fried rice three times now.  SCRUMPTIOUS!  The service is like any other asian restaurant--mediocre.  The to-go wait is pretty short, like ten minutes.  I would eat here again if I'm in a rush or craving some tenderness-loving-beef.", "Date": "2008-09-14", "Author_Location": "Los Angeles, CA"}, {"Author": "YELP U.", "ReviewID": "d_s3u0FZXaVaWGAAc0ERVw", "Overall": "5.0", "Content": "Food was good & price is cheap.I'll be back.", "Date": "2010-03-17", "Author_Location": "Eureka, CA"}, {"Author": "Mike N.", "ReviewID": "geEL8J7kRR4IbCyCsieb_A", "Overall": "4.0", "Content": "Must try, there open late until 12am. Its a hit or miss sometimes with them. I always order the salt and pepper squid, spare ribs, and the chow fun. Service is always good but its a cash only place. SO bring cash", "Date": "2010-06-07", "Author_Location": "San Jose, CA"}, {"Author": "Polly B.", "ReviewID": "qTnToZBs66bY3rNkSmURdg", "Overall": "4.0", "Content": "Been here plenty of times with my family. The food is good and the price is very reasonable. It's open late so you can always go grab a midnight. I enjoy the shrimp fried rice because it has that smokey taste to it, which I love! Another is the fried squid. The portion is big compared to other restaurants that I've been too. The only downfall is the service. Our glass were all empty and when I asked for water, the waiter only refilled mine. And never came back. But overall, I love this place!", "Date": "2010-11-16", "Author_Location": "Sunnyvale, CA"}, {"Author": "Chi-Chong s.", "ReviewID": "Vm6aED6NRat_ZI8am6_moA", "Overall": "2.0", "Content": "Foods really good, well the fried pork ribs are perty good, and their fried rice.  But the service stinks man, its like you dont even exist.  It like puling teeth just trying to get their attention.", "Date": "2008-10-14", "Author_Location": "San Jose, CA"}, {"Author": "Jessica C.", "ReviewID": "eTScCoZ1omtCm2DFng5gtQ", "Overall": "4.0", "Content": "My family's been eating here for 20 years. They have consistently good, no-frills Chinese food. Typically, my brother and I would order a to-go box (I usually get the mapo tofu with rice) for $7.90, and their portions are large enough that I can split that into two meals; my brother usually has leftovers if he buys one of those boxes.", "Date": "2010-12-12", "Author_Location": "Cambridge, United Kingdom"}, {"Author": "Eric S.", "ReviewID": "CyES_ZQCChj0eWUq5vQe_A", "Overall": "2.0", "Content": "Food is excellent. 2*s for the service. No smile. No greeting. They come to you with pen and paper.", "Date": "2012-02-15", "Author_Location": "Santa Clara, CA"}, {"Author": "joe m.", "ReviewID": "XABOHmJSLBZp-nLKm3IuBQ", "Overall": "4.0", "Content": "Love the bbq here and also the beef cube with lettuce. Great place for late dining  and good portions as well. I am a fan of kim tar", "Date": "2011-06-27", "Author_Location": "San Jose, CA"}, {"Author": "Jake R.", "ReviewID": "G1zuTFFwMX0U3lxdwOIGvg", "Overall": "4.0", "Content": "For a relatively small and hole in the wall restaurant, this one is actually very good.  The inside is not as clean as I would like to see it but the food is good!", "Date": "2011-08-26", "Author_Location": "Glendale, CA"}, {"Author": "Mary L.", "ReviewID": "LEeFYikfy1ZUKJfYqdyprg", "Overall": "3.0", "Content": "Came here once, recommended by a friend. I got their BBQ fried rice, it was good. I decided to order party trays from them. I ordered one House fried rice, one house chow mein. It was nice to know I can order it an hour ahead and they can prepare it in time. House fried rice was good, as i expected. The house chow mein looked good...but once we dug in...the noodles tasted floury and the noodles had too much sauce on it...so it looked like wet noodles versus fried noodles. I should have skipped the noodles, wasted my money. 3 stars for the prompt service, and the fried rice. MINUS 2 for the crappy noodles due to being under cooked  and too much sauce.", "Date": "2012-02-15", "Author_Location": "San Jose, CA"}, {"Author": "Hen A.", "ReviewID": "D93WAIpsmYe3bVdEt_8lQw", "Overall": "3.0", "Content": "chinese duck and pork bbq hanging by entrance window...take-out counter with lines for pick up at front...seated back in restaurant...old waiter quick to pass out menus...few orders of noodles, a chicken dish and roast pork....portions extra large..$eight meals mostly...grand noodle plates and meats plenty...big portions, but noodles bit overcooked bloated soft...roast pork served with sweet fresh large pickled vegetables sides tasty and enormous mountain of rice drizzled in sauce decent...but, rice old, dry and flakey...decent large individual meals near or under $ten...sizing large enough to make two meals...", "Date": "2010-06-22", "Author_Location": "San Mateo, CA"}, {"Author": "Eugene L.", "ReviewID": "r6J3GBV-UE2LnSNSLfuY6g", "Overall": "5.0", "Content": "Damn I love this place it has it all. Interesting People to watch ,Great Food , Deli Counter in Front and Old School Waiters. Its the South bay Version of Oakland's Gold Medal Restaurant in C-Town. KT is located in the Ranch 99 Strip Mall on Hostetler. I wander in and grab a table and a Waiter that looks like the Asian Dough-boy from Boyz In The Hood gives me a menu LOL. I saw that they offered a Seafood Hot Pot so I ordered that and Steamed Rice. While I was waiting for my food ,I started to people watch. There were 2 good looking Asian Girls wearing the shortest Mini Skirts that Ive ever seen , 3 Asian Guys wearing FUBU gear with their pants almost around their knees with their Boxers Showing , Some guys wearing full Camo and 1 Elderly Asian guy that looked like Flavor Flav. What a cast of Characters. The Waiter Dropped me off a Pot of Tea and a Pot of Steamed Rice which I like . They don't try to Nickel and Dime you with little bowls. Then the Waiter brought me the Biggest Calderon of Seafood that Ive seen on top of a Sterno Burner. I'm in Heaven. The Seafood Hot Pot had Shrimp ,Scallops ,Squid ,Bock Choy, Broccoli, Black Mushrooms ,Garlic , Fish Fillets and Baby Corn on the Cob in a Savory Gravy. It was Delish . That Hot Pot seemed Bottomless with Seafood Goodness. Its open to Midnight . Cash Only . KT Rocks.", "Date": "2010-06-11", "Author_Location": "East Bay, CA"}, {"Author": "Henry Y.", "ReviewID": "IHzAu52zJEUrJ3txPsY8Pg", "Overall": "2.0", "Content": "other than a spotless toilet, why buy half a skinny duck here for $7.56 when you can get a chubby one for $6.29 just 20 yards away at the ranch 99?", "Date": "2007-12-03", "Author_Location": "Palo Alto, CA"}, {"Author": "Ngoc L.", "ReviewID": "OkVPEks74Huxu0hGJ-j1Kg", "Overall": "3.0", "Content": "I used to go here a lot back in the days but stopped after I moved away from college. I recently came here for a late night meal.. Since it's one of the few restaurant that's open late.. 7 days a week. The food here is still as good as I used to remember and they give you so much. There were 4 of us and we ordered 3 plates to shared and we ended up not being able to finish anything. One of my all time favorite dish here is their salt and pepper squid.. They make it so crispy and good. We also ordered their house special wet chow fun and their salty fish and chicken fried rice which both turned out good. They were also very fast, our food came out within 5 minutes after we ordered.. Maybe it was because there were only 3 other parties besides us. But Ive noticed that this place gets pretty busy during the weekends cause I usually go hello dessert which is right next door to this restaurant. The prices here are pretty reasonable, my only complaint would be that once again it's those typical CASH ONLY restaurant. On the contrary, they have an ATM inside the restaurant thought but paying the little fees are annoying.. I'd rather use that money for a milk tea a couple doors down at Bambu!", "Date": "2012-03-20", "Author_Location": "San Jose, CA"}, {"Author": "Vivian K.", "ReviewID": "HKUCpCJiPYmH4lpt2jOEZQ", "Overall": "1.0", "Content": "I've eaten here several times and their food is alright. I usually go for their fried rice plates, and they give you a lot. Like many reviewers have said, it's nothing fancy but it fills the stomach after a long day. I've never experienced horrible digestive problems here... despite the giant ROACH my friends and I saw crawling on the wall the last time I went. But I did lose my appetite and I am never coming back here again. What sucks is that my boyfriend loves their beef stew (looks really gross to me) and keeps trying to rationalize all the bad reviews on here to try and change my mind on going back. I'm sorry babe, but a giant roach, glass cleaner on food and a rat crawling across the floor in the middle of daylight cannot be rationalized. What's funny is that my bf saw the roach too and it still hasn't grossed him out enough for him to never go back. \"let's go, maybe they've changed\" he would say. ummm no.", "Date": "2009-02-08", "Author_Location": "San Jose, CA"}, {"Author": "Peter T.", "ReviewID": "hCUygUs6Z2_9tohrmiQYJQ", "Overall": "5.0", "Content": "If your looking for good authentic Chinese food, these is the best place.  Everybody loves the fried pork chops.  They are also open til midnight so it's perfect for those late night cravings.", "Date": "2008-09-29", "Author_Location": "San Jose, CA"}, {"Author": "Paul A.", "ReviewID": "aGCtLRjvoAtYI552v_3Bxw", "Overall": "3.0", "Content": "over priced and the bbq was getting a bit on the dry side of things. the rice was a bit dry too.  maybe it was the time i went - it was around 10pm.  friendly service...but somehow i felt like i was eating at one of those Chinese restaurants run by the Triads. i seriously saw \"boss\" looking characters step out from the back one after the other.  clean bathrooms.", "Date": "2006-09-09", "Author_Location": "Oakland, CA"}, {"Author": "Stephen M.", "ReviewID": "9bDSzug8ULiZLSNkP7uVNQ", "Overall": "4.0", "Content": "good fried rice and fried pork chops", "Date": "2012-10-01", "Author_Location": "San Jose, CA"}, {"Author": "Evelyn N.", "ReviewID": "r8lU9GvIg6IK1ei0ys4nWw", "Overall": "3.0", "Content": "I heard about this place from family friends and friends as well. My fiance and I came in the other night (because they rock and they stay open until midnight!) to satisfy a late night craving. I've also seen this place many many times because it's right next to Hello Desserts, tucked away in the corner on the other side of Goldilocks. Anyway, so we came in and were surprised at how much more space they have available in the back for dine in customers. We dined in, and were seated promptly by a very kind asian man. They gave us a lot of time to look over the menu, which I appreciated because they have such a wide variety of selections! We finally ordered the pork chow mein, with the sizzling beef plate with a side of rice (which they didn't charge us for!). They give you free Jasmine tea at the beginning of your meal to have throughout the meal. Our food came out in a timely fashion and was delish! I loved the sizzling beef plate because it was semi spicy with lots of sauce, and not TOO oily like most Chinese food tends to be, The prices are reasonable and I enjoyed eating there. The place looks a little run down, but most of the things there seemed pretty clean to me. The chow mein was a bit on the bland side, but it still tasted mighty delicious! I would definitely come here again! (:", "Date": "2009-08-07", "Author_Location": "Milpitas, CA"}, {"Author": "Johnny S.", "ReviewID": "ihaeyQmWeVFeQ58bP8YGFA", "Overall": "3.0", "Content": "good food. large portions. cheap. can't ask for anymore or any less. i shall return!", "Date": "2012-09-23", "Author_Location": "San Jose, CA"}, {"Author": "trixia g.", "ReviewID": "Puahs78Zo1KN8u5HHGKe2Q", "Overall": "4.0", "Content": "i like their house fried rice here. they also have shrimp fried rice but i thought the house fried rice was better, in price and quality. thats all ive tried. the place is pretty small and the employees seem snobbish but theres a few who are really nice.  they only accept cash here so make sure you have cash before coming here =]", "Date": "2009-03-14", "Author_Location": "Fremont, CA"}, {"Author": "Dennis R.", "ReviewID": "2UMRHUe4sO42O94TrWrW6Q", "Overall": "4.0", "Content": "hot and sour soup, sweet and sour chicken, bbq pork fried rice... all good!!! there's a waiter who always remembers my order...", "Date": "2010-12-04", "Author_Location": "San Jose, CA"}, {"Author": "Phuc B.", "ReviewID": "JIm1wD4JUswDIJXxHavgmQ", "Overall": "3.0", "Content": "not bad, roast duck was good, roast pork was dry, the clams were pretty damn good. friendly service.", "Date": "2011-06-10", "Author_Location": "San Jose, CA"}, {"Author": "Jeff O.", "ReviewID": "bok9AEThxxjYYQHXJztzqg", "Overall": "4.0", "Content": "The place my family will go for crab meat fried rice, fish fillet rice noodle soup, house special duck tongue, kidney, etc. Great food and reasonably priced menu.", "Date": "2011-07-16", "Author_Location": "Fremont, CA"}, {"Author": "Zito R.", "ReviewID": "tdGyTF-j00CsPRXyGrG-TA", "Overall": "3.0", "Content": "the reason why i give this place 3 stars is because every time i come here the service is kinda crappy. the food is pretty good but taking our orders can take awhile, the same as getting refills for water. i", "Date": "2009-09-14", "Author_Location": "San Jose, CA"}, {"Author": "Lucy J.", "ReviewID": "kv1vPDS8r313x6KxStQOqQ", "Overall": "4.0", "Content": "Really good AUTHENTIC Chinese food! (ie no orange chicken!). Was taken here for dinner by friend and her husband. Trust me, this is not anything like Panda Express! The food was not too greasy and was perfectly balanced jn flavor. Ordered the fried chops, fried rice, chow mein and some seafood dish with scallops, veggies and shrimp. All of it was good. Also, try the fresh squeezed OJ.. They put salt or something in it and it tastes really refreshing! They also had a bunch of fresh BBQ meats hanging in the window. Would def come here again.", "Date": "2010-08-07", "Author_Location": "Sunnyvale, CA"}, {"Author": "Ryan J.", "ReviewID": "CkxorSpeN6588KwGbg454w", "Overall": "3.0", "Content": "This place is good.  its open pretty late and the food is good and with huge portions.  the server i usually get is borderline rude, but i guess that makes for a true authentic chinese place (not to be offensive).", "Date": "2010-12-22", "Author_Location": "Foster City, CA"}, {"Author": "Jhomelz R.", "ReviewID": "2f4fcGE3eJaOcv_Oy2mXwQ", "Overall": "4.0", "Content": "we always go over here. the food is awesome. the house fried rice. fried pork chop is the bomb!", "Date": "2011-08-28", "Author_Location": "San Jose, CA"}, {"Author": "Lanh T.", "ReviewID": "3CVrHtvXZxnQaAZcaxwz2g", "Overall": "3.0", "Content": "OK place for lunch and dinner, but their pork barbeque (xa xiu) is delicious.", "Date": "2010-03-05", "Author_Location": "San Jose, CA"}], "RestaurantInfo": {"RestaurantID": "5MQNFFn15zTvUqxq6fxt-w", "Name": "Kim Tar Restaurant", "Price": "$", "RestaurantURL": "/biz/kim-tar-restaurant-san-jose-2", "Longitude": " -121.8837035447359", "Address": "1698 Hostetter RdSan Jose, CA 95131", "Latitude": " 37.387697696685798", "ImgURL": "//s3-media1.fl.yelpcdn.com/bphoto/i1HX3w0QheAdBsJqJbFeww/90s.jpg"}}