{"Reviews": [{"Author": "Syd S.", "ReviewID": "qehnfwyqH6_xn8Ny3BWLeA", "Overall": "4.0", "Content": "Finally!!..I've been fortunate enough to have worked for Thai's and traveled to Bangkok and Chaing mai  several times tasting home cooked thai food..;) Once you've tasted the real deal the search is on...my quest for the delicacies of a fragrant smooth green curry chicken has succeeded here! Yum ....Next ...will I find honey glazed sticky rice with mango and a great foot massage???...", "Date": "2014-05-01", "Author_Location": "Minneapolis, MN"}, {"Author": "Krishna N.", "ReviewID": "qQckebDPqpGgUBqeIXxdWg", "Overall": "3.0", "Content": "The food was OK, tasted decent. The service was good.But it is certainly not worth $14-$17 prices for the 'Thai curry Specials'. The Thai curry special prices are not listed by each item in the menu, so be careful. Also, by 'Special' I am not sure if they mean that they rotate the curries that they have every day? They certainly are not lower price (which is the meaning I take from the word in most other restaurants).The Laab was not minced well enough and the cilantro did not feel fresh.", "Date": "2014-04-29", "Author_Location": "Saint Paul, MN"}, {"Author": "Leah S.", "ReviewID": "6gxC1XXazdSEk0C6wCLbtw", "Overall": "4.0", "Content": "Some of the Best Thai food I have ever had, but the service is sometimes spotty.I'm a fan of their's for many reasons:They support local farmersThey give back to their communityThey understand what you are ordering even when you can really only get out the first syllable. This is big for me, the menu names are confusing enough let alone pronouncing them, but every order has been spot on including my numerous phone orders for Thai take out.Some tips on ordering:Get the Po Pia Tod and the Miang Kam for appetizers (go for Happy hour and they are half off with a drink)Geow Naam Moo Daeng is a delicious soup/entreeGet the curry special for that night you won't be dissapointedTheir Pad Thai is good - but you can get that anywhere - try other dishes!  They won't dissapointIf you need dessert get the Khao Neow Mumuang, I am ususally too full but if I have saved room this is always great.Another thing to note, they don't take American Express.", "Date": "2014-03-28", "Author_Location": "Northeast, Minneapolis, MN"}, {"Author": "Jake R.", "ReviewID": "FWXMuEhJp5ZaoX0vHnaiUA", "Overall": "5.0", "Content": "My go-to neighborhood spot for something out of the ordinary yet always impressive and delicious. Do not miss the Naam Prik Ong (spicy chili dip with ground pork accompanied with fresh veggies and pork rinds) or the Geow Naam Moo Daeng if you're looking for a good Pho-like soup. Nicole is a great bar manager who keeps the taps local and fresh to accompany the food and Joe is beyond great whether he's serving you or just to chat and catch up with.", "Date": "2014-07-09", "Author_Location": "Minneapolis, MN"}, {"Author": "Elizabeth B.", "ReviewID": "AVpkDgmT5uo3yEYv4opLoA", "Overall": "5.0", "Content": "Found this restaurant on Yelp and was so glad I did! I just wished lived in the area so I could eat there weekly! Ate there with my family and we all ordered something different and shared with each other and we didn't have a bad dish in the bunch. Would definitely recommend to all!", "Date": "2014-07-07", "Author_Location": "Bemidji, MN"}, {"Author": "Amanda K.", "ReviewID": "7CA7WlNkLBvVOyssYLargg", "Overall": "5.0", "Content": "This is the best thai food I've found in NE!! I took a few friends out for a birthday lunch, and having never been in before didn't really know what to expect. We walked in to a clean, well lit, AMAZINGLY good smelling restaurant. Our server was sweet and very helpful with the menu. Each and every dish we got was hot, fresh and DELISH!!! I would highly recommend trying whatever curry special they have!Did I mention the mango sticky rice?! I haven't stopped thinking about it since!! I must go back soon!", "Date": "2014-05-06", "Author_Location": "Minneapolis, MN"}, {"Author": "Tony W.", "ReviewID": "zM3dQX7dFKoN3mYda0Wo4g", "Overall": "4.0", "Content": "Sen Yai Sen Lek is by far my favorite Thai restaurant, and everyone I bring there agrees. If you're vegetarian or vegan, you'll love Sen Yai Sen Lek's options, but be a little cautious because several staff members consider fish sauce to be vegetarian. I've received 'vegan' dishes with egg in it before, too.The Taohoo Tod (tofu with a peanut cilantro chili sauce) is vegan, and the Pad Thai Goong is vegan if you tell them: \"vegan with (tofu or mock duck), no egg, no fish sauce.\" Both are amazingly delicious, and pro tip: save the peanut cilantro chili sauce and add the remainder to the pad thai. It sounds like the kitchen has a separate vegan sauce and takes it seriously, but they're not great at communication about it: the menu doesn't have marked vegan options, the staff isn't great about knowing what is and isn't vegan, and to-go orders don't always have 'vegan' written on them. I've received conflicting information about what is and isn't vegan, which could easily be solved with a clear menu.", "Date": "2014-01-13", "Author_Location": "Minneapolis, MN"}, {"Author": "Anya O.", "ReviewID": "LKzlu-siXvNpb4YdC3mTBA", "Overall": "5.0", "Content": "This is my favorite Thai restaurant in the cities. The food is always good. Try the pad panang curry and add mango. So amazing. I have never had a bad meal or service at sen yai.", "Date": "2014-05-02", "Author_Location": "Northeast, Minneapolis, MN"}, {"Author": "sam a.", "ReviewID": "ECh2qXnuY4uVA9hzVl9Bhw", "Overall": "1.0", "Content": "I want to like this place, I live down the street and I really want to like this place as I hear so many good things.The first time the food was decent though a bit pricey and the server was slow and absent minded.The second time we went back we waited 10 minutes next to the \"wait to be seated\" until the host came, and helped the couple that walked in 5 minutes after us.There was probably only 4 tables occupied in the whole restaurant but the server decide to seat us far from anyone else in a dark corer next to the bathroom. We got up and left.I don't really like being treated like a leper for the privilege to spend twenty bucks on noodles. I'll stick with Karta next door where the food and service are always great.", "Date": "2013-12-19", "Author_Location": "Minneapolis, MN"}, {"Author": "Carolyn B.", "ReviewID": "pa-jeE78yZlUEkb3ZBxpyg", "Overall": "3.0", "Content": "After being somewhat underwhelmed the first time we tried this restaurant, we decided to give it a second chance. Unfortunately, it didn't grow in our esteem. While I appreciated the server checking in on dietary restrictions, the food just wasn't that good. I got the pad thai with mock duck and it was pretty dry. My husband's noodle dish was a little better, but with all the great thai options around town, I don't think we will be back. Also, the service is a little lackadaisical. The server meandered past our table several times without clearing our dishes or filling our water. There are better thai food experiences to be had in the twin cities.", "Date": "2014-03-24", "Author_Location": "Minneapolis, MN"}, {"Author": "Mike S.", "ReviewID": "Pg9ujABqWqgEf-PE4yS1dA", "Overall": "5.0", "Content": "I went here because the other Thai place I always go to when I'm feeling the crave. A friend recommended this place and was blown away! I absolutely loved the options of spices you could add to your dish. YUM! It was hard to resist eating all the food (and there was plenty) for the left over meal.", "Date": "2014-01-06", "Author_Location": "Downtown Minneapolis, Minneapolis, MN"}, {"Author": "Ashley J.", "ReviewID": "PetODbD4cGJGl83fl4j_cg", "Overall": "2.0", "Content": "I judge Thai food's quality by how much extra seasoning I have to put on it in order to make it taste good. Let's just say there were no more prik nam som (pickled jalapeños) left in the spice rack. I got Pad See Iew Gai and it was mediocre but better than my boyfriend's special curry. I recommend skipping the 6-dollar spring rolls. The rice paper is thick and chewy, not the thin soft wrapper it should be. Overall, this place is overpriced and mediocre. I don't know why it gets such good reviews. The server was slow and overly loud. At least they have some nice beers on tap. For Thai in Minneapolis, go elsewhere.", "Date": "2013-10-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Heidi T.", "ReviewID": "BQRF-XhLm97VhcVuBV0xuQ", "Overall": "5.0", "Content": "Out of all the Thai restaurants I've been to, this is my favorite. I used to live by them and was a regular customer. I usually got the Pad Panang or their curry special. I actually learned how to make curry at home because I loved it so much. Sometimes when dining in I felt like the server would forget about us toward the end. I'm giving five stars anyway because the food makes up for it. Also has a nice decor and atmosphere.", "Date": "2014-04-14", "Author_Location": "Minneapolis, MN"}, {"Author": "Annie D.", "ReviewID": "tq_Cm7h3nSoxkSRf8tPs3g", "Overall": "3.0", "Content": "Well, it took me three years but I finally came back and it was not as unfortunate as my prior visit so I thought an update was in order. As I mentioned before, I love that they work with local farms and seem to care about their neighborhood community and environment. I really and truly respect this. The space is comfortable and the service wasn't off-the-charts, but it was much improved (it was also a very slow lunch hour). The main gripe (again) is that I still wasn't very impressed with the food. I was feeling a cold coming on, so I ordered the Tom Yum soup. It's a generous portion (with lots of chicken), but it just wasn't all that flavorful until I added some chili oil. They bill it as \"spicy-sour,\" but I did not taste a hint of heat when it came to the table. We started with some crispy spring rolls, which were standard but good. But then the soup fell flat.My two friends that lived in Thailand still rave about their curries of the day (yesterday they offered red or green), but, for me, On's in Midway remains at the top of the Thai food chain overall.", "Date": "2013-09-12", "Author_Location": "San Diego, CA"}, {"Author": "Steven D.", "ReviewID": "pGjZyA_XRNDz2NQQeTrXnA", "Overall": "4.0", "Content": "Who would've thought there would be good Thai food outside of the city in the suburbs. I saw another Thai restaurant across the street as I parked as well. I didn't really see any American wait staff like other reviews have mentioned. Fish cakes were crispy and had some spicy kick to it.. me likey! Comes with the cucumber dipping sauce to offset the salt and spice. Pad Thai is one of the better I've had, even including Philly! Noodles were tender, shrimp was cooked well. I can't speak for the portion size in the restaurant, but in the takeout it was a lot! My favorite dish would have to be the Khao Soi (thanks Yelpers for pointing that out!!). I'm a sucker for mustard greens and cilantro! The broth was so flavorful, rich, and creamy from the coconut milk. I kind of wish the beef were bigger chunks or slices instead of small dices. The first time I ordered from there they forgot my Thai tea, so if you ever order pick up, make sure to check your order before you head out. Not saying it was intentional, I'm sure they just forgot. I think I would come here at least once a week when I'm back in town.", "Date": "2013-11-14", "Author_Location": "Philadelphia, PA"}, {"Author": "Jonathan T.", "ReviewID": "xcUki5b6UIjjtBArzAda9w", "Overall": "3.0", "Content": "I love the fact that Sen Yai Sen Lek supports local farmers, but unfortunately the food was a bit boring for me. Here's what I had:-Tod Mun (curried fishcakes with kaffir lime leaves)-Tom Yum Cup (sour soup with shrimp)-Khao Soi (Curried Chiang Mai egg noodle dish with beef, cilantro, pickled mustard greens and shallots)-Beef Red CurryAll the dishes were forgettable for me, except for the Khao Soi.  Several servers noted that it is the restaurant's best dish. However, it's not good enough to have me return.Great service.", "Date": "2013-09-27", "Author_Location": "Minneapolis, MN"}, {"Author": "Ryan L.", "ReviewID": "Zf5IpTXgWZTYQ5mx-g3EPA", "Overall": "5.0", "Content": "My wife and I love this place! Everything from the food to the drinks comes from mn! Highly recommend this place!", "Date": "2014-03-26", "Author_Location": "Minneapolis, MN"}, {"Author": "Meggan E.", "ReviewID": "z5fQgT_OycA9MdAX-qIhJw", "Overall": "3.0", "Content": "Locally sourced ingredients! So this is a cool aspect to this hole in wall. My friend who was visiting loved this place and wanted to again before leaving town. I went with her. While I enjoyed the food, it did not make me dream about it the way I did after a King and I outing. I would say it's comparable in quality to Roat Osha which I do like so maybe I really should give 4-stars. But I think I had high expectations since an out-of-towner from a foodie scene said she really liked it. We shared a green curry dish on special and drunken noodles dish. Very fresh and not overly greasy. The staff is very accommodating. Rather than meat, we asked for extra veggies and were accommodated without hassle. Lesser serving size than most Thai places but that is not a bad thing! You get plenty for two to share. I think of this as a nice neighborhood Thai joint versus a destination one.", "Date": "2013-08-08", "Author_Location": "Minneapolis, MN"}, {"Author": "Ryan H.", "ReviewID": "EqyRsCKSzqI3K5_tuWZkgw", "Overall": "5.0", "Content": "It's hard for me to concentrate - what with the angels singing in the background - to write this review. Let me just start by saying that I've recently becoming addicted to Thai food. I've just moved away from Portland, where there were at least 12 really good Thai places within three miles of my house. After putting some Pad Thai or Pad Se Ew in my mouth no less than 5 times a week for nine months, my only experience in the Midwest has been a less than average one at a place in Grand Forks, North Dakota.Before making the four and a half hour (or 40 year) trip from Crookston to Minneapolis I did some searching and found Sen Yai Sen Lek on Yelp. I was excited. We arrived in town and met up with my wife's friend. She suggested we go to a bar, but I threatened to smack her if we didn't get some Thai food stat. She agreed and we were on our way. I began to get nervous because I wasn't very hungry (had stopped at a buffet on the way down and gotten full on some weird \"food\") but a big fat doobie of some Minneapolis brickweed quickly set me stomach a-rumblin.I was torn by their ambiance. The place, although my memory fails me on specifics, was strangely decorated and most of the staff was white which tends to make me nervous. Still, I was impressed when I sat down and glanced their great beer selection (something of a rarity at Thai joints) and noticed the placcard on the table explaining that they get all their meat and veggies from local sustainable sources. The waiter, a smiling polite young man, quickly came over and took our order. For an appetizer we ordered some chicken satay, which came out promptly and was some of the best I ever had. Then we ordered dinner.I got the Pad Se Ew (which I noticed was made in the traditional way, without stupid carrots), my wife went with the staple Pad Se Ew, and her friend got something with skinny noodles and pork that the waiter recommended. The food was delivered, I took a sample bite, offered some to my dining mates, and then scarfed the entire plate down in less than five minutes. It was so good (possibly the best I ever had)  that I considered ordering another plate, but was talked out of it by my wife. The Pad Thai that my wife ordered (and the leftovers that I also devoured) was top of the line, and the pork dish ordered by her friend was delightful.We hung around the place for about forty five minutes after we finished eating (my wife and her friend hadn't seen each other in over eight years) and weren't made to feel like we should leave. Then, after leaving we were chased down the street by the waiter; we had forgotten our leftovers. As someone who forgets his leftovers more often than not, this was quite a remarkable occurrence.My only complain was the spice level; I tend to like things so hot that my anus bleeds the next morning and have built up quite a tolerance over the past few years. Most Thai places ask you for your desired spice level, but the waiter here seemed confused when I asked him to make it extra spicy. It came out with less heat than cereal, but he did give me a tray of spices and I was able to rectify the situation.I don't know if I'll ever be back in Minneapolis (it's kind of in the middle of nowhere) but if I do, I know what my first stop will be.", "Date": "2013-06-20", "Author_Location": "San Francisco, CA"}, {"Author": "Ben S.", "ReviewID": "PS6625g7T98bI-15AKuPkQ", "Overall": "4.0", "Content": "Very good Thai food in a Minneapolis suburb--who'd have thunk?! The chicken satay was very nicely cooked (not dried out), and the curry and rice dish were both nicely spiced, interesting, and not too cookie-cutter.Overall, a very nice experience--a good find thanks to the Yelpers yet again!", "Date": "2013-07-07", "Author_Location": "Camarillo, CA"}, {"Author": "Stacy F.", "ReviewID": "hao9tpri3p5pBTfdApCxOg", "Overall": "4.0", "Content": "Have been coming here since they opened 5 years ago - always a good time. Very helpful with dietary restrictions.", "Date": "2014-03-18", "Author_Location": "Minneapolis, MN"}, {"Author": "Sara O.", "ReviewID": "4geX5rEEzRqJeO-YdsaL9g", "Overall": "5.0", "Content": "Khao Soi I found you at last.  Well maybe I didn't look at that hard but I won't be searching any further.   I discovered this dish on a trip to SE Asia and have been craving in since.  Now of course it's not as good as the $1 version at the night market in Laos, but this was a close second.  There was plenty of it too to last for a few days which is a bonus.  It was a tad too spicy but I am also a whimp when it comes to spice!I also have to say we had great service.  Everyone in the group enjoyed their dishes, Chang beers, and left in a great mood.  Can't wait to go back!", "Date": "2013-04-08", "Author_Location": "Minneapolis, MN"}, {"Author": "Katie W.", "ReviewID": "IeJBk0XOJIGWPgdwSKB_Tg", "Overall": "5.0", "Content": "Top notch food and service. I've never had a bad experience here! Love that they list the farms where their food comes from. Definitely get the fried bananas with coconut ice cream!", "Date": "2014-05-11", "Author_Location": "Minneapolis, MN"}, {"Author": "Kate M.", "ReviewID": "BUKpJqukH-aS6-PWrT5Zlw", "Overall": "3.0", "Content": "I've tried Sen Yai Sen Lek a handful of times over the last few years. I'm always waiting to be knocked over by it, but it never really amazes me. I really appreciate their environmental measures to compost and use local ingredients. Plus, they always have a nice variety of cane sodas. But, I always feel like it's a complete crapshoot on whether the food and portions will be good, or whether we'll wait ages for the food. My last visit I tried one of the curries that came with an omelet and side of vaggies. The service was relatively quick as was our food. It didn't change my lukewarm opinion, but I'll be less likely to completely swear it off.", "Date": "2013-07-04", "Author_Location": "Minneapolis, MN"}, {"Author": "Timothy F.", "ReviewID": "NFHBrlukZGsBT_LlwnSuTQ", "Overall": "4.0", "Content": "It really is hard to go wrong with this family-run gem in NE Minneapolis.  The blend of flavors and spices is out of this world.  The papaya salad could have been better if the papaya had been grated more finely, but the flavor was decent.  No matter what I order I am never displeased.  If you're in doubt, the servers are very knowledgeable and friendly.  I wish I lived closer so I could dine there more frequently.", "Date": "2014-02-16", "Author_Location": "Minneapolis, MN"}, {"Author": "David S.", "ReviewID": "OhRrI3ukSMszCaIA9Sp7Cw", "Overall": "3.0", "Content": "Pretty good selection of Thai rice and noodle dishes. The service is a little slower than we'd have liked but the food made up for it. Definitely try the curried fish cakes for an appetizer.The prices though are kinda high so beware of that.", "Date": "2013-08-15", "Author_Location": "Minneapolis, MN"}, {"Author": "Robbin H.", "ReviewID": "O-4bIWIAw47I5S-Sv2l1Bw", "Overall": "1.0", "Content": "After reading all of the amazing reviews my husband and I decided to give it a try. The first time we went the food was mediocre at best. Fish cakes were good. We decided to give it another go. The  Rad Naa I tried this evening was horrible. Slimy... Bitter... Under cooked chicken bits. I've tried, I really have, but twice disappointed, I'm going to have to call it quits. And we were charged for both of our meals. $50 bucks for slop in a bowl - no thanks. I will go across the street to Karta or over to Quang on Nicollet.", "Date": "2013-11-25", "Author_Location": "Northeast, Minneapolis, MN"}, {"Author": "Ashley A.", "ReviewID": "yPMVPjeFlecqEt9CX3IAiw", "Overall": "3.0", "Content": "You probably heard of Sen Yai Sen Lek before you saw it. I did. I've been a handful of times now and think it's delicious. A friend goes more often than me and swears by the khao soi (she won't get anything but). So this past time that's what I got. I think I'll be in that camp as well. Soooo good and just the right amount of spicy.Don't get me wrong: I really like Sen Yai Sen Lek, but its meals are a little on the more expensive side when it comes to thai food (granted, you'll get two full meals out of it). If it's too expensive, try checking out it's across-the-street neighbor, Kharta Thai. Just as great of thai dishes (less of a menu) at a little sweeter price point.", "Date": "2013-04-11", "Author_Location": "Minneapolis, MN"}, {"Author": "PS S.", "ReviewID": "z6yvHLCGlVwIdhStIcUkOg", "Overall": "5.0", "Content": "Fantastic. Some of the best Thai food I have tasted.  Great staff.", "Date": "2014-02-15", "Author_Location": "Chicago, IL"}, {"Author": "Philip C.", "ReviewID": "z2nKzxha1dDybonvxZ45NQ", "Overall": "4.0", "Content": "This place was amazing, the food was really delightful. My friend and I had the fish cakes to start off with and they were the perfect appetizer portion size for two. After that I had a noodle dish which was amazing. I was not able to eat the entire portion, but took the leftovers home and finished them that night. There drink selection is quite good for being a smaller restaurant, they had a lot of local beers which was nice.The service is great as well. They are knowledgeable of the menu and helpful in describing what to get dependent on heat levels. I would highly recommend stopping in sometime.I have yet to try the curries, but defiantly will be going back shortly to do so!", "Date": "2013-08-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Rhea S.", "ReviewID": "bX3WPJRTjZwI_SRrsATx5w", "Overall": "4.0", "Content": "A friend took me here and I was very happy he did. Lots of great choices, but ask the waitresses if you aren't sure. They were super helpful! The Tom Yum soup is among the best things they make. I ordered pad see iew with mock duck and it was good, but not as good as Amazing Thailand. Good curry. Very good portions and reasonable priced. Worth exploring. Also they put up cool art from different schools/organizations.", "Date": "2014-01-01", "Author_Location": "Princeton, MN"}, {"Author": "Josh M.", "ReviewID": "Fiqg_LN7izRyB6vveApzjg", "Overall": "5.0", "Content": "I came here with my family for my birthday. I had the Kai Soi and it was very good. My wife had the Pad Thai which was also very good. We made a reservation because we had 10 in our party. The server we had did an excellent job!", "Date": "2014-01-01", "Author_Location": "Minneapolis, MN"}, {"Author": "Suzy R.", "ReviewID": "H4hwHqtqYCA2JDdzDayYVw", "Overall": "5.0", "Content": "Little quaint restaurant but with amazing food!  I loved the soup with chicken but will get tofu next time. I got a lunch portion which is supposedly a smaller portion but was still large enough for two! :)", "Date": "2013-10-22", "Author_Location": "Phoenix, AZ"}, {"Author": "Kedar D.", "ReviewID": "h2doTRlm3k3Msz3WDw-9uQ", "Overall": "5.0", "Content": "Sen Yai Sen Lek is a gem. It keeps getting better each time I go back and is one of only a handful of Thai restaurants that I've been to in the US that accurately recreates the flavors I encountered regularly in Thailand itself.First the foremost, this is probably one of only a couple Thai restaurants in the Twin Cities where you can be guaranteed to get a meal without fish sauce, without shrimp paste and without any other animal product. The staff and owners here understand and respect veganism and go to great lengths to make sure we are accommodated, and in fine style, I might add (separate veg*n menu, numerous veg*n appetizers, entrees and desserts, and friendly staff that always finds answers to your questions).Secondly the food here is simply excellent. The curries and stir-frys are robust and complex and never feel watered down or simplified like at practically every other Thai restaurant in the Twin Cities (I'm looking at you, Tum Rup Thai and your Uptown clones). Too often does Thai food get turned into either piddling pad thai or soy sauce stir-frys over white rice; at Sen Yai, on the other hand, you'll get a dish loaded with herbs, a multitude of Thai chilis, and tricky variations of from-scratch, hard-to-make curry pastes. You never get the sense that Sen Yai takes shortcuts in its preparation.Third, Sen Yai Sen Lek really listens to its customers and makes changes quickly. The first time I went they didn't have a separate veg*n menu. The second time they did have a veg*n menu, though my noodle dish seemed a little bland. When I came back the third time my next dish was wonderfully spicy and hearty. The fourth time I went they didn't have brown rice but their green curry with tofu was still stunning and substantial in its spice levels and overall heft. Finally, the latest time I went, the panang curry with mock duck ($11.95) was fragrant, rich, and now came with brown rice.I also had a dessert, black beans with sticky rice and coconut milk ($4.95) which really hit the spot. You'll often see sticky rice with mango or banana, but rarely do you see unusual ingredients such as black beans. In another testament to Sen Yai Sen Lek's quality and attention-to-detail, the dessert came with a little twig of mint leaves. This doesn't sound like much, but it's something I have never seen at any other Thai restaurant, and it added that much more flavor, complexity and interest to the dessert.Finally, this is a great place either for a quick, affordable lunch (lunch specials are around $8-9), or an intimate, extended dinner date. They have a good selection of beer and wine and the interior decoration is warm and inviting. I highly recommend Sen Yai Sen Lek.", "Date": "2009-11-01", "Author_Location": "Los Angeles, CA"}, {"Author": "Yoko Y.", "ReviewID": "UJoATe4R42sptZ2E-Jm5fA", "Overall": "3.0", "Content": "When I read Zachary S's review, I thought holy basil, they have pad gra pow!  To my knowledge, this minced meat dish is so rare, it exists on one other restaurant menu, and that's Bangkok Deli's. Since Sen Yai seems to have a reputation of being authentic, I thought the pad gra pow was going to be goooooood. So with blind excitement, I ate my pad gra pow, that is until a twig nearly jabbed my gum off my tooth. In my dish were a bunch of other twigs like you'd find in potting soil and a mini holy basil plant, minus the roots. Just the holy basil leaves would have made the dish authentic enough for me. Well, that was last year and the place still gets good reviews and good press, so my dish then must have been a fluke, right?This time around, the dish was heavy on the soy sauce/fish sauce so I had to adjust the flavor with sugar. Luckily, the dish was mostly leaves with the exception of one huge stem with flowers. No twigs, though! No twigs. I've determined the pad thai here is awful. First time it was white noodles with barely registering flavor and shrimp so salty it tasted like it was soaked in salt water. This time the noodles were dark and salty. In both instances, I was questioning, \"Where is the tamarind and sugar?\" The servers may say that's what the spice tray is for, but personally I'm not enthused about constantly adjusting the flavor of my dish. Just means to me, the restaurant doesn't have to be consistent with its cooking. The real bright spot was the spring rolls.  It came out hot, like singe the roof of your mouth hot. I'll come back here because they have curries and other noodle dishes that seem a whole lot better than the pad thai, but to be honest, I'm in no rush.", "Date": "2010-06-04", "Author_Location": "Minneapolis, MN"}, {"Author": "D. L.", "ReviewID": "pPYGbaQwNEL5GALb4WpUkg", "Overall": "2.0", "Content": "Service is inconsistent at best but not really any worse than some of the other Thai places in town (cough, Taste of Thailand, cough, True Thai). It's cute inside, it's conveniently located, and a nice couple with values I support run this place in a sustainable manner. All pluses.But I can't bear eating Thai food that is just so disappointingly mediocre. I have to believe that this place gets its solid 4-star cumulative rating because of a captive audience. That is, it's the only Thai to be found in this neck of the woods and Thai food is extremely craveable. Nothing else hits that deeply savory spot, salty, sweet, sour, and spicy all at the same time.But that's the problem with the food here. It rarely hits all those notes with any clarity or consistency. Sometimes it doesn't even hit any of them.Almost every component is house-made and they don't rely on commercial mixes or pastes, the servers have told me. I'm all for that...except SYSL's food never has that brightness of flavor that I associate with Thai cuisines. It's always muted by a sort of muddiness. In the case of dishes where the stock/broth is the backbone of the dish, the broth always tastes like they let it boil and didn't skim enough when they were making the base stock. I've made this mistake at home in my own kitchen and I don't know if it's true for SYSL but that's the flavor I recognize it as. Muddiness is something you just can't cover up. It's a problem with the foundation.The other issue is the tray of seasonings and chilies they bring to the table. I'm willing to fine-tune and tweak seasonings to my taste at the table but what I cannot do is repair the lack of proper seasoning that should occur at every stage of cooking. There is no way to compensate for this after a dish is already cooked. Seasoning added at the table never tastes as fully integrated as seasoning that occurs in the kitchen.  We've been here three times since they opened two years ago and have tried different dishes each time but have been so disappointed  that unless I'm alerted to some big sea change in the kitchen, I can't see myself going back.", "Date": "2010-08-20", "Author_Location": "Minneapolis, MN"}, {"Author": "Catherine F.", "ReviewID": "HE7jhzPw2XYYqmYsvzEVbg", "Overall": "5.0", "Content": "I enjoyed this restaurant thoroughly.  I lived in Thailand for a year, and I would say this restaurant separates itself from many other Thai restaurants in the U.S..  While I do like some other Thai restaurants in the cities, Sen Yai seems to put more thought and care into their dishes overall.   I ordered one of the curries of the day--green curry with beef.  Initially, I didn't like the idea that you couldn't choose your own meat for the curry of the day.  However, the curry had a perfect combination of salty and spicy flavor that really worked.  You could tell that the curry had been cooking all day.  I think the care they put into dishes like this is where other restaurants fall short and are inconsistent.  I also tried the Laab Gai and the Khao Soi, both of which were very good.  I must admit that I didn't have any Khao Soi in Thailand, so I can't comment on its authenticity.  The mango sticky rice made an excellent dessert.  I liked the fried spring rolls and enjoyed the wrapping.  They are a bit thicker than many spring rolls I've had, which I don't see as a bad thing.The service I received was very friendly and extremely fast.  I was there on the early side for dinner, so perhaps that changes during the rush times.  Overall, I appreciate Sen Yai's desire to be different from the rest and authentic, and I think they do it well.  I will be back so that I can (hopefully) have the same experience again.", "Date": "2011-01-18", "Author_Location": "Minneapolis, MN"}, {"Author": "Zac S.", "ReviewID": "d1IbolfhxQG5coOt7d2Rdw", "Overall": "5.0", "Content": "It isn't often that I come to this neck of the woods (not nearly often enough).I had a meeting (unemployment code for coffee with a friend) and brought my lunch, so when we were done chatting and with coffee and she kicked me outta her house, I came to Central Ave to check thing out.It ws 50/50 if I would eat the salad I brought.  I parked in front of Holy Land, where they luckily have camel liver on sale, and funny enough, we ate our last camel liver last night!So I ate my salad (nicely prepared, I might add) and went inside.After the bagger helped me load my backseat full of liver, I saw Sen Yai Sen Lek across the street.  Hmmmmmm.....Looks good.  Wife calls.  We chat.  I tell her where I was.  She told me that heavytable.com just posted something about SYSL this morning!  (turns out to be a bit of a confusion there, because when I looked it up, it wasn't what I thought.  Just a mention.  Not one of their full blown articles they are so good at putting up there, daily.)So I go in to see a menu, get seated, and ordered the Pad Bpai Gra Pow, which is pronounced padbpaigrapwoawoedi which,  as you can tell from the name, has pork and rice and red chili in it.It was awesome.  The tray of \"spices\" which includes sugar (is that really a spice, or is it just one of those things that is just always there, like air?) wasn't even necessary.I am coming back. Oh, they use local farms to provide their pork, chicken, veggies, so you aren't going to get that strange bit that you have to spit back into your napkin.", "Date": "2009-05-13", "Author_Location": "Minneapolis, MN"}, {"Author": "Andy G.", "ReviewID": "MZ8ZBGhGkRLYTlvc970UQA", "Overall": "4.0", "Content": "Came here over lunch today with a couple of coworkers. Have you noticed a pattern of me never eating in during the work week? Yeah, me neither. Anyway, we arrived around 11:30 to a fairly empty place. We were seated promptly and had our orders placed within minutes. All three of us got the Pad Thai so that is all I can comment on at this time. They do have a lunch menu with cheaper and slightly smaller portioned selections from their regular menu. I ordered the dinner sized version of it but I guess she thought my tits were getting to big and brought me the smaller lunch version. It was still a good sized plate so I wasn't upset. I could stand to skip a few meals. The Pad Thai had minimal spice on it. The server gave us the little magic decanters of fire potions to spice our meals to our desired flammability's. I chose 5 alarm fire. It was good. The space itself was nice and bright and minimal which made it feel really friendly. They also played authentic Thai music while we ate. The Rolling Stones are from that area, aren't they?", "Date": "2009-04-21", "Author_Location": "Minneapolis, MN"}, {"Author": "Dan S.", "ReviewID": "7sn2nGuiWYYtJ25-Be9cUg", "Overall": "3.0", "Content": "I'm not a huge Thai food fan, but it's my girlfriend's favorite, so we made a trip out last weekend. I'm not sure what this means, but she didn't really like it, but I thought it was pretty good. First, I liked the place because it doesn't look like a typical Thai restaurant. Most Thai places that I have been to are crowded and dark with gobs of Asian artifacts littered about the place. This is a bright space with high ceilings and vibrant colors. The restaurant has a warm welcoming feel and would be a good place to have a long dinner and conversation with friends over wine. I ordered the Red Chicken Curry, at $15, it was the most expensive item on the menu and my girlfriend ordered the Shrimp Pad Thai ($13). We also both ordered hot tea. They bring out hot water and 6 different teas to choose from. I had a particularly aromatic jasmine tea that pleasantly jolted the senses. I thought that the curry was great, it came with sticky rice, several deep fried accouterments, and a thin mini omelet. The dishes are served mild and the waitress will bring several spices, of varying degrees of heat. There is a mild sugary spice, a pepper spice, a jalapeno spice and a delicious fish sauce with hot peppers. I'm not usually a fish sauce fan, but the waitress recommended it and I can vouch that it was a great mix of sweet and spicy. The reason that I didn't give this place four stars was that my girlfriend didn't like the Pad Thai. She usually loves Thai food, and she though the food was slightly below average. I tasted her meal and agree that I've had better. There are too many noodles and not enough of whatever else makes up Pad Thai. We will probably be back because we both thought that the space was great and this is actually a Thai restaurant that I like, that wont break the bank either.", "Date": "2008-12-15", "Author_Location": "Saint Paul, MN"}, {"Author": "sarah p.", "ReviewID": "YSkRz_CLIUzp5ITh7LTo4A", "Overall": "4.0", "Content": "What a great addition to the neighborhood! I'm actually ashamed that it took me so long to make it here...ah, all the great noodle and curry dishes I could have been having all year. Came here early on Friday evening, and, boy, was I glad I did do. They were hosting a groom's dinner in the other room, and by the time we left there was a line snaking out the door. Everything we had was fresh and delicious. I especially enjoyed the chicken green curry special of the evening. I only wish tha tthey gave a wee bit more rice with the dish because I was left with a lot of the sauce and nothing to soak it up with. The \"spice tray\" was especially thoughtful and totally authentic; being able to season your own dishes to your liking is something I always appreciated when I was in South East Asia. They even included the all important, yet often overlooked, sugar in the tray.Early in the evening, this is a great place to bring kids as well. There were tons around the 5/5:30 hour.", "Date": "2009-09-29", "Author_Location": "Washington, DC"}, {"Author": "Carly M.", "ReviewID": "jq9pCqndoTg0vtYA22srGA", "Overall": "5.0", "Content": "My husband got heartburn from his curry, but I liked my Pad Thai so much that I don't care. And I tried his curry (actually it was a kuri) and it was delicious. So there. My pad thai was delicous, not oily. The tofu was cooked very well, and the bananas with sweet sticky rice was an absolutely marvelous dessert.", "Date": "2009-11-03", "Author_Location": "Minneapolis, MN"}, {"Author": "McLain C.", "ReviewID": "FcSc0s8Wc2ufxbDn2uHBww", "Overall": "5.0", "Content": "Ordered the Thai spring rolls for an appetizer.  They were delicious, served with a tamarind dip that had a lot of honey in it.  For my main I had larb gai, a Laotian dish with minced chicken and toasted rice, lime juice, peppers, and fish sauce.  It's one of my favorite \"Thai\" dishes, as it is delicious and healthy.  They made a very nice rendition here, complete with sticky rice.  Finished off the meal with a wonderful fried bananas and coconut ice cream dessert.They carry a nice assortment of craft and international beers as well as some cane-sweetened sodas.  They source much of their product locally from sustainable farms.  Authentic, sustainable, delicious Thai cuisine, what's not to love?I'll be back, and I recommend it highly.", "Date": "2009-12-21", "Author_Location": "Hennepin, MN"}, {"Author": "Jen B.", "ReviewID": "_dbx0pc0PJdnZM68C9nOTw", "Overall": "4.0", "Content": "Newish minimalist Thai place in Northeast that is very promising. The name means \"Big Noodle Little Noodle,\" which I find absolutely charming. Some friends reserved the blue room here for a small gathering, and the space was perfect for the family-centric nature of our group: A few couches and lots of comfy chairs centered around a large coffee table. Great for holding babies and scarfing spring rolls. The friends knew the owner, and we were very well looked-after. I tried an array of different appetizers, which were for the most part quite tasty. The tofu satay with peanut sauce was a highlight, as was the green papaya salad served with sticky rice. It was really tart but the rice balanced it out nicely. My entree was Pad See Iew, and I loved it. Wide egg noodles with egg, chicken and Chinese broccoli, in a sweet soy sauce. Sweet, salty, awesome. Also, big portions. I also had the pleasure of trying Thai iced tea, my new favorite drink. I was skeptical at first, mostly due to its burnt orange color, but the first sip won me over. I am now ordering this whenever I get Thai. The menu emphasizes the restaurant's commitment to authentic preparation and sourcing ingredients locally, which is great. There are a number of veggie/vegan dishes plus many others that can be made so upon request. The decor is sparse - not the chock full of junk type vibe that you typically see, but it almost feels too barren. Definitely no need to dress up. The main dining room has plentiful seating, and there is a separate space for parties / additional seating with a bar. I'm excited to see how this place evolves, but it's so far from home that I probably will only come by sporadically. Hopefully the neighborhood can keep it afloat until it hits its stride. Give it a try!", "Date": "2009-01-04", "Author_Location": "Minneapolis, MN"}, {"Author": "Allison J.", "ReviewID": "7Jof8rg2KP_d3RMgsKzJUA", "Overall": "5.0", "Content": "Sen Yai Sen Lek is absolutely fantastic! I have been meaning to go there for a while because of their commitment to sustainability and was thrilled to discover that their food is as delicious as it is environmentally responsible. They have separate vegan and gluten free menus, which helped our group immensely! My only tiny wish is that they would combine the menus and just use icons for vegan and gluten free on the main menu. The main menu has all of the descriptions for each item, so you had to cross reference three menus to order if you were a gluten free vegan. It was still manageable though, especially because our server was extremely knowledgeable. If those menus were combined, Sen Yai Sen Lek would be perfect.Our absolute favorite dish was the Pad Panang with tofu. It  was hands down one of the best dishes I've ever had. The tofu was so fresh, and the sauce was amazing. We also had the tofu satay, pad thai with tofu and som tum which were all delicious as well!To top it all off, we actually had vegan dessert options! We shared the sticky rice with mango which was amazing and the sweet black beans with coconut milk and rice, which was wonderful. I can't wait to go back!!", "Date": "2010-05-23", "Author_Location": "Princeville, HI"}, {"Author": "Alison C.", "ReviewID": "-MIUdS_L_aAkF39rJw8eYQ", "Overall": "4.0", "Content": "I've eaten at Sen Yai Sen Lek three times in the past month. I like their values and I like that all my garbage is getting recycled. (Should I clean out my purse and leave all my stray receipts on the table? Will they be composted?!)Anyway, they have a few incredible meals and a few duds. Khao Soi: a giant--it's BIG--bowl of yellow curry soup with soft noodles on bottom and fried crunchy noodles on top. The flavor is medium but I always add Thai chilies to make it a little spicier. Very smooth and enough to split with another person.Tod Mun: curried fish cakes. This appetizer is light and comes with five little patties and a deliciously fresh cilantro cucumber peanut relish.Pad See Iew Gai: tastes good like most Pad See Yew except this is one of the few restaurants that actually uses Chinese broccoli when it says so on the menu. Chinese broccoli is long and skinny with big fronds like broccolini but most places just write that and throw in regular florets. Beer List: Share it with a friend or spend some time and finish it on your own but they sell a 22 oz. Flat Earth Orange Porter that is simply incredible. It's lighter than most porters but with the orange tinge like a Sunset Wheat. It's probably the only beer my husband will split with me.", "Date": "2010-08-03", "Author_Location": "Oakland, CA"}, {"Author": "Christopher H.", "ReviewID": "8JrBVuquv9XvtRmn2Wq1rQ", "Overall": "2.0", "Content": "Had dinner here with a group of friends recently.  I'd been wanting to check out this place for quite a while but just hadn't gotten around to it.  When we were seated and I got a look at their menu, I was even more excited as it looked like they had quite a few items on their menu that you don't often see in Thai places around here.  I was particularly excited to see khao soi, which i have fond memories of eating when I was in Thailand a couple of years ago.Anywho, we started out with beverages and a couple of appetizers, the crispy spring rolls and the gai (chicken) satay.  Both were excellent.  The spring rolls were hot and very crsipy and the chicken was very juicy and flavorful, not at all dried out as is often the case with satay in my experience.  After the appetizers we ordered some entrees.  I don't recall exactly what everyone had but there were a couple in our group that had the pad thai, I went with the khao soi and my fiance had the pad prik khing.  Despite the crowd they had on this Friday night, service was great and we didn't have to wait long for our food.Both of the people in our group that got the pad thai were happy with it.  I didn't sample it but it did look quite good.  Unfortunately there were some spice problems with both my khao soi and the fiance's pad prik khing.  Both were so spicy as to be almost inedible.  I had khao soi a number of times when I was in Thailand and never experienced anything as hot as this.  Don't get me wrong, I really like spicy food but I also like to be able to taste my food.  This stuff tasted only like burning.  The same was true with the fiance's pad prik khing, it was so overly hot that she was barely able to eat it.  My recollection was that her dish wasn't even marked as spicy on the menu so we probably should have sent it back, but alas, we didn't.I really want to like Sen Yai Sen Lek since they had so many good looking things on the menu.  I'll probably give them a try again to see if they can do better.", "Date": "2013-02-08", "Author_Location": "Saint Paul, MN"}, {"Author": "Elise S.", "ReviewID": "RFeCo5qdQed-5sA-ahzHYQ", "Overall": "2.0", "Content": "I feel like writing a review is pointless after reading Annie D.'s, because she hit all of the \"high points\". I will endeavor to add my two cents to the debate, though. I don't like writing negative reviews, but I can't recall the last time I had such dismal service in a restaurant.I love Asian food, particularly noodles, almost to a fault as my husband can tell you. So when we started going up to Eastside Co-op to pick up our CSA and discovered just how close Sen Yai Sen Lek was, my heart overflowed with joy. And possibly sesame oil.We went on a particularly steamy Wednesday night, partially to beat the heat, partially to pick up our CSA. When I got there, there were a few tables already occupied, but it was a nice atmosphere and figured it would be an enjoyable wait while my husband bussed on down. Beyond the five minutes it took for the hostess to notice me and the young family there before me, I was still optimistic.I got a seat and was promptly abandoned by my server. I'll cut the story short by saying that it took me over 20 minutes from the time I was seated until I got my first bottle of beer. It was not busy, there were no demanding tables, it seriously took that long for her to come over, figure out what I wanted, open a bottle of beer, and come back. My husband had a similar experience when he finally arrived.The food, to its credit, did come out very quickly and the portion sizes were fair. However, I was not blown away. I ordered the Ba Mee Haeng (BBQ pork, lettuce, garlic, egg noodles) as a soup and it wasn't really anything all that different from Roat Osha or Sawadtee. The fried spring rolls were nice, but tasted heavily of dirty grease and came with a meek little dipping sauce. My husband ordered the marinated steak salad and enjoyed it, but it failed to really stand out and wow either of us.My soup was getting spicy and we were out of not only beers, but water. Our waitress was literally nowhere to be seen - it's like she went on break for 45 minutes and didn't put anyone else on our section. I finally managed to flag down another server, asking for more water and he politely informed me that he wasn't our server, but out of the deep generosity of his heart walked the 10 steps to the server station and mustered up another glass of water. So we finished dinner and waited at least another 15 minutes with empty glasses and dirty plates before another server came by to take them. I asked him for the check, not knowing where our server could have gone to. He brought it, but reminded me that he wasn't actually our server. Our original waitress finally came by as I was finishing out the receipt. I still feel stupid for actually giving them 15%.\"Okay, not such a great experience,\" my husband mused, \"but let's at least go to the bar and have one more drink because it's 1 million degrees Farenheit out there.\" We sauntered over and our waitress from before asked if we wanted to be seated, as if she had never seen us before. We saw the very bored-looking gentleman at the bar, desperately looking around for someone to refill his drink. We braved the heat and picked up our CSA and went home.", "Date": "2010-07-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Tim A.", "ReviewID": "qtK93NozcFwhrE81eZxMXQ", "Overall": "2.0", "Content": "I had read some positive remarks in regards to this restaurant from the Citypages weekly publication, so I was rather excited to check out Sen Yai Sen Lek.  I checked out the online menu beforehand, so I was pretty acquainted with what was offered.The decor of the restaurant is rather minimal with plenty of seating.  My girlfriend and I were greeted promptly and shown to our seat.We started with the Po Pia Tod(crispy spring rolls).  Something like this is pretty hard to mess up, plus I'm pretty sure that I could consume an infinite amount of spring rolls at any given moment, needless to say I was excited.  Unfortunately they arrived undercooked and still frozen. It took our server quite a bit of time to come check on us.  She lightly apologized, and we were given a freshly made batch, thankfully fully cooked, however the fact that our first impressions were frozen kind of threw off the rest of our experience.For a main dish I ordered the Khao Pad Kapi(royal fried rice).  The rice itself was luke-warm, the pork was dry and chewy, and the crispy dried shrimp was a little strange.My girlfriend ordered the Geow Naam Moo Daeng(soup of sorts).  The broth was light and strange in taste.  The pork wontons were decent.  All in all, nothing was too exciting about the food.Food aside, the service wasn't all that stellar either.  Being a server, I often give people the benefit of the doubt; servers get busy, kitchen problems can pop up, etc, it could be any number of things.  This on the other hand was just tiring, our server hardly spoke and took forever to do anything.  My girlfriend and I were contemplating dessert, then ended up deciding that we didn't want to wait another 15 minutes.On the other hand, I did notice that all the other servers in the restaurant were doing their jobs quite well.  Back to the subject of food, I did notice a few tasty looking dishes as I peeked into other booths to see what others were eating.  With that being said, I need to give this place another chance, a reluctant chance.", "Date": "2008-11-14", "Author_Location": "Minneapolis, MN"}, {"Author": "Gina C.", "ReviewID": "Vl8ZI0b3KGCcxvOLW_piMQ", "Overall": "4.0", "Content": "Yum. Great food, great service. Love Sen Yai Sen Lek!!", "Date": "2014-04-06", "Author_Location": "Minneapolis, MN"}, {"Author": "josh b.", "ReviewID": "V-9kMVBMegMmfy8Y1wAcSw", "Overall": "4.0", "Content": "We have been dying for a Thai restaurant to open in NE forever and we finally got one and it is very good.  I have been there twice since they opened and both times my friends and family commented on how fresh everything was.  Right now we are just trying everything on the menu and nothing is disappointing us.  The Thai ice tea is awesome!I asked about the name Senyai - Senlek - Big Noodle - Little Noodle.  Very cool.", "Date": "2008-10-08", "Author_Location": "Minneapolis, MN"}, {"Author": "Nick S.", "ReviewID": "qAChMsCnzityI_oid2f9VQ", "Overall": "2.0", "Content": "It's really unfortunate when poor service overshadows the rest of a restaurant experience, but I really believe that in this day and age there's no excuse for it.I decided to swing by Sen Yai Sen Lek to meet my wife for a quick pint or two and an early dinner.  It took 15-20 minutes to see our waitress and put in a drink order, maybe another 15-20 minutes to put in a food order.  During dinner we ran out of water and beer and had to literally flag down a different server since you NEED something to drink when you're eating Thai food.  We then sat for a good 45 minutes, surrounded by dirty dishes, before flagging down a different random server to please, for the love of god, get our check.  The place wasn't even busy -- there were maybe a dozen seated tables and three servers.  I'm flabbergasted that we had to literally beg for things every step of the way.  We spent more of our quick dinner waiting around than actually eating it.The food was perfectly okay, though nothing exemplary.  I gather some dishes are hits and other misses -- I must have bet wrong.  As pleasant as the atmosphere was and as admirable as their sustainability is, I feel no need whatsoever to return.  There's no shortage of passable Thai places in town with better service than this.", "Date": "2010-08-20", "Author_Location": "Minneapolis, MN"}, {"Author": "Barry C.", "ReviewID": "zmKMcZpfctMkCiKrwHvRTA", "Overall": "5.0", "Content": "A fresh and fun spin on good Thai food- Great beer/alcohol selection- Awesome wait-staff, very friendly, knowldgeable and fun.  (everyone smiles)- Extremely fresh and clean atmosphere.  Asthetically really cool.- Beautiful AND tasty dishes.I would highly recommend getting whatever \"Curry Special\" they are having on the night you visit.  The curry was outstanding.  Very rich and flavorful... spicy but not overwhelming... just what you want in a curry.The meats are all from farm raised animals locally and this place puts extra effort on eco-friendliness.  I rarely believe this, but I tasted a difference in the meat.  Maybe just because it was killed last week or maybe there is something to applying baseball rules of drug abuse to animals... i dunno.Oh one more thing about the atmosphere.  There were several couches in the restaurant and a few dads and moms eating with their kids on the couches.  There seemed to be some games or something for the kids to play with.  I thought this was very cool and it gave it a very inviting feel.....  Anyway, if you like Thai, you should try it out here.And to all you nay-sayers..... It's not that every place I eat at is worth 4 or 5 stars, it's just that I don't review the crappy ones.  I'm trying to eliminate my underlying evil.", "Date": "2009-03-30", "Author_Location": "Minneapolis, MN"}, {"Author": "Paul J.", "ReviewID": "QJ-zC0NxK_yTiUcX-wV-8A", "Overall": "5.0", "Content": "My absolute favorite Thai restaurant in Minneapolis. Fresh ingredients, tasty dishes, unpretentious atmosphere and amazing service. The owners and staff are all so cool. This is a true community restaurant that never lets me down. Highly recommend to anyone who loves good Thai food, made and served by really good people.", "Date": "2013-10-01", "Author_Location": "Praiano, Italy"}, {"Author": "Brian H.", "ReviewID": "Szv9f429GXWz5Sa1UxVJyQ", "Overall": "4.0", "Content": "Eaten here about a half-dozen times and never had a bad experience. Service isn't exactly warm, but good enough so you don't feel ignored or resented. And the food is stellar. Granted, I can't resist ordering the Pad Med Mamuang every time I go, so I haven't had experienced the full breadth of their menu. Also, they compost, and offer a large selection of cane sugar sodas. I find this charming.", "Date": "2009-11-17", "Author_Location": "Minneapolis, MN"}, {"Author": "D P.", "ReviewID": "c5VRokthYWWZCbj5rXw1bg", "Overall": "5.0", "Content": "Not only my favorite Thai restaurant, but one of my favorite of any cuisine. The balance, freshness, and care with the dishes provide a wonderful experience. There is nothing lost in confused tastes or unsubtle combinations - rather everything seems to be... just right. I love it. They *need* to take AMEX... Missing a lot of the business I would like to bring to the restaurant, finding it a perfect place to sit and chat or brainstorm with a colleague one on one. When choosing to \"show off\" Minneapolis to business and personal visitors, Sen Yai Sen Lek is my first choice.", "Date": "2013-11-10", "Author_Location": "Eagan, MN"}, {"Author": "Warren C.", "ReviewID": "wDxZGH3PdyucyjBaf51aAA", "Overall": "3.0", "Content": "3.5 out of 5.Hard to categorize. The food is decent, but the portions are kinda small. It's not that authentic, but it still tastes okay. There's a lot of hype over this place, but I don't think it's justified. Some days the line is out the door, other times it's emptied out. It can be pricey or it might not be depending on what you order. The character of each server is also different.With that said, I had the Pad See Iew ($10.95), which wasn't bad at all. It didn't fill me up and I could've gone for White Castle after. Although I liked my food, it wasn't satisfying. I'm guessing there's a lot of variation in dining experiences here.If given the chance, I'd probably come back.", "Date": "2011-02-26", "Author_Location": "Lake Forest, CA"}, {"Author": "Dan B.", "ReviewID": "1Z70rmsbhLOjRiGImHYzMg", "Overall": "4.0", "Content": "I honestly wasn't very excited about going here last night, but it ended up being a very good experience. Sen Yai is different from the other Thai places around Minneapolis, which is a good thing. Their menu has many different dishes, and lacks some of the old stand by's that people like me default to when they go to a restaraunt and don't feel like thinking about what to order. We ended up trying some new things...We had the lettuce wrap app. and really enjoyed it. It's a do it your self, full contact, interactive app. You can make each roll your way, just be very cautious with the fish sauce they serve with the plate, A little goes a LONG way and can overpower the rest of your meal.For my entree I ordered the Jungle Curry special. Honestly, I didn't really like it, but it's just something that I didn't care for. The dish was prepared and presented well, just not my thing. We ordered the Bananna, Sticky rice, and coconut milk dessert and it was amazing, I would go back just for that. All of the food that came out seemed to have been given a lot of thought and preperation, the service was flawless, and the atmosphere is great. They even have a bar area and happy hour. I would definitely recommend trying Sen Yai, and stepping out of your box for once.", "Date": "2009-12-15", "Author_Location": "Charlotte, NC"}, {"Author": "Brian L.", "ReviewID": "zpkIu37lTwIXHlcHPiWtyQ", "Overall": "1.0", "Content": "The Short Review:  Do not eat here.  If you have any alternative options, exercise them.  It is worth the driving to another part of the city to avoid this experience.The Longer Version:  I read the Yelp reviews before this evening's visit.  The comments were mixed, with the most recent being positive, so I figured we'd try the NE Thai.  What a mistake. The food was horrible.  I should have paid more attention to the previous review from  Afsheen F. (5/2/2010).  I couldn't stomach the seemingly microwaved chicken soaked in a mess of pureed vegetables (i.e., the Jungle Curry special).  The cook even managed to mess up our order of Pad Thai, which was definitely the worst I have ever sampled.  All we could taste was the noodle.The service was mediocre.  Our food arrived in a reasonable amount of time, but I didn't appreciate different servers yelling across the restaurant when we requested changes to the order.The ambiance was lackluster.  We were seated in the lounge area, which has an awkward layout and includes three couches from the 1960s.  For a Friday night the place was quiet (other folks must have figured out the caliber of the food), and there wasn't any music. Overall, I would pass on the Sen Yai Sen Lek experience.  I have eaten a ton of Thai, even the authentic stuff, and this was by far the worst I've sampled.", "Date": "2011-11-18", "Author_Location": "Minneapolis, MN"}, {"Author": "Meghann F.", "ReviewID": "st_U5Ai82WT-QFGc9jJGgg", "Overall": "4.0", "Content": "This place is good!  Their curries are always amazing.Their noodle dishes are usually more of a soup type and I would say that I am quite taken with them.We had some curry somewhere else last night and agreed that the curry here is significantly better, and a little cheaper!  So got me thinking and realized i hadn't reviewed.The last time I was there I got the Khao Soi.  I can't wait to go back and eat more of it!The lettuce wraps are decent, they have a good beer selection, local farms provide the produce, etc, price wise it's really reasonable.Definitely recommend.", "Date": "2012-09-14", "Author_Location": "Minneapolis, MN"}, {"Author": "Steven H.", "ReviewID": "4Gpwg5GJlk492jrfI-f1VA", "Overall": "5.0", "Content": "Whoa. I'm a new fan. This place is awsome. I had the Khao Soi (Curried Chaing Mai egg noodle dish with beef, cilantro,pickled mustard greens, and shallots) and the only thing I would improve is more noodles. It was bursting with flavor, and althouh they say it is spicy, it isn't really spicy. Just a little bite to it. My mother had  Pad Kee Ma, and I tried a bite or two. I love wide pan-fried noodles, and this dish was fantastic. I will get this one next time. As far as the atmosphere goes, it is cozy and warm. I could do without the curtains aesthetically, but they serve a real purpose in the winters. Otherwise the atmosphere is very friendly.", "Date": "2011-02-21", "Author_Location": "Minneapolis, MN"}, {"Author": "Eric S.", "ReviewID": "lnsTh8LTEGsPPCttzaS1hQ", "Overall": "4.0", "Content": "This was a really pleasant little surprise.  I don't often make it Nordeast, but was in the neighborhood last week and asked about restaurants.  Sen Yai came heavily recommended.  Thai is established enough in Minneapolis that I'm fairly set in my favorites, but we decided to give it a shot.It was probably the best Thai I've had in Minneapolis for several years.  The fish cakes were a nice starter - not too greasy, with a tart dipping sauce for a counterpoint.  Pad see yew was garlicky and eggy with silky noodles.  The curry special was a red curry with a side of omelette and vegetables - reminded me a lot of dishes I ate in Thailand.Service was competent, although she seemed a bit like a deer in headlights around us.  (We're not at all scary people.  BOO!)  They could perhaps use some runners on the floor, as servers went clomp-clomp-clomping around the place.  When that's the biggest complaint, they are doing well for a smallish neighborhood place.Look forward to trying it again soon.", "Date": "2010-12-26", "Author_Location": "Washington, DC"}, {"Author": "Mary C.", "ReviewID": "zqCejL_MtqFSzNSxbzEjjQ", "Overall": "5.0", "Content": "A fried egg on top?! Are you kidding me?  Am I in heaven?  OMG...reminiscent of New Mexican food.  It was delicious.  As was the tofu curry.... mmm.  The curry dish was probably better than the noodle dish we had.  Other than the TERRIFIC food, I love the eco-friendly everything!P.S.  The waitresses and bartenders are all nice to look at.", "Date": "2009-06-07", "Author_Location": "Minneapolis, MN"}, {"Author": "Kristin E.", "ReviewID": "GXEQMY7JTPIvFzRA_5CDJQ", "Overall": "5.0", "Content": "I don't really know thai food, but this was fabulous!  Met the owner who was busing tables and he told us how he has been in the US since he was a toddler.  I love the local beers, the composting leftovers, and the emphasis on going local.  The prices are great, portions are realistic (small in american standards) and I love that it's in the neighborhood.", "Date": "2009-05-24", "Author_Location": "Fridley, MN"}, {"Author": "Niraj D.", "ReviewID": "OtcG8vc5gVuDXOPZYWbcKA", "Overall": "5.0", "Content": "First Yelp review, dedicated to Sen Yai Sen Lek. My roommates and I decided to go to this after the amazing reviews on Yelp. Definitely lived up to my expectations!To preface this, I am a vegetarian, and I really enjoyed having the option to add Tofu or Mock Duck with most of the menu items. I had the Pad Kee Mao with mock duck. The noodles were perfectly cooked, and the mock duck fused the flavors very well as well; its slight sweetness added to the spiciness of the overall dish. (Note: When you say \"Make it spicy, please\", they will not shy away from the Thai chilies!) The fresh basil was also perfectly sauteed.I also tried some of the red curry that was part of the \"Curry Special\" for the evening - it was also very well made. It was the right amount of spicy vs. sourness, and also had really good flavors in it.I've had Thai food many times in different cities, and I feel that this was one of the best ones I've had. The service was wonderful as well. Although it is slightly pricey ($12-15 per dish), it was definitely worth it. Highly recommended and will return to this restaurant!", "Date": "2011-02-09", "Author_Location": "Norwich, CT"}, {"Author": "BK J.", "ReviewID": "M2OzNrml8ZzH8htODDZxiA", "Overall": "4.0", "Content": "Rock solid Pad Thai backed up with good service.  No wait to have the water glasses refilled and quick response time from the kitchen.Nice to see a business owner taking a stand on leading issues.Definitely worth a return.", "Date": "2012-10-26", "Author_Location": "Minneapolis, MN"}, {"Author": "Randall N.", "ReviewID": "94p_B8n2s4mFgp_RWMMF5g", "Overall": "4.0", "Content": "I go pretty much from one job to another on Wednesdays and have a hard time finding food that's fast, delish and not able to be obtained via my car window. This place gives me a lovely ethnic option on those days when sitting down for a good meal just isn't an option. First, the guy who took my order was distracting me with his manly nerdy gorgeousness. Not that a staff's attractiveness has any affect on my rating but it certainly made my stop in there more enjoyable. To top it off he was incredibly nice. And not in the I'm in customer service and I have to be nice to you type of way. Second the dish I had was really good. Not the best Thai I've ever had but quite tasty. I ordered the Pad Kee Mao. Wide thin noodles with mushrooms, onion, chicken and green pepper. Little hint of heat. A creeping heat too. Since I put siracha on pretty much everything savory i could have used a smidge more. I was surprised at the amount of chicken they gave me. It was way more than the typical 3 chunks I've come to expect. I love fungus so I could have used more mushrooms in the dish but that's me being picky. The only thing I think I can complain about is the hint of anise, or something similar, that I tasted. It might be my least favorite seasoning. While it didn't ruin the dish for me by any means it was really unexpected. Not entirely unpleasant but a little bit. Again, that's a personal thing though. I still devoured it. All in all i will be adding it to my take out Wednesday rotation. I enjoyed every bite and for the price the amount of food combined with their sustainability practices is right on point.", "Date": "2012-10-24", "Author_Location": "Minneapolis, MN"}, {"Author": "Breanne K.", "ReviewID": "YAWcEzakIi_dQ48jNlQ0qg", "Overall": "4.0", "Content": "Sen Yai Sen Lek has really grown on me in the past few months. At first glance I wasn't very impressed when I tried take out for the first time. While the flavors and freshness was accounted for, I was thrown for a loop by their rations. I had ordered the Po Pia Sod (spring roll appetizer). These were not worth it. They are not the large & in-charge spring rolls I know. They are measly and skimpy and slimey. Good flavor, but if you must try them, don't do it as takeout.In time though I have grown fond of the closest Thai restaurant to me. Their tray of sauces/spices at the table always makes me swoon. My favorite is the slightly sour jalapeno hot sauce. When you get take out, they throw in these sauces for you automatically. It really rounds out the dish.They have great vegetarian options. I had a green curry mock duck special recently and have since added that dish to my favorites list! Sweet, spicy, flavorful; all the things a girl wants from her Thai food.Service is a little off, but I can overlook that because they are so damn nice! The cook came out to check out how our dishes were and to talk with us about the vision of the restaurant. Really nice touch. Especially since I saw it happen a few times.", "Date": "2012-04-13", "Author_Location": "Minneapolis, MN"}, {"Author": "Andrew W.", "ReviewID": "YjJsUKmR6y0HqF7AGxy1QQ", "Overall": "3.0", "Content": "NE has one major problem and thats a lack of Asian restaurants.  I was pumped to see this place open but slightly disappointed about the food.  It tastes good for you and thats almost contradictory to how I enjoy my thai food.  Give it a shot and see for yourself, maybe you'll love it but I'm more of a dirty oily street food thai taste kinda person. The people are great and the atmosphere is wonderful.  The bar area is nice and they have local beers on tap.", "Date": "2010-06-25", "Author_Location": "Minneapolis, MN"}, {"Author": "Katie L.", "ReviewID": "LL2toztsubhFGQjF8GfMSg", "Overall": "4.0", "Content": "YA-UM.  I usually avoid Thai places, not because I don't like Thai, but because I'm allergic to peanuts and find it really depressing how much it limits what I can eat.  I was pleasantly surprised at all the peanut-free obtions!!We ordered take out-- be aware because there are no numbers for each dish. So you actually have to pronounce everything you're ordereing. Not a very easy task, and actually is kind of embarrassing if you're not a Thai food expert.  We got Plo Pla Tod to start out with (crispy spring rolls with pork). You must get these!!! They are delicious and stayed crispy in the 10-minute drive home.  Also got Nuea Yang Naam Tok, which is an isaan sticky rice dish.  It's beef, cilantro, mint,  lime all mixed togeter with other various veggies and served with a portion of sticky rice. It's my understanding you use you hands to grab a hunk of sticky rice and use the sticky rice to pick up the beef. (At least, that is how I saw Anthony Bourdain do it once.) It was super-good. But the only thing I didn't like was the way it smelled. Which is kind of a make-or-break for me. As much as I liked the flavors, I don't think I'll order it next time because of it's strange aroma. We also ordered Pad Gratlem Prik Thai-- which is a super delicious rice dish made with simple inredients.Garlic, pepper, cilantro, bell peppers and chicken.  But something about the way they all come together is reall spectacular.", "Date": "2011-02-27", "Author_Location": "Minneapolis, MN"}, {"Author": "Rachelle T.", "ReviewID": "iaBTvCAtQa07jC_5NGOPeQ", "Overall": "3.0", "Content": "I have to give this place a solid three stars. It was good, but can't say it was out of this world. It has several positive factors: family owned, knowledgeable service and uses sustainable ingredients. Although, I was not a fan of the decor, nothing seemed to jive and it looked worn (in a bad way).The food was good, but I had to use the spice tray. I hope they don't dumb down the flavors for Minnesotan paletes. The portions are nice sized and they do not skimp on protein. I'll definitely go back and give it another try.", "Date": "2012-06-06", "Author_Location": "Minneapolis, MN"}, {"Author": "Peter D.", "ReviewID": "HHrwNVQgUZEUjqeXlkheEA", "Overall": "2.0", "Content": "After hearing all the rave reviews about this place, we finally gave it a try when we were in the neighborhood. All we could say was \"meh\". There are many better Thai places in town.  The decor is nice, but you'll be paying for it on your final bill. The menu has all the things you'd expect, but I was unimpressed by the red curry special they had and my girlfriend was unimpressed by her Pad See Ew (it's the national dish of Thailand - if you can't do that, you probably can't make anything). We both ate every bite though, since the portions were pretty small. The veggie spring rolls we had as an appetizer were actually pretty bad. The service was mediocre, and frankly kind of annoying as the waitress kept shouting the entire time to her friends who were at the restaurant and bar. I mean, lady, shut up, we're trying to enjoy our meal here.  There's really nothing *bad* to say about the place, but nor is there anything good to say about it. I can think of two That places that have WAY better food, cheaper prices, and bigger portions off the top of my head that leave you very satisfied (On's on University in St. Paul and Krung Thep on Nicollet), plus a few more that are better than this place, so we'll be sticking to those.  The fact that they use a lot of high quality local ingredients is a plus, but the lack of quality every where else doesn't make up for it.", "Date": "2013-10-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Ian A.", "ReviewID": "37l5mXIMRrlHIo9rGVllZQ", "Overall": "4.0", "Content": "I was really happy with my two trips to this restaurant.  Both times I got the lunch specials; during the first trip it was Curry Fried Rice, the second was Pad Thai.Both dishes were very tasty and were not that spicy.  Luckily they have three different ways you can spice up your dish.  I was able to add some pepper flakes and other condiments to get it perfect.The atmosphere is very laid back and the restaurant is set back an older part of town, giving this restaurant a very unique vibe.  I really like how they have advertise where they get their ingredients and also some of their other green-friendly practices. I am looking forward to my next lunch trip there to try something else.", "Date": "2010-06-03", "Author_Location": "Ramsey, MN"}, {"Author": "Logan C.", "ReviewID": "KejURYNnz6E_rxRe6wvRSA", "Overall": "4.0", "Content": "The food here was really good, but the restaurant was understaffed and therefore service was extremely slow throughout the meal. Definitely worth coming back when it's either not as busy or has more people working.", "Date": "2010-07-03", "Author_Location": "Ann Arbor, MI"}, {"Author": "Carla S.", "ReviewID": "nEJnwS2MdOUeEDfLa1ZzEw", "Overall": "3.0", "Content": "I really liked the atmosphere of the place. And the food was okay. I had the Pad See Iew Gai (thick noodles & marinated chicken)& the Po Pia Tod (eggrolls). We ordered to go but waited in the bar area for the food. The atmosphere is pretty upscale, relaxing, calming & the food was \"okay\". When we got home (we live about 8 blocks from the place) and I opened up my meal the food was room temperature. It was a little weird because the eggrolls were piping hot (& really good!) but the Pad See Iew Gai fell a little short from what I expected. All in all- I will try it again, I will def try something else & get the eggrolls again! P.S. parking sucks in this area!", "Date": "2011-01-24", "Author_Location": "Minneapolis, MN"}, {"Author": "Amelia B.", "ReviewID": "CiezEDjcz1S0x7D0Z4fugw", "Overall": "5.0", "Content": "My favorite Thai place in MPLS, and there are lots of reasons why. First, it's family owned, their ingredients are local, fresh, and they list where their meat comes from. Second, I love the decor (contrary to what some other reviewers said). It's bright, colorful, and clean and full of cheery paper birds dangling from the ceiling. Perhaps my taste is more whimsical than others like for dinner, but I love it. Lastly, and most importantly - it's delicious. My favorite is the Pad Kee Mao with chicken or shrimp, but it's all good. If you dine in, you may need the spice tray as they leave out the hot peppers and let each diner spice as they like. However, if you order takeout, they'll ask how spicy you want it and do that part for you. Go easy - a 4/5 can be pretty hot (even for this southern native with a more ambitious pallet than many in MN). I'll be sad to move away from Minneapolis soon, and some of that is that I'll miss Sen Yai Sen Lek.", "Date": "2012-06-17", "Author_Location": "Washington, DC"}, {"Author": "Joshua W.", "ReviewID": "iRcjWjaBI8yrRNezp-LigA", "Overall": "3.0", "Content": "Came here for lunch with my girlfriend. Our waitress was very courteous and explained the menu and the different options. She did say we would get some extras to add spice to our meal and that never came, however.Most of the lunch specials were only $8.95, and I thought the portions were normal sized.I got Pad Bai Gra Pow and it was delicious, lots of meat and fresh veggies. Only gripe I had with it was it was listed as spicy (one of the 2 on the lunch menu) and I wasn't impressed on that note.My girlfriend got the Curry Special, which was Green Curry and it was very good, and had the spice my dish lacked. I instantly wished I would have ordered the same.The decor was very modern and chic, recently remodeled, and I definitely liked that it is sustainable farm friendly and family owned.This place isn't too far from her place so I'm willing to try it again.", "Date": "2012-08-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Edward P.", "ReviewID": "DBR-DTGLl524Hs7ekQO72Q", "Overall": "5.0", "Content": "Sen Yai Sen Lek offers up some of the most delicious Thai food in Minneapolis -- bar none.  Hands down they've got the best fried spring rolls in town.  The dipping sauce is tremendous...it reminds me of the old days at The King and I.  My wife and I have gone there just for a glass of wine (they have a comfortable bar area) and multiple orders of spring rolls.Frankly, everything we've tried has been very good.  The Panang curry dish was savory, very fresh, had plenty of basil flavor and the portion size was great.  The fried tofu was perfectly crispy on the outside.  I often judge a Thai restaurant by its Pad Thai, and this dish hit the mark...the shrimp were done just right.Another thing I like is the relatively short menu.  To me a gargantuan menu projects mediocrity, so when I see a concise and descriptive menu like they've got at Sen Yai, I tend to breath a sign of relief.  They even have a kids menu, which is really a welcoming -- and unique -- feature at an Asian restaurant.  $5 buys a generous meal (like sticky rice, chicken wings and vegetables) and a scoop of ice cream (Izzy's).  This place is great.", "Date": "2010-04-17", "Author_Location": "Minneapolis, MN"}, {"Author": "Paola M.", "ReviewID": "J94f2wy0ERDg22eXzGRA5w", "Overall": "4.0", "Content": "I came with high expectations and I have to say they were satisfied. Now I don't know anything about thai food, my term of comparison is pretty much ching mai thai and chai thai on the west bank, but I was pretty happy with my meal.  And so was my BF.We started out with the fried spring rolls, which were pretty good, I think I burned my tongue eating them a bit too fast and too soon. Anyway, these are the risks of the job... The curry special was a red curry with chicken, and was also very good. It came with steamed rice, stir fried veggies and a little omelette. Bf had some beef and broccoli dish, with noodles and liked it a lot. I tasted it and was happy I chose the curry, I think there was a bit too much fish sauce in his dish for my taste, but he ate it all, so I am sure he liked it. By the end of the meal we were more than full and had to pass on the dessert. Maybe next time.Anyway, we liked it. Will be back when we are up for thai.", "Date": "2011-02-04", "Author_Location": "Madison, WI"}, {"Author": "Lindsay K.", "ReviewID": "_uldyLjZ1QyEEZ2L3giqaA", "Overall": "4.0", "Content": "I'm leaving my review at 4 stars because I've only tried a couple things thus far, but both were definitely good.The Laab Gai that they serve here is done perfectly.  The fresh lime juice, mint and cilantro, and healthy helping of scallion leave the dish holding the perfet balance of sweet and sour.  Sticky rice on the side. I personally prefer my Laab with a bit more spice, so I added some fresh chili sauce.  I also really like Tofu Laab, so look forward to trying that some time in the future.I tried the Tom Yum on a different occasion while battling a cold.  It was pretty typical as far as Tom Yum goes; soothing and spiced well.As for the service, the first time I went we sat at a table and the service was relatively slow.  This was quite some time ago, so whatever. The second time we sat at the bar.  One of the owners spent a good deal of time behind the bar, and was very helpful and friendly.  The girl that was bartending was very engaging and had a lot to offer as far as beer and wine knowledge, and was chatty but not intrusive.The atmostphere at Sen Yai Sen Lek is warm, the food is balanced, the ingredients are locally sourced by and large, and the beer and wine lists are thoughtfully crafted.  Looking forward to my next visit.", "Date": "2011-02-19", "Author_Location": "Minneapolis, MN"}, {"Author": "Jay B.", "ReviewID": "SBTLI2WmYx4hjlqSvbALiQ", "Overall": "5.0", "Content": "Wow, awesome food! I will add to the chorus of people praising the Khao Soi. This place put my regular Thai place to shame. The food was as fragrant as it was tasty. I plan on being back to this place soon.", "Date": "2012-06-27", "Author_Location": "Bothell, WA"}, {"Author": "Zach S.", "ReviewID": "sb9p1zdodS-PUM-m5i6cfQ", "Overall": "4.0", "Content": "Great place. Authentic.  Great service.Good food.Desert was an A+.My wife is Thai and she loved it. Said it was \"wery authentic\".  The desert was warm banana over coconut milk and sticky rice.  I will get this every time we go back.  I put a picture up with the desert.  Worth a try fellow yelpers!", "Date": "2012-11-23", "Author_Location": "Coon Rapids, MN"}, {"Author": "Jess L.", "ReviewID": "SjykcFrhuOn785VCRlzr3Q", "Overall": "4.0", "Content": "I had lunch here today with a friend.  We ordered from the lunch menu.  Smaller portions, a few bucks off the full portion price--we both felt like we got full portions!  It was so much food and SO GOOD.  My Pad Thai came with chicken and tofu, which was a bonus in my book.  I love tofu!  My friend's dish was equally awesome and tasty. I was really impressed by their composting process.  Your leftovers--if you have any--will be composted instead of being thrown away.  I know this is a costly system to keep up, but it's a wonderful addition to any business.  I was equally impressed with their list of local and organic companies and ingredients.  There is a local farm whose owner delivers the eggs to them!I'm holding back my fifth star because I found a bit of egg shell in my food.  I have yet to find a place that manages to keep all of the egg shells out of the food.  Otherwise, great food and awesome service!", "Date": "2009-11-05", "Author_Location": "Minneapolis, MN"}, {"Author": "Michael P.", "ReviewID": "S8hqEfgRVn14u-ubDtCwdQ", "Overall": "4.0", "Content": "Sen Yai Sen Lek is great! I took my gf's little brother here one night. When you walk in the interior looks small but there is a second room that you kind of over look, even though the wall is wide open. It was a nice cool night so we decided to sit outside, in the very limited outdoor seating. The service outside wasn't great but it was decent I can't really judge based on service sitting inside vs outside if that made a difference since this was the first time I'd ever eaten here. For starters we ordered some very good tom yum soup. I then had a Pla Pad Prik and lil bro had a pad kee mao. Both dishes were very good and very authentic. I would normally have gotten pad thai as a comparison versus other thai restaurants that I'd been too but I decided to try something else on the menu that looked very good as well. Next time I will try the pad thai. I'd recommended this place, I know I will be going back again!", "Date": "2009-08-20", "Author_Location": "St Paul, MN"}, {"Author": "Andrew W.", "ReviewID": "sIeAZGLMChBI-5V9c8ElcQ", "Overall": "4.0", "Content": "Fantastic. The dishes that we had, one curry and one noodle dish, were out of this world. Of course, don't forget the sticky rice:) It is energizing to see the magic of authentic Thai cuisine combined with a dedication to local and organic sourcing. The service was a little hit and miss, but it wasn't too bothersome given what we got in return. We will be back often and be singing the praises of Sen Yai Sen Lek far and wide!", "Date": "2010-11-10", "Author_Location": "Minneapolis, MN"}, {"Author": "Heidi G.", "ReviewID": "978kXA4V39-auoSANYhK7A", "Overall": "4.0", "Content": "I've been to Sen Yai Sen Lak twice with a friend who is an acquaintance of the owner. I'm not often in NE Mpls, but I'd been meaning to try out a few places on Central and this was a good place to start. The restaurant is small but lively. Good color, welcoming environment, nice employees. The branding and design of menus and other paper products were matched well and offered a fresh take on what otherwise would look like a hole in the wall.Most recently, I ate the Pad See Iew and it was pretty darn good. I'm big into noodles, not so much into rice, so I more often go for the noodle dishes. This one was good - nice variety of veggies, noodles and meat. It was a tad bland in the flavor department, but I fixed that real quickly with the array of sauces they leave on the table. The chili sauce gave it the nice kick that I needed. And as with any Thai food restaurant, get a Thai Iced Tea. Always a necessity for me. And for dessert, the mango on coconut sticky rice is always a crowd pleaser.Cons: The server wasn't stellar, but was still semi-attentive. Parking is a pain in the butt, but if you can find a spot on the street from 1-5 blocks away - totally worth it. And the chopsticks; bring your own! They provide the cheap-o sticks and I've managed to get the yucky splinter filled ones both times I've been here. I should just start keeping a good pair in my purse at all times.", "Date": "2011-01-08", "Author_Location": "Minneapolis, MN"}, {"Author": "Laura F.", "ReviewID": "quH97PZRyZkkWHVBjtW_8Q", "Overall": "4.0", "Content": "Our family loves this place. But it is a bit more costly to feed a family. I love that they source local foods. I also wish they offered a vegan fresh spring roll, it just just doesn't feel right going out for thai with out them. The food always tastes great so it's always worth the trip.", "Date": "2013-08-31", "Author_Location": "Saint Paul, MN"}, {"Author": "Kris B.", "ReviewID": "PaHiX50rGyS7UbbNiTSnQg", "Overall": "4.0", "Content": "The food at this place is amazing.  Delicious, fresh, spicy, authentic, interesting.  I agree that the service could be better -- have been there three times.  First time, the service was great.  Second time, very slow.  Third time in between.  The verdict?  Don't go here when you're in a rush to get to a movie after dinner.", "Date": "2009-10-09", "Author_Location": "Saint Paul, MN"}, {"Author": "Natalie N.", "ReviewID": "FN18xrjvH75Yjwi1jtWdqA", "Overall": "4.0", "Content": "I made my first visit to Sen Yai Sen Lek months ago, after hearing many friends rave about the food. I too am now hooked, and Sen Yai Sen Lek has become my go-to spot for Thai food in Minneapolis. The food is just delicious. Their menu offers a great variety of authentic Thai food- sticky rice dishes, noodle dishes and curries. If you're in the mood for an incredibly flavorful and satisfying noodle dish, try the Pad Kee Mao or the Khao Soi - you can't go wrong with either one. For appetizers, I've had the Po Pia Tod (fried spring rolls), Po Pia Sod (fresh spring rolls) and Gai Satay - it's all good. I was pleasantly surprised to find that the Po Pia Tod weren't saturated with grease as you might find with fried spring rolls at other restaurants.   The prices are reasonable considering you'll probably have leftovers from almost any main dish you order. They also offer a discount if you come in for lunch within a week after you've dined here for dinner (just show your receipt). One thing that I really love about this place, that sets it apart from other Thai restaurants, is that nearly everything they serve is sourced locally (including beer and soda). Also, the service here is great - the waiters are very helpful, attentive, and always have great recommendations for new things to try on the menu. The atmosphere is quaint, casual and relatively quiet. Sen Yai Sen Lek is an excellent option for Thai food lovers in Minneapolis. I can't wait to go back!", "Date": "2013-07-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Eric S.", "ReviewID": "KCEqb8NtzLjEPy-8nQ7ZFw", "Overall": "2.0", "Content": "So disappointed. Super fresh ingredients, but... Som Tam made without fish sauce or chilis or lime?  Curry special and pad see ew were ok, not great, but we couldn't get past the inauthentic salad. Back to the Hmong market!", "Date": "2013-09-14", "Author_Location": "Minneapolis, MN"}, {"Author": "John H.", "ReviewID": "ShEVutQblSyQLnfNpbEpdw", "Overall": "5.0", "Content": "The best little Thai restaurant in NE Mpls.  I've eaten here several times since they've opened and yet to order something other than their daily special.  Always something new and delicious.  They also serve locally brewed MN beers which is a nice touch too. P.S. - They have a great menu selection for kids.", "Date": "2009-11-28", "Author_Location": "Minneapolis, MN"}, {"Author": "Jim N.", "ReviewID": "oRkqbCif73R_kQ5f9u9p4Q", "Overall": "4.0", "Content": "Sen Yai Sen Lek is a nice change from the other local Thai joints in town.    I have a hard time deviating from my favorites here, the fresh spring rolls and Khao Pad Kapi especially, and the daily curry special is always tasty.   I love how the dishes are presented here, the different components are often separated on the plate for the diner to mix together, which I'm told is the traditional way.  They also have a thoughful but small selection of local craft brews.Service can unfortunately be inconsistent.  I wouldn't recommend dining here if you're on a tight schedule.", "Date": "2012-04-23", "Author_Location": "Minneapolis, MN"}, {"Author": "K M.", "ReviewID": "F54pZBFg0G7PBnmq9ajWJw", "Overall": "5.0", "Content": "Really great Thai food and cool helpful staff.", "Date": "2011-05-20", "Author_Location": "Venice, CA"}, {"Author": "Tara J.", "ReviewID": "G8CyuLzRVJdnzsa987bUTg", "Overall": "5.0", "Content": "I just ate here for the first time last week, and I was very impressed.  The decor is minimalist and cheerful, which is a nice change of pace from many Thai joints.  The service was very quick and friendly, both at the bar and in the dining room.  I had the tofu satay and Pad Pak Taohoo with mock duck.  Both were delicious...fresh vegetables, strong spice and excellent peanut sauce.  They have a nice happy hour if you sit in the bar - 1/2 off of taps and appetizers.  I will definitely be going back!", "Date": "2009-04-21", "Author_Location": "Minneapolis, MN"}, {"Author": "Michelle H.", "ReviewID": "a23hWD1D8jUH0AJpD7WUXg", "Overall": "4.0", "Content": "Love the farm-to-table mentality of this restaurant. Every dish we've tried is delicious and interesting.", "Date": "2013-06-19", "Author_Location": "Mounds View, MN"}, {"Author": "Laura P.", "ReviewID": "ICO-QLEW3zG5sU3UMjxJ_g", "Overall": "4.0", "Content": "I am so torn!!! I am going back and forth about giving this place 3 or 4 stars. Here's my dilemma, folks. I would give the restaurant, itself, 5 stars. The food was amazing and plentiful for the price. My co-worker and I started out with a fried spring roll appetizer. It was amazing!!!! The meat and veggies were seasoned and delicious, very fresh. The sweet and spicy dipping sauce was nom-nom-nom-alicious. We ordered a Cane Cola to drink with our meals which was also very sweet and satisfying. It's made with real cane sugar, so it has a nice sweet flavor, but it's not syrupy and as acidic as you often get with regular colas. I ordered the special for the evening, which was chicken curry for $15. I received a bowl full of heaven!!!! The chicken curry had good cuts of chicken and an array of fresh veggies. The curry was smokin' hot spicy, just the way I like it. I also was brought a plate with my rice, a side salad, and a thai omelet. The salad was carrot strands, sprouts, and some spinach leaves. The thai omelet was delicious!!! I've never had one before. The presentation was great and the food tasted so so so good. The restaurant is really cute. It's colorful and modern looking. The walls are painted in bright primary colors and there are colorful paper cranes hanging throughout the place. The art on the wall is appealing and modern. It doesn't have the feel of a traditional thai restaurant, which I thought was a refreshing change. The space echos quite a bit, however. There was a gathering of a gaggle of middle aged women that we gossiping loudly in our proximity and I found it to be a bit overwhelming of our dinner conversation. I think the concrete walls of this place kind of intensified the drunken screeching of the 40-somethings. Eh, annoying. But they seemed to be having an good time, which was cool. So, sounds good so far, right? Yup. Everything would have been totally great, buuuuuut.. . . . Our waiter was a little too inattentive. My friend and I arrived around 7:15pm. We didn't get seated until about 7:30pm. Our orders were taken promptly enough, and we received our beverages and appetizers in a timely fashion. But then we didn't get our main dishes for about 40 minutes after we had our appetizers. Our waiter graciously apologized and said it was all his fault and then he told us that \"desert is on me, ladies\". Which, I was like \"hell yeah!!\". Our food was brought to us hot, so atleast it didn't sit there at the serving station getting cold while he ran around and entertained the table full of moms. Then after we got our food, we ate all that we could and decided to take the rest home. Upon completing the eating, we ended up waiting another half hour for our waiter to bring us our tab and some to-go boxes. He brought us the desert menu and told us to pick something out, which we did, and then after having done so, he brought us our tab. Much to our surprise, he charged us for our deserts that were supposed to be \"on him\". My co-worker brought it up and he said that he could take ONE of them off. So. . .I was kind of turned off by that. I wouldn't have ordered one if I knew I'd have to pay for it because me and my co-worker were requesting them \"to go\" anyway. So, whatever, I guess it is what it is. But after we paid, we sat at our booth and waited another 20 minutes to get our desert. What the hell?? It was ice cream and fried bananas!!! By this time, I was just getting irked. They weren't toooooo incredibly busy, but it appeared that they only had 3 waiters/waitresses and a bus boy working on the dining floor. The \"Mom's Night Out\" table had 10 women at it, so I understand that they might demand a little more man power, but I was kind of peeved by the end of it all, excuses or not. Our waiter was incredibly charming and charismatic, so he kind of gets away with it with me. Anytime I'd get annoyed with his lack of attention to our table, he'd swing by and schmooze us a little and I'd get all googly-eyed and stupefied. So, atleast he has that going for him. Total time spent at Sen Yai Sen Lek: A little over 2 hours. I would say that we spent an hour or so of that time WAITING for stuff. Not cool. But since the food is SO SO SO amazing, I will be back. I think next time I will be more vocal and demanding so I don't end up wasting my entire evening waiting on the waiter.", "Date": "2009-09-18", "Author_Location": "Minneapolis, MN"}, {"Author": "Afsheen F.", "ReviewID": "A_w7fRMgGR5ocy9ckQwaGw", "Overall": "1.0", "Content": "It is a rare restaurant that makes me vow never to come back, and even rarer when a restaurant is so disappointing that I cannot even finish my food. This is such a place.I understand why people come here. It has a nice atmosphere, and it is (as far as I know) the only Thai place in the NE. However, the food and service leave much to be desired.While I appreciate good service - a restaurant with bad service and good food gets a pass in my book. At Sen Yai, the food cannot make up for the service, nor can the service make up for the food. The server was prompt initially, yet was slow to bring our beverages, and even slower in returning to take our order. It was poor service defined: every time we needed something we had to wait several minutes, realize that the server was not coming, then attempt to flag said server whenever we saw him next. Then wait for an even longer time for a glass of water, or another beer. Simply unacceptable.The food was terrible. I, seemingly like many fellow Yelpers, have spent a good amount of time in Thailand. This doesn't compare. It doesn't compare to Taste of Thailand. It doesn't compare to my first attempt to make pad thai upon returning from Thailand. The pad thai at Sen Yai was bland. Yes, it looked like it had the proper ingredients - but somehow it was missing all of the flavor. The tilapia was slightly better, at least it was spicy like I asked, but it was just heat without flavor. Again, very disappointing. I don't even want to delve into the appetizers, we had the lettuce wraps - aka some pieces of snail-rejected lettuce with some typical Thai condiments - which were not appetizing in the least. Perhaps the other appetizers would be better, but based on my experience, Sen Yai Sen Lek would have difficulty making a decent spring roll, since it had such difficulty in making a passable spring roll.The food was overpriced compared to what you can find in Frogtown, similarly priced to the Thai offering in Uptown, all of which have better food. I was pleased with the beer selection though, and was glad to have the option of mourning the terrible food with a solid Thai beer. Next time I'm in NE and crave a Chang or a Singha I may head over to Sen Yai Sen Lek, but only after I first fill my belly with real Thai food elsewhere.", "Date": "2010-05-02", "Author_Location": "San Diego, CA"}, {"Author": "E P.", "ReviewID": "HxyQLz0gnAaZYtYLtLc8Eg", "Overall": "2.0", "Content": "Plain and simple Panang curry  taste like FROM packet , this i can make at homeMy friend had a soup with dumplings he was unimpressed SUPER SALTY.The fish cakes not the best not the worst Everthing was very expensive over 45 dollars for two at lunch is a bit high for NORDEAST its working calss not uptown", "Date": "2012-08-21", "Author_Location": "Minneapolis, MN"}, {"Author": "MN S.", "ReviewID": "Dxcwz6gcEAsTJBlb_JVEFw", "Overall": "3.0", "Content": "Went there on a slow Monday night - was originally going to go to Holy Land Deli but decided to go to Sen Yai Sen Lek at the last minute.     I would give this place 4 stars for the food but 2 stars for the service.    Having been to Thailand about 6 times in the last 10 years, this food is amazingly authentic.   I echo what other reviewers say about the quality of the food.   The use of the fresh spices and the fact that they don't ask you the annoying Sawatdee question \"and how many peppers would you like your noodles\" was refreshing.     Tried the pad thai and little touches like the use of pickled radish (I think that's what it was) and the perfectly fried up tofu as well as the fact that they brought the standard 4 condiments to the table was commendable.Where I had issues was the slowness of the service.  There were maybe 5 tables that were occupied and 2 servers.   We arrived at 6:15pm and didn't get our order served to us for 30 minutes.   Normally, items like spring rolls arrive within 5-10 minutes of placing the order and when you're eating with a 6 year old, having food served quickly is important.      Given the quality and authenticity of the food, this restaurant is definitely worth a second visit to hopefully validate that their service is actually faster than what we experienced.", "Date": "2009-10-06", "Author_Location": "Ramsey, MN"}, {"Author": "Palmer V.", "ReviewID": "9sj0rJVSjRBjW5jVVUxJEQ", "Overall": "2.0", "Content": "Wow! Waited over half an hour after being seated for our hors d'oeuvres and then another 40 minutes for relatively simple entrees. Our server was curt and explained that \"the kitchen only has two woks and everything is cooked to order and that this is a normal weekend wait,\" perhaps, but a warning to first-timers would be nice; we probably would have gone somewhere else with equally good food (the meals were very good) but much better service, e.g., True Thai....in short very good food, very (too) long wait for it.", "Date": "2012-12-01", "Author_Location": "St Paul, MN"}, {"Author": "Julie S.", "ReviewID": "gMUbwKHWp0u6vq6V6utsWA", "Overall": "4.0", "Content": "Finally!  I finally made it to Sen Yai Sen Lek, after so many trips past it on the way to Suzi's (which, of course, we went to after dinner).  I really want to give this a 3.5.  Why don't we have half stars??  I am going to round up to 4 because of the really fresh flavors and ingredients.  Also because they compost your leftovers, if you don't want to take them home (which we did), and because I love that they use local ingredients and even have things like organic beer on their list.    First impression, I love the decor.  Clean and minimal, yet warm and inviting.  Kind of hipster, without being bad hipster.  It reminded me of a spot I'd find in my favorite neighborhoods in NYC, Chicago or LA.  The hostess was very welcoming and friendly. After getting seated, I felt really crowded against the table behind us though.  The guy behind me and I kept bumping chairs.  Not the worst thing in the world. I can live with it.  Just kind of annoying because he was fidgety and there was a ton of room on the other side of their table, so I couldn't understand why it was shoved up against ours.They brought our menus and water immediately, but no waiter came over for almost 10 minutes. This is after we told the hostess that we were ravenous when we came in.  hmm...  Once he did, he was really friendly and listened to our dietary requests attentively (we had a no wheat issue, a pepper allergy and a veggie-only request and all came out exactly as we needed).  My friend had an entree only and I had an entree and cup of Tom Yum.  A pet peeve of mine is when my app and entree come at the same time.  I cannot eat both at the same time, so that means something gets cold.  I would give the benefit of the doubt and say that he did it because my friend did not get an app, but I was a server in a past life too.  You just ask what the customer's preference is to clarify.  Our beverages came, but no soup until the entrees came out.  Boo!  That being said, my sticky rice and sliced beef salad had great flavors (nice onion and lemongrass).  I wish I could have gotten a knife, as the slices of beef were pretty large and just slightly too cooked to be tender enough to cut with my fork.  By the time I got to my Tom Yum, it was getting cold.  It had a ton of veggies and a good lemongrass flavor to the broth.  Not a ton of chicken, but that is actually ok with me.  The straw mushrooms are my favorite part any way.  My friend's curry was delicious.  Great variety of fresh veggies. I liked it and I would definitely go back if I was in NE and wanted some Thai. It was good.  It didn't blow my mind though.  I think I just got a little spoiled by living in Chicago for eight years, where there is fantastic Thai all over the place.", "Date": "2009-11-06", "Author_Location": "Minneapolis, MN"}, {"Author": "Lxs S.", "ReviewID": "vQk0F6QCzv_xTfMakJxEQA", "Overall": "1.0", "Content": "First thing I notice upon sitting down is the sign saying 'WE COMPOST'.  Well ya know what?  That does not put me in the mood to eat - it makes me want to run out back and find some worms to throw in the compost pile.Next - we have to ask for chopsticks.  And the waitress carefully counts out chopsticks for everyone at the table except my niece, who is 10 - and Chinese - huh????Now the food begins to arrive.  Everything was a disappointment.  Lettuce wraps were stingy in size, and the ingredients themselves were nearly unrecognizable having been chopped too small to identify.  The only thing you could figure out were the teensy (less than 1/4-inch) dried shrimp.  They were tough and fishy-tasting.  The Pad Thai was the worst I have ever had - bland and boring but there was plenty of shrimp.  The fresh spring rolls were icky!  Not a thin rice paper artfully bursting with fresh spring flavors.  Instead, a heavy, doughy nearly pasta-like wrap that so overwhelmed the contents, I couldn't tell you what was inside.  The beef salad was the highlight - well-balanced flavor but again, a small portion for the price.  We had a curry (with chicken) that was ok, but nothing special.  And if you want rice, you practically have to wrestle it out of the wait staff.  We were a table of 6 and they brought 1 small cup, we asked for more and got a 2nd small cup.  Perhaps the compost pile gets priority over the paying customers?", "Date": "2010-05-17", "Author_Location": "Corte Madera, CA"}, {"Author": "Josh M.", "ReviewID": "6fDVW2B7YFB0NA8jDo2s9g", "Overall": "3.0", "Content": "I hate to write a bad review based on one entree, but they overcooked my tilapia and then served it cold.  Perhaps because it was new years eve? Their idea of extremely spicy is over-spiced, not hot.  Chai's on Cedar has curries and papaya salad that will show you what spicy means.", "Date": "2010-01-06", "Author_Location": "Milan, Italy"}, {"Author": "P X.", "ReviewID": "qCerYypWDyLW-R1NYG6oZw", "Overall": "3.0", "Content": "I don't know what it is about Sen Yai Sen Lek, but it just doesn't seem to be able to \"hit it\" in the way that I expect every time I dine there. I have been to Sen Yai Sen Lek a handful of times, always during the lunch time, and have ordered the specialty curry of the day, Pad Thai, Tom Yum, and both the egg rolls and spring rolls during various trips. I do have to say that I like the egg rolls (the pork version), however the spring rolls are wrapped in a weird paper that wasn't palatable.  The Tom Yum is ok, but never has the spices that I want it to have (and the last time I was there, the tofu was cut into huge pieces that I could not put in my mouth because I couldn't handle the texture and chew factor).The service is always friendly, but just really random and slow. Overall it is ok, but not the best..hence the three stars.", "Date": "2010-12-26", "Author_Location": "Minnetonka, MN"}, {"Author": "Lisa S.", "ReviewID": "Qu4EJuahRlirxvRTVUOGWg", "Overall": "4.0", "Content": "Very impressed with this restaurant on Central.  The Po Pia Tod is tasty with a great dipping sauce, I get the Khao Pad Gai, great flavors, large portion so there is enough for left overs (and I'm a hefty eater).  My husband likes the curry dishes, although he still prefers Chiang Mai Thai (uptown).  We go here when we don't feel like driving to Uptown from the NE.  We like the outdoor seating available so we can bring our dog.", "Date": "2009-11-03", "Author_Location": "Anoka, MN"}, {"Author": "Drew C.", "ReviewID": "Y1MfzAo91kZKpSA6vSXG4Q", "Overall": "5.0", "Content": "Top 2 Thai restaurants in Minneapolis, awesome spring rolls (po pia tod)!!! I also love the neighborhood. Super friendly service, great atmosphere, food is fresh and not too spicy and you don't like the heat, they have Surly and Ommegang available, just a cool place. I highly recommend it if you are having trouble finding your 'go-to' thai place, great change of place date location...you won't be let down, cool bar too.", "Date": "2011-07-16", "Author_Location": "Minneapolis, MN"}, {"Author": "Lindsey B.", "ReviewID": "d_GpN2ePj8MgVThSKY_Zqg", "Overall": "5.0", "Content": "The food here is great! We have yet to order something that we didn't like. My fave is the pad Thai... my bf loves the spring rolls and all of their curries. Check it out and say hi to Joe, the owner. He is always there.", "Date": "2010-03-07", "Author_Location": "Minneapolis, MN"}, {"Author": "Serenity S.", "ReviewID": "Sq1UOgj2D_q2D1kVc4JGcA", "Overall": "5.0", "Content": "This is the best Thai food in Minneapolis. The curry and spring rolls here are unique. The service ranges from pretty bad to excellent depending on the day/staff but the food is always superior.", "Date": "2013-02-04", "Author_Location": "Minneapolis, MN"}, {"Author": "Kelly B.", "ReviewID": "bG3yCYPlha8m1vs-FYsvrQ", "Overall": "5.0", "Content": "I have been to Sen Yai Sen Lek several more times and LOVE it.  My Fiance' loves the little spice/sauce selection they give you.  The food is superb.", "Date": "2009-05-10", "Author_Location": "Minneapolis, MN"}, {"Author": "Nicholas P.", "ReviewID": "_PRgF9kh6lqfZfCW1eQp-Q", "Overall": "4.0", "Content": "I love that there is a thai restaurant in Northeast.   This place does a lot of things really well.   I've only actually been to this place for take out, but I'd like to get in there and chill for a while with dinner.    They have great local beers on tap and that says a lot to me.    I think that the food is amazing here, and very authentic.    I've had the standards, egg roles which are excellent, Pad Thai, Pad See Iew,  but I also have tried the Pad Kee Mao which was excellent and spicy!!!   I would highly recommed this restaurant if your into support local people bringing us authentic food!  Can't wait to go back!", "Date": "2009-11-05", "Author_Location": "Minneapolis, MN"}, {"Author": "Kevin M.", "ReviewID": "-V2NUQaNlFkK-O0e5_Xjcg", "Overall": "3.0", "Content": "The space is great.  Right on Central and Lowry, easily accessible from several bus lines, versatile enough configuration for big groups or intimate gatherings, and the staff is really friendly and helpful.  Everything they do showcases their carbon-neutral cred, from telling us the names of the local farms they source meat from to the food recycling program they tout on the menus.  The beef salad I had was beyond wonderful, and Lisa's Tom Yum was so citrusy we didn't even need the spice tray.Here's the problem, though.  We still asked for the spice tray when we ordered.  It never came.  Nor did one of our companion's spring rolls, until we inquired about them.  We had to remind our server what our drink orders were.  We waited almost twenty minutes to order, and almost twenty to pay.  On a Wednesday.  To be fair, it was a busy Wednesday.  I don't begrudge them the fact that they had a lot going on.  But if they're going to be a popular restaurant on a major crossroads in a hip part of town, they should hire enough support staff (I didn't see any bussers all night) to keep themselves looking professional.  I'll come back, but I'll make sure I have a book to read and a little time to while away when I do.", "Date": "2011-05-18", "Author_Location": "Minneapolis, MN"}, {"Author": "D M.", "ReviewID": "rjaWxARP0dOHIIELAamPjQ", "Overall": "4.0", "Content": "Went for lunch on a rainy Friday afternoon.  Not very busy, and the staff was quite accommodating.  The food was awesome!  Tried the fried spring roll appetizers, and they were the most amazingly tasty version of a fried food I've tried.  Usually, spring rolls are rather bland & all the taste is in the sauce - here the roll shined on its own.  There was individual layers of taste between the chicken, carrots, shredded cabbage, etc....the thick sweet/spicy sauce they served along side was also a treat, but clearly not needed to enhance this dish.Both of us had the Khao Soi, a spicy beef & noodle dish, smothered in a coconut broth.  We asked for spicy & we got spicy!  The nice thing was that the spice wasn't the only layer of flavor in the dish.  While it was plenty hot, it didn't overpower the coconut, the tender cubes of beef, or even the subtle noodles.  It was a hit.  And such a large portion that we had to ask for a plate of brown rice to soak up all of the broth after we finished the beef & noodles!  I'm definitely going back, and exploring this menu further......", "Date": "2010-05-08", "Author_Location": "Minneapolis, MN"}, {"Author": "Rachael W.", "ReviewID": "uKrS0HvjaOQjYLORvI11pw", "Overall": "4.0", "Content": "A great alternative to uptown dining; quiet and delicious.  Great staff and great menu.", "Date": "2009-06-07", "Author_Location": "Brooklyn, NY"}, {"Author": "Adrian H.", "ReviewID": "ofBaR8pejBT_BvlDGmEUGQ", "Overall": "5.0", "Content": "I worked in a fairly authentic Thai restaurant during college and ate some pretty obscure stuff back in the kitchen with the Thai staff, including beef testicles at one point, but I never came across anything quite like some of the dishes here. This is now my favorite Thai restaurant in the Twin Cities, the flavors are fresh and original and the ingredients are sourced locally. Try the lettuce wraps appetizer, it is amazing.", "Date": "2010-02-22", "Author_Location": "Minneapolis, MN"}, {"Author": "Jessica K.", "ReviewID": "q7gznCG2-1WB4aL5mGTz2g", "Overall": "4.0", "Content": "My hubby and I went in for a weekday lunch, so the place was not busy at all, and were attended to right away. When I said I couldn't eat gluten, which comes from wheat, the server said she'd go back to the kitchen and check for me. She came back with a handwritten list from the chef, making my dining choice much quicker and easier. (I suggested they make a special menu for gluten free or add notations when they redo their current menu) We shared the fish cakes (a little chewy, but the kafir lime tasted great and we couldn't get enough of the cucumber relish that it came with) The beef dish we shared was good, the meat was soft and the dressing was fresh and spicy. For dessert we had the fried bananas and coconut ice cream, so worth it! The bananas are fried in coconut milk, yay, so gluten free and delicious!", "Date": "2009-03-05", "Author_Location": "St Paul, MN"}, {"Author": "Skippy R.", "ReviewID": "-6pV6Kawxl-_w00nSalpqw", "Overall": "5.0", "Content": "Sen Yai Sen Lek is the best Thai food I've ever had anywhere (and I'd consider myself a bona fide Thai food nut who has been to places in NYC, Chicago, all over Minneapolis, London, and California). I can't think of a bad thing on the menu except for the Rad Naa, which I just don't care for. The ingredients used are always fresh, the spices are complex and surprising, the staff is amazing.That brings me to my second point: while the food is spectacular, the folks who work at Sen Yai are friendly and they seriously know what they're doing. Just watch the interactions between the cooks, the owners, the waiters, and the patrons and it will quickly hit you that these customers are friends and neighbors who keep coming back again and again. The regulars aren't just there for the grub, they're made to feel welcome and appreciated. In return, you have a whole army of people who know the menu by heart and will tell you the same thing I'll say: for healthy, fresh, really interesting food in Minneapolis, very few rank up there with Sen Yai Sen Lek.", "Date": "2011-11-25", "Author_Location": "Minneapolis, MN"}, {"Author": "Ms. A.", "ReviewID": "aKiZx-xTemJ4JXntyPgmtg", "Overall": "5.0", "Content": "I was thrilled with the amount of vegan options on their menu and they were even able to make me a vegan Thai iced coffee with soy creamer!  Vegan pad thai was delicious and the fried tofu appetizer was good.  The portions were huge and the prices cheap.  Loved it.", "Date": "2012-08-12", "Author_Location": "Menlo Park, CA"}, {"Author": "Adnama N.", "ReviewID": "4JuffpA00mt8WH0eAJdl4Q", "Overall": "5.0", "Content": "My favorite is the Khao Soi with beef.  A complex combination of flavors will make you ooh and ahhh. The curry specials are good, but be aware that they are pretty spicy compared to the rest of the menu items. Great beer selection too.", "Date": "2013-02-07", "Author_Location": "Minneapolis, MN"}, {"Author": "Eduardo P.", "ReviewID": "WxgFco-Z6kLR2I2QpsErYQ", "Overall": "5.0", "Content": "I've been eating at this place for about 4 years now.  NOT ONCE have I been disappointed.  Their Thai food selection is diverse, complex, healthy, tasty, fresh, and downright delicious.  The owners are pleasant and take the time to get to know your food tastes.  They recently upgraded their air conditioning system so the place is very comfortable on the hot humid summer months.  They offer several different curries daily, usually a red or green curry which is rich, complex, spicy and well done to perfection.  Another dish Mian Kam is a hands on delight.  It is served with kale leaves and a selection of chopped ingredients from shrimp, jalapenos, roasted grated coconut, limes, peanuts, garlic and a type of spread to slather all over the kale.  You make your own hand held appetizer to your liking.  I go about 1-2 a week because I am guaranteed a pleasant dining experience.  The menu is affordable for what you get and the place is not yupscale or uppity in any sense.  It is casual and you are made to feel quite welcome.  Oh, the pad Thai is the best in town.  They don't simply warm the noodles and add the other dish ingredients, they actually saute the noodles in their wok so the noodles are infused with complex flavors.  One of my favorite dishes.  They have a good selection of rice and soup dishes as well.  It's a must place to visit.", "Date": "2013-09-11", "Author_Location": "Minneapolis, MN"}, {"Author": "S O.", "ReviewID": "qeFV6krDCyC3_D3scSr_RQ", "Overall": "2.0", "Content": "Service was pretty, pretty slow. Some who waited to be seated were left waiting longer than they should have. Requested a tea bag and didn't get it the entire time there. I thought the food was ok, I agree that the noodle dishes were not really seasoned well. They had flavor but lacked saltiness-- and I like less salt, actually. Except for the Tom Yum soup which was really salty, and it didn't really taste like Tom Yum. In all, it's really not a bad place to eat but I wouldn't go out of my way to come here like I did this time. And if I did, I wouldn't get the same thing.", "Date": "2012-08-22", "Author_Location": "Minneapolis, MN"}, {"Author": "Jennifer K.", "ReviewID": "jkhr4H_0C0IuyxcUa_yIbA", "Overall": "3.0", "Content": "I wasn't too thrilled with this place. The food tasted good and fresh, it just wasn't too exciting.", "Date": "2009-06-24", "Author_Location": "Saint Paul, MN"}, {"Author": "Jennie S.", "ReviewID": "P-dvLm-DK8c8pSCzN2ifLg", "Overall": "5.0", "Content": "I think this may be the most authentic Thai restaurant I've been to in the US. Really delicious and not just your standard fare that you find in most Thai restaurants.", "Date": "2012-08-02", "Author_Location": "St Paul, MN"}, {"Author": "Justin F.", "ReviewID": "-VyKhX6FIauNGZ5tQdmiIA", "Overall": "5.0", "Content": "Very awesome restaurant and the owner still works in the kitchen so you know that everything is being made tip-top! d", "Date": "2011-07-17", "Author_Location": "Duluth, MN"}, {"Author": "Linnea C.", "ReviewID": "L3x8NgwDGSj2Ilav1yMMmg", "Overall": "5.0", "Content": "This is one of my favorite Thai restaurants! Plenty of vegetarian options for me. I always leave satisfied and wanting to come back. I finally tried the red curry and it was perfect. The staff is very friendly and helpful. Not only do they use local ingredients, they also compost both food and paper products. Sen Yai is win-win for me.", "Date": "2011-10-14", "Author_Location": "St Paul, MN"}, {"Author": "Kelly J.", "ReviewID": "_9g9HvdMFzxKAN8N7m8msg", "Overall": "3.0", "Content": "I have to say I was disappointed. I was expecting to be mind blown from the recommendations I had. I love Thai food and cook it quite often myself. I ordered the green curry of the day, it was full of perfectly cooked veggies and rice, but the savory flavor wasn't there. I was told it was made with coconut milk, but I couldn't taste it. One person in my party of four really liked their meal, the others just thought it was okay. Our server was very loud and told stories from behind the bar that I really didn't care to hear while eating dinner.", "Date": "2012-12-20", "Author_Location": "Minneapolis, MN"}, {"Author": "Rose D.", "ReviewID": "hfCEGX_A1Tu8rrr6obezxQ", "Overall": "5.0", "Content": "Definitely one of the best Thai restaurants in the Twin Cities. The flavors are unique and fresh, and the service friendly. I especially like that they source as many of their ingredients locally as possible, compost their waste and have free-range chicken and grass-fed beef.My favorite dishes are the Curry Special---whether red or green it is always delicious and served with a Thai omelet--and the Khao Soi, a delicious curry-based soup with beef and mustard greens. It's really perfection in a bowl.", "Date": "2011-09-20", "Author_Location": "Minneapolis, MN"}, {"Author": "Eric P.", "ReviewID": "NpX21cnXe6L-TSDhLJ_4lw", "Overall": "4.0", "Content": "Great food. Locally sourced menu items. Ask for the spice tray if you are the daring type. A few hot options to spice up your food even more. Very delicious. Sen Yai Sen Lek is a favorite of ours.", "Date": "2013-09-16", "Author_Location": "Minneapolis, MN"}, {"Author": "Dave A.", "ReviewID": "6D1dbygZI0XorurQGZvBnQ", "Overall": "4.0", "Content": "The Geow Naam Moo Daeng dish is incredible.  I like most Thai food but this blew me away.  We love that they buy local foods wherever possible.  And with my wife's strict standards on \"happy\" meet, she WILL eat the poultry here.  The only problem we've had with the restaurant is the atmosphere.  Our last visit there were screaming toddlers which made it a bit unpleasant.  (Come on parents, get a fricking clue.)   We've brought our older kids a few times but it seems like there are always little kids skirting from table to table.  If you're looking more for a date-night atmosphere, try Amazing Thailand in uptown.  Sometimes this place feels like you're eating at McDonald's Playland.  I think next time I might just get take-out from here.", "Date": "2012-01-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Sasha M.", "ReviewID": "8vMWhdYDHV_ShWcGJkMSCg", "Overall": "5.0", "Content": "So good.  Great vegan and vegetarian options. The service and atmosphere are excellent.  Try the curry specials.", "Date": "2013-09-09", "Author_Location": "Minneapolis, MN"}, {"Author": "caitlin n.", "ReviewID": "gmeCggFwVgxsIVRBaJIJGg", "Overall": "4.0", "Content": "Went in with low expectations service-wise, left pleased. The server was busy, yes, but we could easily flag him down and the owner popped out to fill in the gaps. He generously let us sample a beer we hadn't tried, gave us recommendations for genuine Thai groceries in the TC,  warned that my meal would be spicy (ahh Minnesota), and was overall very smiley. My Thailand-traveled lunch companion says it's the closest she'd had yet to genuine Thai food in MN. There you have it.", "Date": "2010-12-26", "Author_Location": "Hackensack, MN"}, {"Author": "Keith P.", "ReviewID": "TQA90Z-2tPnhswLSBOn99g", "Overall": "2.0", "Content": "My wife and I went here for dinner last week.  I had high hopes going in.  We were seated immediately and the hostess was nice enough.  Our server was very knowledgeable about the menu and very willing to make recommendations depending on our likes and dislikes.  We decided on the chicken satay for an app.  Wonderful.  Absolutely killer peanut sauce and the chicken had a nice amount of char without being dry.  My meal however, left a lot to be desired.  I can't even remember exactly what it was, but the flavor just wasn't there.  I kept saying that something was just missing.  I finally had to ask for some soy sauce just to get through it.  Very bland.  My wife said she enjoyed hers but wasn't really impressed.Maybe my dish was just an anomaly.  My wife and I both said we would come back to give it another try.  Maybe try some noodle dishes next time.  I'll be sure tobring my brother who has spent a lot of time in Thailand.  Maybe he can help mediscern this mess.So, we'll be back, but only to give it that good ol' college try again.  If that meal flunks, it's time to pack it in.", "Date": "2012-05-18", "Author_Location": "Maplewood, MN"}, {"Author": "Barbara P.", "ReviewID": "chiaudTP5tONzsF0ShKg0A", "Overall": "5.0", "Content": "Sen Yai Sen Lek is the Best Thai restaurant in Minneapolis.  FANTASTIC authentic Thai.Recommend it for an after work dinner or even with family on the weekend.  As transplants from Seattle where Thai is everywhere, we were in full out withdrawal.  Had tried other places in town and it was like another cuisine.  Ran across Sen Yai Sen Lek near Holy Land and it was packed, so we decided to try it.  Fantastic.  Basic interior, cheerful and in keeping with the cuisine.  Agree with others that the service / pace is slow, but I like it that way.  When I'm out for dinner, it's a time for enjoyment.  If you want something fast, order ahead and get take out.  Sen Yai Sen Lek, I say \"don't change a thing\".", "Date": "2009-10-11", "Author_Location": "Minneapolis, MN"}, {"Author": "Caileigh A.", "ReviewID": "5Un_cuXHt_0k3IEPFRTEcA", "Overall": "4.0", "Content": "In addition to the traditional menu, there's a smaller lunch menu, a variety of drink options and an all-around great meal selection. The portions were huge! It's a typical Thai menu and reasonable prices. It's a clean, open venue with really great eats!", "Date": "2012-05-15", "Author_Location": "Seattle, WA"}, {"Author": "Sonja D.", "ReviewID": "1T-aE-bSsWMGAcMCaOQhnw", "Overall": "3.0", "Content": "I have eaten here twice in the last 6 months...once in the restaurant and once as take out.  The first time was with a friend.  I had driven by on my way to work for 6 months and I wanted to try it.  So we went on a snowy day.  Service was just okay.  He was busy, and it took him a while to see us in between whatever he was doing.  The owner actually came over and asked how everything was going and was very friendly.  We got a free sample of beer but we were sitting at least 40 minutes until our food came.  It was a generous portion, and I liked that you could make it your own spiciness from the choices on the table.  I had the Pad Bai Gra Pow, my friend the Pad Pla Prik.. i think?  We both left with leftovers.  However, I was disappointed in the fried egg on mine.  Having gone to Thailand, and this place is owned by a Thai family, I really thought my fried egg was going to be more like the egg I had in Thailand.  :(  But otherwise, It was delicious, and I was happy.  Our server rang us up, and I told him that this was actually one of the first meals in the cities that I've had that tastes like an authentic thai meal.  He told us about Bangkok Thai Deli as well.  He's cool. (I can't remember his name?! Jesse? Jamie?)I was craving it again, and I ordered takeout about 3 months later.  I ended up getting the Gai Satay because I remembered the amazing street chicken from Hua Hin and was hoping it'd be similiar...and I also ordered the Pad Thai with shrimp.  I ordered while i was in uptown and he said it'd be like 10 or 15 min.  So I got there about 20-25 min later, and it was ready, and still hot.  Got home, and was slightly disappointed with the gai satay.. it was delicious, but not what i was hoping for.  The peanut sauce was a little too.. peanut-y? I dont know maybe i'm just being weird.The pad thai was good, and there was A LOT of it.. but like Annie D. said, I was hoping for more flavor, more sprouts, more... something.  There were plenty of scrumptious shrimp, though.  Maybe I would've been more happy ordering it in the restaurant where I could've spiced it up myself.  Maybe.I'll go here again, but probably only if it is in the restaurant.  It's worth a try, that's for sure!", "Date": "2011-06-11", "Author_Location": "Minneapolis, MN"}, {"Author": "Kore P.", "ReviewID": "IPg7PJ48LTIJhDsM02qbgw", "Overall": "4.0", "Content": "Dining area was clean and pleasant. The food was tasty and well prepared. Portion size is not huge. Service was friendly and nice but not very attentive. Long time between refills and table visits for tea and other items needed. We also love to eat asian food Family Style where we share all the entrees on the table. They are not set up for this and not very good at accommodating it. We told them we wished family style when we ordered. No extra serving utensils or plates were delivered to the table.  We did flag the server down and got some of the needed extra items. I am sure we will be returning for more of the yummy food.", "Date": "2011-03-25", "Author_Location": "Plymouth, MN"}, {"Author": "G S.", "ReviewID": "Fx68au_KgxLKwWiFwQ22qw", "Overall": "1.0", "Content": "Not sure how to rate this place. Been here once. I was digging it, although it seems trendy and pretentious for some reason.... Food came, started eating, I thought it was really good, then my wife pulled out this really long piece of hair from her dish. Disgusting. She started gagging, almost threw up. I lost my appetite. Told waiter what was going on, almost seemed disinterested, but apologized. Sent all the food back to the kitchen, full plates. No way i was going to eat mine after seeing that. yuck. Charged for everything except the dish with hair in it. Ended up paying about $30 for a meal we never ate. Meh. I think they have good tasting food but won't be back after this experience.", "Date": "2013-09-07", "Author_Location": "Andover, MN"}, {"Author": "Meghan P.", "ReviewID": "5qk7RLdv8mEwLrXKew1FSQ", "Overall": "3.0", "Content": "I want to really like it here, but I'm just. so. underwhelmed.  I can't figure out exactly what it is, but I just feel kinda let down when I eat here.  The fish cake appetizer is the only exception- that's very good.The service has not been that great, but not that bad either.  I think it's kind of expensive.", "Date": "2011-03-26", "Author_Location": "Birmingham, AL"}, {"Author": "Dave B.", "ReviewID": "zTJnYANcizi8KQEaCluxbA", "Overall": "4.0", "Content": "Great pad thai, and a shining light in an up-and-coming neighborhood.", "Date": "2010-07-18", "Author_Location": "Menomonie, WI"}, {"Author": "Elliot J.", "ReviewID": "iS5ZAa_5jTZieO0SuUwwTw", "Overall": "4.0", "Content": "The Khoi Soi was yummy! Service was a bit lackluster. Next time, I'll opt to sit in the dining room on an early Tuesday evening, rather than at the bar.", "Date": "2012-08-19", "Author_Location": "West Hollywood, CA"}, {"Author": "Amy L.", "ReviewID": "3_b3HO08zCpvpAWnPqt1JA", "Overall": "4.0", "Content": "the only reason this place doesnt get five stars is the spendiness. however, all the food sources are listed, which is awesome, the ingredients are amazing and local and the whole thing is just one big yum. great date night restaurant.", "Date": "2013-04-07", "Author_Location": "ST CROIX FLS, WI"}, {"Author": "Vanessa T.", "ReviewID": "UkFqziGWcwG8GW3YkoGOoA", "Overall": "4.0", "Content": "This may have been one of the best Thai places I've found in the Twin Cities so far; and it is definitely the most unique Thai with the breadth of its menu.  It encourages the diner to be a student of Thai food as opposed to the other way around - where a restaurant menu bastardizes and conforms to the American palette.  It's a great place to go to explore dishes and flavors beyond everyone's favorite stand-by, Pad Thai, although I bet they make a darn good Pad Thai there too.  Great place to show skeptics that the Twin Cities does in fact have tasty and authentic ethnic food.", "Date": "2009-03-28", "Author_Location": "Los Angeles, CA"}, {"Author": "Tom F.", "ReviewID": "GZl3EaQ0mtRxiYN5ErLMig", "Overall": "4.0", "Content": "I love everything about this place. Great food made with fresh ingredients, friendly and knowledgeable service, good beer selection. Parking can be hit or miss on Central, but usually available within a 1-block walk. We dine in and takeout often. Sen Yai Sen Lek is a great benefit of living in Nordeast.", "Date": "2010-10-24", "Author_Location": "Minneapolis, MN"}, {"Author": "Anders C.", "ReviewID": "jPzFs6IXBxc-fHNeE4zoBA", "Overall": "4.0", "Content": "I really like this joint. The atmosphere is superb. Spacious and well lit. The service was helpful and friendly. The Royal Fried Rice was really good. It's not your run of the mill fried rice, it's called \"royal\" for a reason. Give it a try. You also can't lose with the red curries.", "Date": "2011-05-01", "Author_Location": "Minneapolis, MN"}, {"Author": "Jeremy J.", "ReviewID": "myB6BsTbfU6UyIv9bwkeRA", "Overall": "5.0", "Content": "This is Thai comfort food in all its glory. The spices are spot on and can be tuned to a raging inferno if desired. The ambience is best in the main dining room. But, then again there was one time when things got a little raucous in the bar and I was yelling across the table just to be heard. Kinda fun actually. This is a place where people eat and laugh and enjoy themselves. Too few places combine fantastic food with a true sense of enjoyment exuding from the kitchen and beyond. Sen yai sen lek is just such a place. Spring rolls are delightful, noodle and rice dishes are adventurous. Try something with dried shrimp and bring your friends who like a fun night out.", "Date": "2011-11-28", "Author_Location": "Minneapolis, MN"}, {"Author": "Bonnie H.", "ReviewID": "pwP3ncdrE0Z1o83ao6ONww", "Overall": "4.0", "Content": "Wow! Contrary to other reviewers experience our server Jared was awesome. The gal who filled our water glasses was cool as well. We brought the kids (12 & 14) who enjoyed the Birch Beer & Fried Rice which were fabulous. We also split the Papaya Salad & the Red Curry du jour.  Both packed some heat & were loaded with fresh tasting tidbits.  Admittedly, we waited quite some time for our dessert HOWEVER the sticky rice, coconut milk, banana concotion was DeeeLiCious!  Warm, creamy & cozy; it settles the tummy.  You're nuts not to at least try this place!", "Date": "2010-03-29", "Author_Location": "St Paul, MN"}, {"Author": "Hannah F.", "ReviewID": "pUK7LDHx2kogHBKAYEKlZA", "Overall": "3.0", "Content": "The food was ok.  I found it a bit pricy and underwhelming.", "Date": "2011-05-11", "Author_Location": "Bucktown, Chicago, IL"}, {"Author": "Peter Q.", "ReviewID": "dN0-BnPcgWz7tTFKD9S0bQ", "Overall": "5.0", "Content": "The daily curry specials are fantastic.Very friendly and they don't hustle you out to fill more tables-- perfect for a relaxing dinner.", "Date": "2011-11-01", "Author_Location": "Minneapolis, MN"}, {"Author": "Melissa N.", "ReviewID": "h2vfzrYD8FwkXs2wXSO44g", "Overall": "5.0", "Content": "Awesome food. Great service. I wish there was more parking, but other than that ... love it!", "Date": "2010-12-28", "Author_Location": "Minneapolis, MN"}, {"Author": "Michelle S.", "ReviewID": "s3nebu0Vtf22uhcQpgdjgQ", "Overall": "4.0", "Content": "Great food and great service. We accidentially had the wrong entree in our take out order, and the manager personally drove out the correct entree to our house. That was the best customer service I have had anywhere in a long time. It is on the top of our list for dinner places now.", "Date": "2012-10-05", "Author_Location": "Minneapolis, MN"}, {"Author": "Judd H.", "ReviewID": "Z-1c4JPinul2PuqlvyfMmQ", "Overall": "5.0", "Content": "Just ate lunch here with some friends today and this place was amazing. I will admit my expectations were not that high but wow did they deliver. All three of us loved what we ordered. I had some kind of thinly sliced steak salad with fresh lime and sticky rice. I also had some pretty damn good Thai iced coffee. They have some pretty unique beers as well.This is a family owned and run place and they do things right. What I really loved is that they get just about all of their ingredients from local farmers. My steak came from a small farm in Cannon Falls where they raise grass fed cows. Amazing! They only sell soda made with cane sugar in the bottle. They want nothing to do with nasty corn syrup based crap here. They're very into recycling as well. They use Eureka. Make sure you ask for their little table tray of peppers. Any place that is locally owned and uses top notch local ingredients AND is eco friendly is rad. Oh and they do have some lunch specials where you can get slightly smaller portions. Love it!", "Date": "2009-07-27", "Author_Location": "Saint Paul, MN"}, {"Author": "Ann R.", "ReviewID": "JXyqmpAPUvj1vRCw_nJSwg", "Overall": "5.0", "Content": "This place is so cool and delicious!!  Love it!", "Date": "2008-12-17", "Author_Location": "Saint Charles, IL"}, {"Author": "Anthony W.", "ReviewID": "GCaBQzvrmIVH76x8NktyNw", "Overall": "2.0", "Content": "decent food but not worth the price.  both times ive gone there ive had terrible service.  theres a thai spot across the street that just as good for half the price and great service.  would not recommend.", "Date": "2013-12-07", "Author_Location": "Minneapolis, MN"}, {"Author": "Mike C.", "ReviewID": "FhN8FMZE-j2vcF-Hze_GKg", "Overall": "2.0", "Content": "This is not going on my favourite places to eat list.The location is great, Central Ave, at Lowry.The decor is minimal. Booths down the right side table in the centre and along the left side, there is another area to the right of the front door where there is a bar ans seating and more tables.The staff although friendly seemed sometimes distant and aloof, maybe we shouldn't have told the waiter we were Thai food novices.The menus are colorful, and laid out well, easy to read, with descriptions of each dish and the prices displayed along with the options for various dishes. The beverage menu is simple and very adequate; we opted for a couple of local draft beers and a bottle of Riesling Kabinett; we were a party of four. The beer and wine came promptly, but no cooler for the white wine.The beer and wine came promptly, but no cooler for the white wine.For appetizers we had the Po Pia Tod, Po Pia Sod and Gai Satay, my wife and son had the Tom Yum. Very delicious except for the Tom Yum, too much fiber, too many sticks and bits of bamboo not enough of the meat or tofu. My son bit into a chile, ouch!  For our meals;  Moo Tod Gratiem for the women, my son had Khao Soi and I had Geow Naam Moo Daeng. The Moo Tod Gratiem didn't match expectations, the sticky rice wasn't and the fried strips of pork were too dry. One gets the impression that the meals sat under a heat lamp which rendered the sticky rice dry and crispy and the fried pork dry and leathery. The Khao Soi looked good, the presentation was good but again not as expected; too watery and lacking substance. My Geow Naam Moo Daeng was OK, the won tons were flavourful but there was a lack of cabbage and onions, I had plenty of noodles and bean sprouts but the dish was awash with an oily broth.We ordered desert; three fried bananas with coconut ice cream and one chocolate ice cream. The fried bananas were dry and tasted starchY; deep fried in batter should have been crispy and light but were instead heavy, starchy and flavourless, the coconut ice cream was also disappointing, a bland white ice cream with dried coconut flakes. The chocolate ice cream was good. So as Thai novices our overall impression was not good. I have eaten Thai food in other cities and here in Minneapolis but never in Thailand so I don't know what is authentic and what is dumbed down for US taste. I haven't eaten enough different Thai dishes or the same dish in different restaurants. So I am not really qualified to be critical of the authenticity of the food we ate, I am however qualified to be a critic of what I was served versus what I expected from the menu description and the waiter's explanation of what was to come, and I know overcooked from just right.I may go back if only to have a beer and several appetizers, they were really good. Perhaps I should try some more Thai restaurants and see if I actually like Thai cuisine.   I thought I did!", "Date": "2009-08-24", "Author_Location": "Shoreview, MN"}, {"Author": "Taylor M.", "ReviewID": "HpYwryHeWirct-25zsHS7Q", "Overall": "5.0", "Content": "Took my college academic team to this restaurant without a reservation on a busy Saturday night.  We asked to sit on the floor around the big table in the \"waiting room\"/bar area and they were quick to accommodate.  Service was wonderful and fast.  We had some people with special dietary issues (vegetarian, gluten-free) who easily found delicious options on the menu.  The drinks were authentic and the food was incredible.  I was happy to discover that the assistant manager, manager, and owner of the restaurant were Minnesota-nice and they consider the environmental impact of their business.  I will definitely go back and I highly recommend it to everyone I know!", "Date": "2013-01-26", "Author_Location": "Saint Louis, MO"}, {"Author": "Mindy E.", "ReviewID": "6kuW69Nua_qSiKfDgPvnEw", "Overall": "4.0", "Content": "My husband and I really like this little gem. We've visited them on several occasions and have always been pleased with their service and food. My husband's go to is always the Rad Na and it's as authentic tasting as you can get in the cold north. I enjoy their Panang Curry, Pad Thai and Laab.", "Date": "2013-01-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Bev L.", "ReviewID": "X_UTIEnXM7Cy7QXVdcvKVw", "Overall": "3.0", "Content": "Expect some very interesting and authentic Thai dishes at a resonable price here.   We ordered the lettuce wraps appetiser which were totally different than others I've had -- a do it yourself affair with a tamerind chili sauce as the \"cement,\"  Also had a nightly curry special that also had a build-your -own component, with vegetables and rice arriving separately.  My spouse took a cooking class from the owner/chef and came away with the recipe for the all-time best killer good peanut sauce.  If the chicken satay with peanut sauce is on the menu, order it!", "Date": "2011-10-07", "Author_Location": "Minneapolis, MN"}, {"Author": "Susan A.", "ReviewID": "L5daCGWknwR8asEQs2HHFQ", "Overall": "2.0", "Content": "I have been to this restuarant many times.  My last encounter two weeks ago left me searching for an alternative.  The food was not up to thier typical standards.  Pad Thai was bland, dry and boring.", "Date": "2011-10-17", "Author_Location": "Minneapolis, MN"}, {"Author": "A G.", "ReviewID": "AQheStSHD9qJ_u_Dnt0V3A", "Overall": "5.0", "Content": "I've been to almost every Thai restaurant in the Twin Cities, this is by far my favorite. The lettuce wraps............. amazing.", "Date": "2010-05-08", "Author_Location": "Minneapolis, MN"}, {"Author": "Joyce L.", "ReviewID": "tlvoj0YNsgznGPkwjvqdew", "Overall": "4.0", "Content": "pretty good although the pad thai was different.", "Date": "2010-11-14", "Author_Location": "Fullerton, CA"}, {"Author": "Tim R.", "ReviewID": "UzfOWgvci6cm3MzDB0tSpQ", "Overall": "5.0", "Content": "Amazing thai food:  less suburban strip mall Thai and more 'There is a guy in the back who really cares about the food' type of place.  Get one of the curry specials in the evening: you will not be disappointed.", "Date": "2012-10-22", "Author_Location": "St Paul, MN"}, {"Author": "Carissa S.", "ReviewID": "4tGQQpxu6KT4WmIXjJtpTw", "Overall": "5.0", "Content": "My favorite Thai restaurant in Minneapolis.  Interesting menu and good service.  I like the family friendly atmosphere and the focus on local food is great!  The food is actually spicy.  Super!!", "Date": "2010-05-03", "Author_Location": "Minneapolis, MN"}], "RestaurantInfo": {"RestaurantID": "5ND9TI-KAellP0t-ZjutUA", "Name": "Sen Yai Sen Lek", "Price": "$$", "RestaurantURL": "/biz/sen-yai-sen-lek-minneapolis", "Longitude": " -93.24774999999999", "Address": "2422 Central Ave NEMinneapolis, MN 55418", "Latitude": " 45.012895999999998", "ImgURL": "//s3-media1.fl.yelpcdn.com/bphoto/7V8pQ9tl3iCTjXApCXN3Lw/90s.jpg"}}