{"Reviews": [{"Author": "Brooke I.", "ReviewID": "esNYIzdNMbXf3hqjpYVTJA", "Overall": "5.0", "Content": "One of our favorite neighborhood spots.  Kids love it. And so do I.  Fast, easy and affordable. Great flatbread italian style pizza.  Tons of different toppings that appeal to our whole family.  Pepperoni for my 6 year old.  White pizza for the 10 year old.  And we love the hot soppersata.  And the arugula and prosciutto.", "Date": "2014-05-27", "Author_Location": "Hell's Kitchen, Manhattan, NY"}, {"Author": "Canny F.", "ReviewID": "bVN56TOI0lrLdqojPXWz9w", "Overall": "3.0", "Content": "They are vegan friendly! You can bring in your own vegan cheese. I'm sure you can bring in your own vegan toppings too! I ordered the no cheese pie, Centi Anini, with veggies and I was quite disappointed. It's not your average local pizza pie but I wasn't feeling the crust. I also ordered the Merilu pizza al metro with no cheese and a topping of arugula. I chose this pie because the honey and truffle oil stood out to me but I didn't even taste a hint of truffle oil. The sweetness of the honey was obvious but the truffle oil was drawing a blank. I like how the pears with walnuts gave it a nice crunch to balance the honey. I figured the pie didn't need sauce with those bold flavors but I was wrong. When I placed the order, he kept saying so it's going to be basically a crust with honey, pears, walnuts and arugula and I kept replying yes. I asked for sauce on the side after a few bites; it was free of charge and it saved the dry pie a lot. The sauce was surprisingly warm. Based on the pictures I assumed the crust would have been better - something similar to brick oven crust but crunchier. This small joint is so friendly! The customer service is amazing! They check up on you quite often and ask you how everything is and if we need anything additional. There's a limited number of seats so don't come here with a group.", "Date": "2014-07-01", "Author_Location": "Brooklyn, NY"}, {"Author": "Jill J.", "ReviewID": "LhzWI82n5U1HxhbAkKQw6A", "Overall": "4.0", "Content": "pizza perfection. crusty, crunchy deliciousness. split 3 different slices with a friend and they were all super awesome. just a regular bacon slice--which was the perfect balance of sweet tomatoes and salty bacon. a greek style kind of slice--loads of veggies and really flavorful. and then some awesome mystery slice--there was ricotta, chicken, prosciutto (maybe)...i don't know but it was LEGIT. service was super friendly and this place is cute and clean looking.just a cute little shop that is worth popping into if you're near by.", "Date": "2014-06-30", "Author_Location": "Orlando, FL"}, {"Author": "Tanner B.", "ReviewID": "kFhWwdx4HxLYPCf4aTxwTQ", "Overall": "5.0", "Content": "We stopped here after looking for a quick lunch and this place was perfect. Good prices and even better pizza! Lots of choices were available for slices and we left very satisfied.", "Date": "2014-07-07", "Author_Location": "Fort Worth, TX"}, {"Author": "J C.", "ReviewID": "qHGnPneOJadVLF5xAmGRMw", "Overall": "2.0", "Content": "We had spent time researching NY pizza and trusted Yelp to find us a place that would have memorable good food. This was not it.4 of us selected different slices and after finishing our meals agreed unanimously that everything was quite tasteless.  We were very disappointed.I don't understand the high rating.", "Date": "2014-07-05", "Author_Location": "Bismarck, ND"}, {"Author": "Luna A.", "ReviewID": "0FXS8E1ruizBU6TDK8dWQw", "Overall": "1.0", "Content": "Terrible customer service. The one who picks up the phone and takes orders for delivery is rude and unprofessional. I placed my order online exactly an hour ago and when I called, the woman on the phone said that she didn't see the order and it would take another 20 minutes or so. She also asked me with nasty attitudes: \"so do you want it or not\" duh...! If she had apologized politely instead saying I wanted the order or not, I could have waited patiently. I said I still wanted the pizza and what she said was :\" I am cancelling the order\" WTH? Why is it taking so long to get a damn pizza? Really? I hate the fact that I have spent so much money dining in that place. The woman on the phone clearly doesn't understand that a good customer care is a must for any business.", "Date": "2014-06-28", "Author_Location": "Manhattan, NY"}, {"Author": "E T.", "ReviewID": "YogWz6YPa5hWHWKdIPUjqQ", "Overall": "5.0", "Content": "Sweet Jesus this pizza is GOOD.  Pricey, but worth it.All the pizzas I've ordered have been good, but if you like meat then try the \"Triple Bypass\"...'nuf said.", "Date": "2014-05-09", "Author_Location": "Manhattan, NY"}, {"Author": "M J.", "ReviewID": "LKXDTNjFw4OptFx588hbRA", "Overall": "4.0", "Content": "Margherita pizza is great! Good thin crust, and the sauce is really flavorful. Prices are a bit steep for pizza, but well worth a try.", "Date": "2014-06-24", "Author_Location": "Manhattan, NY"}, {"Author": "Jam F.", "ReviewID": "8vITKBT3Ntc_ju-tPtyTQQ", "Overall": "3.0", "Content": "The pizza is delicious if you order it freshly made. There's a difference between the ones sitting out and having to be reheated and the fresh made pies. It's a bit expensive but tastes great. A bit too pricey for me, so I'm not planning on going back anytime soon, unless I'm around the area, starving, and craving pizza.", "Date": "2014-06-13", "Author_Location": "Elmhurst, NY"}, {"Author": "Jocelyn K.", "ReviewID": "w5nPj9XolcWavqcJUdFD9Q", "Overall": "2.0", "Content": "Not overly impressed. Really expensive pizza and not really NY-style either. About $4 for a tiny square. And I was still hungry afterwards but didn't want to waste my money on another slice because I would probably still be hungry after the 2nd one. The sauce for the standard margherita is kind of flavorless. Needed a lot of red pepper and garlic powder and I never usually put those on my pizza. Overall pizza isn't bad, but I've definitely had way better and larger.Although props to the crust. It's nice and crispy. It's probably worth more your money if you get a whole pie rather than a slice.", "Date": "2014-03-24", "Author_Location": "New York, NY"}, {"Author": "Steve W.", "ReviewID": "yohZvNDAhgZN6FIzihVJcg", "Overall": "5.0", "Content": "Very friendly, great pizza. Not many tables but the place was great. Would goBack again for more ofThe triple bypass pizza", "Date": "2014-04-05", "Author_Location": "Dacula, GA"}, {"Author": "R L.", "ReviewID": "9YnL5FErWv2zTDYzGVjN_w", "Overall": "4.0", "Content": "Local recommendation given to us. A Sicilian style pizza place. Made to order. Tried the Margherita, pepperoni & triple bi pas. All tasted great! Big square slices. 2 were more than enough for me though husband & the kids devoured the rest. Small place so you may have to order & go if no seats available. Definitely give it a try if your in the neighborhood.", "Date": "2014-05-12", "Author_Location": "Vallejo, CA"}, {"Author": "Tiffany T.", "ReviewID": "qkX_hE8O9rQEuquk5BCb4w", "Overall": "5.0", "Content": "This neighborhood shop has my favorite pizza in Hell's Kitchen! Merilu is not a drunk dollar slice place, as it definitely costs more than $1 but boasts fresh, quality ingredients in a cozily decorated shop.Their pizza is long and rectangular, with a lovely thin and crispy crust (which somehow does not get soggy) and boasts the perfect ratio of dough to toppings. Everything is thinly sliced and thinly layered, but will leave you satisfied without feeling greasy or inundated.I highly recommend:- La Fresca (fresh tomatoes & fresh basil)- Rustica (Italian sausage, onion & peppers)- Cardinale (fresh cut mushrooms & thinly sliced ham)- Catalina (the sliced breaded eggplant is paper thin and not heavy at all)- Wild Child (the ricotta is such a fresh contrast to the jalapeno)Whether it's for delivery, eat-in, or take out, you can rest assured that the quality of the food will remain the same, as each pie is made from scratch right in front of your eyes on a marble slab behind the counter. If you get it by the slice, it's most likely fresh out of the oven (less than half hour ago) and they will toast it again for you to ensure the right crunch for the crust. Definitely come here for quality pizza!", "Date": "2014-03-19", "Author_Location": "Manhattan, NY"}, {"Author": "Helen Y.", "ReviewID": "76uJ0BrfDeZ_SDDUEe4atg", "Overall": "5.0", "Content": "Thank gosh the demands of my stomach are stronger than my appreciation for aesthetics. I walked into this place and was dumbstuck by pizza so pretty I had to admire the pies before I ordered. This is artisanal thin crust at its finest, with fresh quality ingredients and just beautifully made. The pies here are oblongs, and you get a slice that is squarish. Pick your toppings..mushroom, artichoke..when I went there must have been at least 10 different flavors to choose from in addition to the plain margherita. Everything here is cooked just right, to the crispy crust, to the sweetish tomato sauce, to the fresh mozzarella. You pay a little more but you are getting the best. For those with hearty appetites, it will be easy for you to polish off three slices. Merilu also sells Panini, salad and pastaThis is a small place, immaculate with exposed brick walls and not too much seating. So if you come at peak, be prepared to take your pizza to go. This is a family run place with the pride and friendliness that comes from good management and exceptional customer service. The lady behind the counter was the daughter, and pointed out her brother making pizza behind her. She was delighted I remembered her from the Yelp Pizza event in the Church on Houston St. My sis and I had been searching for the place that served up artfully decorated squares to the left and back of the church. After tasting the pizza here, I thought it could be Merilu. This is such a lovely place with great pizza and enthusiastic service, you will immediately recommend it to family and friends, as I did. Indeed after being disappointed by Sacco further up, I came here hoping to get my fix and finding it closed.", "Date": "2014-03-12", "Author_Location": "New York, NY"}, {"Author": "Supriya M.", "ReviewID": "Ybh2g-GVids1Z7jyiAuLZg", "Overall": "4.0", "Content": "Thin crust deliciousness at not so reasonable prices but pizza was fresh and hit the spot for lunch!", "Date": "2014-05-17", "Author_Location": "Baltimore, MD"}, {"Author": "Scot W.", "ReviewID": "Ffu6cuxc_LBoQirAzYmFgQ", "Overall": "4.0", "Content": "Glad I followed the other Yelp reviews to this place. Not at all the typical sloppy and greasy New York slice, the crust is basically a piece of warm and crispy Italian bread, the sauce nicely complements the toppings, which are all fresh. I'd eat more, but unless you're really hungry, a single slice will do you fine.", "Date": "2014-06-04", "Author_Location": "Chicago, IL"}, {"Author": "Adam R.", "ReviewID": "2OPLmcvpnMe_dpAUTWgAdQ", "Overall": "5.0", "Content": "Get the tomato, it's so good. Seriously, I loved this place. I told the cashier that if this visit was going to be my only one during the Super Bowl, I was going to be really sad. I ended up really sad. However, I'm headed back for the draft. I hope I get in early enough on Sunday to go there. I hope you're waiting for me, I'm coming back!", "Date": "2014-04-28", "Author_Location": "Huntington Beach, CA"}, {"Author": "Elicia G.", "ReviewID": "bOST4gDlx8SZheoElFsYmg", "Overall": "5.0", "Content": "We looked this place up because we wanted real \"new york pizza\" we were not dissapointed. it's just a little hole in the wall but I watched my friend have a pizzagasm!like eyes rolling in the back of his head lol.staff was very friendly and the price wasn't bad for what we got. The fact that the crust was so thin just made it that much better, they were not skimpy on the cheese. awesome place!", "Date": "2014-02-23", "Author_Location": "Woodstock, Canada"}, {"Author": "Daniel W.", "ReviewID": "aNqGoqBhWXxEXDmQv6sLSg", "Overall": "5.0", "Content": "Love the crust. People working the counter were great. Food was well worth the 20 minutes for my pepperoni and chicken pie. Cramped seating. So best for take out and not dine in. Only a couple of small tables.", "Date": "2014-04-19", "Author_Location": "New York, NY"}, {"Author": "Selina S.", "ReviewID": "vHccysChDwaj3W5aAnilnw", "Overall": "4.0", "Content": "Maybe not traditional New York pizza but the pizza here is good! Have Tried the pepperoni (a little greasy), white pizza, and the margherita. All very good. However, the pizza is pricey and it's not really a sit down place, there are very few seats (it is a small suite).", "Date": "2014-05-28", "Author_Location": "Indio, CA"}, {"Author": "Pat D.", "ReviewID": "5oqsWUmOrOgN0ipLDY76xA", "Overall": "1.0", "Content": "I'd like to say the food at Merilu's is absolutely FANTASTIC.  They make the best homemade balsamic vinaigrette I've ever had.  Their salads are fresh and the square/oblong pizzas are the bomb.  It's not cheap, but when the food is good, it's almost worth it.  I said, ALMOST because, it's not just good food that brings about repeat business-- customer service to make or break your establishment.  Unless you're 'Dick's Last Resort' and then its part of the experience. So why the one star you ask?  Well, on today, Tues, 4/15 (yep TAX day) we placed an order (GRUBHUB # 58554487) for four orders of Polla Alla Parmigiana (chick'n parm) and requested angel hair pasta or spaghetti on the side for each.  ** Please note, pasta is NOT included with this dish, which is why it was ordered on the side.   However, when opening the chick'n parm, there was no pasta and after searching the other bags (salads and bread) there were no separate containers of pasta either.  See, I know it comes separately, because we ordered the chick'n parm the same way, just the week before, with NO problem.  I called Merilu's to let them know of the oversight and a guy that says his name was DAVID proceeded to tell me their chick'n parm does not come with pasta.  I explained to him, I understood that however I asked for angel hair pasta or spaghetti on the side.  The same as I ordered the previous week and I received spaghetti, on the side with my order.  DAVID becomes somewhat agitated and tells me they don't carry angel hair pasta-- **(stop trying to be RIGHT and LISTEN to your customer-- you know the little people that come in to order your from your establishment, so you can stay in business).  I repeat, I placed the order the same as I did the previous week and received spaghetti.  I think he finally heard me, but wanting to get me off the phone, asks me what do I want him to do about it.  I'm a little thrown back with that statement and I told him I just want the spaghetti delivered as soon as possible.  He tells me its going to take some time, and quickly corrects himself and says it's going to be a while.  He has to wait for the deliver guy to come back to check the ticket, and \"who knows how long that will be.\"  I tell him I have the grubhub order number could he just check that, I'm repeating exactly what was put on the order.  He insists he has to wait on the delivery guy and it's going to be a while.    At this point, I become beyond just mildly irritated and asked if he is the manager and he tells me no-- \"I just work here\".   I state, \"obviously, since this is no longer about the pasta, this as become a customer service issue.  Your tone as well as your lack of proper customer services skills are apparent.\"  Of course, we go thru 'who's the manager? what's the manager's name? etc.'  When I asked DAVID when would the manager be in, he says \"he comes and goes whenever he feels like it.\" I asked how would Uciano, (that's the manager) feel once he learns what he thinks of his work ethic and of course DAVID proceeds to tell me, \"I don't know, you should ask him when you talk to him.\"  I see this is now a joke to DAVID.  At this point, I realize I'm speaking with someone that cares very little for the establishment he works for and even less regarding his own employment.  He's probably bounced around from one restaurant after the next, with his insolent and rude demeanor.  Who knows who DAVID really is and if that's his real name.  He may very well have been the manager, and if so-- Merilu's won't survive if their employees take on DAVID's attitude in regards to their customers.  All it takes is one BAD apple to spoil the whole bunch.  SMHI refuse to spend my hard earned money (or my company's corporate expense) on a business that thinks that poorly of their customers.  Too bad, I really liked their homemade balsamic vinaigrette....", "Date": "2014-04-15", "Author_Location": "Manhattan, NY"}, {"Author": "David C.", "ReviewID": "HPF2dfgVgyFcD4Ki_QkqNw", "Overall": "5.0", "Content": "Merrily is part of the hipster restaurant row in Hells Kitchen. Cool hip tiny hole in the wall pizza joint and friendly young staffers, fits with the hipster foodie neighborhood. It clearly differentiates itself from the myriad of pizza joints in the hood by the only metric that matters, dope pizza!Here's the food lowdown: we grabbed three slices, each of a different pie; Marcilino - meat lover slice w bacon and ham. Two more classics, Margherita, and Mushroom. It hits the spot with some good quick eats. Especially when you're in a rush and don't have time to wait for the other popular sit down joints in the vicinity.", "Date": "2014-01-19", "Author_Location": "Hoboken, NJ"}, {"Author": "Nunzia B.", "ReviewID": "Ro8iUBTMMoi3SazOsxZNXQ", "Overall": "5.0", "Content": "excellent italian thin crust pizza.....and they have gluten free pizza too... .the environment is very friendly ....I absolutely recommended. ...we loved it !!!!", "Date": "2014-06-24", "Author_Location": "Matawan, NJ"}, {"Author": "Mike W.", "ReviewID": "BwkOVuzwJ6OR7ihZgGhiEQ", "Overall": "1.0", "Content": "By far the worst pizza I have ever had. A disgraceI am originally from Brooklyn so I know pizza. I have been living in los Angeles for last 7 years. I came back to Nyc for business and I was looking forward to eating nyc pizza.Boy I was wrong. This is the worst pizza I have ever had. Sbarro has better pizza than this place. I am positive they payed people to give them high yelp reviews. Almost no cheese on the pizza. Horrible cardboard crust. They barely heated it up for me. Any New yorker that thinks this is good pizza must be an upper eastsider. I took my boss who is from LA to eat here and he was so excited to have NYC Pizza and he thought it was horrible.", "Date": "2014-01-15", "Author_Location": "Culver City, CA"}, {"Author": "Nelson W.", "ReviewID": "0FGKmn7lOXNVGuCaeZtiXA", "Overall": "4.0", "Content": "While I hesitate just a bit in calling it the best, Merilu comes darn close to that when it comes to pizza delivery. The high praise and rating is definitely warranted especially after delivery was made on a nasty weather day. Not only was the quality of the pizza very well maintained, delivery came very fast in spite of outside conditions. Merilu is definitely on the pricier side of pizza spots in this neighborhood, but the quality of the ingredients are incomparable. The tomato sauce is amazing, and the thin crust was perfect. Do yourself a favor and join the big leagues. Leave the dollar slices where you found them, and order a pizza that will surely leave nothing but crumbs behind!", "Date": "2014-01-05", "Author_Location": "Sunnyside, Queens, NY"}, {"Author": "Kenneth N.", "ReviewID": "fD1En9soau_VB0w3p49L8g", "Overall": "4.0", "Content": "Now these guys have their act together!  Trying to order pizza delivery to my hotel, and as soon as i place my cursor over their Online Order tab, a pop-up message says \"Online ordering not available at the moment\".will try soon b/c of the 4-star rating.", "Date": "2014-01-10", "Author_Location": "Vancouver, Canada"}, {"Author": "Josh C.", "ReviewID": "PntOKR3coHc0UlMns-SEGg", "Overall": "4.0", "Content": "Had a good experience. The workers were very friendly and were good to have a joke with. They came over to talk about Australia. The pizzas were very nice and great value! Would highly recomend this place to anyone who likes pizza and I will definitely go back in the future.", "Date": "2014-03-11", "Author_Location": "Melbourne, Australia"}, {"Author": "Kirk B.", "ReviewID": "IQg5RB1WDsqjCuF8F7kkzA", "Overall": "4.0", "Content": "Good pizza.  Not greasy at all and the ingredients were fresh.  Delivery was a little bit of a wait, so order early!", "Date": "2014-05-12", "Author_Location": "Foxfield, CO"}, {"Author": "Heather E.", "ReviewID": "7k6_NG1jPmXAfsXwszjGLQ", "Overall": "5.0", "Content": "Not sure why people are so polarized by this joint. It's not traditional NY pizza. It's just good pizza!!  Love the Artichoke & Arugula and you can't go wrong by the eggplant. All delish!  Hubs and I ordered 30\" for dinner and still had some for the next day.", "Date": "2014-05-02", "Author_Location": "Santa Monica, CA"}, {"Author": "My N.", "ReviewID": "4Al51FjcXs0VRtAxHFBsow", "Overall": "3.0", "Content": "Had their margarita and white pizza.  Their crust was delicious had a crunchy exterior and chew.   The margarita was my favorite had the perfect ratio of sauce and cheese.  Their white pizza I didnt like because the ricotta was not evenly distribute, didn't think eat bite was well balanced.", "Date": "2014-01-05", "Author_Location": "San Diego, CA"}, {"Author": "Rebecca B.", "ReviewID": "39GARRAoGjBAtKSiPlYYdw", "Overall": "4.0", "Content": "Very good pizza. Dough was nice and crispy, just enough ingredients on top. Large portion for the price. Not overly filling though, like your typical delivery joint's pizza might be. Not greasy. Had 3 different kinds and they were all tasty! I really liked sitting by the window/door - the whole front of the restaurant opens up and you're basically sitting outside. Very nice in the good weather!", "Date": "2014-04-28", "Author_Location": "Houston, TX"}, {"Author": "Christina M.", "ReviewID": "xA360K0utvYWfFACK-TPPw", "Overall": "3.0", "Content": "The pizza was okay.  I got Margherita and Bianca con Spinaci slices and a minestrone soup.  The slices were both good, but not amazing.  The pizza was also very expensive ($4), and the slices were not large.", "Date": "2014-04-08", "Author_Location": "Houston, TX"}, {"Author": "Stephanie Y.", "ReviewID": "HTp5briZtdm_52i5lAaB9Q", "Overall": "4.0", "Content": "Whoa whoa whoa, stop the presses. Their regular pie may be the best! I know it seems that I say that about every slice of pizza I get down on, but I speak the truth. They do lots of fancy pizzas from a ricotta white (real good) to a meat lovers dream (ok) that really makes this place stand out, but the king of the pizza hill goes to the regular cheese. Large, cheesy with the perfect amount of delicious sauce combined with high quality ingredients? Yes. Prices are a bit high for pizza and  delivery took forever, like close to an hour and a half, but it was a Saturday night so....I definitely recommend the pizza here and it keep simple: the regular pie.", "Date": "2013-12-04", "Author_Location": "Jersey City, NJ"}, {"Author": "renje g.", "ReviewID": "12KXNzFIHVMxa7UzvOy50w", "Overall": "4.0", "Content": "++- Pizza is damn good-  Sauce, (slightly burnt)crust, cheese are all in perfect combinations- Inexpensive, small margherita pizza can easily food two, perhaps three if they're not super hungry- - Very small- You're going to be cold if you come on a cold night, with the constant door opening", "Date": "2013-12-27", "Author_Location": "Brooklyn, NY"}, {"Author": "Junaid H.", "ReviewID": "ptgZI7KEbMmxSerU5oK1XA", "Overall": "5.0", "Content": "great pizza still thinking about it !", "Date": "2014-04-13", "Author_Location": "Raleigh, NC"}, {"Author": "Kat D.", "ReviewID": "_uDRP5aXJCtlh6fhk_328g", "Overall": "1.0", "Content": "I'm not really sure why this place has such great reviews. My boyfriend and I were visiting from Chicago and stopped here after seeing such great reviews on yelp. Yelp has never let me down until today. The pizza tasted like cardboard with sauce. I had the 5 cheese pizza and all I could taste was the overpowering taste of blue cheese and this is coming from someone who likes blue cheese.", "Date": "2014-03-25", "Author_Location": "Chicago, IL"}, {"Author": "Audrey T.", "ReviewID": "utSVwh0fJvDS4-7qXKsx3Q", "Overall": "4.0", "Content": "Found this little pizza place on Yelp to take a pizza-lover. We were not disappointed!This place is small, probably fits only 10 people comfortably. Luckily we were able to grab a table. You order and pay at the front, then the server brings out your slices of pizza to you on cafeteria trays. While it seems like a hole in the wall sort of place, it's still nicely decorated - and sanitary. That's important!We ordered one slice of: the Merilu, Margharita, Mushroom and Parma. All truly very good. My personal favourite is the Parma (yay for cured meat!), but their Margherita and Merilu appears to be the most popular. The toppings seemed fresh, the crust thin. I could've eaten all the slices myself (but I had to share). Everyone in my group were super pleased with this place - glad I found it!Would we come back? YES, if we were in the area. At $3.50 - $5.50 per slice, it's not the cheapest place, but you definitely get good quality for your money!", "Date": "2014-01-20", "Author_Location": "Manhattan, NY"}, {"Author": "Jason P.", "ReviewID": "KhmbGkKK4VGkaAXBvg_3PQ", "Overall": "4.0", "Content": "Tasty, large slices of thin-crust pizza, excellent service, and good variety of toppings to choose from. Can purchase by the slice and ask for middle or corner slices.", "Date": "2014-04-18", "Author_Location": "Manhattan, NY"}, {"Author": "Lindsey S.", "ReviewID": "e5vVHzINbJR0xFmEksZPpA", "Overall": "4.0", "Content": "4.5 Stars! Amazing pizza. The perfect sauce to dough ratio. The toppings were savory and sweet. The girl taking my order was so sweet and explained each flavor descriptively, adding in her personal favorites. It was closer to a thin crust than pan pizza. I only wish it had a little bit more cheese :P", "Date": "2014-03-29", "Author_Location": "RIDGEWOOD, NY"}, {"Author": "Karoline K.", "ReviewID": "NDbRv-5EmEcWld8pHzxODQ", "Overall": "4.0", "Content": "I had the vegetarian pizza and the mushroom pizza. The ambiance is quaint. This pizzeria is rather small but adorable. The customer service was not the best. As a first time customer, I figured they would try and offer some advice or provide the specials of the evening. It was not crowded at all and I couldn't decide on what to get. Finally, I just asked the guy at the counter. He basically named the pizzas but didn't provide much insight. However, I unknowingly ordered a pizza with meat in it. Even though he put it in the oven to heat up, he was nice enough to not charge me and took it right out.The selection of pizza was overwhelming! The pizza pie is oval shaped. The slices are cut vertically, yielding two pieces, similar to a Sicilian shaped slice. The crust was perfection on both slices.I preferred the vegetarian pizza, it had onions, tomatoes and a bunch of other veggies. While the mushroom pizza was good but the flavors of the vegetarian blended extremely well.", "Date": "2014-01-23", "Author_Location": "FOREST HILLS, NY"}, {"Author": "Karoline K.", "ReviewID": "NDbRv-5EmEcWld8pHzxODQ", "Overall": "4.0", "Content": "I had the vegetarian pizza and the mushroom pizza. The ambiance is quaint. This pizzeria is rather small but adorable. The customer service was not the best. As a first time customer, I figured they would try and offer some advice or provide the specials of the evening. It was not crowded at all and I couldn't decide on what to get. Finally, I just asked the guy at the counter. He basically named the pizzas but didn't provide much insight. However, I unknowingly ordered a pizza with meat in it. Even though he put it in the oven to heat up, he was nice enough to not charge me and took it right out.The selection of pizza was overwhelming! The pizza pie is oval shaped. The slices are cut vertically, yielding two pieces, similar to a Sicilian shaped slice. The crust was perfection on both slices.I preferred the vegetarian pizza, it had onions, tomatoes and a bunch of other veggies. While the mushroom pizza was good but the flavors of the vegetarian blended extremely well.", "Date": "2014-01-23", "Author_Location": "FOREST HILLS, NY"}, {"Author": "Jeff K.", "ReviewID": "bT6n8YkEDn5IyHxHot0xZQ", "Overall": "5.0", "Content": "This was a Yelp researched find. Glad I found it. A large Marcolino pizza, Chicken Parmigiana with salad and bread along with  several sodas and seltzers made the perfect dinner for the 4 of us. The sauce was smooth, subtle and just the right amount for my palate, toppings were plentiful and quality. The price for 4 was right, the staff was very accommodating and you can tell they care about your dining experience. I would walk miles to get a pie from Merilu's again.", "Date": "2013-12-23", "Author_Location": "Boston, MA"}, {"Author": "Sean B.", "ReviewID": "KYVTh80lO9Z1RRCMjwDP-A", "Overall": "5.0", "Content": "I ordered chicken parm. Awesome.  However, I tried a slice of their Parma Ham with Egg thin crust pizza, and I ALMOST cancelled my chicken order.  The pizza here is that good!  Everything else(and I have tried them all) in midtown is Child's Play.  The ingredients, the crust, they are very friendly...what an incredible find!", "Date": "2014-05-03", "Author_Location": "Mill Valley, CA"}, {"Author": "David S.", "ReviewID": "f4cly5vePIdmfGFaT7Pg6Q", "Overall": "3.0", "Content": "Too dried out. When we ate there, at lunch on a Weekday, the pizza was bland even though it had toppings.  California has better versions of this style pizza, e.g., Pizza   Antica.", "Date": "2014-06-11", "Author_Location": "Moraga, CA"}, {"Author": "Adrian M.", "ReviewID": "VgcbNQTNgs13qF0YiPk-aQ", "Overall": "3.0", "Content": "I was not impressed. I tried slices or 3 types of their pizzas.  The crust was respectable but not great. The sauce was bland. Toppings were fine. S ok but not great.Service was great though, very friendly. Nice neighborhood place.", "Date": "2013-11-09", "Author_Location": "Tehachapi, CA"}, {"Author": "Amanda N.", "ReviewID": "_saZdpj89ogDXuqQZDrR8A", "Overall": "5.0", "Content": "Je t'aime! This place was amazing! Very cute little pizzeria with delicious pizza! My husband and I got the Pizza de Merilu and it was fabulous! Pears, ricotta, mozzarella, gorgonzola, all drizzled with honey on a thin crust. Highly recommended!", "Date": "2014-03-12", "Author_Location": "Orange, CA"}, {"Author": "John T.", "ReviewID": "ic4q6Ik4MHn9HDxmlcNTaQ", "Overall": "5.0", "Content": "My first slice of pizza when I came to visit New York, walked a mile in 12 degree temp for this pizza after someone on the streets told me to try it.  Glad I did.  Although not the conventional round pizza, it was great.  Light and airy crust, good amount of toppings, not overly greasy.  Service was polite and helpful.  place looked clean, small, but clean.  Sat and enjoyed two slices and the counter guy was talkative.   This is a great place to visit frequently or when you get to Manhatten.  I liked it.", "Date": "2014-03-17", "Author_Location": "Corpus Christi, TX"}, {"Author": "Yi H.", "ReviewID": "ab4xJl08B_gPAqdKvSTUtw", "Overall": "5.0", "Content": "I ordered 6 x 15 inch pizza for a house party of 20 people, it was perfect.I host a birthday party at home on a Saturday night, I decided to order Merilu because of its awesome review on Yelp. I had no idea how many pizzas I needed for 20 people and called them asked. They gave me very good suggestion, so I decided to order 6 different 15 inch pizza and asked them to choose their most famous pizza for me, 2 vegetarian ones and 4 meat ones. We ended up having:- Margherita- Eggplant Vegetarian- Rustica- Prosciutto di Parma- Capricciosa- Jax-TexanI asked them if they can deliver the pizza at 8:15pm, they told me that they can probably do between 8:15pm and 8:30pm, which I thought was good that they managed my expectation. Besides, the lady was very helpful and friendly, she was really helping me to choose pizza. Our guests slowly arrived around 7pm and as time went by, I was worried that they would get bored with chips and dippings. I was looking at the watch and it was 8:24pm, I decided to call Merilu to make sure we will have our food soon and I was told that they are now packing the pizza, they should be out of the restaurant very soon. Then 5 minutes later, they called me to tell me that pizza are already on the way and I shall have them very soon, which I thought was great, I appreciated them calling me to keep me updated. When all the pizza arrived, my guests just dived in and everyone loved it. The quantity of food was just perfect, we only have 1 - 2 pieces left and everyone asked me where I got the pizza from, which obviously made me very happy. I highly recommend here!", "Date": "2013-10-12", "Author_Location": "Manhattan, NY"}, {"Author": "Eric C.", "ReviewID": "LicSsa_-Lm5Bc2x5v10u4A", "Overall": "3.0", "Content": "I can't understand the high reviews for this place. I've ordered from here twice, once a mushroom slice from the counter, once a whole cheese pie delivery. Both times the food was just average. I didn't hate it, just nothing special.", "Date": "2014-03-06", "Author_Location": "Buffalo, NY"}, {"Author": "Joseph P.", "ReviewID": "-rEn5mgoJZNEaPE2iv5TpQ", "Overall": "4.0", "Content": "I tried it based on the reviews from this site. It's pretty good (I ordered a plain cheese pizza), definitely a pretty decent New York City pizza joint, but not quite as good as famous Amadeus which has a lower rating on the site. Amadeus just has a slight edge on taste.", "Date": "2014-05-29", "Author_Location": "Manhattan, NY"}, {"Author": "s r.", "ReviewID": "J3A3Od6S9u4pfHJcJ3u8Vg", "Overall": "5.0", "Content": "The pizzeria is very cosy and inviting. Staff are pleasant patient and friendlyMaggie is very helpful and always has a winsome smile even when you change your mindThe pizza was awesome and we shipped 17 pies to Hawaii and needless to say we are enjoying them akin to hogs heavenEating here with an excellent ambience, compliments the sumptuous pizza. The sopresetta pizza was sublime and prosciutto was perfectly balanced and nuanced in its ingredientsNew York water versus bottled water would be a great addition :))", "Date": "2014-01-06", "Author_Location": "Wallace, CA"}, {"Author": "Kevin W.", "ReviewID": "J2KgtsPVCrThOKzbnmvRKQ", "Overall": "5.0", "Content": "Wow, a pizza place in Hell's Kitchen that doesn't suck.This little place is pretty unique.  15 inch or 30 inch custom pies ... or whatever \"slices\" you see that's already there.  It all sounds like a gimmick, but wait until you actually take a bite of the scrumptious pizza that comes out from the oven.The taste is pretty awesome.  Aside from the unique shape, which gives you plenty of crust (if you're into it), the pizza is pretty delish.  Just the right balance of crispiness, condiments, and sauce.  It's hard to describe here, but let's just say you get what you pay for.  There's definitely a premium placed on the price, but that's not deterring people from the traffic I saw in the store.  I tried a 30 inch custom pie (half pepperoni, half spinach white pie).  Both were divine and the taste fresh out of the oven can't be beat.The folks here were also extremely friendly and helpful with explaining the menu.  As for the size, my lady and I combined took down a 30 inch pie.  Granted we have a crazy love for pizza, but 30 inches is probably fit for either 2 really hungry average people or 3 moderately hungry peeps.  A 15 inch pie is not that huge at all, so keep that in mind when you make up your mind.Thank god here is a decent, unique pizza joint in HK.  As much as I like John's, I was sort of getting tired of the limited options here.Note this place is pretty small.  It sits about 10 to 12 people comfortably.", "Date": "2013-09-09", "Author_Location": "Manhattan, NY"}, {"Author": "Alton W.", "ReviewID": "yPwRZ5RrUv9dTYKeBt49FQ", "Overall": "4.0", "Content": "Decent price for a good amount of food. Split a 30\" with 3 friends, and it was more than enough for us. -Rustica: This pizza was on point--mozzarella, italian sausage, red onions and red peppers. Flavors were good--better than I expected.-Pizza di Merliu: Wanted to go out of the box and try something different, so this pizza with pears, gorgonzola, ricotta, walnuts, truffle oil, and a bit of honey seemed different enough to try. It was good, but the the blend of cheeses were a bit too overpowering and made it too rich to eat much of. All in all, will be back.", "Date": "2013-11-27", "Author_Location": "Temple City, CA"}, {"Author": "Ala J.", "ReviewID": "uwg9vBILr6Q7qqh0SDmofg", "Overall": "5.0", "Content": "I was just looking to get a halfway-decent slice of pizza near my workplace and what I found was this amazing little restaurant. There are literally not enough good things I can say about this place!!I could sit here and talk all about how excellent the food is but I think a hundred or so other Yelpers have that covered! Just get here and try it.If you're planning on eating in, expect an incredibly warm atmosphere for such a small, busy place. The staff here are super attentive, always welcoming, and the place just feels totally relaxed. Great vibes all around!The bottom line at Merilu is fresh, superb quality food at a great price, served by the friendliest people you will probably ever meet in Midtown. Seriously!Eat here and you will not be disappointed!!", "Date": "2013-09-13", "Author_Location": "Midtown West, Manhattan, NY"}, {"Author": "Marc D.", "ReviewID": "OytknMlCmPhcHlw6PjUgJw", "Overall": "4.0", "Content": "* Solid non-NY slice *Lots of good slices to be had all over the place in New York. When in the mood for a non-typical NY slice this spot fits the bill.  They do a pizza that is a cut above the rest.I ordered the straightforward margherita slices.  They are rectangular and cut off of a long rectangular pizza.  The crust was superb with a nice leoparding and wonderful chew.  The tomato sauce popped with a pleasant sweetness. The hand-pulled mozzarella added a nice cut above the rest touch. The thin strips of basil were fresh (I would have perhaps liked a bit more, but I nitpick) and balanced out the flavour.  Overall a very very pleasant slice.  Photo:  yelp.ca/biz_photos/meril…Service was also really friendly and they clearly take strong pride in their product.  I would definitely return!", "Date": "2013-08-27", "Author_Location": "Vancouver, Canada"}, {"Author": "Rima C.", "ReviewID": "8Wz50nYzefB84-ujAiyDvg", "Overall": "5.0", "Content": "Oh my God.  I don't know what Merilu puts in her pizza, but it is GOOD. Do try their garlic bread, as well. Warning: order delivery well in advance, anticipating about an hour wait time.", "Date": "2014-03-11", "Author_Location": "Manhattan, NY"}, {"Author": "Aaron S.", "ReviewID": "JqBVmOu8kr-rO3hxLb6qYw", "Overall": "4.0", "Content": "Tasty thin pizza. European style.  Nice and crunchy. Good stuff.", "Date": "2014-02-16", "Author_Location": "Charleston, SC"}, {"Author": "Felix P.", "ReviewID": "JDZPxOhOMGR9CBAXzS76Xw", "Overall": "3.0", "Content": "2.5 stars....in this place....You can pick....the thin crust oblong or the classic NY style....I chose the latter...the verdict....well it was indistinguishable from any NY pizza place. And the price was frankly, outrageous...17 for a large pie and 4 for sausage topping....welcome to NY! Is it any small wonder that 1 dollar pizza places are so popular?", "Date": "2014-03-27", "Author_Location": "New York, NY"}, {"Author": "Foodlover B.", "ReviewID": "Hb7uavVi8NS9cVf97sDhbw", "Overall": "5.0", "Content": "Decided to try this place and Saccos, which are a block apart in location.  We wanted to gorge on NYC pizza  our first night after flying in today.We  loved merilu the most,    I had a slice with Italian veggies. The hubby, the spicy sopressa.   The crust is the perfect thinness/thickness.It's a simple place with a few tables but really nice workers.The weather was petty cold!", "Date": "2013-11-12", "Author_Location": "San Francisco, CA"}, {"Author": "Lindsey B.", "ReviewID": "aH6ugKoKtVBgEikF263NRw", "Overall": "4.0", "Content": "Really yummy pizza. I loved the thin crust. Super crunchy!! The staff was friendly. Coming from California the price was fair and the portion was generous. The place was a little small but cozy. I'd recommend this place to anyone.", "Date": "2014-02-11", "Author_Location": "Sacramento, CA"}, {"Author": "F T.", "ReviewID": "XEe4cJav6uZIMJLaiJ9Tjg", "Overall": "5.0", "Content": "We've ordered from here numerous times. Their eggplant pizza is beautiful in appearance and tastes delicious. No meat needed, it is very filling. That is my wife's favorite.My favorite is the buffalo chicken pizza. The buffalo sauce has the perfect tang, but the best part is a sweetness by the crust (syrup??). It's very very good.Great place.", "Date": "2013-11-23", "Author_Location": "Jacksonville, FL"}, {"Author": "Glenn C.", "ReviewID": "JWljVluBzkwGNgL011E5ZQ", "Overall": "4.0", "Content": "Tasty mushroom pie, very good spinach but the food in general was quite pricy.I'll give it a 4 for now, I'll try their specialty next time .Woman ws nice, drinks were overpriced like everything else.", "Date": "2013-09-25", "Author_Location": "Fair Lawn, NJ"}, {"Author": "Leo O.", "ReviewID": "q5Lo1RC_W2sV8t-8GyMCJw", "Overall": "4.0", "Content": "Giving this place 4 stars because of the flavors of the pizza but 3 stars for the pricing.  Pizza should be a little cheaper.Had a soppressata (salami) slice and artichoke, mushrooms, and ham slice.  Both were excellent.  Fresh ingredients, flavorful tomato sauce and I would definitely pick soppressata over pepperoni.  The crust is thin which is nice.  There is some mild burnt flavoring which I was fine with.  I haven't tried their other slices but I've heard that their basil one is really good.The drink I like the most is the Black Cheery drink.  I'm going to buy some for myself now.I would recommend this place.", "Date": "2013-09-07", "Author_Location": "Manhattan, NY"}, {"Author": "Michelle J.", "ReviewID": "OOEaqgpPXuRkeWRPm2f4tA", "Overall": "4.0", "Content": "The best pizza in Hell's Kitchen!", "Date": "2014-03-16", "Author_Location": "New York, NY"}, {"Author": "Cathleen S.", "ReviewID": "fd9UvwaYmgw3exbfDx3MfQ", "Overall": "4.0", "Content": "Merilu makes an awesome pizza. I've only ordered delivery, so I can't comment on the experience at the restaurant.  The margherita pizza is so delicious...and if you enjoy spicy get the hot sopresatta.  So delicious. The 15\" is alot...the 30\" is so big it won't fit in your fridge.  I think it is a great bang for your buck. A heads up...delivery from here takes awhile but it is worth the wait!", "Date": "2013-07-27", "Author_Location": "Westchester County, NY"}, {"Author": "Mark K.", "ReviewID": "XHqVeU_al4lkqzjSbGmI7Q", "Overall": "5.0", "Content": "It's hard to walk one block without seeing 99 cent or $1 pizza slices with loads of people stuffing their faces.  I can only hope that these aren't tourists who will go home and say \"I had REAL NY pizza!\"  Blech!On the other side of the spectrum is Merilu Pizza.  Here you can also get pizza by the slice (my preference, since it's easier to try different flavors and toppings) but you'll pay the price - anywhere from $4.25 to $5.00 a slice.Is it worth it?  Every penny.This is not your ordinary pizza.  The pie is long and narrow and the crust is thin but not paper-thin.During our visit, we had the Primavera (excellent combination of vegetables bursting with flavor), the Bianca con Spinaci (no sauce, sautéed spinach, house-made mozzarella and the most delicious, fresh ricotta), the pepperoni (very flavorful pepperoni), Hot Sopressata (topped with hot, as in spicy, salami) - excellent!Needless to say, the bill wasn't cheap but it was a memorable dinner.  Every bite was excellent and the staff was really warm and friendly.  I highly recommend eating there (although there are few seats), so you can get first dibs on what comes out of the oven.", "Date": "2013-07-21", "Author_Location": "New York, NY"}, {"Author": "Kurt N.", "ReviewID": "WU0dsf_pTPCaVGGIxdO84w", "Overall": "5.0", "Content": "We wanted Pizza, and after our disaster at the day before's meal, we punched pizza within walking distance into Yelp and this place came up. Great decision.Good, authentic, italian style pizza. The slices are very filling and reasonably priced.", "Date": "2013-09-02", "Author_Location": "Atlanta, GA"}, {"Author": "Travis D.", "ReviewID": "pA5_5L5NM2LChJ66IdM6mw", "Overall": "4.0", "Content": "Stopped here for pizza and a coke one night after doing some shopping, and I would go back again if in the area and in a pizza mood!   The mushroom pizza that I had was pretty good, and I also tried my date's-which was very good too although I can't remember the kind they had. Worth a try though!", "Date": "2013-09-18", "Author_Location": "Minneapolis, MN"}, {"Author": "Richard L.", "ReviewID": "lF1lBSlhtBsPFupZgwj8JQ", "Overall": "4.0", "Content": "Me and my buddies ordered from here once for delivery - pizza and some rolls.  Then we forgot the name of the restaurant -but remembered the rolls were amazing.So fast forward a month or so - and we're online looking for the place when we eventually found it - 3 guys ordered 6 rolls -  a combination of all the rolls they had there.  Damn they were good - cheesy gooey insides with meat and stuff, and a wonderfully flavorful crust.  The Rolls delivered were cut in half.So here we go in descending order of amazingness:Stromboli - There's a reason why the stromboli has been popular since forever.  It's because the flavors compliment each other very well and it's just damn good!  Over here - you'll get tons and tons of ham, pepperoni and sopresetta.  The cheese and sauce is the right amount as well.  Sausage Roll - The sausage roll has just the right amount of onions and peppers and a generous amount of sausage and cheese.  It tastes good.  Second favorite amongst the bunch.Merilu's Chicken Roll - This...still good...just wasn't my favorite.  The chicken was flavorful and the size was good.  Eating this after the stromboli was a let down...anything after the stromboli was a let down lol.Lou's Chicken Roll - the problem with this roll - still again good - but not amazing - the fried chicken flavor was lost in the cheese.  So they fried chicken and chopped it up into the roll so the fried chicken was lost...oh well - still good, just not as good as i wanted.I would get the stromboli over and over again!", "Date": "2013-07-08", "Author_Location": "Manhattan, NY"}, {"Author": "Abra B.", "ReviewID": "XTpQHUxwfYx9FE0CbPdhyw", "Overall": "4.0", "Content": "Oh how I needed a quick slice of pizza and was not willing to settle for just any pizza parlor. After Yelping this place, I realized quickly why it was close to a full five stars. First off, it's simple. You walk in, head to the back and select from what's out. If you don't like it, wait for what's about to come out of the oven and you're good. They offer normal bottled beverages, but allow you to BYOB. Quick service with fast delivery. The crust, sauce and toppings were delicious and you won't regret going here just based on the pizza alone.", "Date": "2013-08-24", "Author_Location": "Dallas, TX"}, {"Author": "Adam M.", "ReviewID": "FutHhPKSG0_CF4IwbXQ5zA", "Overall": "5.0", "Content": "Perfect square cut thin crust pizza by the slice.  After I left the U.S. Open last Monday, I was looking at Yelp for spots in Hell's Kitchen for pizza.  This little restaurant caught my eye.  It was around four and there was a portly guy with a paper plate and a bit of pizza -- just chilling in one of only several eating areas.  The counter person had a good attitude.The options they had on display all looked great. The Prosciutto di Parma really caught my eye, so I asked for two slices. The prosciutto was very delicious - it had that melt in your mouth sweet-salty combination that comes with primo \"proshut\". All of the ingredients were of note - the mozzarella was incredible (apparently it's all their own hand-made hand-rolled) and the crust is the perfect crisp/chewy combination.  The sauce was slight, but the expertly applied sweet-tangy balance which brought the very fresh Parmesan and arugula together nicely.  These were a pizza masterpiece - a PIZZAPIECE!  I wasn't hungry any longer, but I had to try the Rustica which was old school (sliced) Italian sausage (sausage with caramelized red onions and peppers) on a pizza.  The pizza was freaking magic.  This was the best possible version of a sausage bomber when considering Merilu's crust and sauce capabilities.  This slice had more sauce and it was completely appropriate based on the combination. I was in heaven.  I was a little sad that my hotel room did not have a mini fridge so I could somehow stuff a pie in it.  Thanks to Yelp reviewers for the recommendation!", "Date": "2013-09-02", "Author_Location": "Madison, WI"}, {"Author": "Michael R.", "ReviewID": "4fo9P8IbJhOyx-U-u6eixw", "Overall": "3.0", "Content": "I only tried the pizza by slice. It was good, very thin and light. I think I would've liked the freshly-baked whole pie better. Will try that if I get another chance to visit this place again.", "Date": "2014-02-17", "Author_Location": "San Francisco, CA"}, {"Author": "Scott T.", "ReviewID": "vc3tdUiI085pPAxniE3Xlw", "Overall": "5.0", "Content": "Started our vacation here with a nice lunch and today before heading to the airport for home we agreed a revisit here was an appropriate way to end it all. So relaxed, so affordable and SO GOOD. After a couple of weeks of fairly extravagant, sometimes expensive and weird dining (think food malls in Flushing, Roosevelt Avenue in Queens), their inviting slices of pizza remain some of our best memories of the trip, and it was that memory that had us coming back today. Plus, the owner is pleasant as can be.We had five different kinds of pizza today along with cans of the Sanpellegrino blood orange soda and then went for the knockout punch: the peanut butter and Nutella \"pie,\" more like a stromboli. Oof. That's a lot of food :).What a terrific selection of Roman style pizza, all expertly prepared with great ingredients and the tastiest bread we can imagine. Wish we lived close, we'd be regulars! When it says \"As good as it gets!,\" we're in agreement with Yelp on this one.", "Date": "2013-08-07", "Author_Location": "Lawrence, KS"}, {"Author": "Celeste Y.", "ReviewID": "Qrr6lYso1N2JtYuG5CYeCw", "Overall": "4.0", "Content": "Love the thin crust! We ordered a Rustica pie and it was so worth $33. The sauce and toppings were great. We also ordered a chicken roll and that's what brought the review down to 4 stars. I think it was undercooked because the dough inside was still moist, but apparently it was cheese? It was a bit too doughy. I also wish that there was more seating! Other than that, this place is great!", "Date": "2013-09-05", "Author_Location": "Brooklyn, NY"}, {"Author": "Amy S.", "ReviewID": "opelGbKhDCzgoNm3qBkbKA", "Overall": "4.0", "Content": "Gluten free margherita is more thin and crispy than the regular pizza, and surprisingly really tasty. $$$$ for all the pizzas-- not sure how it's been given only 2 $$, but it was very pricey compared to the other places (by slice and/or pie) that I've been", "Date": "2014-01-27", "Author_Location": "Austin, TX"}, {"Author": "Rebeka B.", "ReviewID": "ZsjAITWdxO1fqML-jDinUA", "Overall": "5.0", "Content": "Pizza here is my favorite in the city (besides Forcella). Great prices, great customer service, and delivery is on time. Usually end up getting two pies delivered and freezing the slices individually for dinners - they are just as great reheated.Love their Margarita pie. Only annoying thing is that they arent open on Sundays (???) That's my cheat day!!", "Date": "2013-09-03", "Author_Location": "New York, NY"}, {"Author": "Adam R.", "ReviewID": "CcxchCrf7iCRfGz7gUePvg", "Overall": "1.0", "Content": "Pizza looked decent but I wouldn't know how it tasted. Ordered a large prosciutto pie and some salads for our family and we all say down while the guy said \"give me 20 minutes\". 20 minutes later he walked over to our table and said \"we're out of prosciutto, want something else?\". If he had told us this in the beginning it would have been no problem but they totally wasted our time and made no attempt to rectify the situation.", "Date": "2013-12-26", "Author_Location": "West Hills, CA"}, {"Author": "Carmen C.", "ReviewID": "ZwJS9nJApabYcjBOU5sqXw", "Overall": "4.0", "Content": "Yummy. What a great find by my friend right in my work neighborhood. The area is packed with a myriad of great Thai restaurants and ramen shops, but this is a great alternative to a regular pizza joint. The pizza is thin crust, made with fresh ingredients (topped with fresh basil) and was just delicious. The pasta was to be expected by any other pizza fast food joint, so it's standard. Great spot to either dine in (though limited seating) or take out.", "Date": "2013-07-13", "Author_Location": "Brooklyn, NY"}, {"Author": "Whaledriving W.", "ReviewID": "bVUcfE0_2aZ3AalY7grFng", "Overall": "5.0", "Content": "Pizza doesn't get any better than this!", "Date": "2013-11-27", "Author_Location": "San Antonio, TX"}, {"Author": "Amie H.", "ReviewID": "cFVot9xG2_UAMsfBgXHILQ", "Overall": "4.0", "Content": "Tastey pizza with a by the \"slice\" style.  Fun spot, hip music, young, attentive staff.", "Date": "2014-02-10", "Author_Location": "Seattle, WA"}, {"Author": "Sandee L.", "ReviewID": "4Mekl6kObaGp8bz9MbojUA", "Overall": "4.0", "Content": "Don't let this little hole in the wall fool you. It's a hidden gem in Hell's Kitchen!The two of us ordered the 15\" proscuitto di parma pizza.  It was fresh, airy and super yums.  I easily scarfed down half of the rectangular masterpiece, which had eight slices to it and still wanted more!  It was just screaming with simple, high quality, fresh ingredients.A great snack or light meal.  It might even be healthy...and if it isn't, don't ruin it for me.  Ignorance is bliss.", "Date": "2013-02-14", "Author_Location": "Oceanside, NY"}, {"Author": "Elizabeth L.", "ReviewID": "Vf_eWD7qbLicZtK5RAOcaQ", "Overall": "5.0", "Content": "Had pizza here tonight, and it was delicious! Got the Sicilian slice with sausage, and the Margherita. I was skeptical of the thin crust, but it's incredibly flavorful, crispy, and satisfying. Ingredients are fresh, and service was very friendly. I was waiting for my fiance, and the lady working originally served me my pizza, then saw I was waiting so she kept my pizza warm in the oven until he arrived. We also LOVED the pasta with vodka sauce. Something very comforting about it -- the sauce was excellent, the portion was large, and it was only $10. Probably a better deal than the pizza, which is around $5 a slice.Strawberry pie for dessert. Basically a pizza with nutella and strawberries. Hard to dislike :)", "Date": "2013-05-02", "Author_Location": "New York, NY"}, {"Author": "Rob A.", "ReviewID": "ueFf9AUm49i0aHhOlxRr3A", "Overall": "5.0", "Content": "Excellent place in hell's kitchen. It easily beats many of the pricy and fancy places in the area. It is small takeout...but has a 2-3 tables if you want to sit and eat there.", "Date": "2014-04-30", "Author_Location": "New York, NY"}, {"Author": "Vito P.", "ReviewID": "zrRMuYTzP53PU_LygXyduQ", "Overall": "5.0", "Content": "Walked in the freezing November cold to try this place. The margherita slice was fantastic and well worth the commute. The place is small, so if you can order for pickup. The Parma slice which had prosciutto on it was also amazing, though a tad salty. The service was friendly and the pizza maker was very nice! I would def come back to this place. The pepperoni slice was also great!", "Date": "2013-11-29", "Author_Location": "Brooklyn, NY"}, {"Author": "Travis S.", "ReviewID": "ecGi6jhmK7V9jDDWJxJ7EQ", "Overall": "5.0", "Content": "Shared a large pie with friends and it was delicious! Will definitely be back to try something with more toppings.", "Date": "2014-01-25", "Author_Location": "New York, NY"}, {"Author": "Bryan S.", "ReviewID": "uYIaZ-XNHme7fhvVTdvZvw", "Overall": "4.0", "Content": "I went in for a couple of slices with a friend between some drinks one evening (still relatively sober so that didn't affect my assessment...lol).  The pizza was pretty good, just know what you are getting.  This is what I would call a more \"authentic\" pizza with thin crust.  It's not the big cheesy slice that I expect from a typical NYC by-the-slice place.", "Date": "2013-12-30", "Author_Location": "Manhattan, NY"}, {"Author": "Dianne M.", "ReviewID": "ht0DQnVH_aQvLfbZqLIZ8g", "Overall": "5.0", "Content": "Best pIzza ever.  Thin, light and crispy crust with delicious toppings.  Just the right amount of sauce and cheese.  Could eat this everyday!", "Date": "2013-12-27", "Author_Location": "New York, NY"}, {"Author": "Jesus H.", "ReviewID": "4vzbOMq13PBYWAf2-hHT1Q", "Overall": "5.0", "Content": "Wow this is the best pizza ever...Extremely casual, fresh!I thought you had to go to a big restaurant such as grimaldi's to get a great pizz but I was wrong...this hole in the wall has the best pizza crust and ingredients ever....Great music, alternative, great people the guys that help you out are very service oriented. Pepperoni, margherita and cabrzze are amazing....any type!....The only minus is that they do not sell any wine...The pizza at merilu with a chianti would do the best combination ever!!!So small you could miss it on the street...It is a must if you are around times square or central park!Merilu should consider betting on huge success going big!", "Date": "2013-01-28", "Author_Location": "New Orleans, LA"}, {"Author": "Santosh I.", "ReviewID": "foQZ6guS0l49trURKh7vlA", "Overall": "5.0", "Content": "Clean, inviting and cozy place with smiling reception and attentive, accommodating service... Fresh ingredients, pizza freshly prepared in front of your eyes, unique and great taste, appetizingly presented, reasonably priced yet does not feel cheapo. What's not to like? Thanks Yelp, for a great discovery!", "Date": "2014-01-17", "Author_Location": "Secaucus, NJ"}, {"Author": "Jacqueline K.", "ReviewID": "QehiKUJfnnM7zoNmcxkSZg", "Overall": "3.0", "Content": "I liked it... it was fresh... but honestly, I have had better pizza in New York.  I felt as if it was a little dull, and I needed to add a lot of chili oil to my slices (though admittedly, I was very happy that they had chili oil... not too many places do).  The inside is really clean for a little pizza place, and I was a fan of the exposed brick.  If you're in Hell's Kitchen, it's a good bet.  But if you really want to scour the city for phenomenal pizza, hop on the L and go to Carmine's Pizza in East Williamsburg.", "Date": "2013-02-22", "Author_Location": "Queens, NY"}, {"Author": "Francisco M.", "ReviewID": "FgJ4iDBGpSaXn8miZ83CCA", "Overall": "5.0", "Content": "Little hole in the wall with 5 star crust and pizza. Only five tables but great pizza.", "Date": "2013-12-27", "Author_Location": "Danville, CA"}, {"Author": "Alexandra S.", "ReviewID": "iYURIQ_6dKcVkejw2YkvcQ", "Overall": "4.0", "Content": "I was in the mood for pizza and decided if I was going to get a slice (and suffer the caloric consequences), it better be the best darned pizza in the area.  Well, it was.  Yelp reviews came through for me on this one. I had a slice of the green pizza (with veggies and garlic) and a slice of the white cheese one.  Both really really good. The crust was extraordinary - toasty where it should be, thin and crispy yet not dried out.  Highly recommend stoping by!Price wise a bit high - and go figure the 2 slices I chose were the pricier ones but still close to $10 for two slices is a little much.", "Date": "2013-02-19", "Author_Location": "Washington, DC"}, {"Author": "Anabel D.", "ReviewID": "jpb5rib0Vmhh4Iu52hjK7Q", "Overall": "1.0", "Content": "I'm staying in midtown and craving great NY pizza.  After a reading reviews, decided to check Merilu pizza out.   Sorry to say that this was definitely a FAIL.  Keep looking and don't bother with this place.  Pizza sauce had no flavor at all.  Still craving authentic NY pizza.", "Date": "2014-04-21", "Author_Location": "Pomona, CA"}, {"Author": "Doreen L.", "ReviewID": "_6EZ2NJz4uo3xS_NWQ4oXw", "Overall": "4.0", "Content": "Did you see that teeny tiny pizza place next to Flaming Saddles?Where?! There!That's Merilu.Is it any good?!You betcha. Crisp square slices for around 3.5 each. Buy a 15\" for 20-25. Well worth the money. Sweet sauce, garlic oiled crust, fresh ingredients. Is this the best pizza in Manhattan? No.But its an inexpensive, cozy, pizza place with paper cut hearts strung across the wall. Besides the cutesy decor, Merilu has a friendly cheerful staff: even the delivery guy was super polite and started picking up our mess. (Thanks for putting up with us while changing our orders a couple times. We are pickkky).", "Date": "2013-01-31", "Author_Location": "Manhattan, NY"}, {"Author": "Ka Chun N.", "ReviewID": "qAHcMCSUeYzooIaXN9KEtw", "Overall": "5.0", "Content": "Living in America, pizza has always been the dominant go-to-food for any occasion. My stomach has probably digested countless different varieties of pizza in the past, yet this place gave my stomach this special \"sensation\" that stands out compared to the nearest pizzeria around. Had Margherita pizza, thin no-burnt crispy crust, good proportion of sauce and cheese, and distinguished flavor. Overall, my stomach is happy.", "Date": "2013-12-09", "Author_Location": "Brooklyn, NY"}, {"Author": "Nichole Y.", "ReviewID": "KqIW9q68eMD-2ysmBVpCJw", "Overall": "3.0", "Content": "The staff was friendly and the pizza was good but I didn't really feel it was anything too impressive especially for the price. $4 a slice is a little steep. It was fresh and I did like the topping combinations. I think I was just expecting something a little more after going off of the previous reviewers.", "Date": "2013-09-07", "Author_Location": "Ellicott City, MD"}, {"Author": "Kell M.", "ReviewID": "kfhIHlWy5loUR8xZN4Fp7A", "Overall": "1.0", "Content": "bland, bland, bland, bland, bland.I was so disappointed. So not worth $5 a slice.The pizza was fresh, tasted like nothing though. I did like the crust, especially after munching on no flavor a nice crunch feels like heaven.", "Date": "2013-03-26", "Author_Location": "Manhattan, NY"}, {"Author": "Jason Y.", "ReviewID": "-CM-lTmxpYNMJWIeyOmo6Q", "Overall": "4.0", "Content": "This is a charming little place, that serves 'flatbread' style pizza. We popped in here after some site-seeing near Central Park / Columbus Circle with out of town friends. Got some quick pieces of margherita,  rustica, and a basic mushroom. Crispy thin crust, tasty sauce that wasn't too sweet, and nice fresh ingredients. Something a little bit different from your everyday NYC pizza. What's not to like?", "Date": "2013-02-08", "Author_Location": "New York, NY"}, {"Author": "Matt E.", "ReviewID": "__KtwA1hZDKAxYBSv_1ErA", "Overall": "5.0", "Content": "4.5 stars...Surprisingly this little pizza shop has one of the best margherita pizzas I've had in a long time, especially considering they do slices. The oblong shape of their pizzas cut into squares may be very unconventional for a thin crust NY pizza but it's really all about the taste. The bright fresh tomato sauce didn't taste like they messed with it too much (a common mistake), the chewy mozzarella was topped with olive oil, freshly grated parmesan, and chopped basil made for a delicious and large slice, well worth the $3.50. The thin crust was crispy and thin but not too thin and was tasty enough to be eaten alone. The girl behind the counter was also friendly and a pleasure to deal with, I appreciated her asking me if I wanted an end or center piece of the pizza that she just finished topping. I'll definitely be putting Merilu into the rotation of great pizza places in the city.", "Date": "2012-09-06", "Author_Location": "Brooklyn, NY"}, {"Author": "Jad H.", "ReviewID": "--XY_bD5DdFKvt37ltSAIw", "Overall": "4.0", "Content": "Great pizza. The crust is so good and the selection is excellent. They have some tables so u can sit down and watch the street. Only negative is no washrooms. Will definitely recommend.", "Date": "2013-12-21", "Author_Location": "Toronto, Canada"}, {"Author": "mina y.", "ReviewID": "KW5_RIjq075N86L9oWPJOw", "Overall": "4.0", "Content": "The pizza was pretty good and I especially liked the texture of the crust. We had the margherita which was decent, and some specialty pizza that came with sausage, goat's cheese, arugula, and olives, a very flavorful combination. It's not what I think of when someone says \"NY pizza\" but that's not a bad thing. It feels more niche/exclusive, and I guess that reflects in the price. I did feel like I was paying a bit too much for what I got, and that I could have found something similar for cheaper in California. But hey, vacations are meant for splurging, and for a pizza, this was a splurge.", "Date": "2013-09-20", "Author_Location": "Torrance, CA"}, {"Author": "Marlo G.", "ReviewID": "YwlYd9tF0bmmtBMypXEzdw", "Overall": "4.0", "Content": "Ohhh yeaaah! Thanks to the YELP app, I discovered Merilu which delivered to the Paramount Hotel. I had the New York pie which was so good!! And the smaller size was plenty of food for two!I ordered it with more sauce than cheese which is how I always order my pies, but every place does it a little differently.  While I would've liked more sauce, I would absolutely order again.  I actually would've gone to the restaurant and tried to, but it was a bit far.If you do order it to your hotel, please know you're gonna have to go downstairs and meet the delivery person. They carry Coke products in cans.", "Date": "2012-11-14", "Author_Location": "Hoboken, NJ"}, {"Author": "Amandeep S.", "ReviewID": "4e8XNg4K-5BqFCpyJ5O-ag", "Overall": "5.0", "Content": "Walked into this restaurant after looking at reviews on Yelp. The pizza was great! Had half margarita and half buffalo chicken pizza. Cooked very well and great flavor. You could tell the ingredients were more fresh than other locations. I would definitely go back. For a larger sized pizza expect to pay around $35-40, but that was more than enough for 4 people. Only thing, I wish they had more seating. However, it is NYC, so I understand why seating is limited.", "Date": "2013-08-29", "Author_Location": "Fairfax, VA"}, {"Author": "Ruggy J.", "ReviewID": "cLErgMwjPpeHOckT6F2knA", "Overall": "4.0", "Content": "Stutting around Midtown and have a rumble in your tum tum? Whip out your Yelp App and twinkle your little toes towards Merilu!On a recent hang in the 'hood, I had this overpowering urge for a slice of pizza. Not knowing much of anything about this corner of Manhattan, the interwebs guided me towards this unassuming gem of a pie shop. It's not your typical New York style slice as it's a bit more Sicilian style than the typical thin crust action, but it packs quite the flavorful, hearty punch. Amore!", "Date": "2012-08-18", "Author_Location": "New York, NY"}, {"Author": "Angela K.", "ReviewID": "6mV0EYEPxrxUEAIDI3CakQ", "Overall": "4.0", "Content": "Style is thin crust but the pies are rectangular instead of round. This pizza is more of an Italian style than the stereotypical NY style slice. I've been told by a friend that lives nearby that this is by far the best pizza in the area. She said its pretty small inside and that she and her husband usually order it in. I can't speak of the restaurant space since we ended up ordering it in based on her recommendation. The staff were very nice on the phone and had no problem letting me substitute ingredients. Garlic bread. JUST DO IT! Really thinly sliced and heavily buttered/oiled. Ridiculously good. Garlic isn't overly intense and its has other seasoning as well. Really good value for $3. It is so good I easily eat a whole loaf by myself, order multiple! Pizza Merilu - Gorgonzola cheese with thinly sliced pears and walnuts. OMG this pizza is freaking bomb!!!!! I've tried similar style at quite a few places, this here it seems to be toned down by being blended with ricotta. The texture and slight sweetness of the pear really pairs well with the cheese. Walnuts are fresh, go surprisingly well too, adding just the perfect amount of bite/crunch. My boyfriend doesn't normally really eat Gorgonzola, pears or walnuts (individually, let alone all together! lol) BUT he actually really liked it! He didn't even get to try it fresh, he had it room temperature several hours later after I had mustered every drop of self control in my body not to eat it all, and trekked with the remaining slices from Midtown to Flushing, Queens back to him! Any pizza that can hold up beyond the 7 train deserves props in my book! Italian Vegetarian Pizza (I asked for artichokes instead of mushrooms) - It  was fresh, good, and very popular with my bf and girlfriends. I still liked the pear one a lot better though.Pizzas are about $19 for a 15 inch which is on the higher end for pizza but I definitely say its worth it!", "Date": "2012-10-06", "Author_Location": "New York, NY"}, {"Author": "Emily C.", "ReviewID": "ATL0HWfjFKSPEUPfme4mqw", "Overall": "4.0", "Content": "Delicious pizza at a tasty price for my wallet! I grabbed a slice of the eggplant pizza and thoroughly enjoyed it. The eggplant was soft and went well with the pizza. You have the option of choosing a corner slice or inner slice & the slice size is generous and my hungry tummy was satisfied. Prices were good- a slice will run you $3.5-$5. Atmosphere was lacking and so was the AC. Not much of a restaurant but more of a you order at the window and pay upfront & then sit down kind of establishment.", "Date": "2012-09-16", "Author_Location": "San Francisco, CA"}, {"Author": "Paul H.", "ReviewID": "DVeG6yRfqHD3D6g-dLAFZA", "Overall": "3.0", "Content": "Tip: no restroom! and $10 minimum for CC. Decor: 4/5Service: 3/5Food: 3/5Initially impression of the Margherita was \"not bad\". The crust was airy, thin and fluffy. The Margherita flavor was somewhat there towards the end. Overall at 2 slices for $3.50, it's decent and worth trying. I wouldn't mind trying their other flavors out.", "Date": "2012-11-01", "Author_Location": "Dallas, TX"}, {"Author": "Linda D.", "ReviewID": "kMM-kUdChPyeG9p9Cbu9Rw", "Overall": "3.0", "Content": "I had the margherita and mushroom slice. Margherita had a nice balance of sauce and cheese a little bland, the mushroom slice was a little disappointing the mushrooms were sliced so thin the mushroom flavor was not prominent at all.Overall the pizza was good it hit the spot. I would probably go back and try another slice.", "Date": "2013-02-15", "Author_Location": "Forest Hills, NY"}, {"Author": "Lawrence W.", "ReviewID": "MmxIODufR4h29eI9qqMZeA", "Overall": "5.0", "Content": "Best pizza I've found in Hell's Kitchen. Long, thin crust pizzas with fresh toppings, delicious sauce and homemade cheese. Literally all of their pizzas are delicious, you can't go wrong. Get what you like, the small sizes are actually quite a lot of food for two.Other things I've tried: Chicken Parm - Delicious, drowned in sauce and a great mozzarella cheese.Chicken Parm Panini - I think my stomach started to ache when I saw this thing! If you don't mind the possibility of having a heart attack from eating this sandwich, it's great. I'm fairly certain they pop their chicken parm onto the panini press between two slices of their garlic bread, more on that next...Garlic bread - So good. So unhealthy. Worth it.", "Date": "2012-12-24", "Author_Location": "Manhattan, NY"}, {"Author": "Mike G.", "ReviewID": "ooKknbKG-qVWjdOQ1k54eg", "Overall": "5.0", "Content": "We caught Merilu's just before they closed late night. They had some slices left so we took what they had and it was great! It's not all like the typical New York slice of pizza, it's true Italian style pies. Really great flavor.", "Date": "2013-12-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Emile M.", "ReviewID": "8inzvfDTYxaCY0B2KXyZNw", "Overall": "3.0", "Content": "Had mushroom slice and a vegetable slice.Their crusts are fantastic.  They are thin and crispy and fresh.The problem I had was the rest of the pizza wasn't very noteworthy.  While the ingredients were fresh the flavors didn't really stand out.  I think I would prefer stronger flavors in the toppings.  I didn't taste any garlic or other spices in a significant amount.Maybe I will try a different slice but I was a little disappointed by this place.Each slice was about $5, which isn't too expensive but isn't cheap either.  A slice is actually two small pieces.Overall their pizza seems not so well rounded with great crust but weak toppings.", "Date": "2013-01-29", "Author_Location": "Winter Haven, FL"}, {"Author": "Jenn C.", "ReviewID": "hV__9FTClyEUGPzVtxjiYg", "Overall": "4.0", "Content": "I love me a good New York slice, but sometimes I want my pizza a little more traditional, a little more Italian. Up until a few months ago, I would have to suck it up and wait until after work to satisfy this craving at lunch, but Merilu came and saved the day.The pizza here has super fresh ingredients, and each day they have different types of the long, rectangular pies - you ask for a piece and they hack it off for you, just like they do at my favorite bakery in Rome. The crust is thin, with the right amount of chew and crisp, without getting soggy. They will even offer to cut fresh basil on top for you. The toppings are fresh and perfectly prepared. Nothing is greasy or overwrought, and I like that upon each of my visits, they've had different types of pies - my favorite so far is the spinach ricotta.They also have a few rolls, and some sandwiches/soups as well (the sandwiches come on delicious looking ciabatta) and the staff are really sweet and helpful.", "Date": "2011-01-26", "Author_Location": "Flushing, NY"}, {"Author": "Janine M.", "ReviewID": "38Tbk1lUwxkpH5u6hQxBaA", "Overall": "5.0", "Content": "I absolutely LOVE this place... It's for people who appreciate fresh ingredients and attention to detail.  I think its family-owned and run, providing that extra TLC.  The pizzas are mostly made in a long rectangular shape but the round style is also available in the margherita.  I moved out of the neighborhood and I miss this place so always make it a point to visit when I'm in hell's kitchen. The place is on the smaller side so I would recommend take out or delivery, unless you are just looking for a quick slice.MY FAVORITES... Margherita (with toppings, Chix and Bacon is good combo), White Spinach, Marcolinos, Buffalo Chix (think Sunday Football) and Triple Bie Pass.", "Date": "2012-09-15", "Author_Location": "Manhattan, NY"}, {"Author": "David R.", "ReviewID": "xO2dO6pJpOxPgfjD993fog", "Overall": "5.0", "Content": "I come from a family of discriminating pizza lovers.  My father discovered this place first and immediately began singing its praises.  We went for lunch there this week and I must say that he wasn't exaggerating.The place is run by an Italian family from Brooklyn.  They are very accommodating and they treat you like you're in their home and they're cooking for you.The pizza was perfect.  We ordered a Sicilian style pie, half with tomatoes and garlic and half with pepperoni and broccoli.  The toppings are fresh, high quality, and actually have taste!!  The crust was medium thickness, light and crispy on the outside, and a perfect combination of doughy, crispy, and firm on the inside.  The sauce is homemade and has a perfect kick to it.  The cheese is REAL cheese, also fresh with a perfect consistency and the right ratio to the sauce.Merilu is among the best pizza I've had and I highly recommend it.", "Date": "2011-03-31", "Author_Location": "Los Angeles, CA"}, {"Author": "Bettina R.", "ReviewID": "vcg6gP43L_gMJD45fmUxtg", "Overall": "5.0", "Content": "You know when you're out of town, and using Yelp to find places to eat, and your belly is already rumbling as you pass restaurant upon restaurant when your GPS finally re-calibrates, and you find out you're going the wrong way, and the whole endeavor starts to feel cumbersome and you want to give up? Don't.We could have stopped at any number of pizza places in lieu of finding Merilu, but what a travesty that would have been, because this was the best pizza I had during my brief trip to NYC. This place is totally no-frills, but as soon as I stepped into the tiny shop, the aroma of freshly baked (and slightly charred) crust and tomato sauce blew me away. My beau and I were both hungry, and figuring out who was ordering what and how many took us a few minutes. We wound up ordering three pieces, and while that doesn't sound like a lot, when the pizza came out of the oven, it felt like a feast. IT WAS SO DAMN GOOD. The sauce was flavorful, the toppings were abundant but not overwhelming, and the pizza sauce was savory with a hint of sweetness. And the crust. I'm a crust fiend, and I couldn't even finish it -- that's how much one and half pieces of Merilu's pie will fill you up. It was crispy and chewy and delicious. Really, this pizza bordered on perfection. I'd like some more right now, please.", "Date": "2012-06-27", "Author_Location": "Washington, DC"}, {"Author": "Paulina L.", "ReviewID": "Z4Vvp-TQ23WnV6gzwVY0Cg", "Overall": "4.0", "Content": "Really good pizza. Reasonable size for the slice, and the place is very welcoming. Would definitely return. Had the fresca pizza. Awesome crust", "Date": "2013-11-22", "Author_Location": "Upper West Side, Manhattan, NY"}, {"Author": "Andreas H.", "ReviewID": "Y0jKVze3bNlubR96qPAWkg", "Overall": "4.0", "Content": "I'm always down to try out a new pizza spot, and after seeing the reviews on Yelp, I was ready to give it a go.The Pros:  Quality toppings.  Great crust.  Amazing garlic bread!The Cons:  $$$$$$  Our pizza and garlic bread was about $45 with tip.  The staff was friendly and the guy behind the counter asked how I liked my crust (soft or crispy).  The garlic bread was also outstanding.  If I knew I was going to die tomorrow I'd come here and devour about 5 pounds of their garlic bread.  It's that good.We'll be back!", "Date": "2011-06-21", "Author_Location": "San Francisco, CA"}, {"Author": "Alex W.", "ReviewID": "q4AS1_M015PgPsj1IMO1yg", "Overall": "4.0", "Content": "This is exactly the kind of place that can use a positive Yelp review -- a new addition to a crowded marketplace that distinguishes itself through good product and great service.The pizza here is tasty and fresh and the staff is remarkably friendly.  On my last visit, I was given a free sample of one of the flavors I was eying and it was nearly the size of an actual slice.  It's hard not to be charmed by pizza generosity.If you're into European style pizza with interesting ingredients (think potato and rosemary) and like your restaurant staff more smiley than surly, give Merilu a try.", "Date": "2010-12-01", "Author_Location": "New York, NY"}, {"Author": "Laura G.", "ReviewID": "Yp9pRRJ-pF_oGVJIK98rPg", "Overall": "5.0", "Content": "It's hard to find a place that does simplicity well, and simple is good. My girlfriend and I discovered Merilu via Yelp (hooray for lots of stars and one dollar sign!), and it was a FIND. The first thing to know is that a slice of pizza here is not the normal slice of pizza that can you can eat in two bites - they're gigantic. We thought we'd share a few slices, and whoa - it was a full-on meal! You can see from the photos that they create a unique style of pizza, and damn - they really want you to have some. Not that there's anything wrong with that.As I chowed down on a slice of pepperoni and a slice of margherita with Italian sausage, I felt like I was in pizza heaven. The thin crust is perfectly baked, with that satisfying combination of tenderness and crispiness. Merilu also gets the ratios right. I can't stand pizza (especially thin crust) that is weighed down with too much sauce or toppings, but that isn't a problem here. The sauce is light and tasty, and even the Italian sausage is there in moderation, as it should be. And who doesn't love fresh mozz?!It's a small, modern space. I love that they serve the pizza on paper plates and the soda arrives in a can. The focus is clearly on the food. Like I said, simple is good.", "Date": "2012-06-24", "Author_Location": "Washington, DC"}, {"Author": "fritz L.", "ReviewID": "V32OYS_24KlGqq9xyNAv9w", "Overall": "5.0", "Content": "This is some of the best pizza I've had in NYC.  I'd call it artisanal.  I know, a word that gets tossed about like legendary.But Merilu is excellent.I make pizza at home and this is better.Small with perhaps a dozen choices.  Don't miss this.", "Date": "2011-03-10", "Author_Location": "Huntington, NY"}, {"Author": "Vikram S.", "ReviewID": "guTnYSHGN-TMMvgXQCc_zw", "Overall": "5.0", "Content": "Wow - finally a good pizza place in Hell's kitchen that stands apart from the other greasy stuff - The type where you not only feel good while eating but after you have eaten as well. The crust is thin and really good and as a vegetarian I found lots of good options. Also had two different soups so far and they have been great! The people running the place are also very friendly.They have a minimum($12? - I forget) for credit cards but that doesn't matter since the ATM is right around the corner(And the guy let me leave, draw cash and come back when I didn't have cash once.)", "Date": "2010-12-01", "Author_Location": "New York, NY"}, {"Author": "Jade L.", "ReviewID": "Gz0xdX8NvVOK810FJX4ACg", "Overall": "3.0", "Content": "With all the great reviews, I was looking forward to being blown away by the pizza here.  I really wasn't.  It may have had something to do with it being one of the hottest days of summer and the AC at this place being broken.  A reheated piece of pizza was okay.  To be fair, I also had a piece of piece of my friend's freshly made pizza and it was better... but I was still not blown away.  FYI: It's a super small place with just a few tables.  No waiter service.  Just grab your pizza and grab yourself a seat.I may need to go back if I'm in the area just to give it another try.  As of right now, I definitely will not be craving this pizza though.", "Date": "2012-07-25", "Author_Location": "Brooklyn, NY"}, {"Author": "Victoria S.", "ReviewID": "Kov9ow_HxH3PA3ZzsoITIw", "Overall": "5.0", "Content": "The dough is crispy but still soft and the cheese is so creamy. This place is delicious!", "Date": "2013-10-17", "Author_Location": "Mission Viejo, CA"}, {"Author": "Jen P.", "ReviewID": "cmMynzHHnPAFXuXtCsU-Zw", "Overall": "5.0", "Content": "Merilu Al Metro has the best pizza in Hell's Kitchen for delivery. I have eaten their Margarita Pizza (also with fresh garlic) And garlic bread. The pizza is thin crust (not super thin), sauce is tasty! The garlic bread is really yummy!", "Date": "2013-08-07", "Author_Location": "Irvine, CA"}, {"Author": "Andrew S.", "ReviewID": "cuA2CO_wSv0mSo-JVqZMwg", "Overall": "4.0", "Content": "Very nice little place. Excellent thin crust pizza. Portions could be a little larger for the price ($3.50-$5.50ish each). Love the open air too, nice touch. Music is good too. Friendly staff. There is a $10 minimum on card transactions, but the cashier was kind enough to accept my $9.53 transaction for 2 slices and a soda.", "Date": "2013-09-14", "Author_Location": "Minneapolis, MN"}, {"Author": "Amy H.", "ReviewID": "9A66iRvjBYEUU7DNsMyycA", "Overall": "5.0", "Content": "Hands down the best pizza we had on our trip to NY. Crispy, perfect crust. Slightly chunky and fresh abundance of sauce. PERFECT cheese that isn't stringy but or even really greasy. Everything tasted perfectly together. Cute little space as well. YAY for pizza!", "Date": "2012-07-18", "Author_Location": "Los Angeles, CA"}, {"Author": "Peter K.", "ReviewID": "lA-36I_yib3sWcYOwdsOgw", "Overall": "4.0", "Content": "Fresh ingredient, decent crust. Definitely take it to go as this place is hot as hell and tiny. Just happened to be near this place when we were waiting to eat at Totto ramen. Would come here often if I lived nearby but probably not cross-town worthy. Nothing mind blowing but definitely above average, well done pizza.Fresh ingredient, decent crust. Definitely take it to go as this place is hot as hell and tiny. Just happened to be near this place when we were waiting to eat at Totto ramen. Would come here often if I lived nearby but probably not cross-town worthy. Nothing mind blowing but definitely above average, well done pizza.", "Date": "2012-09-10", "Author_Location": "Manhattan, NY"}, {"Author": "Abby F.", "ReviewID": "WSNtArJxpcu2WFL9u6Rmug", "Overall": "5.0", "Content": "Quick service with fast delivery. The crust, sauce and toppings were delicious and you won't regret going here just based on the pizza alone. Almost felt too healthy to be a pizza.  The crust was perfectly cooked.  Awesome veggie options.  I grabbed a slice of the eggplant pizza and thoroughly enjoyed it. The eggplant was soft and went well with the pizza. price are reasonable.", "Date": "2013-08-27", "Author_Location": "Manhattan, NY"}, {"Author": "Pablo C.", "ReviewID": "6q_qmlcMCRyTUucl4YRiHw", "Overall": "5.0", "Content": "THE BEST PIZZA EVER.!!! I would give them 100 stars.!!! . My son is a 3 yrs old Mr. Don't eat anything..!! And we were astonished when he grabbed the piece of pie and ate the whole thing..!! We are coming back.!!!!", "Date": "2013-11-20", "Author_Location": "Theater District, Manhattan, NY"}, {"Author": "Chad S.", "ReviewID": "RRge_jHqKgHYjUTUkjqHfQ", "Overall": "4.0", "Content": "When you want to try something a little different, not the NY slice status quo but still oh so good, hit up Merilu for a rectangular pie of flat bread Sicilian style euphoria. Fresh tangy sauce and even fresher mozzarella cheese on that Margherita. Crispy crust. Eat in, though this tiny storefront may be too crowded to accommodate, order delivery, or take to go, just eat it while its hot.", "Date": "2013-08-04", "Author_Location": "Manhattan, NY"}, {"Author": "Allison M.", "ReviewID": "UaHUrfpx0m71UQ6rThMg0A", "Overall": "5.0", "Content": "OMG! Let me start off by saying I don't even like pizza! But a friend and I came here after class (he was craving pizza and I was tipsy, so I said whatever). He had a Sicilian slice and I had some slice that had sautéed onions, garlic and parm...idk what it's called but it is THE ALMIGHTY JESUS! Ohemgee, that slice was amazing! The onions and the thin crust...*homer drool*. Not greasy, cooked perfectly, I can't even stop thinking about it. Needless to say, we ended up getting two more slices. And not for nothing, the Sicilian slice was amazing too! Remember, I don't even LIKE pizza that much, but THIS pizza made my dreams come true. Not even kidding. It's that good. Go get some!", "Date": "2013-09-27", "Author_Location": "REGO PARK, NY"}, {"Author": "Judy L.", "ReviewID": "Id9c5E8OnC9Gb54aqa38YA", "Overall": "4.0", "Content": "Great thin crust pizzas. I'd recommend the ones that we tried: margherita and the zucchini pizzas. Someone there (friends of the owner or chef) asked them to create a dessert pizza: nutella with marshmallow and banana. It was actually quite amazing. But this isn't on the menu, so I'm not sure of its availability. We didn't have to wait, but most of the seats were taken by the time we were done with our pizzas.", "Date": "2012-08-23", "Author_Location": "San Jose, CA"}, {"Author": "Chris M.", "ReviewID": "ktXqPySNtMjPALKkAem2GA", "Overall": "1.0", "Content": "I ordered delivery from Merilu based purely on Yelp recommendations. A pizza place that has more than 4 stars is pretty rare. I had recently moved into the neighborhood and this looked like an ideal place to get some authentic New York pizza for me and my relatives who were visiting from out of town.... boy was I wrong.We ordered an NY Pie with lots of meat and a Margherita Pizza with veggies. It was very pricy (about $25 per pie), but I figured it's worth paying for good NY pizza. The pizza showed up quickly enough. The slices were in disarray like both pies had been dropped, but were were all very hungry and willing to overlook that. After sinking our teeth into slices from both pies, all of us agreed we had made a big mistake. 1) The pizzas were dry. Almost no sauce.2) The thin crust was hard, burnt and tasteless3) The cheese was applied very sparingly and large sections had none at all4) All the toppings were fine, but none stood outThe taste resembled that of a cardboard pizza box more than it did a good NY style pizza. We would have been better off ordering from Pizza Hut or Dominoes. And that's saying A LOT. I would avoid this as a delivery option despite the perplexingly high ratings.", "Date": "2012-07-10", "Author_Location": "Manhattan, NY"}, {"Author": "Sunny G.", "ReviewID": "wSC-vxH5WhaIWxi-Qq_K7Q", "Overall": "5.0", "Content": "This is undoubtedly the best place in the US of A to have single slice, thin crust, crispy margherita pizza...which literally melts in your mouth. Hats off!!!!", "Date": "2013-09-20", "Author_Location": "Garden City, NY"}, {"Author": "Rubun D.", "ReviewID": "auDAV9ZAwT5d0_lo_flscA", "Overall": "2.0", "Content": "This is a thin crust pizza (it's crunchy) sliced into rectangles, and will run you around $4-5 a slice.I had an eggplant pizza, a mushroom pizza, and a margherita (?) pizza. The sauce was not very flavorful, the crust was not mouth-wateringly crunchy (though, as mentioned, it was indeed crunchy). It was a mediocre pizza, and the expense drops it down to a 2-star. My girlfriend and I went to Amy's Bread for some carrot cake to make ourselves feel better about life. Yes, we're porkers.", "Date": "2012-04-10", "Author_Location": "Manhattan, NY"}, {"Author": "Irene V.", "ReviewID": "lIOaelijGsy-lThfkIHBsw", "Overall": "4.0", "Content": "Great pizza,thin crust,light,extremely tasteful.Everything that I ordered so far was great. Fresh ingredients.one of my favorite pizza places in the area.There's nothing negative that comes to mind. I wish delivery was a little faster but it's a small place that's very busy so it's understandable. I just try to call in the order before I get really hungry. Keep up the good job Merilu!!!", "Date": "2013-01-07", "Author_Location": "New York, NY"}, {"Author": "Aaron P.", "ReviewID": "KT5BylVpedJLuiVXoX249A", "Overall": "5.0", "Content": "Absolutely beautiful pizza!! Better than anywhere else I've tried. Friendly customer service and cheap! Definitely recommend to everyone seeking a quick meal.", "Date": "2014-03-12", "Author_Location": "New York, NY"}, {"Author": "Bibi L.", "ReviewID": "_DixgG5AuO4OQ8bMZApj8Q", "Overall": "5.0", "Content": "Visiting from SD and relying heavily on yelp for places to eat. We were starving and went to merilu's. We were able to get 4 slices to go in 10mins. Would have been faster except there was a short line. I loved that they put the slices back in the oven. The crust is like nothing I've ever eaten! It's sooooo delicious! We got a primavera, zucchini, pepperoni, and cheese. They were all mm mmm good! Hope we can stop by again before we go back home!!!", "Date": "2013-07-08", "Author_Location": "San Diego, CA"}, {"Author": "Mark M.", "ReviewID": "RRNkt00xHohBT40QaJQD2w", "Overall": "4.0", "Content": "Pretty darn good...My wife and I had a quick slice here...we got the veggie slice, drizzled it with garlic oil, and scarfed it down.  Good crust, good cheese, and very fresh toppings.  More importantly, the staff here was super friendly and tip-worthy.Thanks for the food and courtesies!", "Date": "2012-02-11", "Author_Location": "San Francisco, CA"}, {"Author": "Clayton A.", "ReviewID": "Amyva2giogqE1hLQFywTRw", "Overall": "3.0", "Content": "The slices here are more expensive than most NYers are accustomed to, but the slices (and the pizzas) are much bigger as well. I'd advise newcomers to order with caution upon arrival, as one's eyes can become overwhelmed by the delicious looking pizzas and easily over-order.I ordered a pepperoni slice and a zucchini slice, both of which were hot, fresh and rich with flavor. The crust was thin and salty, which I always like. The rest of the ingredients were good, including the sauce, which wasn't overly sweet. I must note that I was very hungry, and pizza has a tendency to taste extra-good under such circumstances, but this pizza was only good rather than exceptional. Thus, I give it the three stars. I'll probably try to go back and try it again and may update my rating, but as for now, this place is good, not great.", "Date": "2012-03-05", "Author_Location": "Albuquerque, NM"}, {"Author": "Sasha B.", "ReviewID": "Y10NirQuEt8QNr8UMSJNfQ", "Overall": "1.0", "Content": "DON\"T GET DELIVERY!!!I ordered a large pizza and a salad at 7:20 last night. We were told that it would be 40 mins for delivery. At 8:15 we called and inquired as to the status and were told \"It's on its way.\" At 8:30, we called again and were harassed for calling a second time. The employee handed the phone to who must have been the manager or the owner and she was extremely rude. She raised her voice and continued to have excuses and asked me why I kept calling after the pizza took twice as long as promised.She ended up canceling our order and I'll never order from here again. Go with Capizzi down the street. Better pizza and MUCH better service.", "Date": "2012-03-27", "Author_Location": "Manhattan, NY"}, {"Author": "Wesley C.", "ReviewID": "oCDUvqqeenjuTBgeLK209g", "Overall": "5.0", "Content": "Oh my goodness - we came here for our \"appetizer\" prior to getting seated at Totto Ramen! We almost decided to get ramen another day because the pizza was so good! The crust is thin and crispy, sauce & cheese perfect, and ingredients fresh. What else could you want for good pizza? And the owner was extremely friendly and personable - will definitely be coming back!", "Date": "2012-06-25", "Author_Location": "Philadelphia, PA"}, {"Author": "Vince L.", "ReviewID": "jmqVNrlealXICGiirR_AUw", "Overall": "5.0", "Content": "Ordered 4 pizzas slicesRankingsMushroom - 1stPepperoni - 3rdSausage - 4thMargarita - 2ndAll good though.  Fed 2 for under $20", "Date": "2012-10-23", "Author_Location": "Sunnyvale, CA"}, {"Author": "Nick C.", "ReviewID": "0U_P2hVni4FmgTKCHfTMBA", "Overall": "4.0", "Content": "Small place, Long pizzaAfter wandering around the theater district, Merilu came up as a place to go eat. Merilu is small place...there's 10 seats in the whole place. The service was okay...typically if you are used to New York service.And the pizza?...for a thin crust pizza it was very good...and then Merilu does hold its own because the pizza taste homemade..but don't expect to be blown awayDefinitely more of a date-hipster kind of place....it's not a fold a pizza joint.", "Date": "2012-08-07", "Author_Location": "Torrance, CA"}, {"Author": "Jack D.", "ReviewID": "PdivjDPzCxxDMfsZca8T-w", "Overall": "5.0", "Content": "Everything is fresh everything is awesome. This place is worth the money for sure. But if you have a big appetite you will prolly wanna add some toppings cause I weight about 170 and I fly through 4-5 slices regular slices", "Date": "2013-09-17", "Author_Location": "Jamaica, Queens, NY"}, {"Author": "Sara P.", "ReviewID": "mUmZfVBtNz4h1tsbvtuB8Q", "Overall": "5.0", "Content": "You have to know what to order. I love THIN CRUST pizza especailly when there is home made mozzarella involved. The woman on the phone suggested I try the MAGOTO pizza which is like a margarhita pizza with some riccota, and i got it THIN CRUST and it was incredible, even the BF who is a pizza junkie said it was delic!!!!Love it!def must have!", "Date": "2012-03-29", "Author_Location": "Chicago, IL"}, {"Author": "Melanie S.", "ReviewID": "91h1OigEg4RUkVA9LJKcVA", "Overall": "5.0", "Content": "Just visiting NYC and wanted to eat some delicious pizza near our hotel. We looked up Merilu and decided to give it a shot, and loved it! The pizza crust is thin, crispy and delicious, and they have a pretty good variety. Small shop with great pizza!", "Date": "2013-09-09", "Author_Location": "Midlothian, VA"}, {"Author": "Leslie H.", "ReviewID": "okVQV7iiit8FfzHpfKaKNQ", "Overall": "4.0", "Content": "Delicious fresh pizza. I had the spinach white pizza and thought it was great. One con though was the pizza was pretty oily. I took my pizza to go to bring it back to my office and by the time I got back, my bag was soaked. Definitely got a few judgmental glances at my bag!", "Date": "2013-05-01", "Author_Location": "New York, NY"}, {"Author": "Chrissy C.", "ReviewID": "dlxTIGaHCHd3Pd9ikgTSOw", "Overall": "4.0", "Content": "it's cheap and it's good. they have gourmet style pizza at $ prices! i wouldn't bring a date around here or anything (since it looks like any other pizza joint).  but, i would bring friends for a quick bite.  or a pie to take home.", "Date": "2013-05-19", "Author_Location": "CANAL STREET, NY"}, {"Author": "Alice W.", "ReviewID": "BclBg7C9xtITRQlBMzePsw", "Overall": "3.0", "Content": "We liked it, it's not on our top five pizza joints but we will definitely come back again for a fresh out of the oven slice.", "Date": "2013-07-14", "Author_Location": "Forest Hills, NY"}, {"Author": "Catherine W.", "ReviewID": "4s2b3XHaIptlRNOfBWGqMw", "Overall": "4.0", "Content": "We were looking for a good pizza place and heard about Merilou's. Great atmosphere, good pizza, just like Rome! The margherrita was divine and homemade! Downfalls: service was scattered and limited seating but hey! Good stuff!", "Date": "2014-02-06", "Author_Location": "Costa Mesa, CA"}, {"Author": "Rachel R.", "ReviewID": "bNdpNYGz93jLm3MfAzxgPw", "Overall": "5.0", "Content": "Fresca: One of the best things I ate in New York, and all I did was eat in New York.", "Date": "2013-01-17", "Author_Location": "Boston, MA"}, {"Author": "Punkie P.", "ReviewID": "6WwoxXhMK-nwGaC2EIUC7Q", "Overall": "5.0", "Content": "I came here for a quick lunch on a weekend trip to NYC as Yelp reviewers said it was good... They were right!!! This place did not let me down. The crust was crisp and the cheese was not greasy... It gives New Haven style pizza a run for its money.", "Date": "2013-09-07", "Author_Location": "Berlin, CT"}, {"Author": "Steve S.", "ReviewID": "enwX-gTq_iwjza5yAXIelA", "Overall": "2.0", "Content": "Oh no. Ordered tonight 4/15 from my go-to pizza place. I ordered the Magoto. It arrived and had barely any of the good sauce and was under cooked. Basically cheese on bread. What a waste of 23 bucks and crappy Sunday pizza night :( I hope it's just a bad one. I'll probably order again but it if it's a trend I'll have to keep this star rating.", "Date": "2012-04-15", "Author_Location": "New York, NY"}, {"Author": "Shannon L.", "ReviewID": "V1fP6ZLAfneQL3LuNYR9bQ", "Overall": "3.0", "Content": "Authentic Italian family-run joint. While I wasn't overly crazy about the pizza, pizza is pizza and it's hard to screw up. My brother and I split a gigantic round pizza and hung out eating before a taping of The Colbert Report just a few blocks over. The girl working was ridiculously sweet and eager to recommend other places to check out while we were in the city. They have regulars going in all the time checking up on them and it's really cute to watch if you're into feeling slightly voyeuristic. Still, crazy nice people.", "Date": "2012-04-27", "Author_Location": "Ashburn, VA"}, {"Author": "Cami L.", "ReviewID": "K7ixYsXluZh1bmxskLVw3g", "Overall": "4.0", "Content": "Great quick stop for pizza.Great crisp crust and good ingredients! We loved it!", "Date": "2012-10-15", "Author_Location": "Buford, GA"}, {"Author": "Harry H.", "ReviewID": "PGnfltjM2IbJttzGV5CMMw", "Overall": "4.0", "Content": "Stumbled in here at dusk for a tasty and fairly substantial margherita for $3.50 cash. Satisfying product served up by a friendly staff in a cozy little WYSIWYG joint - dig it.", "Date": "2013-03-17", "Author_Location": "New York, NY"}, {"Author": "L C.", "ReviewID": "-w4m2EPxUMsXPM5PKbHpmA", "Overall": "2.0", "Content": "Maybe people who live here need to get out more. Because I do not think it deserves those ratings.  I've tried good pizza in Brooklyn at some more famous establishments and they are not even in the same league. Or maybe I'm not a fan of their dough and sauce. It's just average to me.", "Date": "2013-08-13", "Author_Location": "Chelsea, Manhattan, NY"}, {"Author": "Mike F.", "ReviewID": "l_v-j28FNGSNRFw_5VaZAg", "Overall": "5.0", "Content": "This is an extremely unique, superb quality & Uber-friendly family establishment.  I live across the street & have an Arts Festival for the neighborhood (HK: ArtiST), & Lucciano donated their sublime flat bread pizza for a major party.  Their methods & fresh ingredients are truly an old school artisan affair  They learned from the best, & the range of dishes encompasses top quality comfort food with cooking methods & spices so wisely chosen.  Would you believe that the marble tables actually are from the family stone work business, Granata?  The generosity in neighborly assistance even extended to offering help with our arts & culture magazine!You value pride of craft, local character & good will without agenda, come by or place an order here.  Whatever else you order, DO include the long rectangular \"Pizza Al Metro\".  The balance of flavors & quality is transcendent.", "Date": "2011-11-16", "Author_Location": "New York, NY"}, {"Author": "Jeff T.", "ReviewID": "VmWidkmAdmoGYoEqsH8yRQ", "Overall": "4.0", "Content": "Went to get dinner, sign said cash only.  Had to come back next day for lunch.Great little place, all types of pizza with tasty toppings and as most people mention a really good crisp crust.   Guys behind the counter are friendly as well.  I will be back for this again.", "Date": "2012-01-27", "Author_Location": "West Bend, WI"}, {"Author": "Rachel P.", "ReviewID": "_8A3YBrZ_7RPzh1NWsO1JA", "Overall": "4.0", "Content": "First encounter: delivery by Grubhub on a Sunday evening. That first taste of the Pizza Rustica convinced me that we made a very good choice. We spiced it up at home with red pepper flakes and Sri Racha chili sauce, but it's still a delicious (long/stretch) pie. I look forward to round two.", "Date": "2013-05-20", "Author_Location": "New York, NY"}, {"Author": "Nicole C.", "ReviewID": "0jiKtVrPBHMi4ybOrBEpdA", "Overall": "4.0", "Content": "Great pizza! Magherita Pizza is a must!", "Date": "2012-12-04", "Author_Location": "San Francisco, CA"}, {"Author": "Sara B.", "ReviewID": "LV_wFJ2BrbD-hhXWvXCyfA", "Overall": "4.0", "Content": "Good pizza.", "Date": "2013-04-12", "Author_Location": "Portland, OR"}, {"Author": "Wesley S.", "ReviewID": "VFK61zke3IbHhDDt73cyZg", "Overall": "5.0", "Content": "I am so glad I followed my fellow yelpers advice on this one. I had not had fantastic pizza like this since Brooklyn. This place has an amazing pie. The crust has a nice sweet taste and is thin. I tried the triple bi pass (appropriately named but in no way greasy). I think I have found a new favorite pizza place. Thanks Merilu you have renewed my faith in New York pizza. Thank you for reading and enjoy.", "Date": "2013-01-22", "Author_Location": "Manhattan, NY"}, {"Author": "Vincent Y.", "ReviewID": "Xy9E7eipo5BfxwaFy2C5IQ", "Overall": "5.0", "Content": "Delicious, thin crust pizza. I would write more for the review but I don't know how I could. Not too much tomato sauce, not too much meat but just perfect in terms of portions (it was a big slice too). My slice was slightly burnt but I still enjoyed it aplenty. It's a small shop (maybe four tables) so be prepared for that.", "Date": "2013-01-21", "Author_Location": "Chicago, IL"}, {"Author": "Juaquin C.", "ReviewID": "UnZtq-xt68F-Y-AdHx4OEQ", "Overall": "5.0", "Content": "Good solid pizza", "Date": "2013-07-30", "Author_Location": "Los Angeles, CA"}, {"Author": "Dave N.", "ReviewID": "ZgVUaL8ngKKVanGhOmSEkg", "Overall": "5.0", "Content": "eaten inside the restaurant and it's just a small place with not too much room...simple cozy eating experience...we primarily order to our apt.  I have to say that we have not had anything from merilu that was less than amazing.  the merilu salad we ordered on a whim, wow, it's out of this world, super fresh and the arugula is not overwhelming at all, the honey is a wonderful augment.the calzones (sometimes a pie) are what we typically order and they always arrive fresh and hot, and might just be the best calzone i have ever had...the rioctta cheese just gushes out when you cut in and they will throw in whatever toppings you'd like.  the dough, there is something about the dough - not sure what it is but wow...to the moon.if you order a pizza the 15\" is plenty for two, the other size, is BIG.order the entire menu, you will not be disappointed...they continuously hit it out of the park.the folks on the phone and in the restaurant are always super nice and cordial, something you don't always get in NYC :)the freshness, the flavor and the deliciousness at merilu is just splendid, this is my number one pizza place i recommend to folks i work with or to people from out of town...", "Date": "2013-07-28", "Author_Location": "New York, NY"}, {"Author": "Matthew F.", "ReviewID": "W8Jg3x0KhKHPlBVPE_I2TQ", "Overall": "5.0", "Content": "Definitely one of the best pizzas I've had.", "Date": "2013-03-24", "Author_Location": "New York, NY"}, {"Author": "Josh K.", "ReviewID": "kR53UIcTrebcGpVyLARf5Q", "Overall": "4.0", "Content": "One of the best pies I have had in the city. Crispy yet shockingly flavorful crust. Amazing that it is a little take out (mostly) shack in Hell's Kitchen and does not have a mega cult following. You can BYO if business is light, they're all very nice. Try the artichoke pizza and if you've got enough people, get a whole pie and eat it right there. Gets cold fast though due to its shape so that is a plus for their pay-per-slice model. I love it, I'll be back!", "Date": "2012-09-30", "Author_Location": "New York, NY"}, {"Author": "Natalie K.", "ReviewID": "2xsaNCtskz3e_1vm9HKxsg", "Overall": "5.0", "Content": "One of the best/ fresh thin crusted pizza in the city! They dont have a whole wheat pizza though, so they have room to improve)) however even a regular pizza is soooo good!!!", "Date": "2013-02-08", "Author_Location": "Manhattan, NY"}, {"Author": "E H.", "ReviewID": "x7D7VA_Kt9lTvl3-ZpoD5Q", "Overall": "4.0", "Content": "when i'm being a pizza snob and the average new york slice just doesn't cut it, i go to merilu, ditch out $5 for rectangular slice of whatever catches my eye first and carry on a little happier.. and heavier.", "Date": "2013-10-22", "Author_Location": "Manhattan, NY"}, {"Author": "Kimberly H.", "ReviewID": "XqycuYXp07E0sX7w51oUtg", "Overall": "5.0", "Content": "My first trip to NYC and I am so happy I followed the advice of fellow Yelpers and grabbed some pizza from Merilu! We stopped in about 45 minutes before close, so there weren't a ton of option for slices, but the guys working were happy to make us a pie of our own. We decided on our a half paddle of pepperoni, sausage, and basil. YUM! The crust was a little thicker than typical \"new york style\" which I am just fine with. The toppings were fresh and the sauce had a great flavor on its own. The smaller size was just right for the two of us - we were starved and we still had a slice or two left. Staff was friendly and made sure we were happy with our order. What more could a girl ask for? I will DEFINITELY be back next time I am in the city; I have been craving this pizza since I left!", "Date": "2012-12-12", "Author_Location": "Boston, MA"}, {"Author": "Dominic L.", "ReviewID": "UAhJc3QiYQp6jLJWRKIgYQ", "Overall": "5.0", "Content": "I've never written a rest. review before.  However, as an experienced Hell's Kitchen foodie, I can tell you this scent of Italy is very special to me.Does anyone remember the last pizzeria in this location?  Well, the place was a wreck, so I stopped coming.  Pizza quality was poor, the place was a mess, and employees were rude to me.Merilu & family have been a shining breath of fresh air.  Everyone enjoys working there and meeting customers.  And this shows in their artisanal & creative cooking.  Nice people + top-quality ingredients can ONLY create excellent dishes.There is a naivete to the owners.  Doing everything by the books, keeping the place beautiful and spotless;  never cheating on pure ingredients.  Don't they know they're supposed to be squeezing as much cash from their customers as possible!  Thankfully NO!Negatives, hmm...how about a better A/C system for the summer.  After all, they are in HELL's kitchen !Best of luck guys, you deserve it !", "Date": "2011-10-15", "Author_Location": "Manhattan, NY"}, {"Author": "Ryan H.", "ReviewID": "Y8bKXyhGxxlCHsmLdxcrIQ", "Overall": "5.0", "Content": "Went to NYC for the weekend and sad to say that we found this place on our last day for our last meal.  The  pizza is AMAZING!!!  I had a slice of the Luciano Senor and it was to die for, great flavor with the ham, artichoke and olives.  We also had a slice of Margherita and Tims  pizza.  The crust is thin and crispy full or flavor!  This is a must!  Next time I am back in NYC this place is on my list to visit again!!!  We walked in around lunch time on Monday and there was only 1 other customer in the place.  We were a little skeptical but the reviews on here enticed us enough to give it a try, and glad we did!!", "Date": "2012-03-05", "Author_Location": "Minneapolis, MN"}, {"Author": "Jordan B.", "ReviewID": "GMWnWU2n24Y9tP_-9MgRtg", "Overall": "4.0", "Content": "So delicious and perfect for a post-show meal.  I hear they make their own mozzarella in house and it makes a difference.  On our trip down to NYC we enjoyed this place so much that we visited twice during the weekend!FYI, there aren't many tables inside, so either be lucky and snag a table or plan to take your pizza to go.", "Date": "2012-03-27", "Author_Location": "Cambridge, MA"}, {"Author": "Peter P.", "ReviewID": "NeYjYuwrXVvyqWOai4ZbPw", "Overall": "5.0", "Content": "Best pizza we had for a long time. In addition the small pizza was this big that we took some home and it tasted even better on the next day.", "Date": "2013-11-17", "Author_Location": "St. George, Staten Island, NY"}, {"Author": "Kevin O.", "ReviewID": "DJV43zv94kB440zvXUz_uw", "Overall": "5.0", "Content": "Best pizza I've had in NYC.  Its not traditional New York pizza, its gourmet, nice ingredients, great flavor, perfectly cooked.  I had the prosciutto with artichoke and olive slice and it blew me away.  $5.50 for that slice which easily fills you up and is worth every penny.  Most of the other slices are $4.", "Date": "2013-02-20", "Author_Location": "Brooklyn, NY"}, {"Author": "Mystery M.", "ReviewID": "lGpqZQR_5BFitlndTQ17_g", "Overall": "2.0", "Content": "The Death of the NY slice of Pizza?So my awesome fiancé suggested that we do a pizza tour.  Since our hotel was located in Midtown- West, we decided to hit up all the pizza spots we could find in one night.  The only caveat- they had to sell plain cheese slices.  Obviously any pizza parlor can make a great truffle oil/filetmignon/garlic/fig pizza.  But can they make a great cheese slice?  Needless to say, I won't be recommending NY pizza as boldly as I once did.  We ranked the pizzas on a basic scale, qualifying crust, sauce, cheese, tensile strength, and overall taste.  The results:1.) NY Pizzeria Suprema (great all around slice. Great sauce, great cheese, decent crust.  We had a bonus slice of the mozzarella/basil and it was one of the best slices ever).2.) Rosa's Pizza (decent slice, but not amazing.  Crust was good.  Our bonus slice of the buffalo chicken was far better.3.) Two Boots (we were very excited about this slice after some major disappointments, but the saucy was just too tangy and different to be a good NY slice.  Sauce wasn't marinara, but cheese and cornmeal crust were good.  Their fancy slices were pretty good looking though).4.) Fat Sal's (this one was decent, but didn't have as much taste as we expected.  Looked so much like a perfect NY slice that I almost cried after my first bite and was disappointed).5.) Sacco (another middle of the line slice.  Cheese was very good, sauce was non-existent).6.) Merilu (this one was a major disappointment.  I am sure their fancy slices are amazing, but the plain margarita was not anything special.  Sparse cheese, a very tangy sauce that was not flavorful, and a tasteless crust).  Definitely not a top 5 place.In conclusion, other than the fact that I want to throw up after all this pizza, I would have to say that if you are in the mood for a slice of pizza in midtown, other than Pizzeria Suprema, you're pretty much out of luck.  You're no worse off by just going to a $.99 pizza stall.", "Date": "2013-08-14", "Author_Location": "Boston, MA"}, {"Author": "Christopher R.", "ReviewID": "tTXcKHZ7jK4cn0s07-IujA", "Overall": "4.0", "Content": "Nothing to blow you away but they do a solid, rustic-style slice. If they have baby slices available they can sometimes be the best bang for your buck. I recommend the soppressata slice.", "Date": "2013-01-11", "Author_Location": "Manhattan, NY"}, {"Author": "Jackie M.", "ReviewID": "tJFWRzht7KSDWroy14D_QQ", "Overall": "4.0", "Content": "Surprisingly great pizza. Nice variety of topped slices or pies.", "Date": "2013-02-10", "Author_Location": "Brooklyn, NY"}, {"Author": "Lauren W.", "ReviewID": "bnIeMxelm2psO2-z8b5-UA", "Overall": "5.0", "Content": "Best pizza in NY! Loved the flavor and the crust was perfect. Margherita was my fave. Sausage and mushroom was tasty too.  The service was great to go along with the food.  Great for a casual and quick drop in.", "Date": "2013-04-23", "Author_Location": "Santa Clara, CA"}, {"Author": "Dave B.", "ReviewID": "f6svZOnyf6823e29qqLlCA", "Overall": "5.0", "Content": "Visiting New York first thing I wanted was some pizza. I found this place near by on Yelp and the reviews were spot on. This place is amazing! We got a few slices of pepperoni and a chicken palm roll and it was one of the most savory lunches Ive had in ages. The girl at the counter was extremely friendly and helpful also. I have nothing but praise for this place. If you are in the mood for this type of food...here is one the best places to go. 5 stars!", "Date": "2013-01-15", "Author_Location": "Brookline, MA"}, {"Author": "Kai R.", "ReviewID": "GQw4NcW34x_fPsHctzeOHA", "Overall": "4.0", "Content": "This is a tiny pizza place (I counted 5 tables in total).  I suspect the bulk of their business is take out or delivery.  I agree with all of the other reviewers here on Yelp - very high quality, freshly made pizza.  May not be 100% NY authentic, but it still is thin crust and very tasty.  You can tell the folks here are passionate about their craft, and it shows.  Definitely check this place out.", "Date": "2013-09-29", "Author_Location": "Altadena, CA"}, {"Author": "Shatha A.", "ReviewID": "QVZloqeOVxC9Ljwy1izVQQ", "Overall": "4.0", "Content": "really tasty oven-brick Pizza go for the Mushroomthe Margherita is good too", "Date": "2013-04-19", "Author_Location": "New York, NY"}, {"Author": "Robert S.", "ReviewID": "ak3lTO3pU-LSwKagGSUQKg", "Overall": "5.0", "Content": "Yum!", "Date": "2013-12-27", "Author_Location": "Manhattan, NY"}, {"Author": "rich t.", "ReviewID": "lTnXdAdQwNcklToov9N_MQ", "Overall": "5.0", "Content": "love this place. i got the special pizza that had olives, ham, and onions on it... the crust is incredibly thin and crispy. it's awesome. if you are in the area... try one of the best thin crust pizzas I've had in awhile!", "Date": "2013-09-19", "Author_Location": "Marina del Rey, CA"}, {"Author": "Blanca C.", "ReviewID": "O4KYIXv1oPebNoF3XDl0Gw", "Overall": "5.0", "Content": "Best pizza we tried in NYC. It was also our least expensive lunch.", "Date": "2013-03-26", "Author_Location": "Avondale, AZ"}, {"Author": "Sparkely K.", "ReviewID": "XDeTkMQZeVddZwM7FB9Ong", "Overall": "5.0", "Content": "I dropped off a load of laundry across the street and had time for a wee bit of pizza.  WOW!  Merilu pizza is yummy.  Great service - really friendly.  I am a true blue Chicago deep dish pizza gal but Merilu could convince me to switch sides!!", "Date": "2012-02-19", "Author_Location": "San Mateo, CA"}, {"Author": "Robbie B.", "ReviewID": "wAZd91gjmbRftDlTJWyKsA", "Overall": "3.0", "Content": "Eh. Semi burnt ok slice. May try again.", "Date": "2012-11-28", "Author_Location": "Portland, OR"}, {"Author": "Danielle H.", "ReviewID": "ZDgP3WGVm9H-b9fHlh8paA", "Overall": "3.0", "Content": "I thought this place was just ok.  I had the eggplant pizza.  The crust was too crispy for my tastes and I didn't think the cheese and sauce meshed well together.  However it was still better than your average pizza and fairly cheap.  I just expected more based on the reviews.  I did like that I was able to sit outside, though.", "Date": "2012-10-08", "Author_Location": "Manhattan, NY"}, {"Author": "Jonathan P.", "ReviewID": "Ycthc5uWT_7X368yvlheDg", "Overall": "4.0", "Content": "Good pizza coming from a NY pizza conisouir", "Date": "2012-11-06", "Author_Location": "Miami, FL"}, {"Author": "Brian M.", "ReviewID": "e6YzL69J_edWRX4LwrqMSQ", "Overall": "4.0", "Content": "Really good pizza. Ordered a large pepperoni for take out and it was ready within about 20 minutes. Crust was thin but not paper-thin and seemed to hold the semi-sweet sauce taste well. A little thin on the cheese spread but it works well and has a crispy taste with the crust and meat layout. The interior of the joint was clean, well-lit, and the people behind the counter were friendly. Will definitely return.", "Date": "2013-03-09", "Author_Location": "Manhattan, NY"}, {"Author": "Luca C.", "ReviewID": "L9g-4-5XknC7LD8hOOWCBQ", "Overall": "4.0", "Content": "Delish, and didn't break the bank!  The staff was so nice there.  They gave me a free cup of hand-pitted olives to taste after I commented on a slice my friend got.  They also hooked me up with a little cup of marinara sauce to go with my garlic knots.  I hope I'm out this way again so I can get my Merilu on!", "Date": "2010-12-18", "Author_Location": "Jersey City, NJ"}, {"Author": "David C.", "ReviewID": "FXE_7QQ8mNEH5Evcc7B0vw", "Overall": "4.0", "Content": "Best pizza I have had in NYC. Slice doesn't droop when folded, crust is just crisp enough and soft too. You can come for the plain cheese and be totally happy or try the several specialty options.  We had eggplant and marguerite as well as the cheese. Several seats inside - about 15 or so.", "Date": "2013-01-12", "Author_Location": "Knoxville, TN"}, {"Author": "Shirley L.", "ReviewID": "ITp89-0c1EMt_lYJZaeTVg", "Overall": "5.0", "Content": "We are San Diegans visiting New York... and we get it!! NEW YORK HAS THE BEST PIZZA!! :) Stumbled into Merilu's on our first night in town and the pizza lives up to the NYC reputation... crust... like heaven... toppings... light and flavorful... I'd give Merilu's 6 stars! Enjoyed it more than Grimaldi's (which we waited 1.5 hours in line for!!)", "Date": "2011-06-14", "Author_Location": "San Diego, CA"}, {"Author": "Jenny N.", "ReviewID": "H_kCEYJz7bHsWTBHjtFmlw", "Overall": "4.0", "Content": "Fantastic food and service. Highly recommended!", "Date": "2013-01-10", "Author_Location": "Melbourne, Australia"}, {"Author": "Minji K.", "ReviewID": "0i52CSpFijtz4kkist5J0Q", "Overall": "5.0", "Content": "After recently moving to the neighborhood, I decided I wanted to try as many of the restaurants in the area, but I keep coming back to Merilu! Definitely some of the best pizza I've ever had, and as an added bonus, it doesn't come with the ridiculous long waits you see at other popular pizza joints (hooray for delivery, as there is not much seating inside the restaurant)! Delicious, thin, crispy crust, fresh mozzarella and other toppings, perfect amount of sauce. Nothing bad to say about this place.", "Date": "2011-08-25", "Author_Location": "New York, NY"}, {"Author": "Michelle M.", "ReviewID": "tJzmN5jSzI5Dxx_wTgJLAA", "Overall": "5.0", "Content": "I live on park ave and love the food by me but anytime im on the west side i always come here. Its the best pizza in NYC and my guilty pleasure! I wouldnt eat from anywhere else. The owners are italian. They know how to make great pizza/food here. I pretty much tried most of the slices. You cant go wrong everything i tried has been delicious not a place i would hesitate trying different options. Enjoy!", "Date": "2013-12-02", "Author_Location": "Manhattan, NY"}, {"Author": "Cesar C.", "ReviewID": "Qlh5zIxDX7M-rbmcAvYBgg", "Overall": "1.0", "Content": "I am really upset at the way they handle their mistakes. I called because I placed an order for a gluten free pizza and they put fried eggplant (not gluten free) on it and instead of accepting their mistake and replacing their order they blamed me for not reading the description even though I specified no gluten. They should have at least called me before delivering it. On top of that, they decided to pick it up and asked us to call seamless to get a reimbursement instead of doing an exchange for that mistake . Horrible costumer service by David. He even mentioned that there was not even a manager who I could address my concern to. It is upsetting that in such a great city, customer service can still be questionable. Perhaps their waiters can memorize the menu and call if there is an issue instead of just sending an incorrect order. Be careful if you have any allergy because if you do and don't \"read\" the description, even though you specified your allergies, you will be held responsible for it. It's the only place where I have had any issues with this and on top of making the mistake, NOT BEING CAPABLE of replacing the item for another one that meets the requirements of your needs.", "Date": "2013-07-31", "Author_Location": "Elmhurst, Queens, NY"}, {"Author": "Ella P.", "ReviewID": "CRAfmh-4zzXfcmnANyKX1A", "Overall": "4.0", "Content": "pros: delicious pizzaexcellent, crispy thin crustsells by the slice (this is kind of like lazarra's by the slice version)sweet saucebest pizza by the slice pizza in hells kitchen, without a doubtcons:not enough cheese not enough basil on margheritaa bit too expensive per slice", "Date": "2012-10-24", "Author_Location": "Manhattan, NY"}, {"Author": "Jeffrey S.", "ReviewID": "mdHMttB4JiS6FhDQ_YrfFg", "Overall": "5.0", "Content": "Merilu's is a small pizza place with seating for about 18 people.  We were a party of eight and we squeezed in.  We ordered a large pizza Fresca and a Rustica Pizza.  They were both excellent.  It was our only pizza in New York but it was as good a pizza as we have ever had.  Both pizzas used fresh ingredients and had a delicious thin crust.  We'll be using this as our bench mark for best pizzas from now on.  Also, the staff was very friendly and accommodating with our large group.", "Date": "2013-06-22", "Author_Location": "Madison, WI"}, {"Author": "Rob K.", "ReviewID": "EI7Too9hP6DnpxyWSs2DaQ", "Overall": "2.0", "Content": "Hmm. Can't believe this has such a high rating. Not too bad but nothing great. Sauce bland. Crust too cracker-like for my taste", "Date": "2013-02-28", "Author_Location": "Grand Rapids, MI"}, {"Author": "Brett W.", "ReviewID": "nzfmJCajrO_FkvExgSw1ug", "Overall": "3.0", "Content": "Guess I'm just not an \"al metro\" guy... I even tried a second slice (of their most popular one, margherita) just to make sure it wasn't me. Yes, this is good pizza. But I honestly don't see why it gets so many 5-star reviews. Maybe because the staff is so friendly...", "Date": "2012-09-23", "Author_Location": "San Francisco, CA"}, {"Author": "Jasmeet Singh D.", "ReviewID": "FvX7QqAewa2uN4ejRVZcLw", "Overall": "3.0", "Content": "Pizza was good. But there was no system in meat and veg pizza's on display. When ordering single slices, don't get to many slices at once. They get cold to fast and that's sad because they taste good. Missing the 2 stars because you shouldn't go here if you just want reguler simple pizza's.", "Date": "2013-10-02", "Author_Location": "Taastrup, Denmark"}, {"Author": "Dung N.", "ReviewID": "CgrL-DLnoD9axZ6pcMX1oQ", "Overall": "4.0", "Content": "Since we had an extra day in NY, we had more time to explore other restaurants lol. This place had good reviews and our friend recommended it, so we headed over there...It felt like such a long walk! I didn't know it was one of those places where you just pick the pizza slices that were already made. There was only one left of the one I wanted, but the cut it in half, so it's more like 2 slices. :) It was really good, thin, and salty. :)", "Date": "2012-02-14", "Author_Location": "San Diego, CA"}, {"Author": "Linus W.", "ReviewID": "x2tPsX7A9cnHRWZJrHChkA", "Overall": "4.0", "Content": "First stop looking for quick eats down 9th ave.  Although the pre-made pizzas may not look that appealing, they reheat it before serving.  The taste is good for the price - ~$5 gets you a big piece of thin crust, nothing fancy, but nice and crispy.  Probably not a whole meal for a guy, but it'll get you more than half way there!  (I still prefer my yuppy thincrust in SF, though. :)", "Date": "2012-03-26", "Author_Location": "San Francisco, CA"}, {"Author": "Elizabeth J.", "ReviewID": "zpQvES7AdRhc8FjjrXbdaw", "Overall": "4.0", "Content": "Had Pizza here last week with my sister. Awesome garden salad to start, big portion, perfect to share.  We had the grilled eggplant pizza, super healthy cooked perfectly.  Almost felt too healthy to be a pizza.  The crust was perfectly cooked.  Awesome veggie options.", "Date": "2012-06-15", "Author_Location": "Manhattan, NY"}, {"Author": "Alex P.", "ReviewID": "JuGPYll0DqVgBQV-Ta6wuA", "Overall": "5.0", "Content": "Absolutely one if the best delivery pizza places the city. I grew up in Bensonhurst eating L&B (just saying). The pizza from Merilu is delicious and is always delivered  crispy and piping hot. Pizza consistency and texture are excellent, thin crust and never too much oil or sauce. The classic staples like the margarita are excellent, but if you like salt try the anchovie/caper combination, its very unusual.", "Date": "2012-10-25", "Author_Location": "New York, NY"}, {"Author": "Andrew K.", "ReviewID": "BwuEJLgJyY7SZsI7e00OmA", "Overall": "1.0", "Content": "Offered me an old, dried out slice. When I pointed that out the response was: \"Oh, it's just a little dry\". Are you kidding me?", "Date": "2013-01-22", "Author_Location": "Cambridge, MA"}, {"Author": "Michelle D.", "ReviewID": "KUc8uF49OmTOeQpmMGzmTw", "Overall": "4.0", "Content": "Very yummy pizza. And they have a huge selection of pies and single servings", "Date": "2013-01-22", "Author_Location": "Los Angeles, CA"}, {"Author": "Sandra M.", "ReviewID": "feO5qFwo8v35NwbSZyLjXA", "Overall": "5.0", "Content": "Just plain awesome.", "Date": "2012-02-29", "Author_Location": "Jersey City, NJ"}, {"Author": "Karol S.", "ReviewID": "hikU842r5gzKdjW4BfxvtA", "Overall": "3.0", "Content": "This review is for delivery of their pizza and pasta so maybe that explains the discrepancy between my 3-star review and all the other 5-star ones.  The pizza was extremely average and the baked ziti was just a-ok.  Not terrible but merely passable.", "Date": "2011-06-12", "Author_Location": "New York, NY"}, {"Author": "Onno K.", "ReviewID": "KMGGP7rTiPMwjmUgUT6mlQ", "Overall": "5.0", "Content": "AMAZING. Everything a pizza should be. Light. Crisp. Flavorful. Fresh ingredients. And the service was the best part. Family owned. Maggie was great!", "Date": "2011-11-30", "Author_Location": "San Anselmo, CA"}, {"Author": "Dean K.", "ReviewID": "j_Aw4QHmxQ8iuZ25CW-GBw", "Overall": "5.0", "Content": "Awesome awesome pizza.  My daughter and I had the 15\" rustica with a BLT salad which was just about right.  It's a rectangular pizza so the size is a little difficult to gauge without seeing it.  I loved the crust - thin and delicious.  Next time I would like to try the calzone - I think their dough would be perfect for it.", "Date": "2013-08-15", "Author_Location": "San Jose, CA"}, {"Author": "Ruth W.", "ReviewID": "2lPl_2pDCLTELQS-3HsVRw", "Overall": "5.0", "Content": "may i just say i miss this place a lot? and that i've discussed flying back to NY just to stop in? It's so good. I'm glad to see they are still doing well:)", "Date": "2011-06-02", "Author_Location": "Fort Worth, TX"}, {"Author": "David H.", "ReviewID": "ejPeV0CXCX65f3UGzDJ8ww", "Overall": "4.0", "Content": "I really liked the pizza here, even though it's a bit pricey.. The selection is great and for two of us, we shared each got one slice and then shared one more.. plenty of food for us!  The pizza is rectangular, so the slices are square, which makes them easy to handle even for younger fingers.  The dining area is very small, so depending on how crowded it is, be prepared to \"take out.\"", "Date": "2012-04-08", "Author_Location": "Chicago, IL"}, {"Author": "Woody N.", "ReviewID": "tbv5ujU0zblBUFUAMSF7Fg", "Overall": "5.0", "Content": "Looks like a hole in the wall, but it is a treasure trove of pizza perfection! Merilu and her daughter are sweet, cute and talented.", "Date": "2012-06-12", "Author_Location": "Bernardsville, NJ"}, {"Author": "J J.", "ReviewID": "Ins8JGdyQVe9z_lslFduww", "Overall": "4.0", "Content": "Delicious!  Thank goodness for Yelp on my Droid!  My daughter and I were starving on our way to the firework show and stopped in for amazing thin and crispy pizza.  YUM!!", "Date": "2012-07-04", "Author_Location": "Yorba Linda, CA"}, {"Author": "Ben E.", "ReviewID": "-plKJsLGISx27IsW69Py1w", "Overall": "5.0", "Content": "One of the best things to happen to Midtown West in awhile.  It has been a struggle to find a good pie here -- until Merilu showed up!  Do yourself a favor and check them out!", "Date": "2013-05-05", "Author_Location": "Manhattan, NY"}, {"Author": "Laura H.", "ReviewID": "LRa8RMFL91oe7cj9wD0SGQ", "Overall": "4.0", "Content": "This pizza was great and cheap. You have to spend at least $10 to pay with credit card. I got the sausage pizza and it was yummy!", "Date": "2012-10-26", "Author_Location": "Rockwall, TX"}, {"Author": "Jones B.", "ReviewID": "F_tmHntbDdxNNZVREH6tyg", "Overall": "4.0", "Content": "It's good pizza, good crust, good cheese, small shop, not bad at all.", "Date": "2012-10-26", "Author_Location": "Athens, TN"}, {"Author": "George S.", "ReviewID": "xWLJKyIJ56OAaxZ9WIqONw", "Overall": "4.0", "Content": "Very good pizza. Had the pepperoni, tomato and basil, and eggplant, all three were tasty. Prices are very reasonable, service was very good. Highly recommend!", "Date": "2012-10-26", "Author_Location": "Alexandria, VA"}, {"Author": "Steve A.", "ReviewID": "qbFb1zmhRpzqrVu9UwXRlA", "Overall": "4.0", "Content": "Very good pizza and nice welcome with the Italian style !", "Date": "2012-04-25", "Author_Location": "New York"}, {"Author": "Constance Z.", "ReviewID": "rWkD9sN4Mg7hME7lIjWvQQ", "Overall": "5.0", "Content": "WOW thanks fellow yelpers this place was amazing!  It is a family business and you feel that as soon as you walk in.  My BF is a pain about eating out and he was hesitant at first since there were not many tables and it is BYOB.  We stayed and it was amazing!  It is not just a pizza place it also has chicken dishes.  He kept saying that this was the best food he had in years.   Everything is made daily and is fresh.  The pizza reminds me of when I went to Naples.  The service was great they couldn't do enough to please us, more grated cheese no problem.  Prices are really reasonable, what a treat!", "Date": "2012-01-07", "Author_Location": "Manhattan, NY"}, {"Author": "Marcos S.", "ReviewID": "2vXt0XSw5jgwWQDlJiDbVA", "Overall": "5.0", "Content": "I can't say enough about the pizza here!  It's some of the best slices I've had in my life, bar none.  Originally from NY, I come to visit the big apple a few times a year  and my priority is to try new pizzerias.  I'm thankful that I ran into Merilu!!  My favorite is the Margarita slice.  The cheese was perfectly heated, the crust crispy on the outside and soft on the inside.  Like some reviewers have said, THE SAUCE is amazing.  I wish they had good pizza in LA.  But the next time I visit NYC, Merilu will be the first stop!!", "Date": "2012-03-24", "Author_Location": "Los Angeles, CA"}, {"Author": "Marlin P.", "ReviewID": "Sclz4uVQ2QMQIT3nvbFc7g", "Overall": "5.0", "Content": "Was at the Library bar @ the Hudson with a few co-workers and started searching yelp for a bite to eat.  Wasn't about to spend insane money for sushi or on any of the french joints in the area and came across the reviews for Merilu.  Have to say it did not disappoint.  Staff was very friendly, relatively small place but for the time we rolled in it wasn't very crowded so we were able to get seating without a problem.  Sampled a variety of slices and the eggplant is absolutely fantastic.  Pretty sure we will end up making a return visit before heading back home", "Date": "2012-03-30", "Author_Location": "San Diego, CA"}, {"Author": "B S.", "ReviewID": "UG8XXFTH6YY2EZvDO7_O6A", "Overall": "5.0", "Content": "Awesome pizza! Great price also!", "Date": "2012-09-24", "Author_Location": "Hackensack, NJ"}, {"Author": "Maggie M.", "ReviewID": "k--B4xsnnAKvxh6Qg3figg", "Overall": "5.0", "Content": "First time in NY and my first pizza here!! It's a cute little place and the pizza is artisan. We got the eggplant rolls and could have only eaten those! They were delicious! Loved it and the service was great! Definitely would go back! Thanks!", "Date": "2013-09-14", "Author_Location": "Theater District, Manhattan, NY"}, {"Author": "Arvind A.", "ReviewID": "HhKa2pcD5fBLkZbUMi4fHg", "Overall": "4.0", "Content": "Seems like the pizza quality has dropped a bit, but it still better than all the other places in the area.", "Date": "2011-07-17", "Author_Location": "New York, NY"}, {"Author": "Aaron P.", "ReviewID": "9eZMWj8tt5CuYMZPseQknw", "Overall": "5.0", "Content": "Simplicity, many times, can carry an experience further than layering on 'the good things' ad nauseam. Merilu has it down.  Simple pies served quick with nice service behind the glass.  I had 2 slices, was asked if I \"wanted an end piece or a middle.\"  The pizza was perfection.  Must've been made from the freshest of ingredients.  You could definitely tell care had been taken in the thought that put this petite eatery together.  Go here and you'll like it.", "Date": "2012-02-04", "Author_Location": "Dallas, TX"}, {"Author": "Chris L.", "ReviewID": "QjMTcLn1-WxAN4cuiKNkKQ", "Overall": "5.0", "Content": "Wow the food was amazing. Try your best to endure the waiting time though because it does take time to make completely fresh pizza for each customer. For me it was a little difficult because it was scorching hot for the whole day and this place was not very cool since heat does come from the kitchen. Trust me, though. It's worth the wait. It pizza was so amazing and you could tell that all of its ingredients were fresh. My family and I CLEANED the plate. There was nothing left. That's how good it was. Please don't settle for the other pizza places around there. Just because its a pizza place in New York does NOT mean its going to be good.", "Date": "2012-07-06", "Author_Location": "Irvine, CA"}, {"Author": "Joy N.", "ReviewID": "nxzVqqxH9gOxMLK7iQipaQ", "Overall": "5.0", "Content": "Awesome!", "Date": "2012-08-13", "Author_Location": "San Diego, CA"}, {"Author": "Patricia B.", "ReviewID": "wp07KX6rg8BG9yd59SOiOQ", "Overall": "5.0", "Content": "Excellent pizza!   Nice, clean atmosphere.  It is clear to see that this family takes real pride in their creations with authentic fresh ingredients cooked to perfection ...and a great value for a fair price!", "Date": "2011-04-14", "Author_Location": "Brooklyn, NY"}, {"Author": "robert s.", "ReviewID": "B7lStt9mPqkUF8AImKqK9A", "Overall": "5.0", "Content": "Wow one of the best pizza I ever had", "Date": "2011-09-15", "Author_Location": "Manheim, PA"}, {"Author": "Stuart C.", "ReviewID": "-1iaamPtu9iTvngMjD3tSA", "Overall": "3.0", "Content": "Good crust, good quality ingredients.  However, overall B flavor.  Ambience is very poor.", "Date": "2011-09-30", "Author_Location": "Eagle, ID"}, {"Author": "Pat S.", "ReviewID": "49fsKg9RvJpEDpII7SKF_Q", "Overall": "5.0", "Content": "I placed an order for pickup last night.  By far, some of the best service I have received in NY.   The lady i spoke with asked detailed questions about how I would like the toppings on my pizza.  She also called me back 10 minutes before the order would be ready so I could pick it up fresh out of the oven.   The toppings were fresh (and a lot of them), the garlic knots were fresh and very good.  Reasonable price, about $22 for a small pizza with 2 toppings, 2 orders of garlic knots and 2 sodas.   Living only a few blocks from here, I will make this my local pizza joint.  Highly recommended.", "Date": "2011-11-09", "Author_Location": "Manhattan, NY"}, {"Author": "Craig D.", "ReviewID": "3SGI87xISvANI100Lg0drw", "Overall": "5.0", "Content": "Great Pizza!!!  Went for a bit to eat after a show and this place was a terrific find.", "Date": "2012-02-19", "Author_Location": "Midtown West, Manhattan, NY"}, {"Author": "Brett B.", "ReviewID": "FqhPTzeiz6xUPaiRrtCaVQ", "Overall": "5.0", "Content": "The place is very small, but has Fantastic pizza.  Great sauce and crust.  And the workers were very warm and friendly.  Definitely plan to go back with I am in NYC.", "Date": "2012-03-15", "Author_Location": "Gurnee, IL"}, {"Author": "Jesse C.", "ReviewID": "AWAtW6q475XOHPPheQfnGg", "Overall": "5.0", "Content": "Myself & the kids loved the pizza here. Wonderfully crispy crust & great toppings. We will definitely come back the next time we make it to NYC.There aren't too many tables, but we happened to come by on a sunny day. We snagged the table closest to the front -- almost on the sidewalk. Made it a wonderful experience, a nice relaxing lunch eating pizza & people watching", "Date": "2012-03-15", "Author_Location": "Vancouver, Canada"}, {"Author": "chil k.", "ReviewID": "9FEn-vLUKrS5fH4cTiKneA", "Overall": "4.0", "Content": "Good pizza at a really good price for NYC, but not all ingredients are as fresh as they say they are. However, if you want quick slices and are near there you won't be disappointed", "Date": "2012-03-30", "Author_Location": "Los Angeles, CA"}, {"Author": "Gail H.", "ReviewID": "59YQw_Jma74c_7m2pmSY3w", "Overall": "4.0", "Content": "margherita:* excellent crust * sauce could've been sweeter* wish the basil wasn't dried out and flavorless", "Date": "2013-04-28", "Author_Location": "Sunnyvale, CA"}, {"Author": "Brian T.", "ReviewID": "VR1OUKQhkI4hh1w-9-Pz6A", "Overall": "5.0", "Content": "We had the sopressata and margherita. The sopressata was spicy and smokey, very good. The margherita was excellent. The crust was thin, light, and crunchy. We would definitely eat here again.", "Date": "2013-07-21", "Author_Location": "Simi Valley, CA"}, {"Author": "Little H.", "ReviewID": "kb-XaxwqAgZapA4w1mA_dA", "Overall": "2.0", "Content": "Honestly not very good. Old pizza sitting out thats reheated. I'd rather go down the street.", "Date": "2012-07-19", "Author_Location": "Irvine, CA"}, {"Author": "Raymond G.", "ReviewID": "GLwSSOw6s5wvYAcRawMQrg", "Overall": "4.0", "Content": "Fresh pizza with interesting toppings.  $4 specialty slices, $2.50 plain.  Good pizza, not great.  Slices are a bit small.", "Date": "2011-10-11", "Author_Location": "Westchester County, NY"}, {"Author": "Chris P.", "ReviewID": "_fLDJIKDm-prZ6qCl2KlEw", "Overall": "4.0", "Content": "AMAZING pizza!  We ate in, only a few tables with no waitstaff but nonetheless the staff was super friendly and the food was fantastic.  We would absolutely return!", "Date": "2011-11-06", "Author_Location": "Deep River, CT"}, {"Author": "E D.", "ReviewID": "3Ved4n6sr40gFU9V2uoRVg", "Overall": "5.0", "Content": "Pizza is amazing.  Crust is perfect...sauce is fantastic.  Ingredients are fresh.  These people just get it.  Staff is extremely friendly.  Highly recommend.", "Date": "2011-12-29", "Author_Location": "New York, NY"}, {"Author": "Ron M.", "ReviewID": "XAVhisc88sylMwNNuRIexg", "Overall": "5.0", "Content": "Visited for the first time on January 21, a Saturday, late afternoon.Had one piece each of the primavera and prosciutto arugula.Excellent! Crust, sauce, cheeses, and other toppings were all great.And when asked if I wanted something to drink, I requested a cup of water, which was provided no problem. Maybe not a big deal, but it's been my experience that certain businesses would rather sell you a bottled water.(I made the mistake of accepting the bottled water at a competing pizza place, only to discover that the bottled water was more expensive than the slice of pizza.)My only complaint about Merilu: I came back the next day, on Sunday, my last day in the city during my current trip, and they were closed! Wish I'd discovered them earlier in the week.", "Date": "2012-01-24", "Author_Location": "Brazil, IN"}, {"Author": "Brenda S.", "ReviewID": "DovLo-bvMUJuyJ2a3DasqQ", "Overall": "5.0", "Content": "Delicious, fresh and perfectly thin - everything was fantastic here, we can't wait to come back!", "Date": "2012-02-01", "Author_Location": "Breckenridge, CO"}, {"Author": "Marianne G.", "ReviewID": "DjB5G0cHOY--A4D4hEVW3A", "Overall": "4.0", "Content": "I steppen into this pizzeria today and I have to say that this is certainly by far one of the best pizzas I have ever had...and I have lived here for many many years!!!!The Margarita was off the hook and I was asked if I wanted fresh grated cheese too!They take care of their first timers for sure...", "Date": "2012-02-09", "Author_Location": "Manhattan, NY"}, {"Author": "Hanna S.", "ReviewID": "1KcIwy272LKnHXQ6jZ4gWQ", "Overall": "5.0", "Content": "Best pizza ever!!! Nice clean spot in Hells kitchen tastiest NY style pizza ever!!!!", "Date": "2012-03-25", "Author_Location": "Tustin, CA"}, {"Author": "Matt M.", "ReviewID": "aNQvaT5zX1YUUhvepS2d1Q", "Overall": "5.0", "Content": "Last September, I called Merilu with a specific request, two pizzas that had to be delivered (one large, one medium) in under 45 minutes for my friends and me. I made this specific request because I was leaving New York City after 5 years to live abroad and my plane was leaving soon. When the lady on the other end of the phone heard my story she promised me she would get it done.Sure enough they got both the pies over in about 40 minutes, and even left me a note wishing me luck and safety on my journey. The delivery man was even panting a bit because he had rode his bike over extra fast. These are the moments that make me love New York so much. I have always thought their Italian style pizzas were the best in hells kitchen. I want to assure the good people of NYC that their commitment to their customers is the same!Thank you Merilu! You and your staff are truly outstanding! Your pizza's speak for themselves, I would give you six stars for your service if I could!", "Date": "2012-05-13", "Author_Location": "Brooklyn, NY"}, {"Author": "Liza Z.", "ReviewID": "qWdBL3--xrcyp5LAK7hW1A", "Overall": "4.0", "Content": "Love this tiny joint. A no-frills pizzeria serving the best pizza in town. Beautiful thin crust with flavorful sauce and fresh mozzarella. Yelp says it's BYOB, too!!", "Date": "2012-07-05", "Author_Location": "Manhattan, NY"}, {"Author": "Arielle b.", "ReviewID": "MmMgiPKBb4XZUxgfoaQYZg", "Overall": "5.0", "Content": "I came here for the first time a few days ago. The pizza was amazing! The place had an awesome vibe as well, perfect music to dine to!", "Date": "2013-07-08", "Author_Location": "Brooklyn, NY"}, {"Author": "the asian jedi ..", "ReviewID": "3qkfqW7heuIOLp0U_A4stA", "Overall": "4.0", "Content": "amazing freaking buffalo chicken pizza. i die.", "Date": "2013-02-18", "Author_Location": "San Francisco, CA"}, {"Author": "Andrea D.", "ReviewID": "FGWWXRjInN0_chOmxKnERA", "Overall": "5.0", "Content": "Great Pizza! nice and casual. Friendly service, and nice music.", "Date": "2013-04-26", "Author_Location": "New York, NY"}, {"Author": "Tim C.", "ReviewID": "3HGISVVW3-_1EPSOHShUuQ", "Overall": "5.0", "Content": "This place is tops inHell's Kitchen. The whole family is there cooking for you.  And they love to do it. Skip Ray's, skip Lazzara's and go Merilu's.", "Date": "2011-05-16", "Author_Location": "Manhattan, NY"}, {"Author": "garrick g.", "ReviewID": "hgbJz83_rWopgK-ikYDMwQ", "Overall": "4.0", "Content": "A charming hole in the wall with friendly staff and wonderfully perfect pizza.  The wife and I stopped in prior to a show after reading about it here.  The pizza more than makes up for any shortcomings in the random decor.  One of the guys behind the counter even started offering me tips on how to improve my own pizza!", "Date": "2011-05-19", "Author_Location": "Collingswood, NJ"}, {"Author": "S P.", "ReviewID": "yXnkIzXJVIuISh_dBTYrUg", "Overall": "5.0", "Content": "I can't believe I've lived around the corner for almost two years and never ordered from here. Simply one of the best pizza places I've been to. Very consistent and fresh. Crust is the perfect combination of crispy and soft. Delivery is quick. Merilu is a must go.", "Date": "2013-03-24", "Author_Location": "Manhattan, NY"}, {"Author": "Gina K.", "ReviewID": "8I-2DKPEbR4l4TKH_FtD3w", "Overall": "4.0", "Content": "Just moved to NYC for the summer and have had Merilu's excellent pizza twice . . . I'm from Chicago (a pizza town) and have lived in a number of other cities and have never had anything like a Merilu pizza . . . all homemade ingredients, amazing crust . . . truly excellent pizza.", "Date": "2011-07-07", "Author_Location": "Los Angeles, CA"}, {"Author": "Kevin L.", "ReviewID": "xmDH6Qxv5kYInZLpXMS4QQ", "Overall": "4.0", "Content": "ive gotten food poisoning from this place, found hair in the garlic bread, and felt bloated/nauseous after eating here, but i still order it anyway because it's so damn good.", "Date": "2013-07-13", "Author_Location": "New York, NY"}, {"Author": "Melissa W.", "ReviewID": "h7B6xSZUNw4pYVgS-Z1z5A", "Overall": "5.0", "Content": "We tried lots of pizza on this trip.  Merilu's margarita pizza was my favorite!  It was so good that I asked my husband to get me a 2nd slice!", "Date": "2013-03-12", "Author_Location": "Bradenton, FL"}, {"Author": "Yesi T.", "ReviewID": "wzrFvELHuJGElMSd3Ph2ig", "Overall": "5.0", "Content": "Just finished eating my first pizza from Merilu's and all I can say is FANTASTIC!!! You have to try it for yourself, you'll be so happy you did.", "Date": "2012-01-13", "Author_Location": "Miami, FL"}, {"Author": "Bhavini P.", "ReviewID": "XbXv1Zn_wssRCeLrEd5lew", "Overall": "5.0", "Content": "Merilu pizza is so good we went twice in one day! The crust is thin and perfectly light and crispy without tasting burnt! The slices also were saucy and not overly cheesy. Try the margarita with mushrooms!", "Date": "2012-12-23", "Author_Location": "West Village, Manhattan, NY"}, {"Author": "Darren P.", "ReviewID": "toVcIxrENkqs3d2d7Ohyog", "Overall": "5.0", "Content": "Went here on our first night in the city. Not as good, but better than we remembered. We all shared a pizza which was to die for, can't remember the name of it,  but it came with Chicken, Bacon, Mozz cheese, hot wing sauce, ranch dressing, the hottest jalapeno peppers I think I ever ate in my life. The only think that was missing was a cold beer. But the good news you can go to the end of the block ( about 5 doors down) and get some beer and take it in with you. THIS IS THE BEST PIZZA IN NEW YORK CITY so make it a point to eat here. It is on 9th ave between 52nd & 53rd streets. Family owned and operated, Mom in the back ( who by the way the place is named after) and the son cooking the pies. WE LOVE YOUR PIZZA & WE WILL BE BACK.", "Date": "2012-11-28", "Author_Location": "Cantonment, FL"}, {"Author": "Robert W.", "ReviewID": "QjnFqiLvA0ruSFt4cPunEA", "Overall": "5.0", "Content": "We're from Boston, which has some pretty great pizza joints, so we were very optimistic when, after having read the reviews on Yelp, we decided to try Merilu.  We were not disappointed!  When.we first arrived all of the five tables were taken, but we ordered anyway, taking a chance that by the time our pizza was ready, a table would become available.  Oh yes, \"so how was the pizza?\", you ask.  Delicious.  We chose the Rustica, which has sausage and roasted red peppers.  The crust was just thick enough to hold the ingredients and very flavorful.  It is not round, but rectangular, and served piping hot on a wooden pallet fresh from the oven.  Merilu offers many different varieties of pizza, so there is something to please everybody.  If you're anywhere near 53rd and 9th you should try it.  It's worth the trip.", "Date": "2012-11-24", "Author_Location": "Boston, MA"}, {"Author": "Stephanie T.", "ReviewID": "YSAyw7_BSM7bvrLtSNI2uA", "Overall": "4.0", "Content": "just a short walk from times square, this was a great yelp find. 3.50 for a medium slice of magherita pizza, 5 for speciality slices. fresh cheese and sauce, crispy crust. would have been 5 stars if the crust had been cooked a bit less. cute decor.", "Date": "2013-08-23", "Author_Location": "San Francisco, CA"}, {"Author": "George L.", "ReviewID": "wTbyhHcskEZqUIt38D2Saw", "Overall": "5.0", "Content": "A little pricey but excellent, fresh and delicious.", "Date": "2012-08-13", "Author_Location": "Manhattan, NY"}, {"Author": "Steve L.", "ReviewID": "429mJVBAsh6TEOLwTr0bhg", "Overall": "5.0", "Content": "Great great pizza. I look forward to trying more of their stuff. So far, recommend the getting Margherita or mushroom.", "Date": "2012-12-08", "Author_Location": "Manhattan, NY"}, {"Author": "David F.", "ReviewID": "XIOkFcPCkXp4Jwhy-KXRRg", "Overall": "5.0", "Content": "I never, ever review restaurants on Yelp, but I'm making an exception. This pizza place is incredibly good. This is as good as pizza gets in my opinion. I tried four slices while there. Each one had a thin crust, delicious fresh cheese, home made tomatos sauce, and toppings you could actually taste. The service was unbelievably kind and welcoming. They suggested slices and were simply nice to chat with. The atmosphere was warm and smelled like pizza just the way it should. If you live near here, or even if you don't, this is a place to check out.", "Date": "2011-09-23", "Author_Location": "New York, NY"}, {"Author": "Chris K.", "ReviewID": "y_rO7uas9kgF5LalA9rGXw", "Overall": "5.0", "Content": "A very nice New York pizzeria with some interesting twists.  Thin crust vegetarian and meat pizza.  Salads are OK, but the pizza is very tasty.  A bit more expensive than the giant New York slices you find at the usual joints.  Trust the reviews, it's pretty darn good.", "Date": "2012-05-10", "Author_Location": "San Rafael, CA"}, {"Author": "p. l.", "ReviewID": "8dUzdXP8RQacyoyN085i3g", "Overall": "4.0", "Content": "Seriously, this is good pizza.  I've eaten at expensive pizza joints (prior to 2008), now I have to watch my budget (it's a recession).  But this is the best pizza I've eaten (ok, Artichoke is pretty good too).  But when you're in Midtown and too lazy to take the subway, this is the place to go.  To owners of Merilu, please don't let the good reviews get to you, because many a places have done this, and it never turns out too well!  Keep up with what you're doing, that's all we ask!", "Date": "2012-09-19", "Author_Location": "Los Angeles, CA"}, {"Author": "Richard O.", "ReviewID": "z8l0fHRKD_jenW2aeMMRgA", "Overall": "5.0", "Content": "Hands down the best Pizza in Hells Kitchen!! The \"Americano\" is one of the best sandwiches I\"ve ever had. Bread is fresh and the salads are great as well! As you can see I\"m a fan!", "Date": "2011-05-20", "Author_Location": "New York, NY"}, {"Author": "Nicole H.", "ReviewID": "Ck9WsU2drLuq3LgNp2YSCg", "Overall": "5.0", "Content": "This place is incredible.  Looking for the best pizza in NYC?  Look no further.  Their crust is incredibly thin and crispy while the toppings are totally perfect, fresh, and delicious.  The owners are about as nice and personable as they come.  I would never go anywhere else for pizza!", "Date": "2011-10-22", "Author_Location": "Manhattan, NY"}, {"Author": "Ken S.", "ReviewID": "5UjJIt0W1Wmv5AQinAPG3A", "Overall": "4.0", "Content": "Excellent pizza.  These guys have clearly put some thought into their sauce and crust. This may be my go-to neighborhood pizza joint.", "Date": "2011-12-15", "Author_Location": "Manhattan, NY"}, {"Author": "Sandro F.", "ReviewID": "lS8c4MXdKoYbbtV_HeXAaA", "Overall": "5.0", "Content": "Esse lugar foi uma bela descoberta, provavelmente uma das melhores pizzas que já comi. Concordo com os reviews que indicam como a melhor pizza de NY! A massa é fina e muito crocante (surpreendente pois é feita em forno elétrico), a cobertura é fresca e deliciosa e o molho de tomate é suave. Pedimos uma Margherita with fresh tomatoes, 4 slices size, pensando que seria apenas o suficiente para a fome do casal, mas era enorme. Deu pena de não conseguirmos comer tudo... Não servem álcool no local, que é pequeno e muito simples com poucas mesas. É mais uma delivery do que uma pizzaria. Os donos são uma família de italianos do brooklyn, todos muito simpáticos. Adoramos e vamos voltar antes de retornar ao Brasil.", "Date": "2012-01-04", "Author_Location": "Austin, TX"}, {"Author": "Jim D.", "ReviewID": "a5a38pZYBI7elKHegc4Afg", "Overall": "4.0", "Content": "Great thin crust pie.  The margarita and the white pizza were terrific.", "Date": "2012-04-11", "Author_Location": "Chicago, IL"}, {"Author": "Peter S.", "ReviewID": "4bhATlrSMQzy_0SBfdQFjw", "Overall": "5.0", "Content": "What a great place on a hot summer evening in expensive Times Square! Pizza is both unique (salami sausage was fantastic) and affordable (4 of us ate for ~$45). My teenaged boys wanted to go back, so in a 4 day trip, we ate at Merilu twice! Interesting toppings, incredible crust, and reasonable prices should make this a must-stop location for vacationers and locals alike. A little haven in the crazy theatre district.", "Date": "2012-09-08", "Author_Location": "Libertyville, IL"}, {"Author": "Julie A.", "ReviewID": "oaF--s9-jkZb-87RCDvSPw", "Overall": "5.0", "Content": "Great pizza!  Crisp crust even w lots of toppings. Good, tasty sauce.  We will go back next trip to NYC.", "Date": "2012-08-22", "Author_Location": "Austin, TX"}, {"Author": "Greg H.", "ReviewID": "N27TiYiACOLjcCyuyvEqzw", "Overall": "4.0", "Content": "The pizza here is good if you like thin crust pizza.  It wasn't undercooked or burned.  The place was pretty small, with only 4 or 5 tables.", "Date": "2012-07-29", "Author_Location": "Princeton, NJ"}, {"Author": "Dani L.", "ReviewID": "O6NkE5u5qdHmRU84lltc9g", "Overall": "5.0", "Content": "OMG!!! this is the best pizza in NYC. The crust is awesome and the toppings are fresh. I had family in from the west coast and they wanted to eat at Merilu's every single day.  In addition to the friendly and helpful staff...I went in for a pick up and it started to rain heavily....the delivery guy drove me bake to my apt out a courtesy....now that's a neighbor you want for life! Congrats and welcome to the neighborhood.", "Date": "2011-05-27", "Author_Location": "Manhattan, NY"}, {"Author": "Matt S.", "ReviewID": "Uadq3UNKHjs9Cl01FFNWdg", "Overall": "5.0", "Content": "really solid pizza.  people who work there are very nice.  i like the buffalo when they have it.  sometimes some of the crazy topping slices can be a bit much, but all their toppings taste really good.  mushroom here is also a winner", "Date": "2012-09-30", "Author_Location": "Hoboken, NJ"}], "RestaurantInfo": {"RestaurantID": "5nlDiuHMDoP3qnPjzqadnQ", "Name": "Merilu Pizza Al Metro", "Price": "$", "RestaurantURL": "/biz/merilu-pizza-al-metro-new-york", "Longitude": " -73.98805500000000", "Address": "791 9th AveNew York, NY 10019", "Latitude": " 40.765273999999998", "ImgURL": "//s3-media1.fl.yelpcdn.com/bphoto/KL8lEh0I6XYEUw4Upo8Cqg/90s.jpg"}}