{"Reviews": [{"Author": "Evelyn H.", "ReviewID": "OL_5UMmm1vXopJavuOT-rQ", "Overall": "4.0", "Content": "MMMM SOFT SERRRRRVE! Sorry, I jumped way ahead here. Let's begin at the beginning:Hubby & I got parking right in front of the restaurant hidden between a AAA and Sherwin Williams Paint store. I was the slightest bit hesitant when I saw how busy it wasn't at 7 PM on a Friday night. No matter though - we were on a mission to find the next great mongolian BBQ place. When we walked in, we were ushered to go get food right away while they got our table ready. No time to waste! The food selection was great. Everything was very clean and well-kept and ingredients were fresh. The employees were spot on with ensuring things stayed clean/organized and ingredients remain filled. The sauce selection was great and they posted suggested recipe mixes, which was uber-helpful. My one criticism would be that the layout of the ingredient bar made it a little challenging for a shorty like me (with short arms) to reach ingredients in the back without dropping things into other bins as they made their way to my bowl (sorry!)It's all you can eat. but I only managed to make 2 trips to the chefs before I had to tap out because I was so excited for SOFT SERRRRRVE! Soft serve was a great end to the meal. Simple, rich vanilla goodness was perfect.All in all, it was good quality food at a GREAT value and solid customer service.", "Date": "2014-07-17", "Author_Location": "San Jose, CA"}, {"Author": "Khanh T.", "ReviewID": "NEZCr0zLIPNYWNF57KsJJQ", "Overall": "4.0", "Content": "Cool cool cool! Another build-your-own-meal type of joint for this plaza. This is pretty much exactly like Great Khan(h)'s in Great Mall but except that it is an actual restaurant and it is AYCE.Tihs is a very clean restaurant. The workers are extremely friendly. There are lots and lots of fresh veggies here. I like that nothing is brown or wilting. You can get up to make as many noodles as you want, but really just one round will have you stuffed. For less than $12, this meal is a steal!", "Date": "2014-07-06", "Author_Location": "San Jose, CA"}, {"Author": "Brielle H.", "ReviewID": "RnMrvybjxObJuxAh_Emcjw", "Overall": "4.0", "Content": "MP Mongolian BBQ in Menlo Park is better but mostly because of the sauce selection here. They're missing ginger, sweet and sour, vinegar, and most importantly oyster sauce. Also the noodles are slightly bigger than I like. Lastly since the jalapeños are cut thicker I feel like the chef can't quite get them cooked through. Aside from that, the place is clean and the food is pretty tasty. If you're a veteran Mongolian BBQ fan, I suggest making your own sauce mix.", "Date": "2014-07-04", "Author_Location": "Ben Lomond, CA"}, {"Author": "Nguyen L.", "ReviewID": "1Hzwg__Xsu3aBBHk3_KTTA", "Overall": "3.0", "Content": "I enjoy AYCE as much as the next guy but when it's not sanitary then I'm going to no come back. The food was pretty decent for a lunch time meal. What irks me is that there's just a mess of food everywhere and sauces dripping in the area where I'm getting my food. Granted it's partly the customers fault to because at times people are trying to put so much food in their bowls that it just overflows. Two words of  advice would be to cut the noodles they have available. It's so long that it makes it so difficult for people to put in their bowls. The other is to please have someone wipe down the area where people get their food. This would make it that much better.I just saw someone's review saying it was very clean and I hope it is better now. My experience was several months ago so I can only speak from the experience. If it's better than I'll definitely give it another try.", "Date": "2014-07-14", "Author_Location": "Mountain View, CA"}, {"Author": "Crystal H.", "ReviewID": "beajKGadpMUWUWe6SCH3Bg", "Overall": "3.0", "Content": "This place is like the one in the food court in great mall and valley fair; except you add the sauces and seasoning yourself. It is also buffet style and cost about $9 for lunch buffet. I'm not into Mongolian food, but I liked how I got to control how much oil goes into the food. Unlike the ones at the mall where its so oily.Make sure to put enough because mines had no flavor. I had to go back and remake another one. Price is good for the portion.", "Date": "2014-06-29", "Author_Location": "Milpitas, CA"}, {"Author": "Jefferson L.", "ReviewID": "yoCaEEmx7vKgcnAMgJkcCw", "Overall": "4.0", "Content": "Met up with a couple friends here for that mongolian bbq pig-out we have every so often. We usually go to one of the Korean-run places on El Camino for this, but we decided to try this place out.Not too much to say here. Good noodles, good meat and a good price. I personally like that they use egg noodles instead of spaghetti like you'll find at other places. They also have shrimp, but it's the really small, tiny, itty-bitty baby kind. Don't be afraid to dig beneath the ice water they keep it in to grab some up!The staff was friendly and the chef was really cheerful when interacting with you and cooking our food. The food comes out really fast, which is nice because you don't have to wait long, but as a result the food came out a LITTLE undercooked IMO.Would recommend this place =). Careful of the chili though, it's actually pretty spicy, so play it safe for the first round.Oh yeah, and the atmosphere is really casual. There's a gym in the same plaza so expect to see a lot of people coming to fill up after working out. They got the right idea =P.", "Date": "2014-06-30", "Author_Location": "Downtown Berkeley, Berkeley, CA"}, {"Author": "Vivian M.", "ReviewID": "cwTfH_qNsn2gxnb1WMuXmA", "Overall": "4.0", "Content": "I like the concept of this place. If you get the buffet, it's all you can eat noodles, and who doesn't love that? I do for sure! It's kind of like all you can eat hibachi found in some buffets, you choose the toppings you want, the sauces, and they prepare it for you.The way they cook it is very interesting. They put it on this round, flat grill and use a large metal stick to push the food all around the grill 360 degrees, by the time they finish, your food is finished. The noodles were good, I don't remember which one I got exactly but I remember telling them to make it spicy with garlic flavor. Oh I forgot to mention that you can choose the sauces that go into your noodles, I think they usually don't help you add the sauces but that day they assisted my party because we were so large. Overall, I say I'd come back here, I'm not sure if I would for the buffet portion since I can only handle at most two plates, but the food is good and so is the experience.", "Date": "2014-05-26", "Author_Location": "San Jose, CA"}, {"Author": "Megan P.", "ReviewID": "lA6C-NF0v5cTSgSszzWnKQ", "Overall": "4.0", "Content": "This place is solid, more of a 3.5. I love making my own combination and being able to control the spice level or add a little garlic or whatever I'm in the mood for. The line can get long and a bit slow but that's more because people can take a long time deciding and piling up their bowls. I am not a fan of the meat. I've tried both chicken and beef and thought both were not good. However I still really enjoyed my food and like the free ice cream. Avoid this place between lunch rush hour.", "Date": "2014-05-23", "Author_Location": "Santa Clara, CA"}, {"Author": "Hakan U.", "ReviewID": "cwfYP69F3mgye0X_81oppQ", "Overall": "5.0", "Content": "I come here regularly.the staff is very friendly .food is always great. You can even have second plate.i highly recommend this place", "Date": "2014-06-26", "Author_Location": "San Jose, CA"}, {"Author": "Garik I.", "ReviewID": "bWN0nj3smK5fdocKS0XHrw", "Overall": "1.0", "Content": "I tried the food once it was not bad... But the second time I came in as I was loading up my bowl with meat I saw the chef picking his nose. After giving him the stink eye for a good 30 seconds he kept picking his nose and then he flicked his booger off his finger.That's where I draw the line. If a chef is picking his nose and sending rogue boogers god knows where, that is the sign of a truly disgusting restaurant. I will never eat here again.", "Date": "2014-04-18", "Author_Location": "West San Jose, San Jose, CA"}, {"Author": "Cake P.", "ReviewID": "WTag53QckSfAkLkpBF9hRg", "Overall": "4.0", "Content": "Lips on fire... What's not to like? First visit, stumbled in after going to the AAA next door. I was so exhausted I could barely add 1+1. But I got helped right away. Instead of letting me make this wimpy bowl of veggies, he taught me how to add noodles into one big bowl and poured the sauces for me. Packed me some hot sauces to go, but I didn't need it my food my PLENTY hot.My mistakes:1) I didn't realize it was All You Can Eat. I usually avoid buffets but everything looked fresh I  gave it a try.2) I didn't get ice cream. Why? Why? Why didn't I get ice cream?3) I got mine To Go. Not a bad thing, as it turns out theTo Go portion was huge, enough for 2 meals.Food is good, sauce blend FIERY. Vegetarian selection good! He even warned me which sauces are made with a little bit of fish oil.Already text my Carnivorous friends that they need to check this place out.", "Date": "2014-06-27", "Author_Location": "San Jose, CA"}, {"Author": "Jonathan L.", "ReviewID": "AoQuj67bhPUfFrWpsXbakQ", "Overall": "2.0", "Content": "Came here a couple days ago for dinner with a couple of friends and their kids. The idea of AYCE Mongolian for 11 bucks? why the heck not right?The line can get pretty long here because of the confusing sauce mixing that we all experience at the end of the line. There is a black board of the various sauces and some sort of measurement of how much to put. It confused the hell out of a lot of people. This part was what made me give them 2 stars.Sauces? more like oil. And as if that wasn't enough.. they add even MORE oil when cooking it. After being cooked and served into a bowl... my food was drenched in hot oil! My food was swimming in a pool of oil and who could enjoy that? My noodles were dripping oil every time i picked some up to eat and eventually I gave up. Couldn't even eat half of the bowl.The idea of $11 AYCE Mongolian is great! and i'm sure people would love this place, but it's not for me. Way too oily and honestly it tasted exactly the same as Great Khans in the malls. If you plan on coming here and getting your moneys worth, I suggest smoke up and come hungry!", "Date": "2014-05-05", "Author_Location": "San Jose, CA"}, {"Author": "Erik N.", "ReviewID": "iTKZABlfxUQu1yCaYjw1mw", "Overall": "4.0", "Content": "Good fresh food.Good value.Very good service.", "Date": "2014-04-27", "Author_Location": "Campbell, CA"}, {"Author": "Benny L.", "ReviewID": "TsYM9o5WFXreG3ngUNtiXQ", "Overall": "1.0", "Content": "I would only come here if it's rush hour! And if it is, prepare to wait FOREVER. It's a shitty catch-22.Anyway, this location is very much the same as the other one.Good: ingredients, and it's Mongolian BBQ for God's sakeBad: everything else. My biggest raging pet peeve is that if you're the only one in there, they keep the meat bins almost empty or filled with scraps. It's gross. And it's not even ice cold. I am sure this is some sort of a health code violation. Service is awful. The prices are higher than their other location ostensibly because their rent is higher (not my problem). Other than garbage won ton crispy things and some \"self serve\" rice and ice cream, there are NO sides/appetizers. I went there recently and at least three different people walked by the food area and inspected it. The meat bin was EMPTY and they ignored it. I had to wait 10 minutes (in an empty restaurant) to ask them to fill it up. Then the chow mein noodles were all tiny scraps. When a few people walked in 5 minutes later, they rushed to fill them up. Fuck this place. Rude, unprofessional. I am going to Su's Mongo and El Camino Mongo in the future. Both of the Gobi chains are worthless.", "Date": "2014-05-09", "Author_Location": "San Jose, CA"}, {"Author": "John M.", "ReviewID": "QcUHno_APTaDNS_B-cWZmA", "Overall": "2.0", "Content": "An oil stained bag of 'meh.'Cafeteria feel. Cramped food selections bar. Rather bland food.Staff was looking over my shoulder as I applied the sauce. Step off, dude. This ain't my first time at this...While I understand that accidents can happen, I shouldn't have to see more stray noodles in a sauce tray than...well...sauce.It's conveniently close to home, and at least the rest of the staff was polite.Not much else to say here except for the following:If you want decent Mongolian BBQ, head to Su's in Santa Clara.", "Date": "2014-04-03", "Author_Location": "San Francisco, CA"}, {"Author": "Hairdiva F.", "ReviewID": "p4uqCEcuFzhZAS6GnxKh8g", "Overall": "5.0", "Content": "Lunch here yesterday with the family. Fast and polite service. Plenty of meat and veggies to chose from. Clean and good atmosphere. Will def be back", "Date": "2014-06-08", "Author_Location": "San Francisco, CA"}, {"Author": "Mark R.", "ReviewID": "ML5pxLHK7Vs3-qMt1Ez-Sg", "Overall": "4.0", "Content": "Come hungry! all you can handle! ALL YOU CAN EAT! I don't even know why I agreed to come in here because i'm trying to go on a diet, but damn, it was pretty good! I came with a couple of buddies lunchtime after a good hoopin' session at City Sports right next door and we made it splash, each getting three plates! Making every penny count! The beef and chicken are good, and the spices are on point, just make sure to come hungry and pace yourself and save room for a soft serve ice cream cone! One thing they can improve on, maybe have ice water because warm water isn't cool bro! Also have two chiefs when it gets busy maybe? speed up the line, fatties get hungry waiting around here, b!They accept card & alot of places to sit inside, GLM approves!", "Date": "2014-04-14", "Author_Location": "San Jose, CA"}, {"Author": "Stacey P.", "ReviewID": "_IL4njU_b-uin-ZxHciU2g", "Overall": "4.0", "Content": "A good place to have lunch. But i do suggest to come early as possible. The line does get pretty longMeat: lamb, pork or chicken. I got the pork & its cooked to order & its ur portion but it was good. Veggies. They had a whole selections of what vegetables you want to get. Sauce: a good selection of it. How spicy/soysauce/sweet/garlicOverall the place is really good. I suggest if youre dining in,to grab two bowls making your plate so everything fits", "Date": "2014-03-25", "Author_Location": "San Jose, CA"}, {"Author": "Gwen G.", "ReviewID": "99-qDwIChJnbGoF3KJc08w", "Overall": "3.0", "Content": "It's ok. Nice having a mongo place on this side of town. They really water down the sauces which really makes the food not outstanding. Also, there is only some fried wantons to go with....Lackluster! But convenient.", "Date": "2014-05-05", "Author_Location": "San Jose, CA"}, {"Author": "Paul L.", "ReviewID": "C3wz08xladqbgLex4We7PQ", "Overall": "2.0", "Content": "Really wanted this place to be good. It's really close to my place. It was a huge disappointment.They hardly have a selection of meat and veggies. They don't want you to smash your bowls together either. Then this guy was hovering over me and almost took the bowl from my hand SO he could do the sauce for me. Really, really dude. I'm a grown ass man and can do it my self. It's very plain and cafeteria like from the paint on the wall to the tables and chairs. If you want good Mongolian. Go to Su's Mongolian in Santa Clara.", "Date": "2014-03-16", "Author_Location": "San Jose, CA"}, {"Author": "Johnny G.", "ReviewID": "ncO2XbGAgo4GpPqpvcd-Pg", "Overall": "4.0", "Content": "This place is a pretty solid. Goes up there as a great place for cheap eats. I mean its all you can eat and dinner is under $12 a person. What a deal!We can here for lunch so the price was like 9.50 a person. What a bargain. This is literally like every mongolian grill place you see in the mall. Reminds me of that.They have a limit of 2 bowls max when you get your food and the choices they have are good. If you go during lunch they do not have lamb though. The noodles are a real good size and the sauces are really good. Surprisingly the cleanliness impressed me the most. They were always cleaning up any spills and replenishing all the trays it was pretty awesome.im sorry, people complaining about a person trying to help you with the sauce combinations...my bad they were just trying to help. I asked the person nicely if I could try my own combination of sauces and guess what.. She was so nice and excited for me she stepped aside with a big cheesy smile. Its not like she was the sauce nazi or anything.plus after you finish scarfing down as much as you could eat they have soft serve ice cream machine on tap. Unlimited quantities to pleasure your sweet tooth. Pretty awesome if you ask me!", "Date": "2014-03-17", "Author_Location": "San Jose, CA"}, {"Author": "Megan M.", "ReviewID": "_XBHo90QzoAyKWqKOkFwEQ", "Overall": "3.0", "Content": "Pros: Really good if you know how to make your combo and which sauces to put! Very fast service and its definitely worth your money!Cons: one of the workers was VERY persistent and kept trying to take my bowl to put sauces. I can put my own sauce thank you very much. They also don't let you take your leftovers home. This really makes me sad because this causes a lot of food waste.", "Date": "2014-03-17", "Author_Location": "San Jose, CA"}, {"Author": "Tram N.", "ReviewID": "EKEGswDUoalGHOPZSuGMeQ", "Overall": "3.0", "Content": "This is a perfect place to go for those that are trying to avoid simple carbohydrates but it would be worth it if you are dining in, however. When you dine in, it's all-you-can eat; you get 2 bowls to fulfill one serving however, when you order for take-out, you get just one bowl.  I didn't opt for noodles but the guy said the order comes w/ rice anyway even though I expressed that I didn't want it.  I didn't eat a grain of rice but I hated having to look at it every time I take a bite out of my meal.  Not that big of a place so if you are on lunch during 11:45AM-12:30PM then you'll be screwed.  I picked chicken, beef, and pork and various vegetables: bean sprouts, carrots, lettuce, onions, and jalapenos.  The meat didn't look presentable but the vegetables were stocked and fresh. The sauces were actually spicy. Since I didn't come during the rush, my meal took about 2 minutes to cook. Service was really friendly. The guy that rung me up was smiling at me the entire time and the guy that packed my order was sincere and quick. I completed 3 days w/o carbs!", "Date": "2014-03-11", "Author_Location": "Santa Cruz, CA"}, {"Author": "Michelle K.", "ReviewID": "4R4O5AEoouqbS4ieq8PA-A", "Overall": "5.0", "Content": "Went here with the boyfriend several days ago and yum! They suggest you grab two bowls for when you go through the buffet line and it was perfect amount for me. I filled one bowl up with veggies and the other with noodles. They also have a good selection of sauces and a board showing you which ones to add like a recipe. I went with the teriyaki recipe and really liked it. They have Rice and soft serve ice cream as well. The two cons were the Tofu they had (it was some chewy fried variety rather than just normal uncooked) and the decoration. There wasn't much of the walls and because of that and the hard floors there was an echo. I'm assuming they will add more decorations as they get settled. I'm glad they opened here and will be returning again soon!", "Date": "2014-03-22", "Author_Location": "San Jose, CA"}, {"Author": "Pauliukonis F.", "ReviewID": "N2cXGn13cmBSCgcitBgf0A", "Overall": "2.0", "Content": "It was just okay. Prefer Great Kahn at the mall. All you can eat for lunch and dinner. Would have been three stars, but minus one star for not taking Amex and the sauce guy not listening to what I wanted - I'm a Mongolian grill pro - I know what I want!!", "Date": "2014-03-27", "Author_Location": "San Jose, CA"}, {"Author": "Brittany D.", "ReviewID": "qPKri7ctAxVdMwQmh2JoJw", "Overall": "4.0", "Content": "I liked it! BUT Beware of the noodles! Get enough to fill two bowls and it'll be hard to go for seconds. Although it fails to differ much from the mall Mongolian BBQ, at least there's all you can eat ice cream! The price isn't too bad either. For lunch, it's about $8. For dinner, it's about $12. This doesn't include drinks. There's rice that you can add as a side for no additional cost. I would recommend the Gobi special sauce & their bbq sauce is great too. Garlic is a must. All in all, it was a satisfying meal. Just be cautious of the portions of your ingredients & sauces.", "Date": "2014-03-18", "Author_Location": "San Francisco, CA"}, {"Author": "Tom S.", "ReviewID": "IJaYjVmV_XEbLDUKSkZH2g", "Overall": "5.0", "Content": "Man, what a plaza we got here! Gobi is one of the newer restaurants to open at Brokaw Commons this time of the year and it really doesn't disappoint!The thing I really like about this place is that they're open nonstop. It's very hard to find an AYCE Mongolian BBQ without that lapse in the day where they close then reopen for dinner. If you're new to Mongolian BBQ, a place that opens nonstop like this is a HUGE plus especially if you want to avoid the insane lines that come around during lunch rush hour. Happens at almost every Mongolian BBQ restaurant I've been to.They let you have two bowls so you can stack your plate at the end pretty well. The usual rule of thumb is one bowl has meat and the other houses the noodles. As for the additional toppings/veggies, it's gonna be your call which bowl it goes into.For me, pork and beef is where it's at. How they sautee the mushrooms and onions though - so good.Chance are, their noodles aren't homemade - but it's damn good. It's thick, firm and chewy - very al dente. It doesn't deflate in your mouth nor does it resemble being soggy. It's not Mongolian BBQ if your noodles suck.Service is great, this is the first Mongolian BBQ where the gentlemen there actually helps you with the sauce to use with your creation at the end. It could be considered intrusive to some, but they were extremely polite in doing so.In its current state, its overall interior design is super bare and nothing to write home about. It definitely looks clean, albeit uninspiring. I can't tell if they'll try to make it nicer or add furnishings, but too much decor will make it look tacky and dusty. I like how it looks now, but it could use a nice mural or something on the wall. The place is very well ventilated.The only few issues I see with it is that the food counter is opposite to where the the kitchen is. That means whenever they need to refill the food at the counters, they'll have to run across the room and refill it in front of all the customers. This could be a slight nuisance if they need to refill while there's a huge line. Compared to other Mongolian BBQ restaurants, other restaurants have access to the food counter from their kitchen and from the rear of the counter - which makes it easier to refill and not have to run to the front.Other than that, this is a fantastic place to get some great and reasonably-priced Mongolian BBQ in the Berryessa/North Valley area. Would love to swing by again!", "Date": "2014-03-01", "Author_Location": "Santa Clara, CA"}, {"Author": "Natalia H.", "ReviewID": "8DcZneX6VQhc74_aR7Jk3A", "Overall": "3.0", "Content": "Came here a while back with some coworkers. Similar to the mongolian bbq on castro and on el camino. You pick what you want (as much as you want), make your own sauce, and have the guy cook it all for you. It's like the mongolian bbq you find at the mall except this is AYCE. Less than $10. Plus our company (I don't know how) is on their preferred company list so we got 10% off our meal. Woot.Not sure if I'll be coming back very often though. I'm not big on AYCE and it's only noodles and meat and veggies with different sauces. Not much of a variety/ selection.", "Date": "2014-03-18", "Author_Location": "San Jose, CA"}, {"Author": "Jen N.", "ReviewID": "8pGI2H5gtnV5_iALCvrBjg", "Overall": "3.0", "Content": "After hearing they were going to open a AYCE mongolian BBQ near home, I was pretty excited to check it out. I love el camino mongolian BBQ so I figured it was going to be the same-ish. My boyfriend and I came here about half an hour before closing. When I first walked up, I noticed how there was just ingredients everywhere. Red flag. I understand that it's somewhat close to closing but I'm one of those people who believe in an \"clean and orderly\" work space. One other thing I didn't like was the fact that they put the shrimp, which was soaked in water, behind the vegetables. I couldn't help to think \"ew there's shrimp water in that cabbage, I don't wanna eat that\". Other than that, the everything was good, although I did make the mistake of adding only one ladleful of sauces so my food turned out bland lol. I'll definitely come back here in the future...this time we'll make it in earlier!", "Date": "2014-04-11", "Author_Location": "San Jose, CA"}, {"Author": "Vivian L.", "ReviewID": "ENwHwyt8KTx8G1N3fQytlQ", "Overall": "4.0", "Content": "I came here on a Friday around 2pm for lunch. I didn't experience a long line or any wait. I came in here expecting it to be just like Great Khanh's (in the malls), but it ended up being AYCE! It's a really good price (under $12) for the amount you get. Although, you honestly probably will not finish more than one plate because it is A LOT! I would recommend to-going it ($8-10) if you don't want soup, ice cream, or plan on dining in. A plate can serve about 2-3 people! It overflows the box and they allow you to take two bowls in one trip to be fried. Food: 4, Delicious! If you make it right especially with the sauces. A worker helped pour the sauce for me which I thought was awesome because they knew what they were doing. I got the house sauce, extra spicy. Lunch doesn't include shrimp, lamb, and soup. I also noticed that they don't have imitation crab or baby corn if you're into that.  Service: 5, they're all so nice and very attentive. Why are people complaining about them helping pour the sauce for you?! Maybe I'm just lazy hah!", "Date": "2014-03-31", "Author_Location": "San Jose, CA"}, {"Author": "Trang T.", "ReviewID": "j3qtSBoALzpq2yeGcB9zBA", "Overall": "4.0", "Content": "AYCE Mongolian BBQ?! I'm there!I saw this place on yelp and had it bookmarked for a long time before getting a chance to try it. Got to come here on a weekday for lunch a little before noon. The trick is that if you are going to eat anything in this plaza on a weekday, you better go before 12pm because the parking lot gets crazy packed from all the surrounding businesses that flock here for lunch.So how it works is that you come in, grab two bowls and fill them with whatever you please. I use one bowl for my noodles and the other bowl for meats and vegetables. For lunch; their meat selection is chicken, pork or beef but for $2 more you can come for dinner and get all those plus lamb and shrimp ($9.50 for lunch, $11.50 for dinner.) The section that you load up is kinda of short and cramped up so it might take a while depending on the people in front of you. They have a variety of oils (chili, bbq, soy sauce, curry, etc) that you can formulate up your own sauce flavors. But if you're like me stick to the board and go with what they suggest. For someone new and wants to be daring, i'd suggest doing a test batch with not so much food and playing with the flavors first instead of experimenting with a huge serving only to get stuck eating it. The cooks grill up 2 peoples food at a time so dont get surprised if you find random stuff in your food cause it flies everywhere. I know the corn and tomatoes from the guy next to me getting his food ended up in mine. Unless you're deathly allergic then its not a big deal i guess.Although its AYCE, i found my eating capacity is only one round. Its not bad but then its nice to know i dont have to cheat the system by trying to maximize my bowl space like at Great Khans. Yes its definitely not diet friendly because it has so much oil but it sure is good!", "Date": "2014-04-05", "Author_Location": "San Jose, CA"}, {"Author": "Tony D.", "ReviewID": "fgkt4nvKFYjNuEnJr_-ZLA", "Overall": "5.0", "Content": "Not since Mungo's closed in San Jose years ago have I been excited about a Mongolian BBQ place.  Glad to say that there's finally a worthy replacement.Anyone who has had Mongolian more than once knows that typically quantity is the big selling point.  We've all seen the mostly empty trays of scraggly bits and pieces of meat and veggies and the messy bars that look like a kindergarten classroom had run amok.Gobi has none of this.  The bar is kept neat, trays of food are replenished often and the sauces are legit.  Spicy means spicy.  I grabbed the requisite two bowls thinking I would scarf it all down easily, but I was defeated by the sheer magnitude of delicious food.  The noodles are nice and fat, not the pathetic spaghetti noodles of other places.  Your drink order is taken upon being seated and refills are brought with surprising regularity.If all this wasn't enough, the soft serve chocolate ice cream (yay not mango for once) was a nice treat to cool the burning fire from the spicy food I just ate.If you are a fan of Mongolian BBQ, don't settle for less.  Come here and get the good stuff.", "Date": "2014-03-07", "Author_Location": "San Jose, CA"}, {"Author": "Monica F.", "ReviewID": "uukkQFJdxQiVfrbxgAGggw", "Overall": "3.0", "Content": "Gobi to me was OK...Althogh I honestly prefer the food court one at the Great Mall.And here is why....We went there on a Tuesday night for dinner.The line where all the food are is way too short... They should have extended it so people are not stuck waiting for this family with like 3 kids put their stuff on their bowls.Not to mention when the parents of this these kids; will not care; and allow their kids to touch every single one of the bowls with their germy hands. The bowls should be out of children's reach.There is nothing extraordinary about this place to make it soo different from the food court one.except that there's soft served available and buffet..But with one trip; you can slap all you want and get the noodles you want in a seperate bowl. Why would you take a 2nd trip ? That's why people get fat.And what's up with the shrimp being so frozen that you couldn't even scoop one shrimp from it?I didn't see crab.. or i mean..imitation crab.It was an EH experience. The servers are nice though.. Absolutely nice.", "Date": "2014-03-20", "Author_Location": "Santa Clara, CA"}, {"Author": "tre f.", "ReviewID": "bTephIx3Q5JenjmSlg-Pkw", "Overall": "4.0", "Content": "Meats look like they are better quality than others, no additional appetizers however. I like their selection of sauces better than the ones on el camino and their prices are about the same.They also have soft serve ice cream, which was a treat.service was prompt, atmosphere is what you expect from a mongolian bbq place, it was nice that they had televisions though.  It was also clean and they allow takeout.And in case you don't know, it is all you can eat.", "Date": "2014-05-08", "Author_Location": "San Jose, CA"}, {"Author": "Christine R.", "ReviewID": "wK5EIlC-Lz_2mqmF40-Abg", "Overall": "3.0", "Content": "I'm thrilled a Mongolian BBQ opened in my area.  I tried it on an early Sunday evening and it wasn't busy when I got there, but when I left there was a short line.  Overall the quality and food taste was good, but I was disappointed that there are less vegetable and sauce choices than other Mongolian BBQ places I've been to.  I did like the noodles which seemed authentic rather than spaghetti noodles.  I think the design of the restaurant could be better.  The food line could have been spaced out more and the vegetable bins larger so they wouldn't have to refill so often.  Also when they refill they have to walk across the restaurant and fill from the front, which I imagine will interfere with customers filling their bowls.  They should have made it so they can refill from the backside.  I also didn't care for the way the guy hovered around when I was doing the sauces.  He offered to help and I politely said no thank you but he still seemed to linger around me.  I thought that was odd but if you're new to Mongolian I can see how it would be beneficial to get help with the sauces.  I wish they had sesame oil and white wine as sauce choices.I got take-out so I can't comment on the restaurant service but the workers did seem friendly.", "Date": "2014-04-07", "Author_Location": "San Jose, CA"}, {"Author": "Naisa L.", "ReviewID": "MH30HQinbG74FJjq6XboQw", "Overall": "5.0", "Content": "Quality of food: 5 starsCleanliness: 5 starsService: 4 starsLocation: 5 & 4 starsAtmosphere: 2 starsHusband & I came around closing last night & though a lot of the food was already gone, they gladly restocked anything we wanted to eat, like the lamb, ESPECIALLY the lamb. In the short time that we were there, they had to restock the lamb twice! But they did it without hesitation. The variety of vegetables were just right for a Mongolian BBQ spot. The only thing I didn't like was that they had corn kernels instead of baby corn, but I wouldn't dock a star for that because the corn option was still there. The sauces were great at well. Service was very friendly & very helpful, if it's your first time, they can help you make different flavor combos & water was refilled quickly. Took one star from service because the moment our food started cooking, one of the servers quickly jumped up to offer us drinks & asked where we would like to sit. That was good, but because she literally jumped up from her seat & was so quick to help, it actually scared me & made me jump as well. But other than that, service was great. Location is smart because there's no other Mongolian BBQ in this area, BUT it is tucked away in the corner & absolutely no way to see it unless you go in the plaza. The place was clean. CLEAN which is important. But the atmosphere reminded me of a cafeteria. I think decorations are called for, or maybe even different chairs, but if you jazz this place up a little bit & make it look more homey & comfortable, it would be great. All & all. We're definitely coming back & would recommend this place to others.", "Date": "2014-03-17", "Author_Location": "San Jose, CA"}, {"Author": "Hoei S.", "ReviewID": "N-Rp3JXXOeGzHL9i4h74hw", "Overall": "4.0", "Content": "Disclaimer: My rating takes into account the price paid for the food. This one is no difference. Went in because of curiosity and because the place that we really wanted to go to was closed for the day. When I saw the price, $9.50+tax for lunch, I thought well it was going to be a little more expensive than typical shopping mall price ... but then I realized it was All-You-Can-Eat. The last time I saw an AYCE Mongolian BBQ place was in Texas more than a decade ago when I was still in college and it was for more than $10.They have the typical selections, minus Lamb for the meat. I was hoping they had lamb but not a deal breaker. The veggies were alright, enough variety for a decent meal. The noodle was also not bad. If you don't want noodles, they also have white rice. To top it off, you can get vanilla ice cream for dessert. They also have the typical sauce selections. Be careful with the spicy oil one.Now though it is a buffet place and the bowl they provide seem small, I am certain I can't eat more than two bowls. And I wasn't even trying to stuff as much as I could.They food taste a little better than the shopping mall variety, but same oily feel. If just for the food I'd give it 3 stars at most, but due to the price for AYCE, I have to give it an extra star. Especially since the ice cream saved me a trip to Black Pearl ... the kids forgot about it after they had their ice cream.", "Date": "2014-04-06", "Author_Location": "San Jose, CA"}, {"Author": "Jennifer P.", "ReviewID": "9JZmrbYweAWFPD9S-ZxQFQ", "Overall": "1.0", "Content": "Don't waste your money! The food is amazing, but the service is HORRIBLE! There is no management, the employees are rude and belligerent, and the design is unwelcoming. One employee, Steve, topped off out visit by screaming at me because HE made a mistake, first by trying to over-charge me, and then by charging my card TWICE. After LOUDLY refusing to refund me the money he had over-charged me, my wonderful bank settle the issue and cancelled the charge. However, he then tried to do the same thing to my sister on her visit! It seems like he is trying to run a scam! I will not be returning here, and the owner Isacc had no one to blame but himself for his poor hiring choices.", "Date": "2014-06-12", "Author_Location": "San Jose, CA"}, {"Author": "Karim M.", "ReviewID": "-crliNZH8W2_qkow9M3YNg", "Overall": "5.0", "Content": "came here for the first time today, only a matter if time before this place becomes a hotspot. fresh and delicious meats and vegetables, roomy, great service, did I mention delicious? $10 all you can eat lunch is unbeatable.", "Date": "2014-04-30", "Author_Location": "Casa Grande, AZ"}, {"Author": "Anders C.", "ReviewID": "2CWcixEOGobEZnMJq1O17g", "Overall": "5.0", "Content": "Round 2. I was craving for Mongolian BBQ (and it's probably going to be a weekly thing) and came back.  The chef took time to make small-talk with me, which was pretty cool since they're usually just quiet and doing their thang. So good.", "Date": "2014-03-15", "Author_Location": "San Jose, CA"}, {"Author": "Jason D.", "ReviewID": "mFM0mM3AMpaA4DOvF-xTjQ", "Overall": "3.0", "Content": "I was really excited to try this place. I love Mongolian bbq places, but don't have a terribly long list of places I've been to, so this place seemed perfect as it's just down the street.As mentioned by others, the interior is fairly simple - bare chairs and tables for the most part - like a cafeteria somewhat. I'm not here for the design though, but it's worth mentioning.The food was okay. We got there at 3:00 or so so dinner wasn't out (I really wanted lamb, but that's only dinner). I piled the beef on and some vegetables - a reasonable selection was available. The workers/owner was exceptionally hands on in suggesting sauces for me at the end. I appreciate that. In the end, I put on WAY too little sauce and it turned out dry. That was probably my fault - didn't want to oversaturate it. The noodles were super thick. The actual cooking of the food seemed to take less than a minute - not sure if it's a hotter grill, but it seemed awfully short. The food was steaming hot, though. Everyone liked their meal, and we learned to dump the sauce on a LOT more next time. In the end, four adults and one child with drinks came out to $53.", "Date": "2014-03-09", "Author_Location": "San Jose, CA"}, {"Author": "David L.", "ReviewID": "RKGkohTBKbdLSo8ieFRnjw", "Overall": "4.0", "Content": "This new Mongolian BBQ restaurant delivers!  The staff is very friendly. The food is good. It doesn't have as many items as El Camino Mongolian BBQ in Santa Clara but it does have free soft serve ice cream.  HuHot still reigns supreme because of their variety of meats, seafood, noodles, rice, and sauces. Too bad they are only in the Mid-west.  Gobi gives great value for your money and adds a nice dining option to the area.", "Date": "2014-03-05", "Author_Location": "San Jose, CA"}, {"Author": "Angel G.", "ReviewID": "V0OlMqyr3tYh906bL3Vysw", "Overall": "4.0", "Content": "everything is good and fast.  the only exception is that they don't have more variety of veggies and meats.", "Date": "2014-06-10", "Author_Location": "San Jose, CA"}, {"Author": "Eli C.", "ReviewID": "e6dFucoTGiF6zmoroqyooQ", "Overall": "5.0", "Content": "Absolutely love it. Paid $11.50+ tax(no drink) for all you can eat and even includes ice cream cones. May seem pricey but if you come here with a big appetite it's totally worth it.", "Date": "2014-05-12", "Author_Location": "San Jose, CA"}, {"Author": "Diemmi H.", "ReviewID": "qx4p04kqXIKFl5q4AllCAw", "Overall": "1.0", "Content": "Edible, but not good. In any way. I don't know what the people in every post are talking about, it being ayce? Ha, yeah right. It barely surpasses the Great Khanh at the Great Mall, so that's not saying much. They barely toss the food onto the grill, the \"water\", or whatever it is they pour onto the food on the grill, have this dark color to it? Their selection of herbs and veggies aren't much, either. The ice cream was so watery, it was practically melting after it came out of the machine. Simply put, DON'T waste your money.!", "Date": "2014-05-13", "Author_Location": "San Jose, CA"}, {"Author": "Jinghao X.", "ReviewID": "cYuqhonQZr_ZpO_OSY3nIA", "Overall": "5.0", "Content": "My family stopped here because, well, we have noses and tongues. A wide selection of ingredients from various meats, vegetables, noodles then sauces. You put as much food as you can into two bowls with sauce and a grill master cooks it up in front of you on a giant round wok. They have delicious recipes you can follow if you blame your own ingredients pickings. It's well-seasoned, tender, fresh, and very tasty. And the best thing is it's MSG free and healthy. Forget to say, this place is in grand opening. I'm not sure if that's a promotion or not, but you can pretty much eat til you die! At least I did that (despicable me, don't let others know). Well, here's the summary:- Overall   = nice experience- Quality   = great- Taste     = delicious- Price      = inexpensive ( - Amount    = pretty good- Service   = fast- Siting in  = well furnished- Staff       = friendly and helpful- To go     = not sure, didn't try to goLove this place, and definitely will revisit!", "Date": "2014-03-12", "Author_Location": "Campbell, CA"}, {"Author": "Raymond B.", "ReviewID": "n4YxQB7E8A5WtabRSCuY-w", "Overall": "2.0", "Content": "Ok so here's the deal. I've been waiting for this place to open cause I love me some Mongolian bbq. Went in today to get a to-go for my wife who is not feeling great. Upon entering, the guy greeted me and was very nice. I told him that it will be to-go and he gave me one bowel. I asked for another one so that I could keep the meat and vegetables separate, and because it's to-go he told me that it will be $1 more for an extra bowel. Are you kidding me....$8 for a to-go, vs $9.50 for all you can eat, as many bowls as you want. So to get 2 bowels my cost would be $9, 50 cents less than all you can eat. I explained to the guy why I wanted a separate bowel, so that the veggies do not get over cooked. He said the cook will not over cook the veggies as he dumps the whole bowel on the grill, cooking the veggies for the same amount of time as the meat. I asked the guy if it's his place or he just works here and he said he's an employee. I told him that you should tell the owners that the one bowel policy is ridiculous.  As I said this another lady said that you only get one bowel because it won't fit in the to-go container. Here is a thought, your serving a stir fry, how about a single compartment container then it will fit.  So, as much as I was looking forward to having a Mongolian bbq close to me I will be heading to El Camino Mongolian Bbq instead. Owners, if you monitor this you lost all of my business at both of your locations. I will not return for take out or to dine in.  I still don't understand why they insist on only one bowel for to-go. Seems to be a bad policy.", "Date": "2014-03-17", "Author_Location": "San Jose, CA"}, {"Author": "Minu M.", "ReviewID": "muRe2f_TtuTiW87uXsu5Ow", "Overall": "3.0", "Content": "It's a very decent place for some Mongolian style food. I almost pitied their location when I first discovered this place existed. The entrance is tucked inside the entrances of two larger stores. It is very tough to spot it from the road and one would need to enter the parking lot to actually see it. Pros: Place is clean, decent choicesCons: Soup was bland and watery. I noticed the cook only making one bowl at a time, while the rest had to wait. Space constraints on the grill?", "Date": "2014-04-04", "Author_Location": "Los Gatos, CA"}, {"Author": "Daniel B.", "ReviewID": "xSrwGH08Cc3IEeUDAxznhA", "Overall": "5.0", "Content": "This is the 2nd of two Gobi Mongolian Grill locations. This one and their other location in Sunnyvale on Tasman. Both of them taste identical in flavor the only setback is the guy running the register was a tool.", "Date": "2014-05-01", "Author_Location": "South Lake Tahoe, CA"}, {"Author": "Basil P.", "ReviewID": "-1DOslLWXeXAuGseNGKiOA", "Overall": "5.0", "Content": "Went to this place for lunch today. The food was good and it's all you can eat dine-in.  Note: use Two bowls to stack all your ingredients. It makes it much easier to have a complete dish.", "Date": "2014-02-28", "Author_Location": "San Jose, CA"}, {"Author": "Adam P.", "ReviewID": "Cl-1weL4FGpC3EW7cZsaVA", "Overall": "5.0", "Content": "Been waiting for this place to open and it didn't disappoint. Fresh veggies and meat was better quality than most Mongolian places. Staff was very friendly and helpful. I tried the Gobi special hot recipe of sauce and it wasn't that hot,and I'm white so u know it's not hot if I'm saying it.  I would recommend the spicy choice recipe next time or just put some Sriracha and chili flakes on top and go to town.  It was all-you-can-eat, but I was done after one big plate. The free ice cream I couldn't pass up at the end even though I has no room for it.", "Date": "2014-02-24", "Author_Location": "San Jose, CA"}, {"Author": "Ryan G.", "ReviewID": "MnK1eCnAFayq5Y8DbnvUqw", "Overall": "5.0", "Content": "This place is great. Their noodles are really good. I love the fact that they have all you can eat. Everything is fresh. Service good.", "Date": "2014-04-25", "Author_Location": "San Jose, CA"}, {"Author": "Jen H.", "ReviewID": "nx8STsXaj4tUJnYy4b5OBw", "Overall": "5.0", "Content": "I've been wanting to check this place out and glad that I finally did!  I did takeout since I needed to run back home... This is the first time I have done takeout for Mongolian BBQ.  I was pleasantly surprised that it was fast and easy!  I came around 4pm, so there wasn't a line and I got to take my time. *FYI for takeout , you only get one bowl for your meat, noodles, and veggies.  For me, that wasn't a problem because I don't eat a lot.  Even with one bowl total, I felt it still made a lot of food! (See my pic).  For dine in, it's unlimited though!  For meats, I saw pork, beef, and chicken.  I ended up getting beef and chicken.  I'm not sure if they offer other meats or seafood at different times of day.  Pretty good selection of veggies although my one suggestion to this place is maybe offering more veggies at some point (baby corn, spinach, etc.).  I just really like veggies :)  I was happy to see fresh jalapeños, cilantro, and tomatoes though because some places don't have those!  I need those 3 to make my combo complete !  Sauce selection was good too- I mixed the BBQ, garlic (lots), Kung pao, oil, and the red hot sauce.  It was DELISH!On the side I saw steamed rice and an ice cream/ frozen yogurt machine and I'm guessing those are included if you dine in?  I did get a small serving of rice included with my to-go meal.Service was great!  The cashier was very friendly and explained everything to me.  While I was saucing up my bowl, another employee came over and helped me out because I was kind of struggling with the garlic (lol, don't ask).  He actually took over and poured the sauces in that I wanted, while explaining what each one was.  Super nice and he didn't have to do that.All in all, great experience!  I'm so happy there is a Mongolian BBQ near my work and gym now!  I don't have to go all the way to Santa Clara anymore!  It's also nice to have a healthy option nearby ... I can come here when I want to be low carb or paleo (skip the noodles and rice).  I will definitely be back!", "Date": "2014-03-02", "Author_Location": "San Jose, CA"}, {"Author": "Da Wahine W.", "ReviewID": "t88Dj3Chm9b_RKqYalOlGA", "Overall": "4.0", "Content": "We were there at 8 PM tonight.  No line, staff was friendly and explained about the all u can eat policy - which was actually written on the board.  Food was cooked quickly. I would put more sauce on mine next time.  Still tasty and fresh. Was stuffed after one trip. Soup was ok. Kids liked the ice cream, good way to end the meal on a nice note!  Will come back.", "Date": "2014-03-15", "Author_Location": "Sunnyvale, CA"}, {"Author": "Kevin J.", "ReviewID": "OHmxs5q_DLl_bJxSmFSvOw", "Overall": "5.0", "Content": "Definitely worth the money. $9.50 for lunch and $11.50 for dinner. (During lunch they have beef chicken and pork. For dinner they have everything for lunch and you can also get lamb and shrimp) If you love Mongolian bbq than you came to the right place. The cooks are fast and the restaurant is newly built and very clean. I would definitely recommend this place to my family/friends and coworkers", "Date": "2014-03-12", "Author_Location": "San Jose, CA"}, {"Author": "Robert A.", "ReviewID": "W3geDVLcM8oWljZJpbpPkQ", "Overall": "5.0", "Content": "Ive been going here pretty regularly now, and I have to say its probably the best Mongolian I've been to.  I can't say for sure why this beats the other spots in the south bay area specifically, but when they make it just ends up tasting better.  Shrimp during dinner although small adds enough to set it apart from the rest.  My favorite way to eat this is to cook seperately the meat with just some onions, oil, and garlic, then have them cook another bowl with the stir fry veggies, cant go wrong with tasting how the meat should really.", "Date": "2014-03-27", "Author_Location": "Bay Area"}, {"Author": "Greg K.", "ReviewID": "fHqfgb1cpmg39MwisjvZIg", "Overall": "4.0", "Content": "Once I seen the sign go up that a Mongolian barbeque place was going to go into this complex I of course got excited..... and they delivered.", "Date": "2014-02-25", "Author_Location": "San Jose, CA"}, {"Author": "Lan A.", "ReviewID": "qo9Owjs4tM9PEmZX-zRtKg", "Overall": "5.0", "Content": "Great price for such a good deal of yummy food! :)", "Date": "2014-02-27", "Author_Location": "San Jose, CA"}, {"Author": "Zachary C.", "ReviewID": "YIwXO6D-AdhIWz5bXmUKdg", "Overall": "5.0", "Content": "I really liked Gobi. It was fun to be able to fill your bowl with whatever you like and then have the guy grill it up in front of you. Great place for an easy lunch, the price for lunch was reasonable enough. I will say that it's a little tough to park in that lot because of the gym and the place itself could use a little more ambiance.", "Date": "2014-03-17", "Author_Location": "Sonoma, CA"}, {"Author": "Holly T.", "ReviewID": "b-5Vef22i0PmQz4Xkhdt2g", "Overall": "5.0", "Content": "Hands down the best (and my favorite) Mongolian BBQ place ever.  Gobi is so much better than the one at the mall.  I've been going to Gobi every week for the past 2 months.  The friends that I have taken here all enjoyed it very much.  The price, the friendly service and especially the food is yumo!  I love the teriyaki spicy recipe that they have and good selection of vegetables.  You have to be there by 11:30am to beat the crowd because by 12:15pm the line is out the door.  I highly recommend this place!!!", "Date": "2014-04-08", "Author_Location": "San Jose, CA"}, {"Author": "Cesar C.", "ReviewID": "ke1hL8LELdwQ3NRGspe8JQ", "Overall": "5.0", "Content": "Came here  with friends for lunch.place was clean.brand new everything.  food was quick and delicious.  Definitely coming back.", "Date": "2014-04-05", "Author_Location": "San Jose, CA"}, {"Author": "Diogenes D.", "ReviewID": "qUcZGvyhJmXNFVmuPPT4XQ", "Overall": "3.0", "Content": "This place just opened in the new-ish shopping area on Brokaw and Oakland Road. The place is kind of small and doesn't offer a large variety of ingredients or sauces. They do have the basics covered though, and you can make a pretty good bowl out of the meats and veggies available. There's almost no pre-made additions like eggrolls available, only steamed rice and fried won tons. They do have a soft serve machine which is nice. Su's Mongolian is way better than this place. The people are very nice and friendly, and the prices are reasonable. But there's better Mongolian joints out there to choose from. And parking in this lot is horrible during the busy lunch hours. Not to mention it faces stiff competition right in the lot from the many other restaurants to choose from.", "Date": "2014-03-12", "Author_Location": "Fremont, CA"}, {"Author": "May C.", "ReviewID": "G9MdoHtEPkFjdG_78OxmsA", "Overall": "5.0", "Content": "This a great lunch or dinner spot!  The food is delicious...less than $10 for all you can eat!  The food is well organized with meat and lots of veggies to choose from, the place is clean and spacious, and you can't beat the price for so much tasty food.", "Date": "2014-02-24", "Author_Location": "San Jose, CA"}, {"Author": "Derek N.", "ReviewID": "58jGkF9HUNksSY2JlTvU2g", "Overall": "5.0", "Content": "I have eaten at three Mongolian BBQ restaurants so far. All of them were pretty decent. There's something different about the noodles they use here, which makes it taste a whole lot better than the other spots I've been to. The cashier got was friendly and attentive. He brought to my attention that I can use TWO bowls: one for the noodles and one for the toppings rather than just one bowl with all the crap piled on top lol.  UNLIMITED ice cream for dining in.", "Date": "2014-02-25", "Author_Location": "Milpitas, CA"}, {"Author": "Rob S.", "ReviewID": "g93O8_9N_DqmxnIv9jrMkg", "Overall": "4.0", "Content": "Group of 5 hit this place on a Friday at lunch and we were all pleasantly surprised. Two bowls full of meat and veggies was just a bit too much food, but between the oils, sauces, and quick cooking time, we made quick work of it.", "Date": "2014-04-25", "Author_Location": "Sunnyvale, CA"}, {"Author": "Yuanzi R.", "ReviewID": "gb5TSg-OD0Qjd16cvvmKVQ", "Overall": "5.0", "Content": "It's located in a new plaza with a lot of parking and it's definitely worth a try!By far, the best Mongolian BBQ I've ever had.This place truly warms the soul and make your way over there with an empty stomach.It's all you can eat and the workers will bring water to your table while you start making your Mongolian concoction. I pick the meats and vegetables I like and follow the instruction in the black board on the wall. My colleagues and I come to this BBQ so often that we call it our company's cafeteria.", "Date": "2014-03-20", "Author_Location": "San Jose, CA"}, {"Author": "Kenny P.", "ReviewID": "ajsTDylY-fZRB_HDlGfHiA", "Overall": "2.0", "Content": "Lets they don't seem to get that cooking meat seperate is important then cooking the noodles first  then the meat then some of the meat is still raw thats like rub your hands with raw meat then pick your nose and lick your hands i can get sick from this", "Date": "2014-03-26", "Author_Location": "Los Gatos, CA"}, {"Author": "Issac K.", "ReviewID": "mv-boCNqoyZJ-Kr9FSGqrA", "Overall": "5.0", "Content": "I came to this place about a week ago.  The inside was pretty plain, cafeteria-like, with a big empty wall, but clean overall.  At first the selection buffet looked short.  I picked some beef slices, zucchini, broccoli, etc. and someone helped with the sauce. I went with the Gobi Special Hot.  The cook grilled it for few minutes.  It was quite short time.  Then I got some rice and tried the food...  Man was it tasty!  It beat my expectation.  I actually went for a second round, although I was quite full.  I will definitely be coming back.", "Date": "2014-04-23", "Author_Location": "Santa Clara, CA"}, {"Author": "Jim M.", "ReviewID": "l4_CfwRcEFhno2mdoH6Giw", "Overall": "5.0", "Content": "Wanted to eat lunch out with a group of former co-workers and someone suggested this place was supposed to be good so we met up there.  Wow, was it great!  If you don't know this style of eating, there is a buffet filled with different meats with tons of fresh veggies, noodles, sauces etc.  You put your choices in bowls (as much as you want) and they have a person there to help you with the many different sauces before it's cooked.  I wanted it medium hot, not too hot, and she added it to my bowl for me.  This is helpful for those new to Mongolian grilling.  The cooks take your bowls and place the contents on a huge grill and cook it.  I enjoyed watching these guys do their work cooking all of our meals at once on the grill.  It's goes fast as the meat is cut thinly and the veggies cook crisp and not limp and over cooked.  Once all cooked, they place it all on a fresh plate and then you can add your rice and any special seasons that you many want to add (I didn't add any spices this time).  The flavors in their sauces were awesome, and it was the perfect amount of hot.  I was glad the lady helped me with that.  My friends made theirs much hotter.  There were six of us, and we all raved about our meals and decided to be sure to come back for our next lunch.  The people and service were very friendly and the place is spotless.   The buffet line runs quickly, even during the busy lunch time.  There is a lot of parking out front, but if really busy, there is also parking in the back.   It's right next to the big AAA Insurance office.  Anyway, a really great eating experience.  Highly recommended.", "Date": "2014-03-21", "Author_Location": "Campbell, CA"}], "RestaurantInfo": {"RestaurantID": "5oJ6BZRx_ZcR69W-AHF9vQ", "Name": "Gobi Mongolian Grill", "Price": "$$", "RestaurantURL": "/biz/gobi-mongolian-grill-san-jose", "Longitude": " -121.89803291112", "Address": "1035 E Brokaw RdSan Jose, CA 95131", "Latitude": " 37.382790050230099", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/BMut8mLYfOgHwQy8EP0h8g/90s.jpg"}}