{"Reviews": [{"Author": "Laurie P.", "ReviewID": "DhHok7m2XggZGeiRdWox6A", "Overall": "5.0", "Content": "This is hands-down the best Mexican restaurant in San Antonio. My husband and I go at least once or twice per month! Known for their delicious seafood dishes, they have so much to choose from on the menu... There's something for everyone.I generally order the pollo a la parilla and it's simply divine. The chicken is always grilled to perfection, the caesar salad is my favorite in town (it includes hearts of palm!!) and it's served with tasty rice and beans. It's a great portion, especially if you're really hungry!No Mexican dinner is complete without margaritas!! And honestly, you really can't go wrong with your drink order. They make delicious cocktails, have a nice wine list and beer selection too. My husband always gets a giant beer in a frosty glass!The prices may surprise you but it's money well spent. The service, food and atmosphere are 100% worth it. YUM.", "Date": "2014-06-09", "Author_Location": "San Antonio, TX"}, {"Author": "Natalie S.", "ReviewID": "KirgvdxiH47JZiCjLCmTnA", "Overall": "3.0", "Content": "I went here for Sunday brunch last week. Unfortunately they do not have a brunch menu online, so I can't tell you what I had, but the server did tell me it was basically a deconstructed Mexican version of a McMuffin (since it was a english muffin, mayonaise, egg, and ham). It also came with hashbrowns and beans. I came with a friend that everyone knew so I felt at home and comfortable immediately. We ordered coffee and breakfast. We did not get any chips (I guess since it was brunch). Our meals came quick enough, however mine was kind of cold. The sandwich was good, but the hasbrowns were mediocre (nothing compares to Waffle House hashbrowns) and the beans were cold. We ended up ordering a Chispa each (margarita made with lime juice, triple sec and tequila) which was the best thing about this place. That is how I have always made my margaritas, so it was great to have one like that at a restaurant with brunch. They are very strong, so make sure to eat your entire (cold) breakfast or you may be stumbling a little. Our waiter was very nice and talkative and asked us if we knew where the world most expensive coffee came from. We were stumped. He said in South America an animal eats the beans, defecates them, they are dried then roasted, so essentially there are feces in it. I didn't know what to say. It may just be me, but I personally don't like talking abut feces over brunch. So if you go to this restaurant and your server asks you about the worlds most expensive coffee, stop him there! (Though after a few Chispas you may find it hilarious).", "Date": "2014-07-22", "Author_Location": "Dallas, TX"}, {"Author": "Luis E.", "ReviewID": "2EVT-fiSE3WgFYatRRmoYg", "Overall": "2.0", "Content": "Time: Saturday AfternoonLocation: Alamo HeightsPrice: 13.95 + the cost of drinkFood: Chile RellenoPoblano pepper filled with ground Beef or Mozzarellacheese topped with Ranchera sauce. Served withrefried beans and rice.Drinks: I had water and just one drink of lemonade with vodka.Music: Old timey spanish music.Crowd: Mostly families and I think they were preparing for a birthday party or something.Interior Design: A fairly large and open space or at least it felt like it which was nice.Pros: The customer service was great. The employees were very polite and attentive.Cons: The food just wasn't very good and definitely not at that price.", "Date": "2014-06-15", "Author_Location": "San Antonio, TX"}, {"Author": "Melanie K.", "ReviewID": "yZqN9Qb8HeUcRfaNZuy1jg", "Overall": "3.0", "Content": "Went on a Monday had to enjoy the patio  even if it was hot but just love all the plants. Better to test the waters during lunch when items are cheaper. We waited over 30 min for our food but that just gave us more time to have drinks. I ordered the cabrito tacos which came with a pico dillo sauce made up with avocado , onions, tomato and cilantro. Borracho beans as a side. Be wary of the margaritas they have lunch time special which made me nap when I was done . It's my go to place for cabrito and nice surroundings", "Date": "2014-07-21", "Author_Location": "San Antonio, TX"}, {"Author": "Kenneth C.", "ReviewID": "A5hrIbf-uLm61d3mxXmaUA", "Overall": "1.0", "Content": "Food was ok but honestly I am not a big Mexican food fan anyway.Food was warm not hot.My biggest complaint was the service.  It was horrible.  It took our waitress over a half an hour to take our order and then we did not get our food for 40-45 minutes.  After all the bad service they charged a 20% service charge because we had a group of 12.I am not sure if the lady was new or maybe a family member.  the waitress had very little assistance from anyone and continued serving her smaller tables and ignoring us.  Probably she new she would get a 20% tip because we were in a group and that tip was not guaranteed for her smaller tables.Either way why does not matter.  Service was horrible and food was not hot.", "Date": "2014-07-19", "Author_Location": "Schertz, TX"}, {"Author": "Susan R.", "ReviewID": "3C0l-uJ9FFOX1FIH7Cc3cA", "Overall": "4.0", "Content": "This place is really cool.  We went on a Monday night do it wasn't that busy but I bet it gets packed on the weekends.  The chips and salsa were awesome.  The guacamole was paste like and I prefer guacamole to be chunky but it wasn't bad.  I don't normally like soft corn tortillas but I figured when in Rome and they were delicious!  The best tortillas I've ever had!  I only gave 4 stars because the steak taco was really tough but the chicken was great!", "Date": "2014-07-15", "Author_Location": "Jacksonville Beach, FL"}, {"Author": "Justin H.", "ReviewID": "s8WIA3tYaHjw6DxvyMBYNQ", "Overall": "5.0", "Content": "I have nicknamed this place ole faithful. My family and I eat here bout 4 times a month and there is a reason for that.The Chispas are tasty and strong wich makea them a little pricey but worth it. Shrimp nachos are great to start off any lunch or dinner.The patio porch is always great for outdoor dining.Great food and atmosphere everytime as the wait staff goes above and beyond to serve everyone.", "Date": "2014-05-24", "Author_Location": "San Antonio, TX"}, {"Author": "M L.", "ReviewID": "ByMMSEwteXzWMQqO2v1LXQ", "Overall": "3.0", "Content": "Well, the verdict is IN: Soluna doesn't quite live up to the hype... Or the price tag, for that matter. ($50+ for two) What an unfortunate discovery. Driving in, you cannot help but notice the beautiful scenery surrounding this hidden spot. I wish it had not been raining so we could've been seated on the gorgeous patio. Inside was another story; loud and hectic! Being PACKED, I was immediately excited for the adventure laying ahead for my taste buds and stomach! We were seated quickly, promptly asked for out drink order, but slowly brought salsa and our drinks. The margarita tasted bitter and my daiquiri watery. The salsa was abysmal. Eugene L. had me anxious for the three salsas- we were only served one. Boo! The ranchera salsa was not bad, it just had NO kick whatsoever. The tacos al pastor were SALTY!!! Sodium overload!!! My dining companion had the tacos nortenos and they were just alright. The rice was stale and beans were blah. FABULOUS queso flameado, however, kudos! This bumped Soluna up to three stars. All in all, though, such a letdown, Soluna! (BONUS: another Ancira siting! Hah!)", "Date": "2014-04-18", "Author_Location": "San Antonio, TX"}, {"Author": "Alexis A.", "ReviewID": "d6Us1CUwVIZM__sTf0ZibQ", "Overall": "4.0", "Content": "First time here was on National Margarita Day, needless to say we came to the right spot.  The Chispas were tasty and not overly sweet (my biggest pet peeve). They packed a nice punch, though were a bit on the pricy side.  I also tried the Coconut Margarita which was a creamy dream.  I walked out with a nice buzz after just these two. I ended up sharing a generous plate of Tacos Norteños which were awesome.  To those who have never indulged in this dish: Refried Beans-Beef Fajita- Cheese and Avocado in a flour tortilla that is then grilled on both sides. Soooo gooood.  While a bit expen$ive.... worth the indulgence", "Date": "2014-02-23", "Author_Location": "San Antonio, TX"}, {"Author": "Angela F.", "ReviewID": "DiNnpJV9HQCH9IDW_bpeLQ", "Overall": "4.0", "Content": "Beware: the chispas (aka margarita on the rocks but with only fresh lime juice, tequila, and triple sec) will knock you the fudge out. Seriously, I had one and a beer and a nap was necessary afterwards. Definitely sets the tone and gets the laughs going!Service was good, I thought...but, I'm pretty low maintenance and we were released early from work so we planned on having a \"European lunch\" (2+ hours, multiple courses). Our server's name was Jesus...he was fun times....we kept telling him \"Happy Birthday\" since Christmas was the previous day and he just cracked up so he had a sense of humor, which is always appreciated by this crowd. To start, the chips & roasted salsa are yums...we took it a step further and ordered the guacamole. It was simple, creamy, and unsalty and rimmed with fresh pico de gallo. You must combat the chispas with food asap, y'all. Take my word for it. For lunch, I ordered the enchiladas del mar. Delicious! Echis stuffed with crab, shrimp, and fish with a delightful tangy cream sauce on top. It comes with white rice and fried plantains (snooooze), but I nixed that and asked for Mexican rice and refried beans. The shrimp tacos were amazing: fresh shrimp with a crunchy slaw and a nice toasted corn tort with lots of white cheese. The borracho beans were very tasty, too. I also had a bite of the cheese enchis, which were pretty dang good. In our drunken state, we also ordered the rajas con queso quesadillas, but they were packed up to go so I didn't get a bite of 'em, but, how can you go wrong with grilled rajas right?! I'd definitely recommend ordering something seafood-y at Soluna...it tastes fresh, not frozen, and they know how to do it up right. Top it all off (and combat afternoon hangover) with a double espresso...the BEST I've had since moving back from Europe. As Melia R. said \"The Italians wouldn't scoff at THIS espresso!\" What a jolly good time! I'll be back!", "Date": "2013-12-27", "Author_Location": "San Antonio, TX"}, {"Author": "Kristina M.", "ReviewID": "J_NuOwXvm6k_Iqj_oYyGUA", "Overall": "4.0", "Content": "It had been awhile since our last visit here because although the ambiance is fantastic, the food was only so-so.  This time, I was pleasantly surprised at how good the food was and I'll definitely go back.We came here at 3 p.m. on a Saturday afternoon for drinks and snacks with friends.  We wanted a place relatively close to the airport that we could linger without much intrusion.The staff was attentive, but did not bother us.  We ordered various entrees, appetizers, and desserts.  Shrimp nachos were particularly addictive and the tres leches disappeared shortly after reaching the table.If you have out of town guests who are craving Mexican food, this is a great place- beautiful, and no \"tourista\" food.", "Date": "2013-12-30", "Author_Location": "San Antonio, TX"}, {"Author": "Jen R.", "ReviewID": "jssQfjjF0_p0KZPIUzmPmw", "Overall": "4.0", "Content": "My husband and I had dinner at Soluna. Great margaritas, beer, and dinner.  The ambience is wonderful and our waiter was amazing.  Check this place out!", "Date": "2014-05-25", "Author_Location": "San Antonio, TX"}, {"Author": "Brittany F.", "ReviewID": "sQVgf1ZR6WnlC3G0ZVw9eQ", "Overall": "2.0", "Content": "I've been going here for years and am going to take another break from them. I used to LOVE their chicken caesar salads with chips and salsa, but this last visit has made me rethink that feeling. Their food (salads, anyway) is very inconsistent and doesn't always have the same ingredients or portions as the last time it was ordered. This most recent time I did manage to get artichoke hearts and hearts of palm in my salad. Sadly, both the artichoke hearts and hearts of palm were no longer good or \"fresh\" tasting (I am aware that they are canned). The chips that they served were also funny tasting as though they were cooked in old oil. The salsa, as usual, was out-of-this-world-delicious but just could not make up for the chips and salad toppings. Like I said, I'm going to take another break and see if they've worked out the kinks the next time I visit. I would like to note that my dining companions have ordered the mole enchiladas, enchiladas verde, chili relleno and chili en nogada and enjoyed it every time.", "Date": "2014-01-03", "Author_Location": "San Antonio, TX"}, {"Author": "Gloria C.", "ReviewID": "0P_yKmLbphu1KrbCBaeyBA", "Overall": "4.0", "Content": "That patio though! If you've read even 1% of my previous reviews, then you know I'm a sucker for an outdoor oasis. They've got that and more. While not my first choice for straight up Tex-Mex, I like that you can indulge here or stay a bit on the healthy side. The ensalada mar y sol is one of my favorite healthy choices - a generous bed of greens topped with perfectly grilled shrimp and fresh lump crab meat. Those shrimp are fat, juicy, and not overly seasoned. The creamy white balsamic dressing that comes with it is a wonderful citrusy complement. I've gotten pretty tipsy off of the stronger than usual margs here. I wish their guacamole was chunkier and better seasoned, although it is still very fresh. As others have mentioned, service is never spectacular. If you can snag a spot on their patio for a light lunch or post work nosh, you'll be a happy camper.", "Date": "2013-11-01", "Author_Location": "San Antonio, TX"}, {"Author": "Roya C.", "ReviewID": "KfcF2O4i5TXNP4im5hokMA", "Overall": "1.0", "Content": "Probably the worst Mexican food I've ever had. I just moved here from Houston and all of the help reviews said to try this place out. \"GREATEST MARGARITAS!\" \"Awesome food!\" they said. They were wrong. Bland food, horrible service. It took 20 minutes just to get the check. Not to mention, they got my order wrong. And the margarita? Imagine what hard water and tequila taste like--that's your \"greatest margarita.\" Save your money.", "Date": "2014-05-10", "Author_Location": "Houston, TX"}, {"Author": "Gene E.", "ReviewID": "4owB3BTVzK1o-FDlqivTpA", "Overall": "3.0", "Content": "The food was very good. I have to say the Huachinango (snapper) in Ajo Mojo was phenomenal, but the sides were average (limp asparagus and a small cup of rice). The guacamole and nachos were decent. Although the servers were very friendly and generous (we received a free nacho order and dessert because we were celebrating a graduation), it was very slow. The main courses were also expensive for their portions. Either way, I'd come back to give it another chance.", "Date": "2014-04-26", "Author_Location": "San Antonio, TX"}, {"Author": "Lorraine S.", "ReviewID": "010vwB42d3MU_ZVoPG6_jg", "Overall": "5.0", "Content": "YUMMMMM!!!!!!!!  Shrimp tacos with pablano sauce!!!!!!!!!!!'  Too good. Add a Chispas and I'm in heaven!", "Date": "2014-04-15", "Author_Location": "San Antonio, TX"}, {"Author": "Dean H.", "ReviewID": "5IhX_PRhoiVczlFGDbTyHg", "Overall": "3.0", "Content": "Soluna is okay - but I am not hankering to go back.We came here after passing it by for literally years.  Everything just was a little too salty, uninventive, and just average.  In some cities, this may be the best Mexican offering for miles, but in SA, I think it only survives because it is in '09.The environment is nice though and the patio is pleasant, so it is probably a nice place to go and have some drinks.", "Date": "2013-10-06", "Author_Location": "San Antonio, TX"}, {"Author": "Travis S.", "ReviewID": "PPNcbx_P4Na1F-0SSWZKOw", "Overall": "2.0", "Content": "Way over rated and overpriced! The food is ok but doesn't match the price tag... Not even close. Drive a little further to Paloma Blanca, at least the prices match the quality.", "Date": "2014-05-31", "Author_Location": "Schertz, TX"}, {"Author": "Randolph J.", "ReviewID": "IqJaIdhX35f0EQy_WwcR3g", "Overall": "5.0", "Content": "One of the better Mexican food joints in San Antonio. The inside seating is a little limited, so the wait can be a pain. However, if it's nice out, the garden/patio is awesome. I can't think of too many places with such a pretty patio area. The food is great...just about everything is prepared really well. The chispa drink is awesome, though those can get a bit pricey. They also have some orange salsa that has a lot of kick in it, though you have to ask for it. I can never remember the name of it, but just ask for the orange salsa. I think the only downside of the place is the small interior and the noise. But, the food/drinks more than make up for that.", "Date": "2014-04-22", "Author_Location": "Fort Worth, TX"}, {"Author": "Whitney H.", "ReviewID": "MollK_uBtGe5Y2s87C5_zQ", "Overall": "5.0", "Content": "One of my favorite Mexican food places in town, which is saying a lot! The Chispas are a home run as far as a marg goes. All of the food I have eaten there over the years has been delicious and consistent.", "Date": "2014-04-10", "Author_Location": "San Antonio, TX"}, {"Author": "Sarah F.", "ReviewID": "TaQ8A72lp4wON7GiYqX9tA", "Overall": "2.0", "Content": "After visiting Soluna one day instead of going with my tried and true Paloma Blanca, I have to say that I'm extremely let down by the high reviews. Yes, the patio is nice, but as far as food and drinks go I am definitely not a fan. I ordered the mango margarita because the waitress said that they are good. It was awful. I couldn't take more than a sip or two and then had it taken away because it tasted like Tang mixed in with a gross premade margarita mix. My enchiladas were so so but finding chicken bones in one of them all but killed my appetite. The wait staff and hostess were not stellar (as has been mentioned time and time again in their reviews). Overall I will stick with either Paloma Blanca or Picante Grill..unless I'm feeling ballsy and want to try their paella that Juliana P. raves about. I hate to leave bad reviews the first time around and always opt to give a place 2 chances, so we'll see if I need to update my 2 stars in the future.", "Date": "2013-07-30", "Author_Location": "San Antonio, TX"}, {"Author": "Andrya S.", "ReviewID": "2Xiah9WSnxeYZEZLO7KFRw", "Overall": "5.0", "Content": "Wow. I am so impressed. I usually am not a fan of 'upscale' Mexican food, but not only was Soluna serving up amazing authentic fare, but the service itself was impeccable. The staff is beyond friendly, almost to the point of feeling like they are old friends. They pay attention to even the smallest details (like placing your napkins on your lap) and showed up with chips, salsa, and water within seconds.  The atmosphere is positively bubbling. The Chispa margarita was the best margarita my husband or I have ever had, and the salsa has an incredible smoky flavor to it... Great experience, we will definitely be back!", "Date": "2014-01-30", "Author_Location": "San Antonio, TX"}, {"Author": "Victoria A.", "ReviewID": "Li8ML8Vl_05fvR-64dQYGQ", "Overall": "4.0", "Content": "The food was okay. I ordered cheddar cheese enchiladas. The margaritas were excellent and I loved the outdoor atmosphere. There was a variety of outdoor seating to choose from.", "Date": "2014-03-14", "Author_Location": "San Antonio, TX"}, {"Author": "Jacob R.", "ReviewID": "fKKAKpj92VXsiBBuA3dq9w", "Overall": "1.0", "Content": "Food is good along with atmosphere but rice, beans, and enchiladas should only cost so much. They are basically stealing your money. Soluna takes advantage of the surrounding clientele. Places like eddies taco house off Thousand Oaks has an amazing atmosphere and gives you the same quality food as far as taste and serving size go for 1/3 the cost. Everything at soluna a is great except the price.", "Date": "2014-05-28", "Author_Location": "San Antonio, TX"}, {"Author": "K M.", "ReviewID": "DktUKndCNg6coQ3ohHvN3Q", "Overall": "1.0", "Content": "Food Poisoning. I went over Memorial Day weekend with my husband, who also got sick. We ordered different dishes, it wasn't just what I was eating that wasn't cooked properly.", "Date": "2014-05-27", "Author_Location": "San Antonio, TX"}, {"Author": "Cassandra R.", "ReviewID": "R0DViUUtGoCH4kZjTdFIsw", "Overall": "5.0", "Content": "I love this place!!! I've been coming here since 2007 and its always been great. I love the tampiqueña al chef and the margaritas from here. Everything on the menu is really good even the cabrito. I also love sitting outside because they have a lot of plants and the decoration is beautiful! Such a nice place and the food is not texmex it is real mexican food!", "Date": "2014-06-01", "Author_Location": "San Antonio, TX"}, {"Author": "Christine M.", "ReviewID": "waU8qh2gmtrFdmrgK8Q3bg", "Overall": "5.0", "Content": "I always glided right past Soluna for some reason, it just didn't speak to me...now I know better.  They have the best upscale Mexican food in the area.  The service you get is impressive and the staff is super attentive.  Their patio is gorgeous and a good wake-me-up if you're a little tired on a Friday after work and need to get back in the swing of things to start your weekend off right.Not being a native Alamo Heights-er its also interesting people watching in a big bad way.I usually get the same thing each time, why mess with a good thing?  Queso flemeado to start and Chile Poblano al Carbon.  Its a huge helping and you will have leftovers.  I did branch out and tried the Carne Adobada last time, also amazing.  I really love this place.  Anyone that comes to visit me from out of town, this is the first place I will take you to eat!", "Date": "2013-05-15", "Author_Location": "San Antonio, TX"}, {"Author": "Erin H.", "ReviewID": "UCHPRJwJ9StnVm2VI0c8Mw", "Overall": "4.0", "Content": "I highly recommend ordering the Tampiqueña del Chef.  It consists of marinated outside skirt steak that is so tender you can cut it with your fork, topped with white wine cream sauce.  The cream sauce is a delight to the taste buds and It includes some spinach and mushrooms in the mix.   I literally could drink this stuff.  It is accompanied with sautéed vegetables and white rice with bits of corn.  Although the price is steep (25.95) if is more than enough food to share. (Think splitting fajitas size).The chispas are still another favorite of mine you don't want to miss.  Nothing beats the flavors of all fresh ingredients to make this margarita stand out above the rest.  All in all, I look forward to my next visit to Soluna.  I will definitely be ordering this meal again soon!", "Date": "2013-07-02", "Author_Location": "San Antonio, TX"}, {"Author": "Melia R.", "ReviewID": "MAArzMbJkqTl4p7XbNks8g", "Overall": "4.0", "Content": "Try the seafood dishes. I will personally vouch for the shrimp tacos (try with poblano sauce instead of chipotle!), taquitos de poblano (crab and poblano!), and the seafood enchiladas (I can't even describe the flavors!), but I'm willing to wager all seafood offerings will be solid. So go for it; you can't get the good seafood dishes everywhere!As far as service is concerned, I'd say don't come here to grab a bite to eat; come here to dine. Come here with friends to enjoy some MEXICO Mexican food at a Mexican pace. Linger over the fresh flavors and good company on the aforementioned fantastic patio.Oh, and spend the 2 extra bucks on the top-shelf chispa; totally worth it.De nada. y Provecho!", "Date": "2013-06-06", "Author_Location": "San Antonio, TX"}, {"Author": "Foodie G.", "ReviewID": "b0hgGRKSZLJxn1s2sFzlbQ", "Overall": "5.0", "Content": "Finally, a restaurant that identifies their Gluten-Free items! Thanks SoLuna for having a ton GF items for my husband to choose from. We've tried almost all the dishes and they have all been amazing and delicious! We stop in this gem of a restaurant several times a week when we are visiting friends & family!! Try their  Chispa Margarita goes great with the food! Please open something here in San Fran.", "Date": "2014-03-21", "Author_Location": "San Francisco, CA"}, {"Author": "Kim C.", "ReviewID": "F7LWVEXNlMW-vF5yNzH6kA", "Overall": "4.0", "Content": "We really enjoyed our lunch here. The service was excellent! We were warmly greeted by all of the staff, and the patio was gorgeous. It's like sitting in a covered flower garden with ceiling fans to cool you off. My husband ordered the mole chicken enchiladas. I ordered the tacos de carnitas. Both dishes were yummy, and we loved the smokey chipotle salsa! We'll come back another time for some drinks!", "Date": "2013-09-07", "Author_Location": "Converse, TX"}, {"Author": "Jessica S.", "ReviewID": "MvGEtT3CtVGT4ZgTVPzJXQ", "Overall": "3.0", "Content": "Soluna is pretty average as far as yuppy Tex-Mex goes, in our experience.Chips were fine, mostly fresh.Ceviche appetizer was good Tacos al pastor were okay, though the meat didn't have as much flavor as I'd like. They weren't bad by any stretch, just a bit underflavored and not a lot of food for the price.Chile en nogada was decent, although parts of the chili encasement were cold (interior was hot) and it would have been nice if some sides came with it. The meat mixture inside tasted good.Mostly we felt Soluna was a bit pricey for what you got, both in quantity and quality. If everything we ordered had been a bit cheaper, or came in larger portions, we'd probably give it 4 stars.", "Date": "2013-07-07", "Author_Location": "San Antonio, TX"}, {"Author": "Chris O.", "ReviewID": "EqjuZhGWRVNXqc6IZY2pvA", "Overall": "4.0", "Content": "Love it. Great food. The tacos de cabrito & skirt steak--yum. One of the nicest patios anywhere. If you're fussed about the service, have another margarita.", "Date": "2013-12-23", "Author_Location": "San Antonio, TX"}, {"Author": "Cyndi B.", "ReviewID": "9Jq41WEATtDL5d3R5ENb5A", "Overall": "4.0", "Content": "Great service & seems like the perfect date night restaurant. I've eaten here three times when in town on business & food has been consistently excellent each time.", "Date": "2014-02-19", "Author_Location": "Houston, TX"}, {"Author": "Andrew E.", "ReviewID": "VzSfbdTlp05D2gQCC6gjCA", "Overall": "2.0", "Content": "Great salsa! That's pretty much the only positive thing I have to say about this place. The carnitas were dry and flavorless. The borracho beans were mediocre. The price was completely unreasonable. I paid almost $12 with tax for lunch. I could've had better carnitas at Chipotle for $7.", "Date": "2014-02-24", "Author_Location": "San Antonio, TX"}, {"Author": "Natalie K.", "ReviewID": "Nm9uA2gpKrfzq0-J-de2iA", "Overall": "4.0", "Content": "We walked into Soluna when I was craving enchiladas verdes last Sunday, and I experienced very strong deja vu.  Initially I mistook this for low blood sugar.  Then I realized that the beautiful patio setting, the wonderful flavors, and the classy service were straight from another great local restaurant--Mirasol, up on Blanco near Bitters.  This food is fresh and flavorful without being greasy.  The enchiladas verdes had nice juicy shredded white meat chicken and came with fluffy seasoned rice.  We all know that the rice is a joke at  most Mexican restaurants, but at Soluna it's totally worth eating.  If you want to economize, the chalupas here are piled high with delicious ingredients--great if you want to sit on the patio with a margarita and a filling snack.  I remember a few other restaurants in this location in the Collection.  Pour la France and Chuy's come to mind.  But neither managed to create a relaxing and ambient patio in a strip mall facing a major thoroughfare.  It really is a bit miraculous.  Mirasol is very much the same, and the menus overlap as well.  We had no wait during brunch hours, attentive service, frequent refills, and hot, delicious food.  All in an atmosphere that the owners had clearly transformed from parking lot to oasis.  I can't wait to try to hit this place up for happy hour.", "Date": "2013-02-19", "Author_Location": "Frederick, MD"}, {"Author": "Eugene L.", "ReviewID": "lMTRjwCUv2bgmaJadmDysg", "Overall": "3.0", "Content": "When I read in the Readers' Choice section of the Express News that voters chose Soluna as Best Neighborhood Restaurant I told myself to come dine here one day.  Then a few months later I saw the Ancira commercial featuring Ernesto Ancira sitting next to the owner of Soluna.  It took me a little more prodding for me to finally come here after having two consecutive miserable Mexican food dining experiences. a few weeks earlier.  I finally arrived and noticed how much Soluna reminded me of La Fogata when it came of the exterior of the building.  While it seemed packed on the inside I still managed to find a seat.  Lo and behold, guess who happened to be sitting smack dab across from me, the owner of Soluna from the Ancira commercials!  A busser brought me my water and a basket of chips and not one, or two, but three salsas:  one red which resembled the watered down and bland tomatoey ketchup that passes for salsa here in S.A. , another which was green, the salsa verde and had more of a kick and last, orange habanero salsa which reminded me of the fiery, hot habanero salsa served at Chacho's.  I dipped my chips in the orange habanero and the green salsas, both were very good.  My waitress, Lucy, didn't smile when she got to my table.  My guess was that she was overwhelmed and had so many tables to serve and took forever getting to my table.  She took my order for a house frozen margarita.  I looked at Soluna's online menu and noticed the price was $8.50 but saw a $2.00 price increase on the restaurant's menu.  For a restaurant to charge almost $11 on a margarita , it better be worth it.  My margarita arrived and I placed my order for enchiladas verdes without beans.  Minutes later Lucy brought my enchilada verdes plate but with beans.  I had to remind her I specifically requested no beans.  Rather than offering a sincere apology, she just said \"Yeah.\" then took off and corrected the error but forgot to bring tortillas.  I had to remind another person I wanted tortillas with my enchiladas.  Later Lucy brought me flour tortillas.  The margarita was worth the price tag.  The glass was huge and really cold, not warm like the margarita glasses at Chacho's and the margarita was strong and tasted what a real margarita is supposed to taste like instead of that crappy excuse for a margarita I got at Taqueria Guadalajara over a week before.  The enchiladas verdes weren't as bad as the ones I had at Taqueria Guadalajara because they were generous with the green sauce and looked like real enchiladas instead of rolled tacos with melted cheese on top like the ones I had at Taqueria Guadalajara however they were far from the best.  The rice was okay.  The flour tortillas were small and not too thick but were tasty.  If it wasn't for Lent I would've ordered a dessert but I got a lemonade instead to help sober me up before I walked to the bus stop on my way home and had a second helping of some chips.  It would've been nice if the busser refilled my orange and green salsa bowls.  I ordered 4 more tortillas before hitting the road and was relieved to find out Lucy didn't charge me extra for them.  Guess it was her subtle way of apologizing for the slow and mediocre service I got earlier considering the fact that she was swamped with tables on one side of the restaurant.  I would give Soluna a second chance to redeem themselves.", "Date": "2014-04-07", "Author_Location": "San Antonio, TX"}, {"Author": "Jim F.", "ReviewID": "YIsTUCDtgooKPnwY-_9uFA", "Overall": "5.0", "Content": "My wife and I have been coming here for years. If you go during a cold, rainy day they give you a side of Fideos to warm you up. The food is always fresh and we have never left feeling dissatisfied.", "Date": "2014-02-12", "Author_Location": "San Antonio, TX"}, {"Author": "Susan S.", "ReviewID": "lH8oiOx_VrMSICrdDUQ24g", "Overall": "5.0", "Content": "Consistently excellent Mexican food, and unique enough to stand apart from the hundreds of texmex operations in the area. I've never had a bad meal here, and most have been delicious. Beautiful patio covered in greenery and the owner is often sitting at the front table keeping an eye on everything. Some favorite dishes other than enchiladas and standard fare: the barbacoa tacos on Sunday brunch are great. Chile en nogata is the best I've had. Even the ice tea they serve tastes great. Soluna has been one of if not the top Mexican food place in San Antonio for me for several years now. You won't be disappointed. Service is excellent as well.", "Date": "2014-01-05", "Author_Location": "Terrell Heights, San Antonio, TX"}, {"Author": "Juliana P.", "ReviewID": "LsarB5NkGM0BaxoDgTpg9w", "Overall": "4.0", "Content": "Awwwww Soluna. How much I love thee. Whenever I get a craving for some great, leaning towards the interior Mexican food, ridiculous paella (weekends only- Sunday to be exact), and the best chile en nogados I've ever put in my mouth, this is the place. Picture raisin seasoned picadillo stuffed poblanos drenched in a creamy sauce from heaven. Might I recommend the Platillo Mexicano? Margaritas. Check. Chips and salsa. Check. Pssstttt ask for the \"special salsas\". Enchiladas. Check. Everything. Check. I'm known to be a patio snob and this place has one of my fave patios in all of San Antonio. It gets packed so expect a wait during traditional busy restaurant times but its worth it.My only complaint is that some of the servers barely understand English and I've received the wrong dish before. Why would I order an Hongos Flameados quesadilla AND an Hongos Flameado bowl as appetizers mister server man?! Hello! But no fear, they were sweet about it. And it ate them both anyway.", "Date": "2012-08-17", "Author_Location": "San Antonio, TX"}, {"Author": "Tamara N.", "ReviewID": "Ayl_YSkIAusf6NxxomeMSQ", "Overall": "1.0", "Content": "Oh, HELL NO! Upon entering the restaurant, I was met with the smell of cigarettes and alcohol. Not appetizing to say the least. The bar is the first area that you enter when you walk into the restaurant. The decor is depressing, to say the least. There are hard surfaces everywhere so there is nothing to absorb the sound waves, which makes for a very loud eating experience. I ordered a diet coke to drink and was served a glass of ice and a can (what?!) of diet coke. The coke tasted odd so I looked at the date on the bottom of the can and it had expired! I ordered chicken enchiladas with poblano cream sauce. Now, I am thinking cream sauce should be white. I understand that the poblano peppers added to the cream sauce may cause it to be a tint of green. However, I was not prepared for what lay on my plate. It was more like a puree of poblano peppers than a cream sauce. It had the texture of baby food, not sauce. The taste was not much better. It was very disappointing.The service did not help either. The waitress barely spoke to us and never smiled. My twelve year old son even commented on the poor service she provided.Needless to say, we will not be returning to this place!", "Date": "2009-01-24", "Author_Location": "San Antonio, TX"}, {"Author": "Aliyah K.", "ReviewID": "XTGs4n1ELQZq0Nmq5rVuig", "Overall": "1.0", "Content": "I have been here two times, I suppose in 2006 and 2007. Both times have been with parties of 12-14 people. Perhaps the staff is simply not trained to take care of a larger table because service both times was downright awful.The drinks are strong and delish. The service is slow, water is not filled up, plates are not cleared and attention is just lacking - extra napkins, need a slice of lemon, a side of sour cream - forget it. Checks took nearly a half hour and I ended up getting my meal (and my husbands) comped after telling the manager there was no way I was paying for a meal that I had been trying to pay for for nearly half an hour.  I would have just left had we not been with a large group of hubby's co-workers.Anyway, the cheese enchiladas have carne sauce on them, this is not written on the menu though, not a pleasant suprise for a vegetarian. Not to mention that I had asked what the beans and rice were cooked with, if they were cooked with any pork, chicken broth etc. - so some idiot waiter checks on that, and then brings the meal with meat sauce - duh.", "Date": "2009-12-11", "Author_Location": "San Antonio, TX"}, {"Author": "Michael S.", "ReviewID": "l7qXDkN0Dj_BM7Q6pwIbDw", "Overall": "3.0", "Content": "You know that scene in Evita where Madonna -er- Evita goes to the polo club, I felt like that a little bit tonight when I went to Soluna on Broadway. Everyone but us seemed to be wearing their fine summer linen. I guess you get that when the restaurant is in Alamo Heights.  I felt like I should have walked in the back door with the kitchen help.  This feeling was all my Sh*t because the wait staff were very friendly and made us feel right at home and the diners could have cared less how casual we were dressed.  Hey, it was a Sunday after all. Last time I was at this joint it was a Chuy's.  Yeah I know that was ages ago but to be honest I knew this place was a sister restaurant to a place I have never really enjoyed:  El MiraSol so I never cared to find out about the cuisine.Tonight as I fulfill a Tour de Broadway requirement, I was in for a good culinary experience.I had the shrimp enchiladas with cilantro creme including plantains and white rice.  The presentation was excellent.  First impressions count and I was enamored with this beautiful plate but my first bite into the enchilada and I had a mouth full of fishy fish. My second and subsequent bites and all was redeemed.  The dish was very tasty.  The cilantro sauce was very nice.  I must have the recipe.OK I will say it, this place was pricey. As a Latino I know how simple Mexican recipes really are so you needn't charge me $17 for two enchiladas even when they are shrimp enchiladas.  These are desperate times so we need to be more aware of our pocketbook.  Perhaps I will try this place for lunch again but for now I need to put myself on a financial diet and eat out only for special occasions. I'm a pretty good cook after all.3.4 Stars out of 5", "Date": "2010-06-09", "Author_Location": "San Antonio, TX"}, {"Author": "Olin S.", "ReviewID": "Wuiu1sRKhm1Cwdz7WJs9mg", "Overall": "2.0", "Content": "Over priced, second rate mexican food.", "Date": "2013-08-09", "Author_Location": "Northern, CA"}, {"Author": "Jessica B.", "ReviewID": "oKrb35KHz4Q36BR23TNbzQ", "Overall": "4.0", "Content": "Had a great lunch on the patio this Sunday afternoon...drinks perfect, food even better and service was right on!  It's great patio weather right now", "Date": "2012-03-11", "Author_Location": "San Antonio, TX"}, {"Author": "Jess F.", "ReviewID": "qBoSC05qpk--6yZyx4G13Q", "Overall": "4.0", "Content": "This place is not far from my house and every time I drove by, I kept saying \"I need to try this place...\" Well, I finally did, and, I was right. Walking in, you immediately realize that it is not your average mexican restaurant on the corner. Nice outdoor patio with low lighting and lovely plants and fountains. Inside, also well decorated and ambient. This prepares you for opening the menu and seeing a higher priced menu than average.The meal started with your usual chips and salsa. The salsa was pretty good but nothing to write home about. Chips were warm, crisp, and not too salty. Bonus. My friend ordered the queso with carne which was definitely good, but again, nothing spectacular. We ordered a couple mixed drinks, both of which were very good. A little on the dangerous side possibly, great tasting and not weak at all.Then, the entrees arrived. My enchiladas verdes had more flavor than I could have ever asked for. They were simply delicious. The seafood enchiladas in a white wine lobster sauce were also amazing. Yum! The only real down side I would mention would be the waiter. Not friendly, not attentive. We never had to go looking for him, but did think about it a couple times before he showed back up. Definitely will be going back here.", "Date": "2010-08-29", "Author_Location": "San Antonio, TX"}, {"Author": "Emily F.", "ReviewID": "PQS2ldwh8qfvXq68AE7GRg", "Overall": "3.0", "Content": "So I may have been mad that my family and I had to wait so long for a table. HOWEVER, the drinks were lovely, the staff treated me like gold, and the food was not something to shy away from. Will I make a special trip to San Antonio for this? Likely not, but I would go if the opportunity came up! Order the house margarita, sin sal, con hielo. ARRIBA!", "Date": "2011-03-27", "Author_Location": "Waltham, MA"}, {"Author": "K H.", "ReviewID": "luyEgdg387jRnmHgH0jxMw", "Overall": "5.0", "Content": "My friend told me about how amazing Soluna was, and I had to give it a try. She suggested me to make sure to get the orange salsa (habanero), and the Soluna Enchiladas. They actually have three types of salsa; roasted (you get by default), habanero, and verde. They are all so soo sooo good in their own ways!!! Someone really knows how to make salsa.... it's like no other place I've ever been, and trust me I know my salsa (not to mention the chips are warm and fresh). So far I've had the Soluna Enchiladas (all shredded chicken; 1 chipotle sauce, 1 poblano sauce, 1 cilantro sauce) and the Enchiladas De Mar (seafood w/ lobster sauce) and they were both to die for. Also have had a margharita there and I loved it, not too strong but definitely not too weak. Not to mention the atmosphere of the place is also two thumbs up. Overall, 5 stars, quality all around. New favorite mexican food restaurant, I'm actually going to go for my birthday dinner. :) So glad I found you!", "Date": "2014-03-20", "Author_Location": "San Antonio, TX"}, {"Author": "Jamie B.", "ReviewID": "_MPj97Stve2N0R0qzVrP6Q", "Overall": "2.0", "Content": "Excellent Tex Mex but, unfortunately, the food & superb margs are always overshadowed by the deplorable service. Each visit to Soluna Includes us working with about 3 different staff members, including bus boys, just to get the bare minimum. If it wasn't for the amazing margs (limit 2!...not really, but strongly advised), delicious Lobster enchiladas, and refreshing iced tea, we'd be hard-pressed to head back.Oh and beware of the priciest fajitas in town - while the price screams gourmet, the taste is reminiscent of Taco Cabana. Certainly not what we bargained for.", "Date": "2012-03-11", "Author_Location": "San Antonio, TX"}, {"Author": "Cliff B.", "ReviewID": "RwaEwg0F371Ti2XJ-6_W6A", "Overall": "3.0", "Content": "You are not going to leave this place full, but you'll likely leave broke. The atmosphere & service were great.  Margarita was somewhat disappointing. The food was pretty good, but the pricey portions are skimpy.  Even with the great patio & ambiance, when I got my bill  I felt gouged, and is why I only gave Soluna 3 stars.", "Date": "2011-04-26", "Author_Location": "New York, NY"}, {"Author": "Kassi L.", "ReviewID": "RSmcJ7Wr5JS0o8uaqm2hAQ", "Overall": "4.0", "Content": "My friends and I come here ALL THE TIME. Same goes for El Mirasol (sister restaurants). They both get the same review.Their Mango Margaritas are delicious. Be careful! You only need about 2 and you have a pretty good buzz going. Fresh slices of mango are added to the glass for a nice touch.If you like spicy food, try the Chipotle enchiladas. If you want variety, try the enchiladas Soluna (a trio of three enchiladas with three different sauces). Both are cream-based and delicious. Salsa is delicous. They even sell it at HEB.I've been here a million times. I'll continue to come back here. At the very least for some Mango Margs!", "Date": "2010-11-02", "Author_Location": "Austin, TX"}, {"Author": "D D.", "ReviewID": "Q0oJtKC7dsgrO6Bw174dug", "Overall": "5.0", "Content": "Excellent meal and attentive service despite being very busy.  Our waiter stayed right on top of everything from start to finish.The food is very good - some of the best we've had in San Antonio.  I love the chile nogada but I've never had anything that wasn't excellent.  The gorgeous patio and expertly made drinks would be worth the trip all by themselves.", "Date": "2011-04-14", "Author_Location": "La Honda, CA"}, {"Author": "Vik S.", "ReviewID": "YOB63xXHTAHz4l2VLkYcQw", "Overall": "4.0", "Content": "Had the cabrito. All I can say is it is INCREDIBLE. The meat is so tender it's unbelievable. Will go back.", "Date": "2013-08-22", "Author_Location": "Houston, TX"}, {"Author": "Renee W.", "ReviewID": "pqBMdEl82jVABt8jp4YxVw", "Overall": "5.0", "Content": "We eat here at least once per week as both a family and with friends. Great atmosphere, family friendly and one of the best patios in town. The food is always excellent and the chispa is by far the best margarita in town. The service is also some of the best. We love SoLuna!", "Date": "2011-04-13", "Author_Location": "San Antonio, TX"}, {"Author": "Ryan M.", "ReviewID": "pOVu7MwpBUAr261dipKHmw", "Overall": "4.0", "Content": "A little on the pricy end but that is my only complaint. The lobster quesadillas are to die for. The Chispas are delicious. Service is quick and attentive. Good date spot.", "Date": "2013-05-12", "Author_Location": "San Antonio, TX"}, {"Author": "Casey L.", "ReviewID": "GItqlzWHDTlseAuGeAcDzA", "Overall": "3.0", "Content": "The food at Soluna is good, but the service could use some work.The patio at Soluna is nice enough, the decor isn't bad and they make pretty good Margaritas. I'm not really a fan of their chips - they're baked chips that use flour tortillas instead of corn which makes the texture a little weird. The hot sauce is great though. The food is good but a little overpriced in my opinion. I was in for dinner tonight and the service has really gone down hill lately. I don't remember the service being that bad on previous visits but this time it was no bueno.", "Date": "2009-12-21", "Author_Location": "San Antonio, TX"}, {"Author": "Krystal A.", "ReviewID": "cyet35-RS2PhYO5bZuAbvw", "Overall": "4.0", "Content": "I've been back many times for dinner and drinks and had to up the place to 4-stars since my last review only pertained to lunch. The patio is divine. On a cool night you can sit out there under heat lamps, but on the hottest of summer days it actually stays pretty cool and comfortable. Combine the beautiful atmosphere with some of their signature cocktails (skinny margaritas, ftw!) and you have a great start to an amazing night.Service is great. The waiters are friendly and work swiftly to bring your food or refill your drinks. The place is a fun sort of relaxed vibe but still just dressy enough that you could throw on some heels if you want to. It's been a great choice as a place to begin some fun evenings lately!", "Date": "2012-02-08", "Author_Location": "San Antonio, TX"}, {"Author": "Sonia S.", "ReviewID": "NNOf_JDcnX_u2CFy7iaGdg", "Overall": "5.0", "Content": "They have the best chipotle salsa, and the enchiladas were amazing. We left there wanting to come back for more.", "Date": "2013-06-19", "Author_Location": "Olympia, WA"}, {"Author": "Ryan S.", "ReviewID": "_rnwiICO1-GZughpazCLuw", "Overall": "2.0", "Content": "The only thing saving this place are its curiously strong margaritas and tacos nortenas.The service is terrible, the interior mexican fare very ordinary.  Its sister restaurant, El Mirasol on Blanco Road, has the same menu and is infinitely better run.  Go there.  The nachos are scrumdidlyumptious.", "Date": "2009-12-11", "Author_Location": "Austin, TX"}, {"Author": "Colt V.", "ReviewID": "M-cJuOgM106m4H6MaPcRcw", "Overall": "2.0", "Content": "The restaurant appeared to be staffed with an adequate number of people, but my actual server was more or less non-attentive. He had to take out drink orders twice, did an OK job after-wards....I ordered Tacos Al Carbon; They were \"Hum Drum\", under whelming, spicy, but with no character, meat was a bit chewy but OK otherwise. The Mojito was very limey, and hardly minty.Atmosphere is decent. Fresh flowers on the table is nice, but nothing notable on this front either.General experience is definitely, \"Meh.\". Prices are very high for the level of service and quality of food. You leave feeling like you paid to eat in a particular area of town, not good food.", "Date": "2010-06-15", "Author_Location": "Somerville, MA"}, {"Author": "Adrian M.", "ReviewID": "yE-CE82KTQzwlf8L1tUdmA", "Overall": "3.0", "Content": "I was there on a Friday night so it had a nice crowd no wait. First off the margaritas are not very good a little artificial. I don't know but if you pay upwards of $11-12 for a margarita it should be good. Food the pork guisada was awesome if you like Celentro. The Fajita good but not over the top.Service our waitress was super nice but a bit slow. All in all ill be back since the atmosphere is so nice. Out of towers would like it", "Date": "2011-04-06", "Author_Location": "San Antonio, TX"}, {"Author": "Rebecca g.", "ReviewID": "Bt6BSjj8aXWk1lOLn-loCQ", "Overall": "4.0", "Content": "SoLuna boasts tons of great authentic Mexican platters, all of which are amazing. I've never had a bad meal there. Take out of towners here for the real mexican food of san antonio. However, the jewel of SoLuna is its incredible,fabulous, light & refreshing margarita chispa. I've traveled long and far and have never met a margarita to rival the chispa.click here for more info on the chispa!thenudecanvas.blogspot.c…", "Date": "2011-07-22", "Author_Location": "San Antonio, TX"}, {"Author": "Zeenat H.", "ReviewID": "x10mqbmo0pJQ_hvASroTCA", "Overall": "4.0", "Content": "We visited this little Mexican joint while in town visiting a good friend. Our awesome waiter, Eduardo, bragged the place was recently crowned the Best Mexican Restaurant in all of Texas. While it may not quite live up to that moniker, it offers some delish enchiladas and other TexMex concoctions. The real jewel of this place are the killer margaritas, however. Rumor has it they throw in more than a splash of everclear and after our meal, I believe it. Easy parking, and an interior that's festive and homey if not all that refined.Overall, a great spot with a good vibe, super friendly waitstaff, and solid cuisine (and even better drinks).", "Date": "2012-02-14", "Author_Location": "San Francisco, CA"}, {"Author": "Andrea M.", "ReviewID": "xSiHs_evBibU1g0ISIWL6A", "Overall": "4.0", "Content": "the food is a little on pricey side but that what you can expect for an 09'er. Drinks are delish and the food is tasty.", "Date": "2013-06-16", "Author_Location": "San Antonio, TX"}, {"Author": "M. C.", "ReviewID": "XNt20pSHPO1iW9lb9eVvfw", "Overall": "5.0", "Content": "Great place.  We're here once/week at least.  Always seem to be able to get in without reservations which is a plus esp on busy Fri-Sat nights.  Patio very pleasant with heaters for cold months (except on those rare occasions someone's smoking, but unless it's super crowded you can move tables). Most of the food is excellent (steaks, enchiladas, salads, chile en nogada, queso, etc.) but there are a few things not to my taste -- YMMV so I won't name specifics.  Housemade tortillas are fantastic -- it's a sad couple of weeks every year when Margarita the master tortilla chef (yes trufax, that's her name) goes on vacation & you're stuck with storebought tortillas.   Drinks are excellent.  Service is quietly friendly if not especially polished (but it's not a super formal kind of place, thankfully).", "Date": "2013-01-13", "Author_Location": "San Jose, CA"}, {"Author": "Michael F.", "ReviewID": "JiiL-v52CNsarPyCjH8CQQ", "Overall": "5.0", "Content": "Great service, really god and strong top shelf Margaritas and the Guisado Ranchero is very good", "Date": "2013-08-13", "Author_Location": "Glendale, AZ"}, {"Author": "Andrew G.", "ReviewID": "gHneCvLSbHVNIWEfNjMaBQ", "Overall": "4.0", "Content": "Upon entering for lunch Saturday were greeted just inside, the place was busy, but not near capacity, our greeter seated us immediately and took our drink orders.  We sat on the patio which was nice, covered in shade, the Texas summer heat had not kicked in just yet that day.  The greeter brought us water, and our waiter showed up about 30 seconds later with our drinks... service throughout our meal was great.Enchiladas Mirasol were great, the Guac was very good.  My wife ordered Un Poquito De Todo (a freakin huge combo plate that I'm certain would have fed us both).  I tasted the borracho beans were savory with bacon and cilantro, I could make a meal of just those. The price is a little steep for TexMex but I'll be sure to visit again next time I'm in town.", "Date": "2012-07-08", "Author_Location": "Mansfield, TX"}, {"Author": "Shana H.", "ReviewID": "lN2KL43fNf41-i9BnB9o_g", "Overall": "4.0", "Content": "I am a huge fan of margaritas and thought La Fogata  had the market cornered on margaritas in San Antonio. Went out for margaritas before the Spurs game, and So Luna's margaritas rivals La Fogata. They were excellent. Had a nice little patio area, and we sat outside. Had some appetizers. They were also good. But Definitely Try their margaritas.", "Date": "2013-02-18", "Author_Location": "San Antonio, TX"}, {"Author": "Mary S.", "ReviewID": "EXZ6Twm5esj4Y2lneErVGg", "Overall": "2.0", "Content": "It's Mexican food in San Antonio, something anybody who lives here should be VERY familiar with.  Service was attentive enough.  Food was average, at best. Presentation of food was very unimpressive.  My order consisted of 3 small taco's with re-fried bean and beef filling, a few shreds of cabbage, a whisper of tasteless tomato and an equally thin slice of avocado.  No sauce served with this, no rice, no little cup of beans, not so much as a sprig of parsley,  cilantro or wedge of lime on the plate.  And that was an inexpensive choice at $11.50!  Food's  really just ok, location convenient, prices very high for what you get.  You can do better in this town.", "Date": "2014-02-07", "Author_Location": "San Antonio, TX"}, {"Author": "Tom R.", "ReviewID": "KlrpQ_NT-SSM26mSKsAY1Q", "Overall": "5.0", "Content": "My favorite is the Cilantro Salmon. I'm craving it right now, but I haven't been in awhile.There are also some interesting drinks at the bar that could be authentic Mexican mixs, because I haven't had them anywhere else.", "Date": "2007-09-20", "Author_Location": "San Antonio, TX"}, {"Author": "John-Raymond B.", "ReviewID": "XJ0xolEMYJeoslcSVajsdQ", "Overall": "4.0", "Content": "I would have given 5 stars but service was lacking. Maybe they were short staffed. The food is great. Love the ambience and my fiance loves the margaritas.", "Date": "2013-05-01", "Author_Location": "San Antonio, TX"}, {"Author": "Brad S.", "ReviewID": "kcsVSUEjaFyNyy8ZiTHlVA", "Overall": "4.0", "Content": "Wow!  Always good. Visiting the rents and we come here during most visits. Just SOLID!", "Date": "2013-05-05", "Author_Location": "Marshall, MN"}, {"Author": "C N.", "ReviewID": "Snj5oRZFsbHpq3ROhhQ44Q", "Overall": "5.0", "Content": "Excellent.  I love Soluna and El Mirasol. I think it's the best Mexican food in SA...right up there with Rosarios.  The food is tasty without being fat laden and heavy on the stomach.  The Margaritas are superb too!  I think Soluna has a bit more ambiance than El Mirasol,, otherwise they are pretty equal.  I also find the service very good...but beware, these are not high volume sit-eat-go kind of restaurants.  Take your time and enjoy.  Also, I think Soluna is great for kids...we had a ceviche appetizer and our waiter included some complimentary queso and chips for my five year old.  Very thoughtful.  So if you want great Mexican food in SA, look no further.", "Date": "2012-08-18", "Author_Location": "San Antonio, TX"}, {"Author": "Jim N.", "ReviewID": "QcdS0dBEatv7PQlTvP2mmg", "Overall": "4.0", "Content": "Yum. We rarely have to wait here even though it always seems busy. I can heartily recommend the lobster enchiladas, which I found pleasantly creamy and light. I've had them on two separate visits and enjoyed them both times. I know I have had other things in the past, but these were my most recent meals. No problems with the sampler plate my wife got, either.", "Date": "2012-08-14", "Author_Location": "San Antonio, TX"}, {"Author": "Mark C.", "ReviewID": "RVpWBW8ZdQvnMbvEhjTVKg", "Overall": "3.0", "Content": "Funny, this place was my favorite restaurant. However, I find myself questioning it's overall vibe now? They use to pour a generous portion of wine, now when the waiter brought me my wine it looked smaller than the average restaurant. I even made a comment to the waiter, and he told me, \"Yes, we are pouring less and charging more!\", try $9 a glass! I told him,\"Come to think of it, I will have a Heineken!\" To make matters worst, we had to wait almost an hour to get our food. The patio is a nice people watching space, but so is North Star Mall. My food was marginal and pricey. My bill came out to $30 dollars including tip, and I thought to myself maybe it's time to get that E-Trade account after all and start enjoying the Joys of Cooking at home. I have been going to this place for a year, and it seems like Soluna and I are in need of a divorce. Give it a Fair Rating, but I gave Popeye's a Fair Rating too, \"Non-Experience.\" Going from Good to Fair....and that ain't a good thing.", "Date": "2013-12-01", "Author_Location": "San Antonio, TX"}, {"Author": "Elizabeth W.", "ReviewID": "oO9yv4YoYFIs0L3Uhq_1QA", "Overall": "3.0", "Content": "Distinctly average, especially compared to its sister El Mirasol. Food average - some dishes good some lukewarm, drinks average - the mango in my margherita was frozen in clumps - and an inexperienced waitress.", "Date": "2013-01-20", "Author_Location": "San Antonio, TX"}, {"Author": "Carol W.", "ReviewID": "OZuwrLH76aarHw899Ino1A", "Overall": "3.0", "Content": "Ahhh, Tex-Mex!  I went here with my mom and sister during a recent visit to San Antonio. It was close to where i was staying...When I can find them, I usually choose to go to restaurants that have gorditas. This was no exception. But let's start with the drinks. I got a margarita (naturally). It wasn't anything special. Perhaps a little to much mix (this is why FRESH is best). The chips were a little stale, but the extra spicy salsa was definitely spicy (just the way I like it). The gorditas:  they were good just not great. The pork was tender, but the tortilla was a little dry rather than moist and well - greasy (if you fry, there is gonna be some grease!). All in all mostly a 2.5 rounded up to a 3.  Service was good, food was edible, but not worth going to again.", "Date": "2011-12-12", "Author_Location": "Alexandria, VA"}, {"Author": "Sarah M.", "ReviewID": "cHlhFaxzHNiRku9hy0Obhw", "Overall": "3.0", "Content": "I have to say I wasn't entirely impressed with Soluna. I went there for a late lunch one day and sat outside. The patio area is nice but could probably use a tune up seeing as though it sits on the corner of one of the busiest streets in San Antonio. The drinks were good but pricey. For the amount I paid for a margarita I would assume it to be a little better. The decor on the inside was something I didn't pay too much attention to since I was escorted to the patio so quickly. The prices for the food are a little much for the kind of food you get. It's a typical Tex-Mex restaurant. I can say honestly that I've only been there a couple of times so I would definitely give it another chance. I would also love to hear other people's opinions about it. Perhaps I caught it on an off day.", "Date": "2009-09-11", "Author_Location": "San Antonio, TX"}, {"Author": "Eliza B.", "ReviewID": "t_EdmEevz69w8QT38OnXVA", "Overall": "4.0", "Content": "I love this neat little gem and their abilities to not only do Tex-Mex (enchiladas, etc)  but to also offer up traditional foods from Mexico (chile en nogado).  They somehow manage to strike a  balance and execute both to perfection!", "Date": "2012-02-18", "Author_Location": "Houston, TX"}, {"Author": "D C.", "ReviewID": "ALxCRUfmqL4-KkR6yir8cA", "Overall": "5.0", "Content": "I love this place. Its my favorite restaurant in San Antonio.  The people who work there are awesome. The food is amazing. The ambiance is great. Its a fun environment.  I always bring people here and they are never disappointed.  Their sister restaurant El Mirosol is just as good. I just like this place a little better.", "Date": "2013-10-15", "Author_Location": "San Antonio, TX"}, {"Author": "Monica M.", "ReviewID": "Jt6QixyecZKmfF_cOW5erw", "Overall": "4.0", "Content": "The food here is quite delicious. I had the tacos al carbon, a small yet flavorful dish. Just the right sized portion for me. The food came out very hot and very quickly. The waitress never let our drinks run low and was only a hand wave away whenever we needed anything. Definitely first class service. They have a wide selection on their menu which made it hard for me to decide what I wanted so I'll definitely be back soon to try something else out. Great place... wish I knew about it sooner.", "Date": "2011-05-29", "Author_Location": "San Antonio, TX"}, {"Author": "Roxanne R.", "ReviewID": "YoO_QrXImZrCu0y_jLuWeQ", "Overall": "2.0", "Content": "So Friday night I decided to give Soluna a try. We were able to get right in at 7pm, even though the restaurant was very busy. Our server was frazzled but friendly, although I did overhear two tables next to us complaining about how long they had waited for food. The Chispa Magarita I had read so much about was just so-so. Sorry, but I could not really tell the difference between that and what you would get at Marthas down the street for $6 cheaper. The guacamole we ordered that was almost 8 dollars came out on a dinner plate and had been mashed down with a fork (the prong marks were visible). It was about 1/2 of an avocado worth-very disappointing. The shrimp tacos my guest had were so so, but the enchiladas a la Antigua I got were HORRIBLE. The sauce was heavy and tasteless-just an all around disappointment. Next time I will save about 50.00 and go down the street to Betos where the food is MUCH better. Overpriced for sure.", "Date": "2013-11-18", "Author_Location": "San Antonio, TX"}, {"Author": "Paul C.", "ReviewID": "f7DqS6ZeWBEsGx6fHjd0-A", "Overall": "5.0", "Content": "Very relaxed and fun atmosphere. I really enjoyed talking to the staff they are helpful in recomending what to order. I ordered the Salmon and Spinach Salad. It was delcious. A very nice porton of Salmon. My GF ordered the Red Snapper Vera Cruz. Oh my spiced up and served just right with rice and steamed vegetables. We also had the Mexican Coffee which has Kalua and Whip Cream very good and a Guava Empanada. We really enjoyed it and recomend it to everyone. I hear that the Paella on Sunday is really good.", "Date": "2012-11-19", "Author_Location": "San Antonio, TX"}, {"Author": "Greg M.", "ReviewID": "e9swdH3kZ-20z2RZry5Mkw", "Overall": "5.0", "Content": "Everything on the table was... well, muy bueno!!! Chips, salsa, guacamole, enchiladas mole, and those enchiladas Soluna... amazing! Great service, ambiance and \"talent\", to match.  This was the first stop on my \"foodie tour\" of San Antonio, and it didn't disappoint.", "Date": "2012-06-23", "Author_Location": "New Orleans, LA"}, {"Author": "Monica L.", "ReviewID": "KqhREC34cpKa_Mmemrymnw", "Overall": "1.0", "Content": "Hubby and I tried this place Monday night.  Thought it would be great as it was pretty packed out for a week night.  I ordered the tortilla soup which sounded great - ingredients listed included sliced avacado, chicarrones, queso blanco and tortilla chips.  What I got was barely warm tomatoe chicken soup with all the other ingredients cold on a separate plate.  I don't expect to have to assemble my own dish when I go out to eat.  My hubby ordered the cabrito tacos and they were not very hot and bland. Service was slow too - probably had to do with the fact that we didn't order drinks and she a large group she was taking care of at another table. I wouldn't recommend this place if you are looking for great mexican food - the drinks looked good so maybe for those.", "Date": "2013-10-22", "Author_Location": "San Antonio, TX"}, {"Author": "Curtis L.", "ReviewID": "iRlLcoWLYIv38D6Q7PGZ8w", "Overall": "3.0", "Content": "No mole..no sweet tea..no paella...no problem. I ended up ordering the snapper with vegetables and white rice with a coke since they didn't have any of the aforementioned items. The fish was good but nothing to write home about . The vegetables and white rice were really tasty I just wish they would have put more on my plate :) . I heard a lot of good things about the mango margaritas but the waiter mistakenly sent my wife a regular one so I guess we will need to try it out on another visit. The prices were a bit steep for Mexican food but the wait staff was great.", "Date": "2011-01-17", "Author_Location": "San Antonio, TX"}, {"Author": "Logan V.", "ReviewID": "rcMGmJ-CUWWREpedLD6Yrg", "Overall": "3.0", "Content": "I had the asada mini tacos and they were superb. Maybe... a little too superb! They came artfully placed on a cute plate drizzled in goodness and lime and ready to be devoured by the mouth that is mine... I obliged then swallowed them down with two platinum martinis! The prices were good, the music and atmosphere were great, my service lacked a quite a bit but once it got started ( as in once I went up to the manager who sat us and then asked him after 10 minutes  if someone was going to wait on us) yes it was good after that! I will definitely be back to give it another shot! :)", "Date": "2012-03-27", "Author_Location": "San Antonio, TX"}, {"Author": "Colette E.", "ReviewID": "xvXBIewz0fVKQ4QqabVy_A", "Overall": "5.0", "Content": "Love this place, but don't go very often because it's expensive.  I really like their margaritas, the patio and mariachi band.   Chips and hot sauce good and pretty pink flowers on patio.  Spinach salad is good and so are the nachos of course.", "Date": "2010-04-14", "Author_Location": "San Antonio, TX"}, {"Author": "Thefoodie F.", "ReviewID": "rhi3xEWOpnVrJdxk2fPY3A", "Overall": "2.0", "Content": "What is the buzz on this place some say it is the best Mexican food , don't see it. But killer salsa ,service was very good ,OK could have had a off day Chipotle enchiladas were just so so , BUT SALSA MAY BE ONE OF San Antonio's best", "Date": "2011-04-03", "Author_Location": "New Braunfels, TX"}, {"Author": "Carlos G.", "ReviewID": "eWzxOZYnt9CJ_euj2sX6WQ", "Overall": "4.0", "Content": "Food is really good but overpriced in my opinion. Service is hit or miss.", "Date": "2012-07-06", "Author_Location": "San Antonio, TX"}, {"Author": "Gene B.", "ReviewID": "5doIUuZfoVxRrbWOcrA7CA", "Overall": "4.0", "Content": "Great restaurant. Awesome service from the manager and my waiter. They checked me 12 times at least!Great salsa. Great Tacos al Pastor!", "Date": "2012-09-29", "Author_Location": "Austin, TX"}, {"Author": "Ray R.", "ReviewID": "7SDiRUtFEyRiSNZT4ITXGw", "Overall": "4.0", "Content": "Very good environment and really nice out on the patio with all of the shaded plants and trees. I had the enchiladas verde, which I'm very particular about but they were on point with these. Perfect for lunch and their mango margaritas are the best. Perfect for going to lunch since it's not pricey at all. Not sure about dinner though.", "Date": "2011-05-11", "Author_Location": "San Antonio, TX"}, {"Author": "Melissa W.", "ReviewID": "zQ_-AL1o99qFDmtxA95b-w", "Overall": "5.0", "Content": "Great patio dining! Especially great atmosphere when the mariachi bands are playing! Great authentic Mexican food.  Try a  \"chispa\" margarita!", "Date": "2011-06-27", "Author_Location": "San Antonio, TX"}, {"Author": "Elizabeth L.", "ReviewID": "9my5UIasuzryLyiNAX2bMg", "Overall": "5.0", "Content": "OMG is all I have to say about Soluna. I stumbled upon this place while on a one day trip to San Antonio. Everything about this restaurant is amazing. I came in about 20 minutes to closing and they welcomed me with friendly smiles and encouraged me to stay. This is the best Mexican food I have ever had. And the margaritas are amazing. The combo of off the chats food and super friendly service had me back a week later on my 2nd visit to San Antonio. I drove totally out of my way to eat here again and was not disappointed. The staff even remembered me!! Thanks Juan!!", "Date": "2012-02-02", "Author_Location": "Portland, OR"}, {"Author": "Gregg V.", "ReviewID": "PE1rmbBG5b1TyXv_vD3FvA", "Overall": "5.0", "Content": "The first time I walked in with my wife to try this establishment, a gentleman by the front (who at the time was the owner...unbeknownst to me) took note of my Atlanta Braves polo and took the time to chat about the team and the retiring of Chipper Jones. I explained we had just moved to the area, so I thought he was kind enough, and just making conversation. We came to find out later in the evening that after eating a fantastic dinner and having great dessert, that he had our meals completely paid for - all because he wanted to welcome us to Alamo Heights. Needless to say, he won two customers for life.", "Date": "2013-01-10", "Author_Location": "Atlanta, GA"}, {"Author": "Whitney F.", "ReviewID": "a38SYuyriXZh7rIhKAJ2tw", "Overall": "4.0", "Content": "The food here was supremely delicious and they seriously make the tastiest/stoutest margaritas EVER. I started off with the coconut margarita and the ceviche. The margarita was excellent and the ceviche was good but it had a weird presentation. It came in what looked like an old-fashioned sundae dish which made it a little difficult to scoop out. But overall, it was good. Then for my entree I had the chicken mole. The chicken was delicious, but for me the beans and tortillas really stood out. I seriously dream about those amazing tortillas! And if you can manage to save room for desert then definitely get the empanadas de guayaba. Holy cow, it was yum! If I'm ever back in San Antonio, I am definitely hitting up Soluna again. It was truly a great meal.", "Date": "2009-03-14", "Author_Location": "Newbern, TN"}, {"Author": "Rob A.", "ReviewID": "skq_23n4bKJYGU5e7unYIA", "Overall": "5.0", "Content": "Soluna! They greet you as if you are long lost family. Service is outstanding ! The food , even more! I say  Go! Go to where you are welcome and have superior meXican food  in a beautiful tropical environment.  My husband and I love this place . we visit at least 3 times a week .", "Date": "2011-11-26", "Author_Location": "San Antonio, TX"}, {"Author": "Jonathan S.", "ReviewID": "GpGlx_9V5UjxwqwuR8yxDg", "Overall": "5.0", "Content": "Three stars overall for this restaurant?!?  Are you kidding me?!?  This is the best MEXICAN restaurant in San Antonio.  If you are expecting TEX-MEX crapola, do a 180 when you get to the door of Soluna, throw a rock in the air, hit a nearby Tex-Mex restaurant, and go there to get your grub on.  A good friend of mine, from Toluca, Mexico, who is a graduate of the Culinary Institute of America and a chef in town, recommended this place to me.  I could not have been more pleased with the food or the service.  Based upon my friend's recommendation, I ordered the Soluna Trio Enchiladas.  This plate consisted of a delicious poblano, chipotle, and cilantro enchilada.  To my surprise, my favorite by far was the cilantro enchilada.  As an appetizer we ordered the avocado crab meat with caviar appetizer, based on previous Yelp reviews.  That was very yummy, as well.  A highlight of the meal for me were the salsas.  We tried three different kinds that included a roasted chipotle salsa (similar to Rosario's), a roasted red jalapeno salsa, and what appeared to be a spicy tomatillo salsa.  They were all fantastic, but the roasted chipotle and the roasted red jalapeno were definitely the best of the three.  In addition, our waiter, Omar, could not have been better.  Being very attentive without being annoying is a acquired serving trait and he definitely has it.  Not to mention, we were given a complimentary dessert, which I believe was the empanadas de guayaba.  Although we were full from the meal, we ate every last bite.  The only knock I can give against Soluna are the prices, but considering how wonderful the food and service is I can make an exception.  Thank you, Soluna, for an incredible dining experience.  I will be back to try your mole next time!", "Date": "2011-02-14", "Author_Location": "Olmos Park, TX"}, {"Author": "mrk t.", "ReviewID": "wYzuJ_47Hj_OX_KdnVFfPw", "Overall": "5.0", "Content": "Decided to try Soluna after seeing a writeup in Texas Monthly.  I don't typically rely on reviews by magazines, since my experience has been nothing like what the magazine experiences.  In short, this one is going into the GPS as a favorite, and we liv in Austin!!!  Our experience was great. We were there for lunch, and I have to admit, the initial greeting after being seated was longer than I am used to.  They did take our order and all was forgotten.  The service was excellent, everything from keeping the drinks full, to making sure we had plenty of chips, salsa and tortillas.  Their main salsa while not very spicy, was really good.  Our waitress offered two additional salsas which she claimed were much hotter.  We tried those, one orange in color and the other was green.  Both of these additional were equally tasty.  They were not that much hotter in spiciness, but it didn't matter, they were really good.  I had the Carne Adobada, and honestly this is the best I have had in a really long time.  I wouldn't hesitate to order this again though menu has a lot of other tempting dishes we need to try.  The wife had the stuffed avocado, and it was equally good.  The corn and flour tortillas are hand rolled, no machine here as you order them.  Great food coupled with outstanding service, that is hard to beat!", "Date": "2012-04-06", "Author_Location": "Austin, TX"}, {"Author": "Monica K.", "ReviewID": "tON_QjT0zTm81hA6k9okVA", "Overall": "4.0", "Content": "I wish we had 3.5 stars to give as that's my rating here. The food was very good; The restaurant more upscale that I originally envisioned though I was informed the space was vast and mixed. The menu was so extensive, I found it hard to focus even though I was drinking only water. Several choices appealed to me; I'd read the recommendations and decided to go with the Enchiladas Soluna. Chicken Enchiladas are my benchmark for Mexican food. They were delicious. I was surprised how much I enjoyed the chipotle enchilada. The poblano and the cilantro enchilada were also tasty. However, all were cream-based and pretty heavy. I'll be interested to return and to try some sauces that don't rely on cream to carry them through. Service was pleasant and attentive. Server recommended several dishes upon being asked. These enchiladas were among the recommendations. Still searching for the \"perfect' Mexican food in SA as a recent transplant. Recommendations are welcome.", "Date": "2011-03-07", "Author_Location": "Austin, TX"}, {"Author": "Yolonda K.", "ReviewID": "DeSHhfRwpOVi-mlBNwDFkA", "Overall": "5.0", "Content": "This is my new favorite place. We discovered this fantastic restaurant after a day  at the zoo thanks to Yelp! We were a little under dressed, but it was OK. The service was fantastic and the food was great! We had drinks drinks from the bar that were also very good. We will definitely be back.", "Date": "2012-04-05", "Author_Location": "San Antonio, TX"}, {"Author": "Chris A.", "ReviewID": "yOj9ec-ufsxCo4zrzU0Pmw", "Overall": "4.0", "Content": "I agree that the service is in need of some work, but the food made up for it. I would say the menu is well priced for the complexity of the dishes served. I ordered the stuffed pepper with cream sauce and pomegranate. Very flavorful, and the borracho beans served on the side were some of the best in town. My wife ordered the Mirasol enchiladas which were complex and flavorful, but a little too spicy for her taste. The margaritas are almost as good as La Fogata, and definitely as potent. The salsa was also good, but not an absolute favorite.", "Date": "2010-03-17", "Author_Location": "Boulder, CO"}, {"Author": "Mari S.", "ReviewID": "QLw5MIvHmNmmhh4rchgQmQ", "Overall": "1.0", "Content": "The food is decent but the portions are small and it's over priced. The chips have a weird grease flavor but the home made flour tortillas are wonderful. Margaritas aren't bad, but again over priced. Don't sit outside unless you love breathing second hand smoke while trying to eat. They should put the smokers on the upper level in the back of the patio. I know a lot of people that like to sit outside that quit going because of all the nasty smoke as you are trying to eat. I am on that list! I'm really surprised its even allowed where food is served!", "Date": "2012-05-08", "Author_Location": "San Antonio, TX"}, {"Author": "Cracker J.", "ReviewID": "-2DTETRmNegeOUFoP-2Qqw", "Overall": "5.0", "Content": "A great place for a date, friends or family. This authentic Mexican style restaurant is a mile above the rest. We celebrated a friends birthday dinner here and was not disappointed in anyway! The service was excellent. This dinner was a great bonus to my San Antonio visit!", "Date": "2011-06-10", "Author_Location": "Dallas, TX"}], "RestaurantInfo": {"RestaurantID": "5ON_1KLlK5AWmx9XfmAcDw", "Name": "Soluna", "Price": "$$", "RestaurantURL": "/biz/soluna-san-antonio", "Longitude": " -98.46667456883059", "Address": "7959 Broadway St Ste 204San Antonio, TX 78209", "Latitude": " 29.5066405659216", "ImgURL": "//s3-media3.fl.yelpcdn.com/bphoto/6JWfhGaW7wP_VihjK0kc0w/90s.jpg"}}