{"Reviews": [{"Author": "Mitch B.", "ReviewID": "-aZWPZtAywJVkqQL7jbWxw", "Overall": "4.0", "Content": "We found this place on yelp and decided to give it a try. Definite worth it! The service was unbelievable, we got there 45 minutes before they closed but were never treated like they were in a rush to get us out.The food was good. We tried the Alfredo and the bolognese. Both were very tasty and the food came out fast. The Alfredo had a slightly different taste of something than I'm used to, maybe a bit more cream, but it was very good.Prices are good and you get large portions. My girlfriend and I could have easily split an entree and been full. Yelp is currently running a deal $20 coupon for $10 which makes the prices even better. If you're in the area, this place is definitely worth a visit.", "Date": "2014-07-10", "Author_Location": "Seattle, WA"}, {"Author": "Tia W.", "ReviewID": "Q_ULGeA_43-9JIPoTE1UDQ", "Overall": "5.0", "Content": "My husband and I have been going to Pasta Bella for the last five years; we're 100% full on addicted to that roasted garlic!!  We go for the FOOD, 'cause the FOOD is ALWAYS amazing.  It's funny how when you walk in, you almost want to walk out, it looks old, and not well cared for... but wait for it.... it's just the charm of that place.  The last time we ate there, we got a new server, some italian guido sounding chump.  He was extremely cold with us, never cracked a smile, and left us kinda feeling jipped.  We were both craving pasta on Friday night and agreed that it was a PB kinda night.  We walk in, it's packed!!  But we'll wait for a table if that's what it's going to take to get that roasted garlic into our bellies.  Despite the discouraging packed lobby and group of people waiting outside, we were sat fairly quickly (SCORE!).  We knew what we wanted before we even left the house (Involtini and the mushroom steak, SO GOOD!), so we placed our menu's at the edge of the table to signal that WE WERE hungry and READY!  When our waitress walked up to our table, we just about died.  She hasn't been there the last 10 or so times we were there and we missed her!  No matter how busy it gets in there, she's ALWAYS smiling and we like that.  Wherever she's been, she needs to come back 'cause we don't want the italian man again!  We'll be back, we can't get enough of that menu... *best italian in Seattle*", "Date": "2014-06-24", "Author_Location": "Seattle, WA"}, {"Author": "Jena L.", "ReviewID": "g0sR6-BVcjD8ZLxOQL2plw", "Overall": "5.0", "Content": "Absolutely delicious and very reasonably priced.The free appetizer with a check in on Yelp was tender gnocci that was amazing.  Hubby had the mussels in some kind of lemon garlic sauce and said they were excellent.  We then moved on to the Dungeness crab manicotti (me) -- where you could actually see a generous amount of crab meat in every single bite!  Hubby had...something else seafood, I forget but I know he liked it.Our waiter was friendly and enthusiastic about the restaurant, which is always a good sign.  Very highly recommend!!", "Date": "2014-06-01", "Author_Location": "Stevenson, WA"}, {"Author": "Tas H.", "ReviewID": "j07a-18FmUsMHqPlxTotgg", "Overall": "4.0", "Content": "We found this place just driving around on an exploratory trip of Ballard. It is a great Italian place and I am sure we will return. Everything we had from the roasted garlic & bread to the dessert was great. Service  was good and price wise-it is on par with the quality and serving size.", "Date": "2014-07-16", "Author_Location": "Seattle, WA"}, {"Author": "Devin E.", "ReviewID": "T3BwJayjeFUNvHwsF_4OCw", "Overall": "5.0", "Content": "Best Italian in Seattle.  There are higher quality Italian places that charge 2x as much for half the food, and there are cheaper places, but this one is the perfect mix.  I have taken large groups, or gone as a couple, and never had anyone leave disappointed.Some of the dishes have interesting flavor combinations, but the menu is large enough that you can be as daring or safe as you like.  Decor is interesting, and they definitely save a bit on the furnishings, but the food is why I go.  Skip the chain restaurants, make the trip to Ballard, it's worth it.", "Date": "2014-05-20", "Author_Location": "Seattle, WA"}, {"Author": "Katie K.", "ReviewID": "nuKz-WHO3I3zOhAjNWPyog", "Overall": "3.0", "Content": "I here on a Friday night seeking some take out. I had a craving for fettuccini Alfredo, so I ordered theirs with chicken and broccoli. While I was waiting, the waiters were pleasant and attentive, and offered water while I was waiting. They packed up the bread and roasted garlic that normally would have been served table-side. When I got home, the pasta was passably good, but not great. The noodles were well cooked - not underdone and not squishy. I could have done with some more depth of flavor and thickness to the alfredo sauce.", "Date": "2014-04-16", "Author_Location": "Seattle, WA"}, {"Author": "Chloe H.", "ReviewID": "t0Wvt-HN3JSwTO0aCRmyeQ", "Overall": "5.0", "Content": "The food, staff, and environment were all amazing! Coming from an Italian family,I recommend this to anyone looking for authentic Italian!", "Date": "2014-06-28", "Author_Location": "Seattle, WA"}, {"Author": "Ren G.", "ReviewID": "KKk0DIomHNdqq8Vp2VXQPw", "Overall": "2.0", "Content": "Somebody needs to call Gordan Ramsay, because this place is in need of a major restaurant overhaul. It was not even worth the $10 for the Yelp deal I used to try it. I have no idea how this place has landed four stars, but heed me on this one: do not waste your money here unless something changes drastically!When I saw four stars on Yelp, plus a good Yelp deal, and a menu full of elegant looking pasta dishes, I thought it would be worth a try for a catch up date with a friend. Little did we know what we were walking into. The food was so bad that we were sitting there contemplating leaving it and going for taco bell across the street.I ordered the cheese tortellini in pesto cream sauce with artichoke hearts and it tasted precooked, prepackaged, and just above grocery store quality. The sauce itself was fairly flavorless and I'm guessing came out of a can or a packet. When I hear pesto cream sauce, I'm dreaming of a rich creamy cheesy sauce with the added umph of basil pesto, but this was watery and melted into the bed of marinara the pasta was on top of leaving a runny brown mess that was anything but appetizing.My friend had the spinach and gorgonzola ravioli. I remember this very well because when he ordered it, he accidentally said tortellini and the waiter got confused and looked at him like he had three heads. I tasted the ravioli and it was even worse than my tortellini. It had that flavor that leftovers get from sitting in the fridge for too long--not freezer burn, but that nasty fridge taste that is anything but appetizing or fresh. At around $20 per person, this was in no way worth the money. Even the bread they served before the meal was pretty terrible. It was chewy beyond belief and served with a few poorly roasted pieces of garlic thrown into a lonely looking little bowl. We were only served four half slices of the bread and about four pieces of roasted garlic which was not even roasted enough to spread on the bread evenly. Overall, I definitely should've gone for the taco bell. Cheaper, tastier, and probably even friendlier. Unless this place makes major changes, I think it's in for a short run.", "Date": "2014-04-08", "Author_Location": "Seattle, WA"}, {"Author": "Esther S.", "ReviewID": "Up5VhE2PMQaPqy0aGDpwdg", "Overall": "5.0", "Content": "What a find!! As a New Yorker - the \"divey\" decor of Pasta Bella got me thinking that this place might have the same quality and deliciousness of my favorite hole in the wall iTalian places in the Bronx...and it did not disappoint. It was DELISH! Good, homemade Italian without the pretentious foodie price tag. I'm a fan. Get the gnocchi pomodoro appetizer. It's delish. My husband almost licked the plate after he used all the bread to clean up the sauce. So yummy! Great staple. Will be back!", "Date": "2014-06-02", "Author_Location": "Seattle, WA"}, {"Author": "Cody J.", "ReviewID": "wOHF5812Ee7L8TsgnsoU-A", "Overall": "4.0", "Content": "The boyfriend and I actually discovered this place on Yelp, and we were craving some good Italian food. We definitely found it at Pasta Bella. My fettuccine con pollo was deliciously prepared in a roasted Alfredo sauce with peas and broccoli. I was looking for something on the lighter side - and it satisfied me! The boyfriend's Chicken Cannelloni was rich in flavor with cheese - also highly recommend.The service was decent. The waitor seemed a little monotone, but his recommendations were good nonetheless. Only reason I'm not giving 5 stars is because I was double charged.", "Date": "2014-04-23", "Author_Location": "Seattle, WA"}, {"Author": "Susan M.", "ReviewID": "oZlMUT_ZToVTesB7FovGmQ", "Overall": "4.0", "Content": "Mama Mia!  We just moved to Ballard and I was craving Italian food.  Of course we turned to Yelp and found Pasta Bella right around the corner.  When you arrive it looks like a typical Italian restaurant.  The staff is attentive.  They were out of the wine I wanted but our server recommended a substitute for me.  My husband had a steak and I got the 3 course meal deal for $22.00.  Wow, was it worth it.  I had the linguine puttanesca and it was full of garlic and anchovies, just the way I like it.  I smelled of it for the rest of the night (which is the real test of good Italian for me!).  My dessert was tiramisu.  My husband normally doesn't like tiramisu but he took a bite and agreed that it was delicious.  The next time I want Italian I know where to satisfy my craving.", "Date": "2014-05-22", "Author_Location": "Seattle, WA"}, {"Author": "Eric J.", "ReviewID": "-98BYZtzyAJKvOa4AiY9tQ", "Overall": "4.0", "Content": "Saw Yelp deals for this place after searching for Italian in Ballard and wanted to try it out. Glad I did!I used the Yelp checkin for a free gnocchi appetizer which the owner(?) checked out and accepted right away. Speaking of which, the owner was a great host, chatting with us and other tables (but not too much).Small, intimate setting with nice low lighting and a great ambiance.Generous portions that definitely fill you up. Bread with roasted garlic to start with, too.I want to use the $10 for $20 deal later. Looking forward to it.", "Date": "2014-03-15", "Author_Location": "Seattle, WA"}, {"Author": "Graciela D.", "ReviewID": "459OrM1E-rXamvgj0BgV1A", "Overall": "5.0", "Content": "The secret to having a really delicious meal here is to make sure that you go on the nights when the Chef is cooking. If you go on a Monday or a Thursday, good luck.I  figured it out with a simple phone call.  The Chef even comes out to the dining room to make sure you are enjoying your dinner. His name is Steve. Go when Steve is working. So there people (all the unhappy patrons) I just did the homework for you. Many times people just don't realize that maybe the Chef did not prepare your meal...? Hopefully they hire someone as good to cook on the days he's off duty. On small houses like this one,  sometimes is not up to the Chef to fire mediocre cooks.", "Date": "2014-04-09", "Author_Location": "Seattle, WA"}, {"Author": "Garrett S.", "ReviewID": "EQVoPuUeqqmN54wZM6gFXQ", "Overall": "5.0", "Content": "Went back again for a date night with the GF and yet again left full satisfied and happy. There food is simply the best Italain in Ballard! The Chicken Involtini is rich flavorfull and delicate at the same time. The staff is always extremely polite and helpfull. I cannot stress how fantastic Pasta Bella is. They are my go to Italin joint in Seattle.", "Date": "2014-05-25", "Author_Location": "Seattle, WA"}, {"Author": "Ross B.", "ReviewID": "2IL48Z0zvSSp7v0jr18ATg", "Overall": "2.0", "Content": "I received a very rude \"you know nothing about restaurants\" message from what I assume to be the owner, claiming he knew when I came and that \"he remembers me\" but he's wrong on both accords. I also just received a \"complement\" from a brand new account that bags on my review and has an EXTREMELY familiar sound to it. The fact is, I had an unpleasant experience, and the badgering isn't helping anything or anyone.", "Date": "2014-04-05", "Author_Location": "Seattle, WA"}, {"Author": "Andrew L.", "ReviewID": "zVlXZj4zGZ8kOUBlNG1Cow", "Overall": "4.0", "Content": "This place reeks of romantic and yummy... I don't even know why we ended up here, it wasn't even a date or anything of the like, but here I am, with a old college buddy, and she is even more confused... we should have planned catching up next time, not over a candlelight dinner. But this is exactly what it ended up being, and I'm not sure I would come here with her again, but I might bring my actual Girlfriend next time, because it was delicious. I love bread, and they have bread and nearby roasted garlic... I mean seriously, hello dragon breath, but it's perfect.When you walk in, it's dark, it's not modern, it's not even that good looking when you come in, it's like you have walked into a dark homely place in the alley way in Italy, because you just don't know what the deal is, unless you have been there... you know this will be good food. You get seated, I feel this was a place that once held good fellas meetings, where I have you watch your back, but you don't at the same time.  I feel like here, it's just a home you walked into, where family is there, and family is going to watch your back and treat you right. I love the old school feel... it's not for the modernist looking for decor.  The food was right also, the noodles were cooked right, the seafood on our places, were just delicious. I love the warm bread, I love that really they do it right... and people ignore it.. in the world of new chefs and modernist themes, they have something delicious here.  It's worth going.", "Date": "2014-01-19", "Author_Location": "Seattle, WA"}, {"Author": "Robert H.", "ReviewID": "Kgp_mjdC2Xo5T0jtz0UUKA", "Overall": "2.0", "Content": "After reading some reviews about this place my expectations were maybe high.  People have said this place is good and given it 5 stars.  5 stars better blow your socks off.  Take all of this with a grain of salt because we did take out.  Maybe the fact that we didn't eat hot off the grill had something to do with it but honestly it wasn't the consistency or how hot the food was.  When I arrived home we unpacked the food and divided up our food.  I began to dig into the Risotto Zafferano Con Salsiccia E Pollo which in my opinion was not bad but I could see a huge pool of oil at the bottom of the container which was somewhat of a turn off for me.  The risotto was cooked well and the consistency was pretty good but the salt content was a bit much for me and to be honest I like salt so I was taken aback.  My wife had ordered the crab and spinach manicotti which was quite mushy.  The taste was what I would describe as off.  The first few bites we were investigating and halfway through sharing the one we decided to not continue and throw it in the compost.  We moved on to the spaghetti we had gotten for our two your old who just turned his nose up at it and I think this was the best of all three dishes.  It was basic enough were I feel it would be hard to screw up but there was that hint of overpowering garlic.  Now I do like garlic but maybe not as much as other people so maybe that is just preference.  The food in my opinion was sub par.  The prices were fair I guess but I will not return to this place.  If you want really delicious food try yelp.com/biz/ristorante-….", "Date": "2014-07-08", "Author_Location": "Seattle, WA"}, {"Author": "ryan r.", "ReviewID": "2_mzn_W0QCjFWPqY1l493A", "Overall": "5.0", "Content": "Best italian in seattle.", "Date": "2014-06-04", "Author_Location": "Seattle, WA"}, {"Author": "Tim L.", "ReviewID": "dbM6LFmZwzmeFfMrIwW36w", "Overall": "4.0", "Content": "I chose to bring a date here after seeing the Yelp deal and the proximity to my house. It was a quiet Wednesday night and with the rain and the window booth we were seated in, a romantic night was surely in store. Our waiter was extremely attentive and informative, about the wine selection, the specials and the regular favorites. Now I'm not a fan of eating Italian out usually as I feel like I can often prepare similar quality at home, but here comes the exception. My pumpkin ravioli (a seasonal special) was light and pillowy, while my date's chicken dish (one of their specialties) was rich and flavorful. We ended up sharing because the contrast made for a perfectly balanced meal. Although a bit pricey, the deal definitely  made it worth it and I would surely come back to this neighborhood spot in the future.", "Date": "2014-03-14", "Author_Location": "Seattle, WA"}, {"Author": "C. M.", "ReviewID": "giP9pcqasUBYfxRhVQ83Ig", "Overall": "5.0", "Content": "Pasta Bella is a true gem. The food is always delicious, the service is gracious and there is not usually a wait. There is a vast array of choices on the menu consistently prepared, and perfectly seasoned with fresh, vibrant flavors. Portions are generous and very reasonably priced. An added bonus is the yummy bread with roasted garlic that appears when you are seated. Warm, European ambiance in this charming restaurant, tops it all off. One of our favorite dining destinations.", "Date": "2014-04-06", "Author_Location": "Seattle, WA"}, {"Author": "Kyle W.", "ReviewID": "gP0Il-lKzn6gwTQ6iy0lPQ", "Overall": "5.0", "Content": "We have been going to Pasta Bella ever since they were up on Queen Anne. Very good food, consistently good service and their prices are fair. The quality of food compared to their prices is extremely good and we will continue to dine here for a long time.", "Date": "2014-02-28", "Author_Location": "Seattle, WA"}, {"Author": "Haley B.", "ReviewID": "3agGAmaVA-Fkfvoog9SP5Q", "Overall": "4.0", "Content": "Whenever my boyfriend and I are craving Italian, we dine at Pasta Bella. It is a lovely setting for an impromptu date night. The service is great, the menu large, and food is fresh and delicious. Our eyes are always larger than our stomachs because there is always something new we want to try whether it's an appetizer, salad, or entrée! I give it four stars only because they do not serve cocktails which I understand is not a big deal and totally a personal preference. (Wine and beer are both offered!) If you're looking for delicious, authentic Italian in Ballard without the hustle and bustle of Ballard Ave. or Market St. then give Pasta Bella a shot!", "Date": "2014-04-16", "Author_Location": "Seattle, WA"}, {"Author": "Kyle W.", "ReviewID": "GPqTR-IpMb07_u6kZh2yag", "Overall": "3.0", "Content": "Ehh..Service was ok and food was the same. Nothing wonderful, just average.", "Date": "2014-05-31", "Author_Location": "Seattle, WA"}, {"Author": "Mark R.", "ReviewID": "A0xiZftnaoWmFcPYIjsuCA", "Overall": "5.0", "Content": "Delish food! If you're looking for some authentic Italian in a quaint setting then this place is it. Always great service and delicious food!", "Date": "2014-03-02", "Author_Location": "Seattle, WA"}, {"Author": "Jonas G.", "ReviewID": "pFVw0zRUKobfzvhXOytLzA", "Overall": "4.0", "Content": "Romantic and delicious!Food takes a bit, but it's worth the wait.The roasted garlic that comes with your bread is super yummy:)", "Date": "2013-10-27", "Author_Location": "Seattle, WA"}, {"Author": "Tabitha T.", "ReviewID": "QncrEByc0SlW_sQrmu9tRA", "Overall": "4.0", "Content": "I went out to dinner with friends the other night and Pasta Bella is where they wanted to go. Seeing the Yep deal $10 for $20 I quickly agreed and purchased the offer. When we walked in I was not that impressed by the décor. It comes across as a bit cramped and dated. The tables have heavy plastic table cloths that look bad and are very stiff which makes sitting a tad uncomfortable. The walls are lined with art and other knock knacks which are fun to examine, but do not add to the ambiance. Overall I was just not a fan of the look of this place.The food however is this restaurants saving grace! The service is piece meal and a bit slow. The owner who is often present is very pleasant and kind. When I did not realize I could not combine Yelp Deals he honored it for me anyway. This I felt was super nice. The waitress though seemed a bit distracted. She had difficulty splitting the check and keeping the order straight. The food also came out of the kitchen staggered in a way that didn't make sense.  They also mixed up plates and nearly left my fiancée biting in to a meat dish he would not have appreciated. The chicken was hidden under some innocent looking pasta. Now back to the food! It is SO good. . The meal is served with warm bread and roasted garlic. YUM!  We tried the gnocchi appetizer which was to die for. I went back after my initial visit just to eat it again. The spaghetti I tried was super delicious and the portion was huge, I took half home.  My fiancée loved his mushroom pasta also.  We later tried two deserts the cannoli and the tiramisu. The cannoli was top notch, but the tiramisu was not the best. I am a huge tiramisu fan so can be very critical. Overall this is a great local Italian restaurant I would recommend to friends.  The prices are fair, food is great, and the location cannot be beat.", "Date": "2013-07-30", "Author_Location": "Seattle, WA"}, {"Author": "Marina G.", "ReviewID": "MWlj1KZVl1GGZBJ8MS70sw", "Overall": "5.0", "Content": "Dinner at Pasta Bella was perfect. Amazing service, delicious food, what more could you want? I felt like all the staff truly cared that we enjoyed our meal, the host and server were very attentive and helpful, made great recommendations and checked on us often. The chef even came out and asked how the food was. It was genuinely delicious - we got shrimp scampi with lime aioli as an appetizer, then split the special of wild Alaskan salmon in piccata sauce with pesto linguine and veggies. Only $2 more to split the dish and we each got almost a full serving. We relished every bite and cannot wait to come back. Highly recommend Pasta Bella.", "Date": "2014-02-10", "Author_Location": "Santa Barbara, CA"}, {"Author": "Jessica G.", "ReviewID": "-mrKJ7tT4PSOjyjnTQR_Rg", "Overall": "1.0", "Content": "As a Ballard resident, I have eaten at Pasta Bella a number of times and have had no complaints. The food isn't anything to die for, but it's decent Italian fare, and the bread basket with olive oil and balsamic is pretty tasty. My mom was a big fan when she first visited me in Seattle - her favorite is the chicken parmigiana. In fact, she says that it's the \"best\" chicken parmigiana she's ever had. Maybe we hit them on a good night, though, because my recent experience there was horrible! The waitress seemed a little ditzy but nice. After explaining the specials to us, we ordered the pesto cheese bread appetizer (one of the specials), my friend ordered the chicken marsala, and I went with the lasagna (I usually go with the carbonara or gnocchi). The pesto cheese bread was okay, although not as tasty as I thought it would be considering that I am in love with pesto sauce. But the entrees were terrible! My lasagna wasn't very warm and bland. No striking tomato or cheese taste to it whatsoever. My friend pulled a long hair out of her chicken marsala, which made us both lose our appetites.We actually told the waitress about the hair in the food, and she seemed completely unprepared to handle a situation like this. She was fumbling, desperately trying to figure out what to do/say, and offered to bring my friend a new half order of chicken marsala. When we declined, she didn't offer to comp the dish or offer any free desserts, etc. She merely said she would take a \"substantial portion\" off our check. That substantial portion was less than half of the cost of the dish itself. Major fail.We ended up using a Yelp deal to get $20 off the meal.Needless to say, we both lost our appetites. I don't usually get grossed out easily, but the whole mishandling of the situation was unacceptable. I won't be returning unless it's to please my mom...and I'll stick with the bread.", "Date": "2013-07-23", "Author_Location": "Seattle, WA"}, {"Author": "M S.", "ReviewID": "z09pQ5KA163GGDeZAFXYog", "Overall": "4.0", "Content": "Exceptional food!! There are no two-ways about the quality of food! We drive all the way from east side pretty much every week just for the wonderful food! I am cutting down one star because the service hasn't always been impeccable. We have had some real moody servers. But for that, everything else is great! Happy to recommend this place to all the veggie lovers!", "Date": "2014-04-30", "Author_Location": "Bellevue, WA"}, {"Author": "Elena M.", "ReviewID": "Uf-qYeTz9uRb5FK0ulHx-w", "Overall": "2.0", "Content": "I would really love to be rating this place higher.  This is a cozy, comfortable restaurant with quite good food.  But, our experience there tonight was truly disappointing.It all started out promising. We arrived and were greeted by someone who appeared to be the chef.  We were seated immediately at a comfy table by the window at the front of the restaurant.  And then we sat. And we sat.  And we sat some more.  The host (?) who was standing at the door (but also helping to refill water glasses, clear plates, etc.) walked past our table several times, but either did not realize we'd been sitting a while without so much as being offered a drink or chose not to acknowledge this.Finally, a server appeared.  She asked if anyone had taken our drink order. No.  Had anyone told us the evening's specials. No.  \"Oh,\" she said.  \"They must have forgotten to tell me they'd sat someone in my station.\"And, so we ordered our drinks and our appetizer and our entrées all at once.  Nothing was written down.  Our server returned a minute later to tell us she'd totally blanked on our entrées.  We repeated our order.  \"And, so, no wine, then?,\" she asked.  I reminder her that I had ordered a glass of Pinot Noir.  Bread and my wine (a generous pour of good quality wine for a very reasonable $7) were brought out.  But, our server needed to be reminded that my husband had ordered a Diet Coke.We waited a while for our appetizer -- an antipasto plate that we ordered in lieu of getting salads.  We'd been picking at the antipasto for just a few minutes before our server returned -- with our entrées.  She made some comment about the main courses coming out pretty quickly, but now, she said we can just sit back, take our time and enjoy our meals.This is one of my pet peeves in restaurants.  Appetizers are meant to be served -- and consumed -- before the main course.  Not with it.  Heck, by it's very name, \"antipasto\" means \"before the meal.\"  In a well-run restaurant, this should never occur.Our entrées, my chicken piccata, his gorgonzola ravioli, were both very tasty.But, contrary to our server's statement that since all our food had been served at pretty much the same time, we should just \"relax,\" we felt rushed.  This was disappointing, as, after a busy holiday season, we were looking forward to a relaxed, paced, meal in a pleasant setting,   This is not what we got.  Service was completely unprofessional.   Since we barely got to taste our appetizer before our entrées were served -- which our server all but admitted was mistake -- it would have been nice (and appropriate, I think) for the restaurant to offer to comp the appetizer.  Truly, we never would have ordered the appetizer had we known in advance our courses would be so ill-timed.  But, of course, no such offer was made. Despite being happy with our entrées and the wine (ironically, the antipasto itself was pretty forgettable), I cannot see returning here.", "Date": "2012-12-23", "Author_Location": "Seattle, WA"}, {"Author": "Tangi S.", "ReviewID": "tMLAE8rM7NeEZFuyE0Sf4g", "Overall": "5.0", "Content": "The food here is divine and the service impeccable!  I had the Caesar salad and Pollo Marsala~ some of the best!!", "Date": "2013-12-29", "Author_Location": "Dallas, TX"}, {"Author": "Roscoe C.", "ReviewID": "GuFabrQlyBj4MQKbqgi2ug", "Overall": "4.0", "Content": "Charming little place, talented staff, elegantly crafted dishes.  Entrees are wonderfully rich and creative, but they are a bit small so get an appetizer (or split one of their wonderful salads).I've been there many times and always had a rewarding experience. Pasta Bella  is a substantial cut above most neighborhood Italian eateries, though it is not an exclusively Italian eatery. I've referred many people here and have never been embarrassed to do so. Pasta Bella is, in a word, consistent.", "Date": "2012-12-26", "Author_Location": "Mountlake Terrace, WA"}, {"Author": "Amanda M.", "ReviewID": "JOSpPsXe9BwIE5zUicH2oQ", "Overall": "5.0", "Content": "Pumpkin ravioli!!! Amazing!!! Service was great everyone checked on us was a little bummed couldn't try the wine since I left my ID in my nye purse but whatev the boy got angel hair pasta with scallops which were also delicious! Bruschetta was to die for. Cute and romantic even though they were kind of busy. We got a window booth, perfect for our three year anniversary.  Definitely will be back!!", "Date": "2014-01-01", "Author_Location": "Seattle, WA"}, {"Author": "Cortny P.", "ReviewID": "lwbkBoVZRwGgmefZ1vsWiw", "Overall": "5.0", "Content": "Cute little hole in the wall, family owned business. Today was my first time here. The service was great. The waiter came around the perfect amount of times. Always making sure our waters were full. The bread & roasted garlic were super yummy that they start you off with. I also got a side house salad to start, which was pretty plain but still good. I got the Capesante Rossa for dinner & it was really good. Full of flavor. I'm Italian so a good Italian meal means a lot to mean. It didn't seem at all like it was just thrown together. I will for sure be coming back!", "Date": "2013-12-04", "Author_Location": "Bellevue, WA"}, {"Author": "Aaron E.", "ReviewID": "VsHDlLuQUsTwC4KTh69NVg", "Overall": "2.0", "Content": "Not impressed.Well... I was impressed until the entrees arrived.  The salad course was probably the highlight.  The roasted garlic served with the bread was also pretty awesome.  But that's kind of sad that the highlight was the salad course and the free bread they serve to everyone.Things started going down hill when one of the two entrees was right.  It got even worse when I said \"no thanks\" when asked if I wanted fresh ground pepper and our waiter decided to add some just for fun.  Eventually they brought out the correct entree but it was just a little awkward waiting for it.  The crab and spinach manicotti was pretty decent although a little fishy and the béchamel sauce was clumpy.  The mushroom ravioli (when it actually arrived) was definitely a lot better.  Then dessert time came.  Tiramisu and cannoli were both okay, but I was hoping for better than okay... I was really overwhelmed with how mediocre it was.  Oh, and the cappucino I had with dessert had some extremely bitter espresso.  It took about 20 years for the bill to come.  It took like 20 years for them to take our form of payment as well.  The quality and experience was not worth the cost.Definitely not the worst dinning experience but it was pretty bad and I probably won't be back.", "Date": "2011-02-14", "Author_Location": "Seattle, WA"}, {"Author": "Kat F.", "ReviewID": "GRlNOOTJpLWcxr6N3ATR-w", "Overall": "4.0", "Content": "It was love at first whiff. My parents were in town and wanted to eat Italian. I'd driven past Pasta Bella many a time but had never gone inside so we decided to venture over to Ballard and give it a try. The moment we stepped inside we knew we had made a good decision! It was warm, cozy and dimly lit and garlic was in the air. We were shown to a table and given some bread with roasted garlic to nibble while we read over the menu. We had a calamari appetizer which was delectable - calamari sauteed with tomatoes, kalamata olives and fresh herbs in a white wine sauce. For dinner I ordered eggplant that had been stuffed with other veggies and goat cheese and then roasted. It was served over tomato sauce and fettuccine and was done absolutely perfectly. I like my eggplant so tender that I don't need to use a knife and I was definitely able to cut this entree with a fork. My parents were very happy with their choices as well. Our only \"complaint\" was the sheer number of dishes on the menu. Everything looked incredible and it was very difficult to choose!", "Date": "2009-10-13", "Author_Location": "Seattle, WA"}, {"Author": "Kaitlyn M.", "ReviewID": "U01i0oqqQfSDmGPJGsjK9w", "Overall": "5.0", "Content": "I've been to Pasta Bella about 4 times, tried a new dish every time and it's always incredibly delicious. The food is fresh, flavorful and the atmosphere is perfect for dinner with family or a couple friends. Every time I bring someone with me, they always enjoy it as well. I highly recommend trying this restaurant!", "Date": "2013-12-22", "Author_Location": "Chico, CA"}, {"Author": "Brian E.", "ReviewID": "75JL3EgYt92Uw0a9ErKBEg", "Overall": "1.0", "Content": "Free Bruschetta appetizer? Fuck your bruschetta. You may have incredible food, but you ruined our favorite Italian restaurant in Seattle.Used to be 5 stars. That was at the Queen Anne location, which closed.Tonight, I took my pregnant wife to the one in Ballard and the asshole Italian host/proprietor seated THREE couples who put their name in after us. Then, when I told him he skipped us, he apologized and 2 minutes later sat ANOTHER couple ahead of us.We left without eating. An hour wait for nothing.", "Date": "2012-02-11", "Author_Location": "Seattle, WA"}, {"Author": "Ray Z.", "ReviewID": "eSNzKNsJioP6szma8kVEDw", "Overall": "3.0", "Content": "I have just come home from dinner at Pasta Bella, and my hands are a bit tired. Tired from salting my food (you know that things are not looking up when you _both_ reach for the salt at the same time). Tired from picking out the Rosemary twigs and leaves from each mouthful of Osso Buco (it is indeed ironic that just recently, I was complaining to a friend that I hate picking out the leaves from unstrained tea).Not that the food was terrible or terribly flavorless. Indeed, one could discern the distinct flavors of the various ingredients (like the Rosemary). But as a whole, the dishes just seemed to lack body and richness. Perhaps it's that I've been spoiled by the robust flavors at places like Assaggio and the Pink Door. I guess one could grow to appreciate the delicate flavors at Pasta Bella. But one thing I'm certain about is that the pasta was overcooked. It was soft and lifeless. In fact, once mixed with the Osso Buco, mine became mushy.The consolation to the evening was the service. We were promptly seated, and our server was friendly, helpful and attentive. Glasses were never left empty, and empty dishes were never left sitting around. The timing on production and serving was fine also. Drinks, bread and garlic, appetisers and main dishes all appeared prompty. Overall, the meal was \"pasta non bella\". There are just too many more dependably-good places (like Asteroid, Perche No, Fremont Classic) in the immediate area for me to want to risk this place again.", "Date": "2007-09-17", "Author_Location": "Paradise, WA"}, {"Author": "Dianne B.", "ReviewID": "oJG6pPlne3oJ_ENHeSHYgw", "Overall": "5.0", "Content": "Super good experience at this place! Our waitress was one of the nicest I ever had AND she never let my water cup run dry (this is always a big plus for me. hehe)!! The food was delicious -- try the gnocchi for starters. The rossa sauce it was in was yummmm.. It was also my friend's 21st birthday, and at the end of our meal, our waitress surprised us both with a slice of their Chocolate Decadence, a flourless cake. She even sang for her. (: I really appreciated her accommodation and her good vibes in general. Plus, this place is super cute, so give it a try!", "Date": "2013-08-15", "Author_Location": "Seattle, WA"}, {"Author": "Dianne B.", "ReviewID": "oJG6pPlne3oJ_ENHeSHYgw", "Overall": "5.0", "Content": "Super good experience at this place! Our waitress was one of the nicest I ever had AND she never let my water cup run dry (this is always a big plus for me. hehe)!! The food was delicious -- try the gnocchi for starters. The rossa sauce it was in was yummmm.. It was also my friend's 21st birthday, and at the end of our meal, our waitress surprised us both with a slice of their Chocolate Decadence, a flourless cake. She even sang for her. (: I really appreciated her accommodation and her good vibes in general. Plus, this place is super cute, so give it a try!", "Date": "2013-08-15", "Author_Location": "Seattle, WA"}, {"Author": "Lauren D.", "ReviewID": "3wDm7dlHPQra2kBZ3S1_lg", "Overall": "4.0", "Content": "We enjoyed New Year's Eve Dinner '07 here and were pleasantly surprised - it was good!Driving by it for months now, I had always envisioned Pasta Bella as a one room, dark restaurant with really standard fare. Instead, it's got several rooms, brightly painted walls (complete with Roman columns!), cozy tables, and some damn tasty food!We called ahead from our friends' house a block away - they happily put us on the list for a table, and promptly called when one was ready for us! This was a really lovely touch, so we could wait in the comfort of the house rather than packed in their little entryway.Soft bread and roasted cloves of garlic were a treat - far better than bread and butter or oil, if you ask me. Since we were celebrating, we went with a bottle of red, and a half carafe of white. We also ordered their antipasto platter, with yummy veggies, all pickled and colorful. Our table saw two orders of a wonderful rolled eggplant with artichokes, zucchini, spinach and pine nuts, a seafood alfredo, and goat cheese & walnut ravioli - everyone really, really loved their dish. A look of shock crossed all our faces as we realized this place was WAY better than our expectations. Nice to know Pasta Bella is there, off the main Ballard strip, waiting with comfy warm food.", "Date": "2008-01-04", "Author_Location": "Seattle, WA"}, {"Author": "Danielle H.", "ReviewID": "TpiM0kmYGsaaW5tl8GFuwQ", "Overall": "4.0", "Content": "This place is easy to miss if you are just cruising down 15th and not looking for it. The service was great and our waiter was very attentive and helpful in choosing from the many menu selections. The wine glasses being small is pretty much my only complaint. They serve roasted garlic cloves with their bread which makes me a happy girl!!! I had the salmon piccata special with capers, onion and fennel served with fettucine and pesto pasta and vegetables. It was awesome. The salmon wasn't the best I have ever had, but was cooked perfectly. The gnocchi with pancetta was to die for. For dessert, we ordered cannoli and tiramisu. The tiramisu was rather wet, but I appreciated the rich flavor. The cannoli was excellent, perfect amount of ricotta. The americano was also extremely yummy. Their menu is so extensive that anyone could find something to like on there... I would recommend this restaurant to anyone looking for a quaint location with personalized service. We lingered long after eating and didn't feel rushed to get out. I will go back!", "Date": "2009-10-30", "Author_Location": "Seattle, WA"}, {"Author": "Ashley I.", "ReviewID": "XmueI5yQ0iJLZm4Q4DiQhg", "Overall": "4.0", "Content": "The food was delicious, and the service was great! Their Gnocchi dish was delicious! Definitely recommend this place!", "Date": "2013-08-10", "Author_Location": "Magnolia, Seattle, WA"}, {"Author": "Samuel R.", "ReviewID": "-bb7xn5O4rsYU_tGGkCHLg", "Overall": "5.0", "Content": "My wife and I live up the street and love this place! We've never had a bad experience, can't wait to go back next time! Anyone who rates this place less than 3 or 4 stars is out of their mind, and needs to see the rest of the states. Try getting nice Italian food in Paducah, KY.", "Date": "2013-09-17", "Author_Location": "Haller Lake, Seattle, WA"}, {"Author": "Betsey S.", "ReviewID": "oJNLHy3HiUxcEGnADCYdvw", "Overall": "5.0", "Content": "I love Pasta Bella for a relaxed dinner date (more like Wednesday or Friday night date... to me, it's not Saturday night fancy).  You come away from dinner feeling full, happy, and very well cared for.  They say you can't love well until you have eaten well, and I fully buy into that maxim.  Pasta Bella must, too, and their entree size is just perfect for eating well but not inducing the beached whale effect (not a desirable date feeling).  I love the roasted garlic they bring out with warm bread, and the fact that they have carafes of house wines (that is how Italians really do things, people).  We get the house Montepulciano, and find it's a lot better than the house Chianti.  And yes, we get the large carafe... we like long dinners.... with lots of wine.  The staff takes excellent care of you while not being in your face too much, and they'll frequently remember you if you are a repeat diner.  Pasta Bella's pasta is freshly made, and has the perfect 'tooth' to it.  Bistecca (steak) entrees, seafood dishes (I love the Seafood Risotto), baked dishes (it is hard for me not to order the Melanzane - stuffed eggplant - every visit, but sometimes I can resist), simple dishes, salads (including salads with grilled chicken or shrimp if you are not a pasta eater - you poor bastard!), and did I mention wine in carafes?  Pasta Bella really has it all.  It's a little funky decor-wise with empty olive oil jugs etc, but it works, and you'll be full, happy, and ready to love well.  If not a little drunk.", "Date": "2007-04-09", "Author_Location": "Seattle, WA"}, {"Author": "Arvind K.", "ReviewID": "7NJfN2gUZqyIbvq1KUDMTQ", "Overall": "4.0", "Content": "Liked the ravioli pastas. The service was good even though it was pretty crowded at the time we went. The prawn appetizer was also good. Did not like the dessert options.", "Date": "2014-03-16", "Author_Location": "Bellevue, WA"}, {"Author": "Danielle G.", "ReviewID": "JF4sPmzZPhs48JMz3bW7lA", "Overall": "5.0", "Content": "We set our sights for trying something new one night, and found a $10 for $20 deal at Pasta Bella. We thought it sounded good and it did not disappoint us! Nice, small place with a hilarious waitress, honestly I would go back just to hang out with her. She was funny, friendly, and made us feel like we were long lost friends (she is the adorable red head with (newly) straight hair, in case the management is reading this.We had a blast, dinner was great and the $10 off made it around $50 for an appetizer, two entrees, two glasses off wine and dessert. What a great deal!", "Date": "2013-03-03", "Author_Location": "Seattle, WA"}, {"Author": "Hauke G.", "ReviewID": "Uyt-m1OS2jVfHc8lkIq75w", "Overall": "4.0", "Content": "Excellent option for a lower key Italian dinner in the Ballard Area.  Voltaire is great, but usually a bit of a fuss.  This place feels like a little slice of Italy.  The decor is cute and simple, the people are great, and the food is spot on.  Good salads and pasta options on menu, along with a seasonal Garlic Festival list that is deadly - but tasty.  Decent wine and beer selection (Moretti by the bottle!).  I recommend the Involtini con Pollo - HOLY CRAP is it good! The only down side is if you get one of the nice window seats it can be a little chilly and your view is drunk bastards speeding down 15th.  How romantic.", "Date": "2006-12-28", "Author_Location": "Seattle, WA"}, {"Author": "Damon C.", "ReviewID": "guDw6e0GDYItcUyzCkmfDA", "Overall": "4.0", "Content": "The Parentals are in town and my father was looking for a basic spaghetti dinner.  So where better than Pasta Bella.  A cozy little place up on 15th with an interior decor that makes you forget there's a Taco Bell and Blockbuster right across the street and almost makes you think you're in your Italian Grandmother's house.The staff is very friendly and more than willing to help explain the different menu options.  Unfortunately for me, it is the Roasted Garlic Festival and there were so many tasty dishes with garlic, but I had to refrain as I'm going to be dancing up a storm tomorrow and I'm sure my partner wouldn't appreciate a load of garlic in her face.So I settled on the Penne Sausage.  As is too often the case with pasta and sausage dishes, you typically get gypped on the ratio of sausage to penne and wind up leaving a lone piece of sausage hanging around for that last bite.  Not at Pasta Bella!  There was so much meat in the penne that there was some leftover when I was full!  Now THAT is a good Italian joint! ;o)My only suggestion is that they have a few dessert choices that are a little bit lighter on the stomach.  They looked fabulous, but a little cup of sorbet would have been perfect.", "Date": "2007-08-11", "Author_Location": "Seattle, WA"}, {"Author": "Lisa N.", "ReviewID": "jcc6VaxRMusnn1Gil6YaPw", "Overall": "3.0", "Content": "I was craving pasta and bf lives a few blocks away from Pasta Bella. Remembering that I enjoyed it several years ago when I came for a friend's birthday, I suggested we check it out. Bonus was that there was a Yelp check-in special AND a Yelp deal for it. I purchased the deal and we headed out the door. The group leaving immediately before us gushed about how wonderful their meal was, which set a great precedent for our meal. We were seated quickly at 8:30pm on a Friday, but the restaurant was definitely pleasantly busy. Menus were presented and the specials read off, but with all of the options we were slightly overwhelmed and not sure of what to order. I informed our server of the check in special and Yelp deal and he marked my special as used before telling me that I cannot use both at once. I would have preferred to use the deal since I had paid for it specifically for that visit, but I don't have a problem with coming back again (and I suspect others who have potentially run into this would feel the same way). The free appetizer was their gnocchi with creamy marinara and honestly could have been a full portion of pasta, it was so big. The sauce was wonderful and full of flavor, but the texture of the gnocchi wasn't my favorite. I like my gnocchi to be soft, melt-in-your-mouth-pillowy and this was heartier, chewier, and doughier-- much better suited for a main course pasta than an appetizer. Regardless, it acted as a perfect vessel for the tasty sauce so I wasn't upset. I had the linguine con pollo piccata and enjoyed the wine flavor in the sauce. Bf had some sort of garlic sauce penne dish with chicken (can't remember what it was called) and I immediately regretted not ordering it because the garlic in the sauce was amazing. Both dishes were incredibly generous portions-- I took half of mine home to eat later because I was already carb-overloading. Prices are reasonable for pasta with meat and I think it's a good neighborhood joint for comfort food so I'll definitely be back next time the craving hits.", "Date": "2014-01-13", "Author_Location": "Seattle, WA"}, {"Author": "Kevin B.", "ReviewID": "EmXNJaXJ7GkHY97yJC_Crg", "Overall": "5.0", "Content": "I don't recall a bad visit here and never get tired of visiting.  The food is excellent and I could eat just the roasted garlic and bread all night.  The atmosphere is excellent, just a few dark, narrow rooms - seems like you could be in Brooklyn.  Warning: You will overeat and get stuffed if not careful.The Ballard location is much more intimate and interesting than the Queen Anne place, in my opinion.", "Date": "2007-09-16", "Author_Location": "Marina Del Rey, CA"}, {"Author": "Katie S.", "ReviewID": "WAOFN8qFcH_gjtRYTOKvaw", "Overall": "4.0", "Content": "I love this little place.  I love the long, claustrophobic, hallway-like dining rooms.  I do not love their tapwater.  It tastes like crap.The pollo involtini (I think it's called; we just say 'involuntary chicken') is the absolute bomb.  The chicken breasts are stuffed with pine nuts, raisins, sausage, spinach, and a few other things....with a delightful marsala sauce, crisp-fresh steamed veg, and a somewhat mediocre pesto linguine.  Gnocchi is unbelievable.  It's pretty much like nibbling on fresh poached, hairless, hamster bellies.  In a good way.  So tender and fluffy.  My first taste of gnocchi...and I am now hooked.  If they are available, try them!Also have tried some sort of lamb thing (someone else's), a couple different raviolis, and the fettucine alfredo. Everything is very nice - pasta is very nicely al dente (read firm-ish).  A ravioli with mushroom stuffing was superb.The spinach salad with Gorgonzola and pralined walnuts is OMG good.Their menu has gotten a little sprawling - like many Stephen King novels.  I generally get that chicken thing that I know I like, then taste other people's.  They always start you with bread (meh) and a dish of roasted garlic (YAY!) that is awesome.  I think it would be fine for kids because it's already DAMN LOUD in there!The service has been generally slow, with the handsomest waiter I've ever seen...who was rather cold.  Sadness!Great little romantic place.", "Date": "2008-11-18", "Author_Location": "Seattle, WA"}, {"Author": "John C.", "ReviewID": "lzPt4r4t93Z8pI3bQ-D14g", "Overall": "2.0", "Content": "Ate here once (mid 2006), and that was enough; the experience was so poor we went to another restaurant 30 minutes later to finish dinner. Consider any of the other great Seattle pasta places first.I would typically give any restaurant the benefit of the doubt, however there were too many issues with this place to consider it again.1. The food was poor, overall. If you like garlic, there is plenty of it, and this is a good thing for me. The bad part: the ravioli my wife ordered was stale and old. the edges were hard, actually crunchy. I had the 'fresh' fish, which this night was halibut. This fish is rather bland, but when cooked right can be really awesome. This night it was served in a picante: it tasted no more flavorful than a piece of low grade cod boiled in water. really, it was bad. I was disappointed.2. Service was average, and the serving time was all messed up, and made me irritated to say the least. We sat down at 7pm, had our order taken for apps and salad immediately. this was served by 7:08. the dinner order was placed in the meantime, prolly around 7:05. The dinner was then brought out less than 10 minutes after the apps!! I told the waiter it was WAY too early, so he told us he would keep it heated. Therefore, our dinner was now simply sitting in the kitchen...ugh. I dont understand this, as the place was not full and we did not tell them to make it all happen fast.The bread was good, not great. The roasted garlic was fine, hard to mess that up.We left and went to Pontis for appetizers and desert. Pontis is great :^) Pasta Bella is very average.", "Date": "2009-02-23", "Author_Location": "Seattle, WA"}, {"Author": "Rachel P.", "ReviewID": "Fz65yhYh6Nrl7JBh0by2XQ", "Overall": "2.0", "Content": "I had the meatball spaghetti with side of salad (i know, so typical and boring. but it's all time favorite!) and my boyfriend had some kind of  steak . They were out of mashed potato so he had spaghetti as a substitute....I don't know what to say.Honestly, my spaghetti tasted like frozen food from any market. It was kind of watery, tasteless, and noodle was overcooked.Steak was okay, but I could have better steaks at home with a grill though.Italian Canolli for dessert, hmm ugh, kind of greasy - lots of creeeaaam. And the service was promt - not too bad.The roasted garlic that my boyfriend forced me to eat (up to mischief, cuz I didn't want my mouth to smell) was the BEST out of all I ate there.", "Date": "2009-04-03", "Author_Location": "Los Angeles, CA"}, {"Author": "Zannie S.", "ReviewID": "Hn9kls9ntWEwOTy-9_uUUQ", "Overall": "3.0", "Content": "Last night was our first visit to Pasta Bella.Overall, we three adults had a very nice dinner.  I had the mushroom ravioli which was a very rich but tasty treat.  One companion had the eggplant which she was pleased with and the other had a special with Italian sausage that went over well.   One of my favorite things about an Italian restaurant is the probability of a small salad with gorgonzola, nuts and raspberry vinaigrette.  Pasta Bella did not disappoint.   That being said, the restaurant was out of \"fresh field greens\" as described on the menu and gave us spinach instead.  Honestly, I love spinach so it was A-OK with me.  Not sure my companions were so crazy about it.We thought the pricing was a bit high.  The entrees were fine...$14 - $20 each, but the salad was not included and was additional $5.50 per plate.  The cost of a salad plus entree was approximately $20-$26 each.For dessert we chose the cannoli.   Nice filling but the shell seemed a bit stale.One guest asked for coffee with cream.   The coffee came but Pasta Bella was \"out of cream.\"  OK...Safeway is four blocks away....why is there no cream?    Very nice service, ahem, except for the items they ran out of.  I really want to give this place four stars but I just can't.    I will update hopefully with additional stars when we try it again.", "Date": "2009-02-22", "Author_Location": "Seattle, WA"}, {"Author": "Rose B.", "ReviewID": "8gnkTbIVtpP243ZTFZsEbw", "Overall": "3.0", "Content": "I came here with my husband expecting a romantic meal with a classy atmosphere. That was the impression we had after walking by this place on our walks home. The ambiance was closer to Olive Garden with the food of Little Italy. The noise level was quite undesirable. I could hear, word-for-word, the conversations at the tables behind us. We had an okay waiter. Nice guy but not as debonair/something I'd expect from an Italian place. The decorations were cute and romantic is the brick building with the wood floors. The food is great. Amazing. We had the white wine calamari and loved it. I ordered   the steak  with Gorgonzola and mushrooms on top. It came with mashed potatoes and vegetables. I was grateful that the sides were good because they didn't bring me a steak knife and didn't come to check on our meal for several minutes. Unfortunately this impacted my enjoyment of the steak a bit. It was delicious but a tad cooled. we didn't stay for dessert. I think if we go back it won't be for a romantic dinner (just a night out.", "Date": "2012-09-17", "Author_Location": "Seattle, WA"}, {"Author": "Michael C.", "ReviewID": "H7N_Op7KpoMmO2ZTZPYp_Q", "Overall": "5.0", "Content": "First off, I am Italian. I can honestly say that I have not had better Italian food anywhere else in my 43 years on this earth. I cannot recommend Pasta Bella enough. Simply amazing.", "Date": "2013-05-24", "Author_Location": "Seattle, WA"}, {"Author": "Leatha K.", "ReviewID": "vmDSbENWVjF9fREgFOgOZw", "Overall": "3.0", "Content": "My mom and I opted for the $10 for $20 off Yelp deal and decided to check this place out on a week night. We were seated right away at a small 2 person table - if you haven't been here, it is very small inside with limited seating and it is all table and chair seating. It is a little dim which makes it difficult to read the menus. It took a while for the waiter to get our drink order and when they finally arrived, my soda was completely flat. He changed the tap and brough another glass and again, it was flat (actually it tasted more like soda water than a sprite, there wasn't any flavor and the carbonation was lacking). Since this was a flop, he brought me an Italian Soda instead and it tasted fine. It took a while for him to come back to get our order... we were probably there 30 minutes before we got a chance to order. I ordered the tortillini in gorgonzola sauce and mom tried the chicken marsala. When the food arrived, mine was piping hot and I had to let it cool for a moment, mom's on the other hand was less than warm. Finally after another 15-20 minutes the waitor came back to see how the food was and we told him hers was never even warm. He offered to make her another but by the time it would come out I would have been done eating and we'd be ready to leave. He apologized and boxed things up for us.When he brought our boxed food back, it told us he removed her portion of the dinner and offered us a free dessert for the trouble. We accepted and dinner ended up being quite inexpensive due to the misfortune and my coupon. I understand meals not being ready to go to the table at the same time and sometimes it just happens where one is colder than the other however, I still expect both meals to be hot. I gave 3 stars because the atmospehere was nice, the wait staff was friendly and offered to rectify the error on their own - which goes a long way with me. They were a little slow to get back to the table in reasonable time throughout the meal too. Overall, I will definitely go back here to try other dishes, the food was AWESOME,", "Date": "2013-11-12", "Author_Location": "Lake Stevens, WA"}, {"Author": "Lisa E.", "ReviewID": "n1YmCDs2WvlNULsxEm7s0A", "Overall": "4.0", "Content": "Went here for an early dinner this weekend and loved it! The restaurant was cute and the food was fantastic! The brought out bread with roasted garlic as an appetizer (delicious). I ordered the spinach ravioli stuffed with gorgonzola, sausage and walnuts in an Alfredo and marinara sauce. I enjoyed my meal tremendously and everyone else liked their food too.Decently priced, quick service, delicious food. Our waiter wasn't exactly friendly--I don't think he cracked a smile once. But the service was decent despite the frosty attitude.", "Date": "2012-08-06", "Author_Location": "Portland, OR"}, {"Author": "Vincent T.", "ReviewID": "hcteAnZ1NLlX_csZJHHnng", "Overall": "4.0", "Content": "Beautiful decor in a decent neighbor with reasonable prices. Terrible lattes however (no foam?!)", "Date": "2014-02-27", "Author_Location": "Hampton Bays, NY"}, {"Author": "Matthew P.", "ReviewID": "FniVVzjIoi_GmcYlQBai0g", "Overall": "4.0", "Content": "A nice little unpretentious restaurant with GREAT pasta.  I tend to associate Italian restaurants with over-cooked pasta slathered in red sauce and generally avoid them.  Pasta Bella, much to my delight, definitely breaks this mold.  I had their gnocchi while my companion had their mushroom ravioli.  Both were cooked perfectly and had just the right amount of delicious sauce on top.  Add some very nice house wine and crusty bread with roasted garlic and you can see why I was disappointed to be too full for desert.The service was excellent and the restaurant a very pleasant place to enjoy the company of whomever you're dining with.  I'd definitely rate this an excellent date restaurant, if that's what you're looking for.", "Date": "2008-11-09", "Author_Location": "Seattle, WA"}, {"Author": "Marian M.", "ReviewID": "PpBQlmj3c1H2F6cvOrWJ2Q", "Overall": "4.0", "Content": "For reasonably priced Italian in Ballard, Pasta Bella beats Lombardi's anyday.  The food is delicious and comes in generous portions.  As mentioned by the other reviewers, the roasted garlic and bread is simple and heavenly.  I personally like the Frutti de Mare and the Hot Seafood Salad-- the lemony combination of mussels, calamari, and shrimp over a bed of wilted baby mixed greens is so scrumptious!  Parking tip: the espresso stand next door is closed during dinner hours, and I believe it becomes a shared lot with Pasta Bella at that point.  :)", "Date": "2007-07-26", "Author_Location": "Seattle, WA"}, {"Author": "Dee B.", "ReviewID": "IKzdYzGDXa-cxiKP9X0PFA", "Overall": "5.0", "Content": "Involtini is AMAZING and the $20 for $10 Yelp deal makes this place our new favorite Italian. Can't wait to try the veal!!", "Date": "2013-07-07", "Author_Location": "Lynnwood, WA"}, {"Author": "Stan F.", "ReviewID": "DnNS8BgwVCMY0R7cMjRmlg", "Overall": "4.0", "Content": "I've been meaning to try this restaurant.  We went here when we were trying to avoid going out in potential snow and they happened to be open when other places were closed.  I'm happy because we always wanted to try this restaurant.  When we got there, we were the only ones in the restaurant.  I felt bad at first as though they might want to close early because of the weather forecast, MLK holiday, and just being a Monday when restaurants seem to be a little slow anyways.We had the Ceaser salad and ministrone soup to start.  The Ceaser salad was excellent, one of the best Ceaser salads that I have had.  The ministrone soup was a little on the tomato-ey side and in a very small shallow bowl, so not a whole lot to enjoy.  I thought this was okay, not great, but not horrible.They start you off complimentary hot bread and some roasted garlic cloves.  There is oil at the table or you can ask for butter which also tastes pretty darn good with hot bread and roasted garlic on a cold evening.For the main course, I had the hallibut special which was hallibut pan seared with a picatta sauce and accompanied with pasta with pesto sauce and some sauteed vegetables (broccoli, winter squash, bell pepper).  My better half had the gnocchi with a pink carbonara sauce.  Both were pretty good.  For dessert, we all shared the hot bread pudding with raisins pears and whipped cream.  This was very tasty!Overall, I was happy to know that this restaurant was here.  I liked it pretty much.  The price was a little more than what I thought it should be (towards the upper end of the $$ bracket), but overall it was a positive experience.", "Date": "2012-01-17", "Author_Location": "Seattle, WA"}, {"Author": "Krishna S.", "ReviewID": "FAFC6Elf5tyh1theMxvMbQ", "Overall": "2.0", "Content": "This was a pretty lackluster pasta place. I think I got the carbonara and it was not that good. Definitely isn't a place I would bother visiting again for pasta.", "Date": "2013-08-17", "Author_Location": "Seattle, WA"}, {"Author": "Jacque C.", "ReviewID": "AJRJZfZAH5sXTFQIEduCKw", "Overall": "4.0", "Content": "I recently went to Pasta Bella after not having stopped in years and all the memories of great food came flooding back.  This is a great little place; they're just focused on good food and making sure your evening is lovely.  We bumped into two other parties we knew while there and they both reaffirmed their dinners were as great as ours.  I had the carbonara and it was perfection.  My companion had the spaghetti and loved it.  Our friends had my traditional favorite; a filled pasta with chicken pesto and walnuts.  If you want a quaint little place with great prices and even better food, you can't go wrong here.  Very sweet.", "Date": "2013-10-07", "Author_Location": "Seattle, WA"}, {"Author": "Jeanine Q.", "ReviewID": "RgzBC_jK5hlB_VL8Kh7e7A", "Overall": "3.0", "Content": "Food was average, service was okay. There weren't a lot of people there at 8pm on a Saturday, which was a bit odd to me.  I'm not sure if I would go again, but the ambiance was nice for a date or meeting.", "Date": "2013-06-23", "Author_Location": "Seattle, WA"}, {"Author": "gretchen m.", "ReviewID": "oM3n4jz9uFBZoZaojV6GAg", "Overall": "3.0", "Content": "This is not the best italian restaurant by a long shot, but... its ok. I could go on about all the mediocre things about it, but it has something really great. Its quirky, a little homey, and has an intimate local feeling especially on a busy friday night. We really enjoy going there. Nice bread and roasted garlic to start. Stay away from anything with a marsala sauce - it is sickly sweet, but the cream based sauces are okay. The wine selection is not that good, but the service is excellent. I have had a good lasagna and an eggplant dish with bechamel sauce that was delicious. My husband enjoys the veal in lemon sauce. The creme caramel dessert is fantastic and worth going there for. So - a balance of good and eh, and reasonably priced.A perfect place for a weeknight outing. It is very convenient because of the parking lot next door.", "Date": "2011-05-27", "Author_Location": "Seattle, WA"}, {"Author": "Felisa D.", "ReviewID": "bs8P6891xq_yJWFxBAEsBw", "Overall": "4.0", "Content": "This place is very reminiscent of the restaurants in Little Italy in Boston. There's the cheesy decor that clearly did not get the memo about modernism being all the rage when it comes to restaurant atmosphere these days. It reminds you a little of your grandma's house because it has that small, cozy, neighborhood-joint feel going. The kind that reads, \"I know these young'ns like to be all modern but I ain't doing none of that\" (because I imagine all grandparents are sassy and have that Southern twang going on... In fact, I think I was particularly picturing Paula Deen in my head) They were even playing Frank Sinatra songs to seemingly finish off that theme they have going. They like the 50s. They're Italian. They ain't changing for nobody.They started us off with bread and roasted garlic cloves. Oh my goodness. I kept sipping the crap out of my wine to make myself slow down over the bread and the cloves and to ensure my friend got his fair share. Then the food arrived and while my dish was a little on the salty side, it was very flavorful. Also, when it first arrived I thought I would need dessert to supplement my dinner but it was so rich that by the end, I was stuffed and I had to leave a couple of bites on my plate. It totally hit the spot.It's not the height of culinary amazingness. It's not the best Italian restaurant ever (or even in Seattle). I was hoping it would be! But I still liked it. I ultimately appreciated the unapologetic rich Italian-American fare they served. I'd come back!", "Date": "2012-05-03", "Author_Location": "Seattle, WA"}, {"Author": "Reese M.", "ReviewID": "0O4SuoPq22V8fOCUK43DFw", "Overall": "5.0", "Content": "We had our rehearsal dinner here last year. The food is delicious and the service is fast and pleasant. They totally worked with me and my husband to make a really nice menu that would satisfy our 15 guests for a really nice price. Just about every aspect was negotiable and the manager was so friendly and accomodating. I can't think of a bad thing to say.", "Date": "2007-10-26", "Author_Location": "Seattle, WA"}, {"Author": "Eric S.", "ReviewID": "4chpxePkxcRF-uPyrNZSHg", "Overall": "5.0", "Content": "When the occasion calls for a special evening out, and relaxed casual, Pasta Bella fits the bill. Nice local down-to-Earth feel yet Euro-esque.I've been here probably a couple dozen times over the past 20 years and it is consistently a nice experience. Great friendly service, tasty Italian dishes, mostly fair prices. ...and of course FRESH made pasta done just right. Note: I have only had the meat-free dishes here.There may be a wait on weekends and holidays, but weeknights have been easy and good service lately.", "Date": "2010-11-26", "Author_Location": "Seattle, WA"}, {"Author": "Mandy C.", "ReviewID": "tDTNUJ5sX7aXC671ioBx-g", "Overall": "3.0", "Content": "I ate here tonight so my memory is fresh.  My dinner mate & I decided to try this place after consulting the menu on the front door & thought, 'what the hell!'  We order an appetizer off the \"Garlic Fest\" menu supplement because a garlic fest sounds kind of ridiculous but something you just gotta try.  We had the carbonara garlic dip with toasted baguette.  I described it as a kind of 'Italian chowder-like dip' with pancetta & cream.  It wasn't bad but it also wasn't terribly flavorful either.  (or garlicky, for that matter).We had a house salad and then split the fettuccine with funghi something-er-other.  It was fine.  I won't say it was aaaaamazing or anything like that.  Again, I don't recall it as being particularly flavorful.  The most 'flavorful' thing we ate was the roasted garlic that comes with bread at the beginning of the meal.  We felt that the service was 'uninspired.'  I have to say that it's kind of true.  The guy we had was nice but didn't really engage us.  He was attentive though with the water-refilling & clearing plates away.   I have other fave Italian restaurants personally so I'll keep on trying new joints I come upon.  It may be your kind of place.  I will say that it had a big menu with quite a few choices though.", "Date": "2009-07-30", "Author_Location": "Seattle, WA"}, {"Author": "Sidnee S.", "ReviewID": "OUKaHFj1hqwzEO5zoN5GpA", "Overall": "2.0", "Content": "The first few times I ate at Pasta Bella the good was great. My last visit and the visit before were definitely less than great.  My mom was in town for the weekend, so I thought I would take her to a place that I knew was good. Well it definitely was not good.She ordered lasagna and it came out cold with a messy appearance. It hardly looked like lasagna. I ordered the gnocchi, which I had 2 times before. This time it was hard and seemed undercooked. I never send anything back, but it was basically inedible. They were very apologetic and took it back to fix the issues. It came back and both were the same.  I decided to try it again because maybe it was an off night. I ordered the special. Goat cheese ravioli and it was okay. However there were flies buzzing around and they kept landing in our food. I don't think I will be trying it again. Very disappointing. The inconsistency kills this place.", "Date": "2013-08-21", "Author_Location": "Ballard, Seattle, WA"}, {"Author": "Amy I.", "ReviewID": "YMi9D6PBF8pqCLyqFN31eA", "Overall": "5.0", "Content": "Great first dinner at Pasta Bella! Food was fresh, fast, and super tasty. Service was prompt and friendly, and the atmosphere was sweet and romantic - a perfect end to our weekend. Happy to have discovered a new go-to restaurant!", "Date": "2013-04-21", "Author_Location": "Seattle, WA"}, {"Author": "Stinky C.", "ReviewID": "W3oBxSwquw40r2waCTKtUA", "Overall": "4.0", "Content": "A lovely little restaurant with true Italian flavor.This is a great place for a romantic dinner with someone special.", "Date": "2009-09-19", "Author_Location": "Indianola, WA"}, {"Author": "Allison W.", "ReviewID": "BX8lJwOLJkpH4SM0ApmZDw", "Overall": "2.0", "Content": "I'm being a little harsh by only going two stars, but the salad is no longer included and it really seems like the food has taken a nosedive. With any luck, it was an off night. I used to love this place.", "Date": "2013-05-21", "Author_Location": "Seattle, WA"}, {"Author": "Grant N.", "ReviewID": "KAPiNT4-j_jsuWFoQUYCig", "Overall": "4.0", "Content": "Affordable Italian food has been an enigma for us to find in this area of Seattle so my wife and I were pleased to find Pasta Bella. The inside has character, much more than Olive Garden, as someone else stated. The food was good and service was a tad slow, but we weren't in a hurry. The owner/manager walked around to each table and everyone seemed pleased. Parking could be a little tough if you're having an early dinner but there was a small lot and residential streets. Long story short, we'll be back.", "Date": "2013-03-16", "Author_Location": "Seattle, WA"}, {"Author": "Sam T.", "ReviewID": "8JrZ4EncIyzDf1BLuHna6g", "Overall": "4.0", "Content": "Excellent Food, great service. Ambiance not that great.This has been our favorite Italian coz of the diverse & vegetarian friendly menu they have. I love Ravioli in creamy sauce & my wife loves Linguini in light sauces. So their Menu works out perfect for us and so we drive 40 mins for them :).Recently visited them for our anniversary. The food was Absolutely awesome. My ravioli (Gorgonzola) was solid and my wife loved her Pollo Picatta Lignuine. She kept raving about her perfectly each Vegetable in that was cooked crisp and how perfect the sauce was and she is a harsh food critic, so that says a lot about how well her dish must've been cooked.The Server was awesome. Very knowledgeable about the cooking process and very attentive.The only reason to Not give this place a 5 stars is the ambiance which unfortunately is bad :(. The colors on walls are boring green and red and the whole inside is not very welcoming.", "Date": "2013-12-28", "Author_Location": "Sammamish, WA"}, {"Author": "Angela D.", "ReviewID": "dYzvzqtjYV_MA03wjbahgA", "Overall": "5.0", "Content": "This place is great for traditional Italian. I tend to always get the frutti de mare - delicious. This time we tried the gnocchi pomodoro appetizer which was also fabulous. I really miss the Queen Anne location, but don't mind trekking to Ballard for the frutti de mare every so often.", "Date": "2014-01-05", "Author_Location": "Seattle, WA"}, {"Author": "Trese I.", "ReviewID": "ZuFm2IVJ2lXYucuM_JSAXw", "Overall": "5.0", "Content": "It seems we've found an adorable hidden gem sans the pretentiousness that accompanies so many other Italian restaurants in this town. The food came out fast and was super tasty, our server (Lisa) was cute as a button and bubbly, and the restaurant itself had a really cozy vibe to it. My boyfriend and I decided (3 bites in) to put this place in our dining rotation indefinitely.  Now if you'll excuse me, I'm going to slip comfortably back into my food coma. Oh yeah, and the menu is MUCH larger than what is posted on here. Lots of seafood options!", "Date": "2013-07-12", "Author_Location": "Seattle, WA"}, {"Author": "Pura V.", "ReviewID": "gMJw3WrPsk8P5nme9k_moA", "Overall": "5.0", "Content": "Yummy! Highly recommend this restaurant. I have been a faithful customer for over 10 years- Gorgonzola walnut spinach ravioli is to die for, Involtini is A M A Z I N G, the Halibut piccata is mouth watering- every dish is delish! Not to mention we receive fresh bread with roasted garlic - olive oil and balsamic vinegar for dipping- I'm a dipper!We usually start out with the garlic cheese bread with marinara or calamari with red sauce.We had our wedding reception here- everyone loved it! Definitely worth it if you love Italian!", "Date": "2013-07-01", "Author_Location": "Redmond, WA"}, {"Author": "Kylie S.", "ReviewID": "9N50mSK0L006XbY0qEyh-A", "Overall": "5.0", "Content": "I've been to Pasta Bella a few times now, and every time I leave full and very happy. It's casual Italian, which a very extensive menu, and every kind of pasta you could ever want. I had the goat cheese stuffed ravioii with pears and pine nuts, that was their special, and it was fantastic. (Hoping they add it to the menu). They always offer bread before hand, with roasted garlic, so good! They have parking spaces next to the building, which is very convenient for this location. The service isn't the quickest, as it is a small place so they only have one or two people working, but they always seem friendly enough. Definitely a good spot for a casual yummy Italian meal.", "Date": "2013-12-30", "Author_Location": "Kirkland, WA"}, {"Author": "Tiffany S.", "ReviewID": "z72xsR38UpHFoC2B44L92Q", "Overall": "4.0", "Content": "Got takeout there from a very helpful staff. Along with our very well-wrapped dishes we received hot bread with roasted garlic cloves. Needless to say, we couldn't wait and there is now roasted garlic on our car seats. We ordered a pesto dish and a marsala fettucine. The fettucine was wonderfully homemade though I thought the sauce was a little sweet. Maybe that's what real marsala tastes like. We can't wait to go back and eat in the restaurant. I hear you can park behind the Espresso place just to the south.", "Date": "2006-10-21", "Author_Location": "Seattle, WA"}, {"Author": "Joel C.", "ReviewID": "iuTU2Xy9Yg7RuMPLjHVhhw", "Overall": "4.0", "Content": "This is a great neighborhood restaurant that's a little off the beaten path. Which is to say it's on a major thoroughfare (15th), but not in a spot with a lot of other restaurants. But I'm glad that I finally checked it out. The atmosphere is very cozy and it's easy to forget you're on a major road. The food was great and our waiter was friendly. We had no wait on a Thursday night, but a good number of other people were in there. We're both vegetarian and there were lots of good options for us. I had the seasonal ravioli (pear gorgonzola in cream sauce, with shaved pear slices cooked in the sauce) and was impressed. This is a great place for a casual, mid-priced, neighborhood night out.", "Date": "2013-03-03", "Author_Location": "Seattle, WA"}, {"Author": "Laural B.", "ReviewID": "7wmiCHtbwyRlsSPHcvZf7Q", "Overall": "4.0", "Content": "Oh how I love this place. Not only is it superior Italian food, but it's two blocks from my apartment. Cozy-to-cramped in a good way and so tasty. Prices are reasonable as well.", "Date": "2005-10-14", "Author_Location": "Bellevue, WA"}, {"Author": "Diana F.", "ReviewID": "Bu3HBt9NQWyp84bKxElglg", "Overall": "4.0", "Content": "It's consistently good food! At a decent price.  Love the pasta de mari.", "Date": "2013-04-06", "Author_Location": "Bentonville, AR"}, {"Author": "Tom N.", "ReviewID": "3zW8HV_1RmgBa1yUuUFubQ", "Overall": "5.0", "Content": "I HATE ITALIAN FOOD! but after coming here...I think I'm only going to give this place a chance. I remembered walking in and found this place dead empty, but I had hopes for my fellow yelpers and this place is real nice, a nice place for a first date in the future. Anyways, on to the food.Their $23 dollar steak was fucking amazing. It came with tasty smash potatoes and soft steam veggies. I had to finish them all so I can enjoy my lovely steak. The best $23 dollar steak I've ever had. I forgot the name of it, but it had some vinegar in it.The service? The man was the best waiter I've ever had so far. He gave great recommendations and was a bit cocky to say everything was good, which it was... my group of six all loved their food and I tried all their food as well and it was flavorful. He refilled our waters consistently, remembered our orders easily and even our cards. That man was a true professional, so for once, I had to tip someone 20%.", "Date": "2011-09-04", "Author_Location": "Seattle, WA"}, {"Author": "Sumanth G.", "ReviewID": "nsZJq8Q0aHm0RiiHEusduw", "Overall": "5.0", "Content": "The best Italian food I have had in Seattle, and this was our second time there. The ravioli was fantastic", "Date": "2013-11-16", "Author_Location": "Bellevue, WA"}, {"Author": "Joel M.", "ReviewID": "QTNw11dAri3g4WtcSOQF2A", "Overall": "4.0", "Content": "I've been to Pasta Bella several times. The food and service is consistently good. The decor leaves a lot to be desired, but hey, I was there for food.My favorite place close to home changed hands a few months ago and I've been looking for a new go to place when I don't feel like cooking. l noticed the Yelp deal $10 for $20 and decided to go by myself. The service was excellent, the waiter was attentive without hovering, informed on the menu and offered recommendations and suggestions.While I don't usually eat out by myself, it was a very comfortable experience. The music was pleasant and fitting for an Italian restaurant.I started with the Spinach salad and had the Pumpkin Ravioli special. The Spinach salad was truly the best salad I've ever had. At the waiters suggestion, I added pine nuts to the Pumpkin Ravioli and it was perfect.The first two times I was there, they were quite busy and I have to say that when they are busy, the acoustics are terrible. Hopefully they'll put some ceiling tiles up to help out with that. I'll definitely be going back and am looking forward to trying the Hot Seafood Salad.", "Date": "2013-10-15", "Author_Location": "Seattle, WA"}, {"Author": "Adam S.", "ReviewID": "0YYYtBm5C4ijziLX5Dqn6Q", "Overall": "4.0", "Content": "What a find!  Great little place; packed with locals on a Tuesday night (always a good sign); a comfortable, neighborhood atmosphere and REALLY good food.Okay, can't do the review without a couple of gripes:  The service was VERY slow.  They seemed to have only two waiters and the owner serving what has to be at least 30 tables.  Even though there were only two of us, our table was reaaalllly small.  We had to set a few things on the ledge next to the table and it was still very cramped and crammed.The food was very good.  We started with an antipasto that had some very good components.  My father in law had a pasta dish which had fresh, tasty pasta and  a good sauce.  I had a lasagna that was outstanding.  rich, slow baked, wonderful layers of cheese and sausage, really it was an exceptional lasagna.  Dad had a cannoli for desert that was soso.  Too many ingredients smothering what should have been a simple dessert.What really stood out here was the value.  Two beers, a glass of wine, a large sized appetizer, two entres, a dessert and a cappucino for $65.00.  In Seattle THATS a bargain!", "Date": "2008-09-07", "Author_Location": "Albuquerque, NM"}, {"Author": "Emma C.", "ReviewID": "9mHqnh0bdV4MLdQpXFci4w", "Overall": "4.0", "Content": "Great service! Very good food. We will definitely be back!", "Date": "2013-08-08", "Author_Location": "Ballard, Seattle, WA"}, {"Author": "Sheri N.", "ReviewID": "CJlXZh_INAYOyF8NKV11nA", "Overall": "5.0", "Content": "i loved everything about this place!the decor is so cute.  it's dimly lit, dark green walls [ or so i remember -- i was in an inebriated state that evening ]  olive jugs and wine jugs lined the walls...  great place for a date, and cozy for a group dinner.the start you off with roasted garlic and bread.   mmmmmm...  had we not been in the company of people, the bf and i would have torn all that up and then some!  i had the eggplant melanzane -- slices of eggplant rolled then stuff with herbs and cheese on a bed of pasta w/marinara sauce.    mmmmmmmmm... i still think about that dish to this day!  the bf had some kind of stuffed crab pasta dish that's his staple whenever he goes there.  our couple company had steak and a pasta dish that they enjoyed as well.  we had two bottles of wine [later to see the same bottle of wine for 6.99 @ the grocery store -- there $28...markups...what can u say?!?]  and that was our night.  i believe that we were too stuffed for dessert.it was really good there.  it was like eating at someone's home in italy.  casual spot with a great home cooked meal feel to it!i definitely want to go back the next time i'm back in seattle!", "Date": "2007-06-04", "Author_Location": "San Francisco, CA"}, {"Author": "dean c.", "ReviewID": "FCBWYK31xiD9cEHpDmJeSg", "Overall": "4.0", "Content": "I took my girlfriend here for Valentine's day. Pasta Bella isn't the very best place to go for Italian in Seattle by any stretch, but the food is good and I think it has a really pleasant atmosphere. It's also laid back and reasonably priced. The place was packed when we went in, super busy, but everyone working seemed like a total pro. Without having to be forgiving because they were slammed, I can say that we received excellent service. They were out of steaks, but I made really late reservations so it was understandable. The waiter recommended the braised lamb shank instead, their osso buco, which was delicious; that dish is pretty hard to fuck up. My girlfriend had some eggplant pasta dish and enjoyed it.", "Date": "2008-02-16", "Author_Location": "Seattle, WA"}, {"Author": "ron p.", "ReviewID": "OLxcsUIg3w9HtJQhv5BUZQ", "Overall": "5.0", "Content": "I gotta tell you, this place is amazing! David (owner) has continued to run his operation for years now with consistency and flavors that slaps you in the face every time you go here with your taste buds asking \"What has taken you so long to return?!?\". I went here for dinner recently and could not remember a better Italian meal from anywhere else in the city. Their menu has changed and prices has increased significantly over the years but if you dont mind paying a bit more for amazing Italian, Pasta Bella is the place to be. Our waiter was great (Macie), Poland dude, very attentive, friendly, knowledgeable and on top of things. The Caprese was delicious with fresh tomatoes & even fresher mozzarella. We had the Pesto Tortellini which melts in your mouth like it was freshly made tortellini right out of the machine along with a Pesto sauce that was not too creamy or bland. Our other dish was the Linguine Amatriciana (+ chx) and boy was it delicious. Bursting with flavors, just the right spices, wonderful sun-dried tomatoes, romas, just the right amount of olive oil, this dish was a freaking masterpiece! Then we washed everything down with a bottle of Montepulciano which on Tuesdays is discount wine night ;)The only sadness to the evening was Owner David not being around (out of town). We were hoping to see him and say hi.", "Date": "2011-02-09", "Author_Location": "Seattle, WA"}, {"Author": "Mohammed R.", "ReviewID": "fY04x_Lvz8RvHjVRGeOkJQ", "Overall": "5.0", "Content": "By far this is the best Italian place that I have been to in Seattle. To say the taste was mouth watering would be a bit of an understatement.", "Date": "2011-11-20", "Author_Location": "Seattle, WA"}, {"Author": "Amanda K.", "ReviewID": "or9e0Mk7mP3ZKSuVqVHS1A", "Overall": "4.0", "Content": "More than expected from the outside. We were walking home from blockbuster and starving, so we stopped here for a \"quick\" bite. Ended up not being so quick, but much more than we anticipated. I ordered the chicken panacotta which was delicious and the salad. since I was already getting an entree and a salad I decided to take part in their $20 special where you get 3 courses for $20.  However, by the time I got to dessert, I was just WAY too full. I like that atmosphere and the food. I was pleasantly surprised by the fact that there were so many people.  Spinach salad was delicious, but tiramisu was mediocre.", "Date": "2008-07-30", "Author_Location": "Seattle, WA"}, {"Author": "Danielle B.", "ReviewID": "SscaVIyenGj_nOmlBbjBWQ", "Overall": "3.0", "Content": "Food was okay, but over priced.  I recommend the Alfredo.  The service was SLLLLOOOWWWW!  Our waiter was very nice but he was the only one on the floor so I guess the slowness wasn't totally his fault.  They did have really good bread with whole roasted garlic cloves, which I loved.  All-in-All I've been there done that, NEXT.", "Date": "2008-01-02", "Author_Location": "Seattle, WA"}, {"Author": "Kelly M.", "ReviewID": "oMnX3WUM0829DT0R2lBcGg", "Overall": "2.0", "Content": "I really wanted to love this cute little restaurant but I am sad to say they didn't make the cut.  Simple Italian food is based on good ingredients.  Pre-grated parmesan cheese, pre-sliced canned olives, watery bland caesar dressing, stale croutons and other short cuts resulted in flat flavorless food.  Taste your food, even if you have made it a million times.  Our waiter on the other hand was top notch, perhaps he should find a venue that matches his talents.  Here's hoping they put some extra effort into their food in the future.", "Date": "2012-01-14", "Author_Location": "Seattle, WA"}, {"Author": "Scott S.", "ReviewID": "IFyzXuNQUC2fMOkpbB-SBA", "Overall": "4.0", "Content": "I have been going to Pasta Bella off and on for the last 15 years, more so in the last 2 or 3 years.  I really enjoy it every time I visit- from the great italian mood music (opera, Dean Martin, etc) to the garlic aroma- especially in the winter when it's cold outside and the windows are misted up, and the Italian Courtyard decor. One thing that comes to mind right away is the baked garlic and bread, also with oil and balsamic vinegar- I appreciate a restaurant that provides a quality bread plate! The basics are all done pretty well- Spaghetti, Lasagna, Ravioli.  I really enjoy the following-Pollo Involtini- Chicken Breast stuffed with Italian Sausage, Pine nuts, Spinach and raisins.  The sauce is a garlic marsala with mushrooms and sun dried tomatoes.  The sauce brings a great full earthy taste to the dish.Linguini con Pollo Agrodolce- Another great chicken dish sautéed with Apricot, Rosemary, Onions, and Green Apples and covered with a great Mango Chutney tomato sauce.The Manicotti con Granchi e Spinachi- stuffed with Dungeoness Crab and Spinach and covered with a red and a white sauce is another favorite.A great appetizer to have, when in season, is the Crab and Artichoke dip, very tasty.The menu is very robust, the wait staff has always been very good and personable and the prices are reasonable, especially if you use an Entertainment book coupon. I say check it out!", "Date": "2010-09-23", "Author_Location": "Rocklin, CA"}, {"Author": "Martha T.", "ReviewID": "3inkfqz6bQ9NMGxR3gLKLA", "Overall": "5.0", "Content": "My husband, son and I went to Pasta Bella for dinner yesterday.   Everything about this place is stellar.  The atmosphere is delightful, the staff is friendly and they know their stuff,  parking was easy and the food was amazingly delicious.  Their location is good too.  It's in Ballard.  I think they had one on Queen Anne, but closed it so all those Queen Anne fans could always drive down to Ballard without too much traffic.  The owner came over and talked to us a bit.  I wanted to hug him.  He made our experience delightful.  I looked around as people were eating and I could see everyone there was enjoying their food and having a good time.   I highly recommend Pasta Bella in Ballard.", "Date": "2011-10-29", "Author_Location": "Seattle, WA"}, {"Author": "Mike D.", "ReviewID": "1E9hqLy9ztDPS7Z24-brUQ", "Overall": "5.0", "Content": "The best Italian food in Seattle by far.", "Date": "2011-06-03", "Author_Location": "Vallejo, CA"}, {"Author": "Rachel M.", "ReviewID": "tkkDBps0nzZsvf98a2-pEQ", "Overall": "5.0", "Content": "So glad we found Pasta Bella! The atmosphere was very warm and cozy; it looks like the place was garages at some point, so each little room is sort of long and narrow and a few inches lower than the one before. The waitress was sweet and attentive and helpful with the menu. They brought out bread with roasted garlic, oil and vinegar before our salads came. We had caesar salads and I ordered the linguine with clams, and my husband ordered chicken marsala. The pasta tastes and feels homemade, and the linguine with clams was in a light sauce with diced tomatoes. It was delicious.", "Date": "2013-10-07", "Author_Location": "Seattle, WA"}, {"Author": "Stephen K.", "ReviewID": "fZkyDC0F2HDv10vCFlRX7Q", "Overall": "3.0", "Content": "Very decent italian food. The ambiance is very nice too, although the decor is a little cheesy. All the amazing legit italian joints I've ever been in have old family photos of people not smiling. This one has duplicates of italian masterpieces.. whatever though, our experience was very pleasant.", "Date": "2012-01-14", "Author_Location": "Seattle, WA"}, {"Author": "Linda S.", "ReviewID": "tKhIjk5WEpQ44iyWGIXxLA", "Overall": "4.0", "Content": "My husband, son and I decided to have dinner at Pasta Bella on a Tuesday night.  The atmosphere was pleasant.  My son had the basic cheese pizza that he thought was delicious.  We were happy to purchase a Yelp coupon that basically paid for our appetizer and one side salad.  My husband had the Mellanzana Mediterranea and I had the Baked Ziti.  Both dishes were excellent and portions were enough to have for lunch the next day.  This long time Ballard establishment will certainly stand the test of time with great meals and service.", "Date": "2013-09-25", "Author_Location": "Seattle, WA"}, {"Author": "YW T.", "ReviewID": "kqrpN6dkdRlv2BgelMdY3Q", "Overall": "4.0", "Content": "this is definitely one of our favorite italian places. the food is always delicious and perfectly seasoned. i always order the prosciutto wrapped chicken breast with creamy sauteed mushroom and sun dried tomato garlic sauce along with veggies and pasta on the side from their special (it's available as a special most of the time). ok, i just drooled on my keyboard when typing the last sentence... i took one star off because the service hasn't been consistent. sometimes they're really attentive, and sometimes they're just there to hang out with each other.  although i must say that the last time i visited (last week), the service was good.", "Date": "2009-02-06", "Author_Location": "Seattle, WA"}, {"Author": "AJ M.", "ReviewID": "b0tK84_G0ttM81JoidN_Vw", "Overall": "4.0", "Content": "Good food, better service.", "Date": "2013-08-20", "Author_Location": "Orlando, FL"}, {"Author": "Winnie C.", "ReviewID": "bHrX_jpVu2m3n-yu1yAsRg", "Overall": "4.0", "Content": "Went there for a girls night out. It was delicious. The waiter treated us well. It was a nice petite Italian restaurant. I would recommend this place.", "Date": "2013-08-16", "Author_Location": "Seattle, WA"}, {"Author": "Carrie P.", "ReviewID": "PGYpCUmimY3pk3TIPY2eTA", "Overall": "5.0", "Content": "My husband and I eat here frequently.  We love their menu.  There are so many menu choices and anything you get is pretty much guaranteed to be good.  Service is always great and we've never had to wait to be seated.  Menu prices are reasonable.", "Date": "2009-09-19", "Author_Location": "Seattle, WA"}, {"Author": "Amber H.", "ReviewID": "hjNbAAqPoChWXpNhq0CUpA", "Overall": "5.0", "Content": "I can only rate the food, as I've never actually eaten in the restaurant but it consistently looks busy and the staff is always very helpful and friendly when I pop in to pick up my take-out. They were friendly even before they started to recognize that I was a repeat customer (I order take-out a lot) and it always seemed to me like people were thanking their servers, etc as the left so I'm a bit surprised to hear some of the complaints I've read here. Growing up in NJ, in what I like to refer to as 3 square miles of guido, I was lucky enough to experience quite a bit of true Italian cooking. Everything I've tried from Pasta Bella gets it right. Their dishes are flavorful and don't feel like they're drowning in grease or sauce (yet you still get an ample amount for dipping your bread in). Their homemade ceasar dressing is absolutely amazing, and even with take-out, they include some of their delicious warm bread with roasted garlic. My favorite dish is the Chicken Marsala, which rivals the home cooking of a \"straight off the boat\" Italian I know.  The only \"cons\" I can think about regarding Pasta Bella are that they don't deliver (but really, dining at their establishment is their forte so I can't really fault them for that) and they are slightly more expensive than some of the other \"Italian\" restaurants in the area but in my opinion  you get what you pay for. Sure, Pasta Bella might be a few bucks more (and really, it's not that much more expensive than Palermo or the other \"Italian\" places in the area who are really glorified pizzerias) but the quality is MUCH higher.", "Date": "2011-07-31", "Author_Location": "Seattle, WA"}, {"Author": "Chris R.", "ReviewID": "v0splSJHaIm9k6f2jKsOtw", "Overall": "4.0", "Content": "One of the best Italian restaurants in town. Small but with great atmosphere. Good for groups or a date. Consistently fantastic food and service. You will love this place.", "Date": "2007-04-06", "Author_Location": "Seattle, WA"}, {"Author": "Christina L.", "ReviewID": "zPUrmqevfAXUgQkAjlXOFA", "Overall": "4.0", "Content": "We went here as a family for the 1st time last night. Restaurant has a cute but worn atmosphere, kind of shabby chic I guess. At first I was a little skeptical as there werent many people in there and no kids (we had our 8 year old and 14 month old.) But as we sat there more people trickled in, with kids in tow as well.Anyhow, on to the food!! I have to say YUM YUM YUM. Delightful that they serve bread with roasted garlic, and you can dip in the olive oil and balsamic vinegar. They dont bring much butter since they have this for you on the table.I had Linguine con pollo piccata, very delish!! Nicely cooked chicken breast with a lemony caper sauce, just the right amount of lemony goodness, that came atop linguine and a side of veggies that included carrots, broccoli, and zucchini which were very nicely seasoned as well. My fiance had Gnocchi but I dont remember what sauce, it was kind of a creamy tomato-y kind of sauce, it was also very good. The gnocchi were nice and fluffy, but a little chewy and good. My daughter had the kids alfredo with chicken and it was delicious as well. The chicken was well seasoned and the sauce was just the right amount of garlicky creaminess, and the noodles were cooked to perfection. We also had the \"fried ravioli\" for appetizer, which was the only dish that I would say was just \"ok.\" It wasnt the fried ravioli you would get at say, the olive garden. It was not breaded, it was just kind of sauteed so that the pasta part was crispy and then they put a tomato sauce over it, where as im used to having a sauce on the sice to dip it in. Overall the experience was good, and I would definitely return here for some delicious pasta again!!", "Date": "2010-08-17", "Author_Location": "Kent, WA"}, {"Author": "Delairen B.", "ReviewID": "C6_jsoUA5xlRk_R42bEOPw", "Overall": "3.0", "Content": "We went here because someone gave us a coupon for buy-one-get-one-free entree, and it seemed like it could be good. They were able to seat us quickly and without a reservation, which was nice. They served us complimentary bread and... roasted garlic YUM. The roasted garlic was almost enough to earn this place an additional star. It was that good. Unfortunately, it was probably also the best part of the meal. We ordered the small caesar salad, the gnocchi appetizer, the lasagna and the pollo parmagiana. The salad was fine. Unremarkable, but okay. So hubby and I came down split on the Gnocchi though. He liked it. I thought it was a little too mushy. (I prefer a slightly firmer gnocchi). The sauce was pretty tasty however, and this dish was probably my favorite after the bread.The Lasagna, was okay, but also unremarkable. The Pollo Parmagiana was a mix. The Pollo part was yummy, can't really go wrong with breaded and fried chicken, lol. But the pasta was overcooked and again, the sauce was unremarkable. It was served with a side of veggies that was pretty good though. Overall, with the coupon, I'd say it was worth the price. But I wouldn't go back and pay full price for what we received. In fact, there wasn't really anything I'd go back for, except the bread and garlic, and honestly, I can easily do that at home so... yeah, not really baaaaad... but not great either.", "Date": "2008-03-23", "Author_Location": "San Francisco, CA"}, {"Author": "Lorena D.", "ReviewID": "vHyzxViopVGDuvq5lX8drQ", "Overall": "4.0", "Content": "This is my preferred place to get Italian. I can't count how many times I've eaten here with various friends, and I think everyone has enjoyed it. The staff are very friendly and welcoming, the restaurant is cozy, and while the food isn't phenomenal, the menu offers good variety and most of it is really consistently good. I never worry that I'll be disappointed if I order something new. And I love the roasted garlic and oil and vinegar they offer with the bread basket. We're always too full to eat dessert there, but they're very good about packing up any leftovers for us, as well as dessert to go. They even do a good job with large groups, something I think most Seattle restaurants don't handle very well.", "Date": "2011-06-18", "Author_Location": "Seattle, WA"}, {"Author": "Kate W.", "ReviewID": "8zCpD60mR-9HnzNQs5y0cw", "Overall": "3.0", "Content": "I was recently here with a group of 7 other women -- we had to wait 20 min for our table, despite a reservation made a week in advance (it was the other table's fault for taking too long ... according to the waiter). The service was incredibly slow - from the waiter bordering on inattentive, to having to ask for water refills, to it taking almost 2 hours to get our entrees. (Our reservation was at 815, we sat down ~ 835, we didn't get entrees until 955). To the waiter's credit, we were a group of 8 women and were talking - but still, the timing between our orders, our salads and our entrees was extremely long.The saving grace was the food - which was delicious. Amazing pasta, cooked just perfectly and lovely flavor combinations.I wouldn't go back right away, as there are so many options in Seattle, but know its a go-to option for Italian cuisine. I would probably not return with a big group.", "Date": "2013-07-07", "Author_Location": "San Francisco, CA"}, {"Author": "Matt M.", "ReviewID": "EhTHjVpJB3cC14sybt0OyQ", "Overall": "5.0", "Content": "Consistently great since the mid-90s!My wife and I came here a few times when we lived in Magnolia back in the mid-90s and always enjoyed it. The food and the service were great. Imagine our pleasant surprise when we noticed it was still in business all these years later when we drove by while visiting Seattle with our teenage kids this July! We just had to eat there again. I am happy to report that nothing has changed in 15 years!", "Date": "2012-08-29", "Author_Location": "Bay Village, OH"}, {"Author": "Randall L.", "ReviewID": "wNS6LLCqHT7cptsAZq2uAA", "Overall": "3.0", "Content": "Not bad for what I call and old school italian-american pasta house.  I didn't care for the anti pasto plate but my pasta was acceptable.", "Date": "2008-03-26", "Author_Location": "Seattle, WA"}, {"Author": "Brian C.", "ReviewID": "qGWYqfl3RSrGyS1M426Fkw", "Overall": "3.0", "Content": "I ordered take out from pasta bella tonight, and while they were very nice to honor my coupon that was supposed to be for dine in only, my raviolis were extremely salty.  I'm sure it's a very nice place and other dishes are good (my tiramasu was tasty, and the bread was nice) but I was in the mood to seriously mow down some Italian food.  I could hardly swallow that last bite.", "Date": "2009-10-23", "Author_Location": "Seattle, WA"}, {"Author": "Jill T.", "ReviewID": "AlSeLh39d5PhLWhpkSxNag", "Overall": "4.0", "Content": "I would usually only give this restaurant 3 stars.  It is really good, but I can get the same type of Italian food at a lot of other restaurants.I will tell you thought, what makes this a 4 star restaurant is the DELICIOUS roasted garlic served with the bread.  It is so delicious I think I could eat it everyday.", "Date": "2011-06-01", "Author_Location": "Seattle, WA"}, {"Author": "Cindy T.", "ReviewID": "9OsWPhcykQ6frcgK-0vs1w", "Overall": "5.0", "Content": "We took our friend to Pasta Bella in Ballard for dinner.  We had never been there before and it's our new favorite.  The atmosphere is romantic, cozy and comfortable all at the same time.  The food was delicious.  I had the halibut picata special and it melted in my mouth - it was the most perfectly cooked halibut I've ever had.  And the service was outstanding too - friendly, attentive, and genuine.Thank you for a terrific evening! We'll be back soon. Cindy", "Date": "2012-04-24", "Author_Location": "Seattle, WA"}, {"Author": "Pamela C.", "ReviewID": "0EsfGwTTMX2CkSmK092Kwg", "Overall": "5.0", "Content": "My favorite restaurant!", "Date": "2012-05-18", "Author_Location": "Edmonds, WA"}, {"Author": "Jan M.", "ReviewID": "hoBxZbtbatJlxXWsw2p2sA", "Overall": "4.0", "Content": "Love the Food. Love the Service. Wish my Ravioli was hot, though:(", "Date": "2012-05-19", "Author_Location": "Mountlake Terrace, WA"}, {"Author": "Mark T.", "ReviewID": "_eLfqDqLwdvgCaq1zgqb2A", "Overall": "4.0", "Content": "We have been going to Pasta Bella since before my eldest daughter was born and tonight we celebrated her high school graduation there. Consistency has been a major reason for our loyalty. Sure, there is better Italian food in Seattle,and even in Ballard, but Pasta Bella has always provided a satisfying and tasty meal at a decent price. Best to order from the specials, but even the base menu has a nice list of choices, from standard Italian fare to more interesting flavor combinations. As for service, they seem to have higher staff turnover even than most restaurants, so you never know who you will get. But we have been generally pleased with the wait staff. We will certainly will continue to return.", "Date": "2012-06-17", "Author_Location": "Ballard, Seattle, WA"}, {"Author": "Kara M.", "ReviewID": "StPwxJhUkJC391KDd000kw", "Overall": "3.0", "Content": "Host seemed incredibly new and inexperienced, wait staff did well but lacked the smooth polish of a real professional job. Food was quite good...atmosphere was a little odd. Also, it was cold, the tables and booths weren't up to my standards, and the noise echoed terribly. But the food (usually the focus!) was very good.", "Date": "2013-06-24", "Author_Location": "Ballard, Seattle, WA"}, {"Author": "Gretchen G.", "ReviewID": "m8tjvasKWBJRbtkgM7AweA", "Overall": "1.0", "Content": "I went here for my birthday dinner. It was gross. I had the chicken Parmesan and it tasted like the chicken was freezer burnt.  Not the best. This was my second trip to Pasta Bella and I think they are one step away from being featured on Food Networks Restaurant Impossible. Clearly they need to rethink their current kitchen staff. Save your money fellow pasta seekers Olive Garden deserves ten stars compared to this Italian train wreck!", "Date": "2012-12-02", "Author_Location": "Seattle, WA"}, {"Author": "Elias L.", "ReviewID": "RgQfP7ePVRWA9ZSCYwGYMg", "Overall": "5.0", "Content": "Best pasta I have ever had in my life! The special was goat cheese ravioli with a garlic cream sauce...AMAZING! Server (Jesse) was perfect! suggestions were spot on. Ever the server assistants were pleasant and personable. Will definitely be going back! Date night perfection!", "Date": "2013-05-12", "Author_Location": "Seattle, WA"}, {"Author": "L S.", "ReviewID": "gSQY97nHeGVPrxXXAGrPCA", "Overall": "4.0", "Content": "Pasta Bella has some delicious food. Erik T and I came here a few weeks ago when we didn't know what to have for dinner one night. Driving around Ballard, I had a genius idea! Let's have something GOOD for dinner! Let's go to Pasta Bella! I had previously only dined at the Queen Anne location a couple of years ago with my mom. I didn't think much had changed or that anything would be any different at the Ballard location of this fine Italian restaurant. I was right. The food was great! We enjoyed the complimentary (and delicious!) roasted garlic before our meals were brought to us. I then devoured my entire meal of Linguini Carbonara and Erik made a decent dent in his Spaghetti Bolognese.  My meal was really superb, and Erik later mentioned he kinda wished he had ordered something a little more adventurous than spaghetti. I had a glass of the house chianti, my usual when I go out for Italian. And it always tastes good. Erik ordered a Blueberry Italian soda. It was so good! We contemplated dessert, but since I had finished my entire meal, I was pretty full and Erik was pretty full, so we declined, though all the dessert options sounded delish. For the meal we had and the dining experience we had, I felt the prices were fair. My dish was $13.95 and Erik's spaghetti was $11.95. The portions were large, Erik had a delightful lunch of leftovers the next day. Erik's Italian soda was reasonably priced at $2.95 and my glass of wine was a deal at $4.95. Erik and I decided that when we go back, we'll probably just get a half carafe of wine, a good deal for $12. Erik and I will definitely return to Pasta Bella, not only because of it's close proximity to our home, but because the food was really good! The restaurant itself is cozy and eclectically decorated. Pasta Bella is a must if you live in the neighborhood.", "Date": "2007-04-28", "Author_Location": "Seattle, WA"}, {"Author": "Cat L.", "ReviewID": "73RyMJ98BTk1ege4YGDQtA", "Overall": "4.0", "Content": "I thought the food here was delicious! I am very picky when it comes to Italian food, but I loved everything we ate at this restaurant. The only reason I didn't give it 5 stars is because of the atmosphere (We went to the one on Queen Anne). There's nothing terribly wrong with it, but the decorations and location is a little strange. The servers were prompt, but not very friendly. It felt like they were relatives of the owners helping out, rather than real servers. The food make it all worth while though!", "Date": "2009-03-15", "Author_Location": "Seattle, WA"}, {"Author": "Luisa I.", "ReviewID": "oemvsamhnUluh4IWTpl5YQ", "Overall": "1.0", "Content": "I really thought Pasta Bella would be our new \"go to\" place for Italian food. The place looks so cozy, they seem to have a lot of regular customers, and usually little hole in the wall places turn out to be gems. Unfortunately every part of our experience there was negative. My soup was room temperature, which was a disappointment since I had a cold and was really looking forward to a steamy bowl of soup. My husband ordered lasagne, and it was still chilled in the center. The worst part is when we told the waitress, she was so rude. She rolled her eyes at us and didn't even apologize. When she came back with the re-heated lasagne, it still was cold. I would have given a higher rating if the staff was at least nice about it, but our complaints of the cold food seemed to be a nusissance to them. Also, I wanted to mention that this happened about a year ago and it's been on my mind since...hopefully they've gotten better.", "Date": "2011-02-24", "Author_Location": "Seattle, WA"}, {"Author": "Joey G.", "ReviewID": "uaGiLxJV5K7a-4VmswuRZw", "Overall": "5.0", "Content": "Excellent food! great prices! Just open menu and point everything is good!", "Date": "2012-09-21", "Author_Location": "Seattle, WA"}, {"Author": "Mac J.", "ReviewID": "rzolazcpniGCC0GgGVkFOA", "Overall": "4.0", "Content": "chicken pesto con penne!", "Date": "2008-03-28", "Author_Location": "Seattle, WA"}, {"Author": "erik b.", "ReviewID": "rFGOfwm51IiDq5XNL_6wDQ", "Overall": "3.0", "Content": "the first time i went here, i had found the best itallian restaurant in seattle. everything was perfect: food, service, atmosphere. everything. was. perfect. the second time however, it was terrible. the seating was right next to the bathroom, even though there were plenty of available tables. the place was not busy however, the service was extremely slow. i think it was about twenty minutes from when we were seated until the time we ordered. when we received our food, mine was not what i ordered.  after waiting for the server for a while, i told her about my order. she really made no effort to remedy the situation. so at this point, i was just really hungry and tired, and told her not to worry about it.  i ate what i did not order, and when we were finished, the server just gave us the check. no offer of dessert, drinks, or coffee.  so, i'm up in the air about this place. i will give it another chance, but i don't know when that will be. hopefully my third time will be as great as my first time was.", "Date": "2008-09-12", "Author_Location": "Seattle, WA"}, {"Author": "Leslie S.", "ReviewID": "fsM3__4hd7weX5IPzXmwuA", "Overall": "4.0", "Content": "Leslie S.  My companion had angel hair with chicken and fresh vegetables while I tried the manicotti stuffed with crab.  Both were absolutely delicious.  Bread was hot, roasted garlic soft, merlot pleasing.  The staff was attentive and observant, and the chef came to the table to see how we liked our meals.   This was my first time at the restaurant; I would definitely return, often.", "Date": "2009-09-04", "Author_Location": "Mercer Island, WA"}], "RestaurantInfo": {"RestaurantID": "5Po1F2VTKuTxvGJ0ThqB4w", "Name": "Pasta Bella", "Price": "$$", "RestaurantURL": "/biz/pasta-bella-seattle", "Longitude": " -122.3762", "Address": "5909 15th Ave NWSeattle, WA 98107", "Latitude": " 47.672054799999998", "ImgURL": "//s3-media3.fl.yelpcdn.com/bphoto/-ZDxZ72QhYd6Os6UjcR1Dg/90s.jpg"}}