{"Reviews": [{"Author": "Sean P.", "ReviewID": "2zldAyjhmODtsfEy-Bl0tA", "Overall": "4.0", "Content": "I liked this place. It's kind of loud & pretty hipsterish (I'm not), but good food, service, location, and super prices!I had some chicken yakisoba (with ramen noodles & yum!), kimchi (Korean, but yummy), & lychee soda.  Great & total was $17!! The servers were not Japanese, but the chefs were & that is what counts - authentic yumminess!  Great service topped everything off.", "Date": "2014-06-14", "Author_Location": "Arlington, VA"}, {"Author": "Reed G.", "ReviewID": "oKbt-JTs4mgS7T3E0bkpPA", "Overall": "5.0", "Content": "I love this place.  Great food, atmosphere, and service.  Have been there countless times and really love the menu.  The ramen seems to get the most hype (because it is excellent), but I usually order a whole bunch of appetizers.  So many of them are great and the variety is fun!What isn't to love about this place?  I guess if you need tater tots then you might go somewhere else.", "Date": "2014-05-09", "Author_Location": "Seattle, WA"}, {"Author": "Susannah H.", "ReviewID": "XYy1j4PJjwbENgsCYMixgg", "Overall": "3.0", "Content": "You know what, I stand corrected.  Zen Box Izakaya is a-ok, and is probably the closest thing we have to an actual izakaya so far here in the Twin Cities.  My friend Benny did a great job summarizing it: \"completely sufficient\".  **Indeed, Zen Box Izakaya is completely sufficient:**+ it offers a late night happy hour with sake, beer, and chu-hi+ has small \"tapas\"-style dishes like takoyaki, ramen, edamame, chicken wings, ochazuke, sashimi, etc+ is reasonably priced and offers a nice atmosphere similar to most izakayas**Where sufficient is only so-so:**- the sake selection is pretty meh- no jumbo sizes!!  jumbo beer and jumbo chu-hi = win!- the food that I've had has been pretty \"meh\" so far when it comes to flavor (tonkotsu ramen, miso ramen, chicken wings, takoyaki, and tuna poke)- wish they catered less to the \"Japanese dinner crowd\" and focused more on traditional izakaya fare, like tako-wasa, shishamo, seseri, mochi-bacon, tsukune, bonjiri, okonomiyaki, tebagyoza (if they could do this, I'd be in izakaya heaven), and etc. That being said, I still enjoyed coming here and reliving an izakaya experience and will definitely be back.", "Date": "2014-05-07", "Author_Location": "St Paul, MN"}, {"Author": "Ronnie G.", "ReviewID": "H1YsDR9A3APSG6qG-NyIJA", "Overall": "5.0", "Content": "Public Announcement to all Ramen fans.We made it out to Zen Box recently after being in newborn baby time out for the past few months (Being Elite is challenging when your kid sleeps every two hours...).We stopped in at 5 PM because we now sleep at 8 PM due to the tiny devil. Zen Box was an old favorite of ours.We got there and we were one of the first patrons naturally. We ordered several of our favorites, including Takoyaki and the Tonkatsu Ramen. While the Takoyaki was standard awesomeness, we found the Tonkatsu very different.It was...creamier, more flavorful, more umami-nom nom ness. How could this be? The dish looked exactly the same.We pulled Lina, boss lady, aside. What was going on here? Lina informed us that indeed, they had found a way to improve their broth. She explained the key to great tonkatsu broth was in the pork bones. The better, the more flavorful. What has been elusive was the Berkshire Femur bone off the pig because almost all farmers sell them to dog food manufacturers for higher margins than ramen shops. However, they finally found a farmer who was willing to consistently supply them with femur bones.As a result, their famous Tonkatsu Ramen is now even better than before. Honestly, I've made my fair share of ramen, and this was as good as the Ippudos of the world.So note to self: Go Back, often, and devour this city treasure whenever I can make it out of our home.", "Date": "2014-03-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Bob D.", "ReviewID": "jIARexNaYtetVzo7ywanYA", "Overall": "5.0", "Content": "I love this place. They mention on the menu that you should think of the food as \"Japanese tapas\". I've filed that one in the \"whatever\" category (aren't sushi and yakitori already Japanese tapas?). Nouvelle silliness aside, Zen Box is a great place to go for a few small plates and a beer or two. Nice atmosphere, generally good, friendly service (they can be a little slow getting your first beer to you). Sake selection is OK (I wish they'd replace the house Sho Chiku Bai with something a little drier). Their beer selection is small but thoughtful (I don't recall seeing a super-dry, but I could be wrong). And they have shochu in case you're in the market for a savage headache. Hits (so far) include the aburi salmon (get the kamikaze sauce--you've already tasted teriyaki), the seaweed salad, veggie gyoza (the other one's fine too, but the veggie is remarkable because it's, well, veggie), daigaku imo, onigiri, ramen, ochazuke, any of the grilled dishes (although the tofu skewers are screaming to be brushed with something while they're on the grill) and the kake udon (but don't you wish they also did this one with soba? Me too.). Misses were the tofu donburi (I would have been happy with crispy tofu and sauce on rice topped with maybe a little black sesame or furikake--I REALLY didn't need or want the lettuce) and the yakisoba, which is a tad too sweet and gets sickeningly so after a few bites. Small complaints--there's plenty here to choose from.All-n-all, Zen Box is a new favorite place to go.", "Date": "2014-05-22", "Author_Location": "Minneapolis, MN"}, {"Author": "Nina B.", "ReviewID": "zm2pAOXx2WlU6sjKmldbMw", "Overall": "5.0", "Content": "I've been to Zenbox when they first opened and their food has improved!!! This is one of my favorite happy hour spots and luckily, I live just a few blocks away and visit there quite often! I am in love with their kimchee ramen! It is by far my favorite ramen in the twin cities! Secondly, they have amazing small plates and a reasonably priced menu! If you're like me: I love sharing small plates with my friends so I can try everything, this is the place to be! I love their tako yaki (I believe there is 5 in an order), short ribs with kimchee, and the karaage. (fried chicken) Zen Box is the place to go if you're a fan of Japanese comfort, street food!", "Date": "2014-05-25", "Author_Location": "Minneapolis, MN"}, {"Author": "cat m.", "ReviewID": "yQ2Ix6ts0R_CeCzSpUkMLA", "Overall": "4.0", "Content": "That was freaking delicious! Small plates of Japanese comfort food. We had at our table gyoza, seaweed salad, some kind of thin-sliced semi-raw beef, short ribs, noodle salad, ramen, tofu on a stick, edmame. Hot sake, cold sake. Then two kinds of ice cream, and two kinds of mochi ice cream. Listen. Nobody was talking for a while b/c we were all having private conversations with our food. We ate ourselves silly. Somebody said the rib plate was too small; they wanted more. Somebody wanted to order noodles to take home but she was full and she wasn't sure she could stop herself from eating them once she got them back to her room. So glad we went there! Great service, too. Lots of different people helping bring little plates to our table and top off hot tea and water. Yum!", "Date": "2014-05-09", "Author_Location": "Washington, DC"}, {"Author": "Nnaemeka O.", "ReviewID": "8KEBiqhfHgOmwUsxnBrSrw", "Overall": "5.0", "Content": "Food was amazing and service was great! The Sashimi Kimchi is definitely a must have!", "Date": "2014-05-22", "Author_Location": "Rockville, MD"}, {"Author": "Iain B.", "ReviewID": "WQB0RFtJhY9eKakahprP3g", "Overall": "3.0", "Content": "Not what I expected when I typed sushi into yelp. They do not have sushi.  Great service,  fun location and atmosphere. I sat at the bar and had the sashimi which didn't come with rice. I had to order it as a side. The next surprise was the edamame served cold. I inquired about it and was told that it was better that way. I don't particularly agree. Nor did I care for the table salt used on it. I prefer a sort of sea salt rather than table salt on edamame,  but call me crazy. Worth checking out just not what you're looking for if you want sushi.", "Date": "2014-06-27", "Author_Location": "Bronx, NY"}, {"Author": "Jonathan T.", "ReviewID": "7k4RB6-6xQCG7NV_6GGrsw", "Overall": "4.0", "Content": "Zen Box, congrats on making a fine bowl of ramen! Wow, I can tell that pork broth (aka pork neck/ shoulder bone nectar) is simmered with tremendous love and care. It's similar to how my homie Soupy and his wife Monica take care of their newborn or how Derrick Rose took a whole season off to nurse his knee back to health (before he hurt himself again). I mean, Zen Box  put in work like the girl lookin' fly at the club on her birthday! Ayyyyeeeeee... Oooh yeah, and the broth tastes so nice with that runny soft boiled egg and the al dente noodles that's garnished with fresh scallions, ginger, and salty seaweed. Again, mad props!Tapoyaki (floured and fried octopus balls) were bomb dot com. They were hot and burned my tongue, which means that they were prepared correctly! I love it when folks cook octopus right. Some places overcook it making it chewy. For this Tapoyaki, I could eat this errday.I would give Zen Box five stars if it weren't for the price. $12.50 for a bowl of ramen is a bit steep, especially considering the noodles -which are bomb- are from United Noodles. If you are going to charge $12.50, make those babies fresh! Granted, they are the pricer, non-msg and organic kind (props!) but it still doesn't justify the price for me.I took my lady and paid about 40 bucks for my whole meal (including a generous tip), but that's a bit too much even for downtown. I think a couple dollars cheaper would be more reasonable.Give this place a try!", "Date": "2013-12-04", "Author_Location": "Minneapolis, MN"}, {"Author": "Takashi S.", "ReviewID": "RgBHDsQEU9YcHisr_xkMcg", "Overall": "5.0", "Content": "My favorite and recommendations. Ramen of your choice and sake / shochu.Chicken Kara age, Saba No shioyaki, crispy tofu skewer..... If you have an extra appetite, ask for onigiri to finish.  I want to come back for Katsuta curry soon.", "Date": "2014-02-01", "Author_Location": "London, United Kingdom"}, {"Author": "Jessica L.", "ReviewID": "TzyHblPaQenuZ8ycBv_oOw", "Overall": "4.0", "Content": "Décor: I like that this place is not right in the middle of downtown, so you can usually find a decent parking spot. The place is quite small, and it's got that pop-up small-store Japanese feel to it. Service: Quick and attentive, thanks! They closed at 9 but they politely allowed us to take our time.Food: I was pleasantly surprised by the quality of the food! They have tons of little tapas-style dishes and several bigger entrée sized things. Our table got a multitude of things - including fried chicken, various raw fish salads, rice bowls and ramen. While my ramen broth was just okay, I loved that they had a proper egg- softboiled, with a great runny center (I also presume it was a tea egg). Overall: I liked this place and would definitely come back with some friends for a sharing meal.", "Date": "2013-12-21", "Author_Location": "Minneapolis, MN"}, {"Author": "Donna H.", "ReviewID": "Wbli6FBSTfZD-yyLP93YqA", "Overall": "4.0", "Content": "I was recently in MN for business and as a California girl, I was freezing. Only thing I could think of to warm me up was ramen. Zen Box was close to my hotel and the staff was really friendly. I enjoyed their Tonkatsu Ramen and added corn. The broth had great flavor and was a good size. Glad I found it!", "Date": "2014-04-16", "Author_Location": "San Francisco, CA"}, {"Author": "Jim O.", "ReviewID": "cMQw6z5PfQnm7MD4cIF4wQ", "Overall": "2.0", "Content": "Preface: whenever I eat at any east Asian (Chinese, Japanese, Korean) establishment, I ask if I can do it better myself.In this case, based on one visit, the answer is yes. I had the miso ramen and it was so-so IMO. The service was great but for the price, I'm heading into my own kitchen.", "Date": "2013-10-09", "Author_Location": "Maplewood, MN"}, {"Author": "Autumn V.", "ReviewID": "SWer6JODFf_YTZGvH7ME2g", "Overall": "4.0", "Content": "This place is really good in a non-pretentious way. It just had really good food, good service, and good deals!I came here for a late dinner (I think it was around 9pm) so they had their late happy hour menu out-- lots of good little deals and super delicious food. I'm not sure what their regular menu looks like to be honest.I have to say my guilty, guilty pleasure are the takoyaki balls. Omg, sooo goooood. just wait for it to cool down or you'll have a delicious mouthful of molten lava. The karaage, the ramen, the little apps..... If you are nearby, do yourself a favor and stop here. Your tummy will be so happy that you did.", "Date": "2013-10-03", "Author_Location": "Minneapolis, MN"}, {"Author": "Kien N.", "ReviewID": "d3FM3zWaAXQ2Qg9rgEvdgw", "Overall": "2.0", "Content": "I have eaten here twice for lunch.  The lunch rush ranges from busy to moderately busy.Our first waitress was nice and accommodating, but our second waitress didn't seem like she wanted to be there.Service was slow the first time, and very slow the second time.I had the Katsu curry and the tonkotsu tonzen ramen which were both okay.  My friend's salmon teriyaki was charred black.  I felt bad watching him peel away the black exterior and trying to make out with whatever salmon remains were left.  He was a sad, sad boy.I don't believe the prices justify the quality of the food; it's just an okay place to eat if nothing else comes to mind.I would rather not return considering how inconsistent the food quality and staff are.", "Date": "2013-11-10", "Author_Location": "Minneapolis, MN"}, {"Author": "Annie D.", "ReviewID": "7-CKykTo1GVIc4rbbH7ccA", "Overall": "4.0", "Content": "I guess I'm on a bento kick.I came here for a lunch meeting yesterday and I fully enjoyed my tuna poke bento box. For $13, it comes with a good deal of food: rice (white or brown), edamame, gyoza, a big pile of string-thin cabbage/carrot slaw and savory marinated tuna poke, sliced thickly and served on top of romaine.I'm surprised about the mixed reviews, because I thought the food at Zen Box was pretty fantastic. The rice could've been a little bit stickier (and it was missing the little umeboshi that was SO tasty at Obento Ya), but everything else was awesome. The tuna poke was absolute perfection, but they also offer beef, chicken, pork and tofu bentos.The rest of the menu includes some delicious sounding ramen, soba and udon soups that I would really like to eat. However, yesterday was 100 degrees so that was out of the question.The service was friendly but a little slow, which could be a problem at lunch when people are trying to get in and out. The food came quickly so it evened out.In terms of vibes, this place reminds me of a more approachable Masu. Or a moto-i with better food.All in all, well done, Zen Box. Sorry it's taken me so long to get wise!", "Date": "2013-08-29", "Author_Location": "San Diego, CA"}, {"Author": "Chris P.", "ReviewID": "yER4A4DRRrU8K7gjgPe63g", "Overall": "4.0", "Content": "Zen Box is a small space and very intimate but they are big on the taste of their foods. The menu is ala carte and varied. I had a hard choice deciding upon what to have. As it was a cool night I wanted to start with the hot tea. I don't think they let the tea steep long enough and I found it to be a little weak for my taste. I started with the Shumai Tempura and was not disappointed. There was a full taste and the tempura was nice and light. The dipping sauce added just enough extra flavor to round out the dish. I then asked about the Kimchi as this was listed as a Japanese restaurant and I thought Kimchi was Korean. They told me their version was lighter and less spicy as the Korean version. It was less hot and spicy, although I do like the hot and spicy. It was quite good but the portion is very small. I finished with the Tuna Poke. OMG! The tuna was served just the way I love it! RAW! The poke sauce (or was it a ponzu) was delicious and I was pleasantly pleased with the dish.I do want to return to try additional dishes on the menu. Some in our dining party said to stay away from the ribs as they were dry and not tender at all.", "Date": "2014-05-31", "Author_Location": "Minneapolis, MN"}, {"Author": "Liz A.", "ReviewID": "dX4_DVhcP0yAGvDRDAmD7A", "Overall": "5.0", "Content": "BEST RAMEN IN THE MIDWEST! Yes, Chicago included. My husband is Japanese and I lived in Japan for 5 years.  We both agree that the spicy miso ramen is amazing and the best ramen they have.  It's also probably the best flavor for the American palate.  Get the spicy miso.  Oh, and an Asahi Beer. It's truly worth the extra buck compared to the other beers.  2nd best things: Takoyaki and Grilled Mackerel", "Date": "2014-04-09", "Author_Location": "Minneapolis, MN"}, {"Author": "Jason W.", "ReviewID": "4Z5PJ5QKovZW9uq6xMdm_Q", "Overall": "4.0", "Content": "Came in for lunch on 12-11-13Solid Lunch.  Started off with some apps.  The Takoyaki and Chicken Kara-age.  I'm a  big fan of the octopus Takoyaki, a delicious battered ball that is crispy on the outside and a nice soft texture inside.   The chicken Kara-age is the Japanese version of chicken nuggets.  They come with a dry slaw and sauce and I could sit down and eat a bucket of these.For my lunch entrée I had the short rib bento box that came with miso soup, slaw, brown rice, 2 gyoza's,  edamame  and a small pile of short ribs.I really enjoyed everything and would definitely get this again after I come back and try some other goodies on their menu.If you're downtown  and craving some Japanese don't be afraid to give this place a chance.", "Date": "2013-12-11", "Author_Location": "Minneapolis, MN"}, {"Author": "Mary K.", "ReviewID": "kW_hsgCojT1RKJm_EXkaBg", "Overall": "4.0", "Content": "The ramen is so very very good, and the sushi we had tasted fresh. Service was spot on; the only downside for me is the space is a little \"cold\" feeling; can't quite put my finger on it. I guess I would consider this place as a quick stop and not one where I would linger for a long time.", "Date": "2014-03-29", "Author_Location": "Minneapolis, MN"}, {"Author": "Melissa S.", "ReviewID": "RhYwFJeUCrkLDnsBV71YQg", "Overall": "2.0", "Content": "I've been here twice now, and both times we've had the same server.  He is so weird that it makes me super uncomfortable.  On the one hand, he certainly seems to know what he's talking about when it comes to the food & drinks there.  I do appreciate that.  But on the other hand, he's just really socially awkward...sort of overly friendly in an unprofessional type of way, I'm not sure how else to describe it.Most importantly though, I did not really care for the food.  My friends go on and on about how much they love this place, and I just don't get it.  Maybe I just don't like Japanese food (outside of sushi anyway)?  I was there a few days ago for happy hour and we ordered veggie gyoza (pretty good other than heavy on the raw garlic, which gave me a tummy ache), seaweed salad (barf!  But I don't like seaweed and was forced into trying it even though I know I don't like it), chicken nanban (meh...the chicken itself was actually good but the rest of the flavors were weird), and veggie curry (quite disgusting...reminded me of the pot roasts my mom would make in the crock pot when I was a kid, you know with the carrots & potatoes & gravy.  Blech!).  I didn't order a drink but my friend ordered the calpico and let me have a couple sips of it, and I didn't like that either.  The ramen here is allegedly amazing, so if I ever get talked into go back I'll give that a try.  I just hope I get a different server!", "Date": "2013-08-15", "Author_Location": "Minneapolis, MN"}, {"Author": "Mariel L.", "ReviewID": "L0A4iEXPNp7d-Y4h7p3gLA", "Overall": "4.0", "Content": "Yum, yum, yum. I'm so glad I finally got to eat here after eating at their skyway location at an almost weekly basis. My friends and I came in for Saturday dinner, just as the weather was turning cool. We all got some chu hai; I got the lychee one, and it was delicious, just bursting with lychee flavor. Of course, this being an Izakaya, we ended up ordering mostly small plates with our drinks, and I'm so happy we did because it gave us a chance to try many of their delectable dishes. I'm happily surprised at how affordable the dishes are, and the portions aren't too bad either. I ordered the takoyaki, chashu yaki (grilled pork belly), and the tonkotsu 'tonzen' ramen. My friends ordered tofu, the potato korokke, etc. I didn't really pay attention to their dishes, though, because I was pretty damn happy with the ones I got. The takoyaki was delicious; the octopus was not rubbery, which is fantastic, and the bonito flakes are huge! I liked how it gives the takoyaki balls a unique texture as you're chewing on them. Mmmm, octopus battered balls...The ramen was fattier and creamier than what I imagine to be the 'typical' ramen -- and no, I'm not talking about the 25-cent Tap ramen, thankyouverymuch. It had so many elements and textures. The noodles were al dente, and the broth was just pour-all-over-your-head good. But, my absolute favorite that night was the grilled pork belly. As if pork belly couldn't get any better, it just did. I've had grilled salmon belly before, and that was a heavenly experience. This is on par with that. There's just something about those open flames licking the fat on that pork belly that just gives it an indescribable taste. I know they have \"must try\" written all over their menu, but if there's one thing I 'must try' every time I come here, it's that pork belly. Damn you fat, why must you taste so good?", "Date": "2013-10-24", "Author_Location": "Minneapolis, MN"}, {"Author": "Maggie H.", "ReviewID": "ma7Vk6Ir5cONioaKSBKzyQ", "Overall": "5.0", "Content": "This place is amazing and as soon as I left the first time I couldn't wait to go back. The Onigiri and Takoyaki were my favorites but everything we had was wonderful.", "Date": "2014-04-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Sarah H.", "ReviewID": "96SC-6A-DxgnAMZES-9Lig", "Overall": "4.0", "Content": "My husband and I walk by this location often during lunch but their odd hours have kept it an elusive secret for almost 3 months. We finally planned a date night to a baseball game and on the walk home from the lightrail station, we saw the late night lights on and the patio open to a few last diners. We crept in the door and were greeted with a fun young waiter with a large smile and his karate kid headband on. We sat at the window to people watch and ordered three-four appetizers as it was the late night happy hour and two lychee mason jar drinks. The drinks were great (a little too sweet) but very tasty and unique.  The edemame was deliciously spiced, the seared salmon was tangy and lean and the sea weed salad was also fresh and perfectly spiced. All the food was delicious and a great serving size for just a late night snack/dinner. We left with only a small tab of under 20 bucks and were very happy with the price, the service and the food! We'll be back soon Zen Box you elusive creature!", "Date": "2013-07-29", "Author_Location": "Minneapolis, MN"}, {"Author": "Gary B.", "ReviewID": "YM3P6uuvG3IcJz7K83L3aw", "Overall": "4.0", "Content": "First, it was easy to get a nice table on a busy day just before 2 performances at the Guthrie.  Iv'e onlyh went once, mostly cuz I could face the crowd and prices at Spoon River or Sea Change.  Zen Box seems to do best at their small plates.  Just try the tempura avocado for an introduction, and then keep ordering.   We didn't order alcoholic beverages have just spent our beer budget on overprice taps at the eagle.  The appetizer was really filing, then we proceded to order entrée size portion of the raman and the yakasobi.  Both were too much food.  I didn't taste the Yakasobi.  My ramen was nicelu put together, but I though it waw too overly seasoned with ginger to make it last the evening.  The bill came to about $30 including a nice tip that was well deserved by the happy and helpful staff that keeps the place running.  I'm sure some long term friends will come out of working there.", "Date": "2013-08-11", "Author_Location": "Minneapolis, MN"}, {"Author": "Wesley H.", "ReviewID": "T6zxVLcuRoXHC_VEj4tFWQ", "Overall": "4.0", "Content": "This place is awesome! Came on a Saturday night around dinner rush. For as busy as it was, the service was very quick and attentive. We ordered many small plates and shared. We had chilled edamame, various pickled vegetables, grilled tofu, vegetable dumplings and curry with brown rice. All the food was good. We also tried 4 different house cocktails. All were good. Highly recommended.", "Date": "2014-01-21", "Author_Location": "Minneapolis, MN"}, {"Author": "Michael L.", "ReviewID": "f3dq_zMf7OvAR-UxMHcl0g", "Overall": "1.0", "Content": "Had a bad first experience here and will probably not be back. If the aim is to replicate only the annoying aspects of a traditional casual Japanese eatery and none of the good ones, success!For example, having \"Irrashaimase!\" screamed at you upon entering and leaving is indeed very authentic, but not exactly my favorite feature of Japan. Having this done by a blonde Minnesota lady in a kimono lost it's charm fairly quickly, especially when she should have been helping to expedite orders instead of waiting placidly to assail her next victim.  In a real Japanese eatery the staff are usually working very quickly to deliver your food, drinks, hot towel, etc. Not here. We came aiming to eat in somewhat of a hurry, which admittedly is not always a fair requirement to make of a restaurant, but it seemed feasible in a place that looks very casual (posters on the wall) and serves traditional, uncomplicated Japanese food (NO SUSHI). Not to mention, it is probably used to people having to eat before a show at the Guthrie, right? Wrong.It took a good 15 minutes to even speak to a waitress. We told her we were in a hurry and ordered a few things. It took a very long time to get our drinks (they are very proud that they are supposedly the first place in the Midwest with Asahi on tap, and they price it accordingly high, $7 I think). Then we saw our orders, and many others, sitting on the counter, waiting to be delivered to tables, piling up more and more. The waitresses were either standing idly by or trying to figure out how to enter more orders in a computer. It took almost 45 minutes to get food basically, which is the moment we were supposed to be leaving.When the food arrived, it was not very good, and overpriced for what it was. Very salty, no real complexity in flavor.  Oh well.", "Date": "2013-03-14", "Author_Location": "Loring Park, Minneapolis, MN"}, {"Author": "Sergio R.", "ReviewID": "9WWrntlT7A-JqICZ1lvU_Q", "Overall": "4.0", "Content": "Loved the Kimchee ramen!", "Date": "2013-12-28", "Author_Location": "Minneapolis, MN"}, {"Author": "Kristin H.", "ReviewID": "Gu9Vo25wFi9JqRnC3HcIkQ", "Overall": "4.0", "Content": "Located in the corner of a swanky condo building a stone's throw from the Guthrie theatre and a few blocks north of the Metrodome, it's in a prime location to suit its vast clientele.  Tourists, sports fans, and downtown-dwellers alike are greeted with a friendly \"Irrashaimase!\" (translation: \"Welcome!\")Zen Box Izakaya is a self-proclaimed Japanese pub.  Downplaying many of the raw and sushi options, the menu instead highlights comforting, non-threatening, and hearty dishes like ramen, potstickers, and spareribs.  This is my kind of place!  So much so that Phillip and I have ended up here twice in the last couple of weeks for a quick dinner and drink after work.  For just one short hour, from 5pm to 6pm, every day Zen Box Izakaya offers the \"Other\" Menu.  This menu includes a selection of small dishes priced between $3 and $6 as well as $4 pints of select beers.AtmosphereThe \"Japanese\" decor is tasteful, not kitchy, and the dining room and bar have an overall cosmopolitan feel to them without veering into overly trendy territory.ServiceReally excellent.  Our server the first time and the bartender the second time were both extremely welcoming and patient, making ample time for chit chat and pleasantries.  Empty dishes were cleared immediately, and water glasses never were less than half-filled.PresentationWith the exception of the veggie curry, which looks a little unappetizing on the plate, everything was presented beautifully and with care.TasteDelicious!  I haven't had much experience tasting Japanese food, but if it's all like this?   Consider me a fan!Value for DollarsThe happy hour prices are good but not great.  I would love to see a greater variety of taps on special, especially since $4 for a pint is not a very competitive happy hour price.", "Date": "2013-01-28", "Author_Location": "Minneapolis, MN"}, {"Author": "Lindsey W.", "ReviewID": "bW188Q9K2WfJ77L-FKb1sQ", "Overall": "5.0", "Content": "I continue to visit Zen Box frequently, it is such a gem to have in our neighborhood.  The food is really great and the service is really fantastic!  They always make sure that you are taken care of and it is a group effort for service and a really nice change of pace for the restaurant industry.  We even met the owner tonight who is incredibly engaged and very gracious.  The food is still fabulous and is always perfectly prepared.  We also tried the shucho (not sure if I spelled this correctly) but it is a cross between vodka and whisky.  We tried the flight and our favorite was the sweet potato...give it a whirl!", "Date": "2012-10-19", "Author_Location": "Minneapolis, MN"}, {"Author": "Emily O.", "ReviewID": "5rb9fg0tv4fBFUIXtyEtEQ", "Overall": "5.0", "Content": "I felt like I was in Tokyo... the ambiance here is awesome!  Japanese television shows, lantern lights, & a low glow provide a wonderful experience.  Super authentic Japanese cuisine served small plate style.  On this particular visit, we visited during happy hour (the best deals in town) &  sampled the fish cakes, crispy tofu, seaweed salad, edamame, fried sweet potatoes, & ramen: THE BEST RAMEN I have ever had.  Everything we ate was wonderful.  The server recommended we try the special house sauce, called the Kamikaze sauce with our small plates.  The Kamikaze sauce was the perfect dipping sauce for just about anything on the menu.  Just enough kick to appeal to everyone @ the table.  We also enjoyed Sake flights & Sapporo: our faves.  The service we received was wonderful.  Attentive, happy, & helpful.  We will definetly go back :)", "Date": "2012-12-31", "Author_Location": "St Paul, MN"}, {"Author": "Andrew W.", "ReviewID": "zcgrXuvkXv10wvMIYsIgPA", "Overall": "4.0", "Content": "Zen Box was a favorite stop of mine when I worked downtown Minneapolis and it's cool to see another non-sushi Japanese restaurant pop up in the cities so I was excited to try their new place out.  I went with 4 friends 3 of which had been to Masu before, we all ordered their ramen along with a side dish.  The standouts were definitely the side dishes, they're fantastic.  The chicken kara-age I had was perfect mix of sweet salty and crunchy.  The crab croquettes my friend let me try had him saying \"this is my new favorite place to eat because of these\", crabs not my favorite thing yet I liked them enough to order again which is saying something.  The ramen is great and while I prefer Masu's more I'd say its about the difference between one ramen shop in Japan vs another.  They have all the Japanese staple beers on tap which is awesome, theres not a lot of places pouring Asahi around here so thats a welcome rarity.  While excellent to have they do charge a bit much for the beers which is one largish fault I'd give the place.  The atmosphere is very cool, it definitely captures the vibe of izakayas in Japan well except for the back party room which is a bit spartan.  They're still pretty new so I'll give them he benefit of the doubt that they'll add more to that space later.  Service was very fast and knowledgeable, food came out fast and together.  I cant say much more other than I'm a fan, if you're in the mood for some good Japanese food hit it up.  You wont regret it.", "Date": "2011-12-15", "Author_Location": "Minneapolis, MN"}, {"Author": "Sabrina C.", "ReviewID": "oq0oEauhUrQIwpx6g2CGVQ", "Overall": "2.0", "Content": "Not a fan actually.  The food was ok but didn't seem anything more than chain inspired.  It seemed to stick to safe dishes so if you are new to Japanese this could be a good start for you.  I was sad to say the flavors were downplayed in many of the dishes....The wait service was ok but a bit distant- I was disappointed to see that the staff didn't offer to really assist with the ordering for those in our group that were new to Japanese foods.", "Date": "2013-02-20", "Author_Location": "Atlanta, GA"}, {"Author": "Mike W.", "ReviewID": "-smBR07CZQhUyLO-MzdgeA", "Overall": "4.0", "Content": "Went with a friend for happy hour after driving past this place everyday since it opened.The happy hour prices were good and there was a lot to choose from on the HH menu.   Just wish happy hours didn't end at 6.  Some of us have to work till 530.  Moving on.  Ordered up a variety of dishes to split and all were great.  The Chicken Curry was an unexpected treat and one I would have again.Staff was attentive, put a bit too friendly as the person I was with and I had not seen each other for awhile and were trying to catch up.  The watter tended to hang out and chat with us, which just seemed odd.  Oh well, not the end of the world.The full dinner menu looked great and I know I will be back to give that a try.", "Date": "2012-09-13", "Author_Location": "Minneapolis, MN"}, {"Author": "Hyoga Z.", "ReviewID": "67UJcwr7rac8bSmXX-EKsQ", "Overall": "4.0", "Content": "The Raman soup they provide is really good. A very reasonable price that I would like to go there often durning my lunch time. But for the dinner entree, I think that they should have more choices.", "Date": "2013-12-05", "Author_Location": "Minneapolis, MN"}, {"Author": "Stacy K.", "ReviewID": "43u1bSxOUF0GtuvK7jzuig", "Overall": "5.0", "Content": "Amazing service & food! Not a single complaint. Quaint, friendly, and I am wishing we had a Zen Box closer to home to enjoy.", "Date": "2013-09-11", "Author_Location": "Bradenton, FL"}, {"Author": "Kara B.", "ReviewID": "Pk0Gw0SbssryUhZlGo1AUg", "Overall": "5.0", "Content": "Absolutely the most traditional (and delicious) Japanese food in Minnesota!!!Zen Box's offerings are always fresh and delicious! The atmosphere is relaxing, yet fun. The service is always top notch - the servers make you feel welcome! Food and drink prices seem cheap for the quality/quantity.The only thing I would change would be to add pictures to the menus for people who aren't as familiar with Japanese food.", "Date": "2012-09-19", "Author_Location": "St Paul, MN"}, {"Author": "Paola M.", "ReviewID": "-btVonVsGP7tF8mvGhxdRg", "Overall": "4.0", "Content": "I went 2 days in a row. The first time I was completely burnt out from work and I just wanted to seat down and have a beer. The second day I went back with my BF and had dinner. Both times I was very happy.I think we tried pretty much one dish from every section of the menu. The korokke were crispy, creamy and not at all greasy, the ramen with kimchi was spicy enough to have a kick but not so spicy that you cannot taste anything else, the takoyaki were by far the best one I have tried: light and you could actually taste the octopus, and the pickled vegetables were really very good. Oh and I think they feed pork to their chicken, because I cannot explain otherwise how they can get such flavor from their chicken wings! And the mochi ice cream is super special. Not a fan of matcha flavor (but my BF is), but this comes actually wrapped in mochi.Beer was excellent. They have Asahi on tap and it is light and bitter exactly how I like it. I could drink gallons of that. They also have your usual Sapporo and Kirin Ichiban and a ginger infused Hitachino which is very interesting and very good. The list of sake and coktails also seemed very interesting.Service is good, prompt and attentive. I will be back for sure. Maybe for lunch...", "Date": "2011-10-07", "Author_Location": "Madison, WI"}, {"Author": "Jonathan E.", "ReviewID": "SE9dERrokQ3pNH48hzJRBw", "Overall": "4.0", "Content": "If I had one phrase to sum up my feelings on the opening of Zen Box it would be... FINALLY.Having lived in Japan and traveled there extensively, you become quite accustomed to the izakaya culture. Izakaya are traditionally similar to the pub culture in Europe--places where you can enjoy drinks with your friends around a table and share small plates of comfort food. I hope that this catches on here in the Twin Cities because I believe most of our perception of Japanese food is mediocre sushi and dudes flipping shrimp into their hat at some teppan-yaki place like Benihana. The wait staff which seems like your stereotypical mix of Japanese majors and anime otaku, but they are also friendly. As far as food, dont go expecting to order some catapillar-like sushi monstrocity... Go expecting a hot plate of yaki-soba noodles or some lightly grilled fish with a dipping sauce. My recommendation if you are not familiar with this type of menu is to view the items online so you arent overwhelmed with choices when you get there. Pick 3-5 different things to try and share them with your small group. This is the essence of the izakaya experience.", "Date": "2012-07-06", "Author_Location": "Minneapolis, MN"}, {"Author": "Thao P.", "ReviewID": "Hnj2rHGzeLWHmaduKPUJ9Q", "Overall": "4.0", "Content": "Japanese Comfort food...mmmmI really like the \"tapa\" style of this place because your whole table can share them. It's not like the typical commercialized place with Sushi that has become mainstream. I've had the Takoyaki balls, Chicken Kara-Age, Shrimp Shumai, Edamame, Croquettes, Ramen, Bento boxes, and Shortribs. Mmmm all of them were so good! The Takoyaki balls were the greatest in my opinion. The 2nd time I had them, I had it had a bit too much of their spicy mayo sauce and was a little bit too soft on the inside. It's probably a hit or miss depending on when you come in. I would highly suggest going in for Happy Hour to get full on a more discounted price.", "Date": "2012-08-17", "Author_Location": "Urbandale, IA"}, {"Author": "Carolyn A.", "ReviewID": "oxzEBV8wFei5n1XM8vVMyA", "Overall": "4.0", "Content": "Yum, yum and YUM.Four of us headed into Zen Box Izakaya for a quick bite to eat on a weeknight.  Our server explained to us when we first arrived that we could order several small plates to share...and we did.  Here are the highlights:- Asahi...ON TAP!- Chicken Kara-Age (I could eat this everyday)- Aburi Hamachi (yellowtail)- Tebasaki (chicken wings)- Mochi ice cream -- I just tasted my friend's, but it was delish.The location is perfect for a pre-show meal before the Guthrie.  I can't wait to go back and try more of the small plates.", "Date": "2011-10-31", "Author_Location": "Minneapolis, MN"}, {"Author": "Ngoc N.", "ReviewID": "Gob3bq6zuBe8wBIlRVHfYQ", "Overall": "2.0", "Content": "I must be on a rant of all the bad food options I have near me.  Mill City neighborhood, you truly are disappointing when it comes to food options. Thank you NE for being across the river.---I really really really want to like this place! I go here most often in the neighborhood and it just keeps goind down hill for me.  The food really is expensive for what it is.  Portions are too small, food is too bland, and not fresh like I'd want it to be.  Service is okay.  We go there later in the day most of the time, around 8-9ish and in between service, they're busy closing down. Can it wait until we leave? They have people coming and going like it's a family owned restaurant.  I wonder what goes on in the back room?I don't really know how to directly explain it, but it's just one of those places where you just eat to fill your stomach and nothing ever stands out.  It's never terrible either.  I do wish the ramen was better.  The broth is just bland.  Too bad Tanpopo is not on this side of the river.", "Date": "2012-01-23", "Author_Location": "Chicago, IL"}, {"Author": "Sarah Z.", "ReviewID": "7lRx44TQ6YMsNKLNN6AVHQ", "Overall": "3.0", "Content": "I should probably be giving Zen Box 4 stars, but something about it just feels lackluster. If I never went there again, I wouldn't think twice about it. Their food is great--authentic Japanese (from what  I can tell by other reviews). Each time I've been there I've had the tuna poke. It's a little weird to pair raw fish with lettuce, but I'm guessing that's pretty traditional for Japanese food. A lot of their dishes are served this way. I have been pretty disappointed with their portions. You have to order a few things to fill up. For the entree dishes I think their portions are decent, because they're not terribly expensive. But when you get a small cup of edamame for $5, you'd get better use out of your money by going to Target and getting frozen edamame and having that before you go out to eat. The staff is nice, but forgettable. Also, watch out for the tippy table. You coup end up with soup in your lap.", "Date": "2012-12-28", "Author_Location": "Madison, WI"}, {"Author": "Patti K.", "ReviewID": "KhgwOVxm5LCp8voxD2PPtA", "Overall": "4.0", "Content": "There are few Japanese restaurants in the area that actually remind me of Japan. Zen Box makes the grade. The menu was put together very carefully, with an eye toward replicating old favorites that you would find in a real Japanese izakaya such as buta no kakuni (braised pork belly) and ochazuke (rice with tea and topping such as pickles or salmon). They also had real Japanese drinks such as Calpico (Calpis) soda, Chu-hai (flavored shochu drink), and Choya umeshu (not the fake plum wine). The music as I walked in was more traditional-sounding samisen music, but they switched to Sazan All-Stars, a popular band from the 1980s, and other music. They took great pains to get genuine Japanese decorations, mostly sake ads and containers, but the wooden restaurant tags with menu items written in Japanese were a nice touch (even though people who read Japanese would know that only some of the items were actually in the menu). I would have liked to see some more vegetable dishes such as ohitashi (boiled spinach), but that's a small quibble. Thankfully, not a cream cheese wonton in sight.We had a mix of traditional and non-traditional foods. The avocado tempura was quite rich, and had a nicely matched Russian dressing-type sauce. The other non-traditional innovation was eggplant ja-jang men noodles. Overall, the ja-jang men was fine, but the \"tofu chips\" were a dry unhelpful addition to an otherwise tasty and interesting dish. The sauce was largely miso, with a spice kick, and the fried (non-chip) tofu and eggplant inside made the noodle dish hearty. The execution of the traditional dishes was pretty impressive. The wakame salad was solid, and the grilled squid was cooked just firm, not rubbery. The soy-based sauce provided flavor to the smoky squid. The braised pork belly was a genuine standout dish. It was just half a touch overdone, but otherwise a really wonderful, tender, flavorful dish served with boiled eggs and mustard just like in Japan. Overall, our experience was lovely. The food came out quickly, and the service was very attentive. I'm looking forward to going back and trying more of the dishes, particularly the nikujaga (Japanese style meat and potatoes), korokke (fried croquette), and the chu-hai.", "Date": "2013-09-07", "Author_Location": "Saint Paul, MN"}, {"Author": "Ariel L.", "ReviewID": "IXfE8kpwQtXmQOpoZasFcA", "Overall": "5.0", "Content": "I've dropped by here for many-a-meal and still love Zen Box. Lately I've really been enjoying the buta-no-kimchi(a delicious stir-fry) and buta no kakuni(a small plate soupy-ish appetizer). I love the buta no kakuni broth, so tasty! I can't resist ordering those items every time now.I also usually enjoy the veggie curry(served over white or brown rice). I usually ordered this with white rice -but I can't help being annoyed with the improperly cooked white rice.  It tastes and feels overcooked -like they soaked it in the water for too long. Soggy and too soft. Since the white rice ruins the veggie curry -I started substituting it with their brown rice, which is much more tolerable.Skip the onigiri they have on the menu. The slice of seaweed they wrap it with is just a sliver, and the stuffing is barely existent. It just taste like you're eating white rice, and that's it. This obviously sucks even more because their white rice sucks anyway! lol.Despite these minor blemishes, I still love Zen Box! Keep up the good work.", "Date": "2013-07-09", "Author_Location": "Minneapolis, MN"}, {"Author": "E K.", "ReviewID": "P2wvYntArVePjC319yOeng", "Overall": "4.0", "Content": "On to positive review~ :)I ended up going to this place cause I missed going to izakaya style Japanese eats cause they are quite rare in the mid west, I took a look at their menu in their website and was quite excited to see ramen and takoyaki on their menu as they are one of my favorite Japanese eats since I happen to be Japanese,,, lol so I will start with authenticity of this place, I would rate it as I rated it 4 star since I would say some of their food was quite close to what you will get in Japan like their takoyaki, chicken nanban, creamy kana korokke and the ramen was quite good but minus 1 star cause some were not as impressive like their yakisoba which was too greasy and had mixture of veggie that you normally don't find in authentic yakisoba and even though ramen was quite good it was not as tasty was the real deal was their broth did not have deep flavor and the chasu lacked flavor. Their other chasu *not the ones in the ramen* is not quite authentic but rather too salty and it is not braised like the real deal but overall they do carry surprising things on their menu such shiso ume cocktail! Their caplico chu-hai are real good there as they add enough caplis syrup in to the cocktail :) Oh another BIG PLUS: service was GREAT! The servers are not obviously Japanese but their politeness reflected Japanese esque style and I love that ^__^overall: tasty! recommend:takoyakichicken nanbancream kani korokkeDon't get:chikuwa Q *just gross*yakisoba *too greasy*", "Date": "2012-04-29", "Author_Location": "Minneapolis, MN"}, {"Author": "Jacky W.", "ReviewID": "KIJ6lFy8sihDzsTdA44IIw", "Overall": "4.0", "Content": "I had my first experience at Zen Box last night and it was lovely. The service was extremely attentive and sociable, both of which I like. My water glass was never empty, a sure sign of great service in my book. We sat outside (lovely) and had drinks. We then shared 4 plates, all of which had impressive flavors. Our server explained all of the foods to us, as I was previously unfamiliar with Japanese comfort food. He even went the extra mile to explain how things are made, the origination of the food, and the health benefits. It was a thorough lesson in Japanese food and culture - I loved it.The food was interesting and I enjoyed trying everything. We had some standard fare  and some that was completely new to me. I will go back to try more.", "Date": "2012-09-05", "Author_Location": "Minneapolis, MN"}, {"Author": "Galina M.", "ReviewID": "qQSjLgt84p6Op45LwxitRA", "Overall": "3.0", "Content": "I come from the land where sushi is plenty so i may be biased w my review. I ordered tuna poke - very average its got this strong ponzu sauce n lettuce and marinated onions, different; salmon sashimi - fresh to death. I also got seaweed salad - it was good. I wouldnt eat here again if I was craving sushi but if i was craving cheap salmon sashimi that was super fresh then yes. The service is impeccable - staff is very nice. Nice outdoor seating and reasonable prices. I gotta say the place has an unusual menu-id call it a japanese tapas bar!For Minneapolis it will do.", "Date": "2012-08-30", "Author_Location": "Chicago, IL"}, {"Author": "Zion W.", "ReviewID": "tUHuURTIPbKDjPv0EKSkvg", "Overall": "1.0", "Content": "Ick...Went here on a Thur. evening w/friends and ordered:1. Chashu \"fresh\" ramen noodles with broth - no depth, no flavor and the noodles were \"fresh\" out of the package. I was looking for some serious hardward in the back, like maybe a ramen noodle machine...but did not see one. Didn't see anyone making fresh noodles, lame.2. Zen box soba salad - tasted like it's been in their fridge for 2 weeks. The noodles were soft/mushy and stuck together, the edamame was soft too. It was bad.3. Kimchi ramen - meh...salty.4. Hiyaykko - acceptable, no flavor in the sauce.Ok, I'm going to stop now.Parking was a nightmare and the dining experience underwhelming.Authentic ramen shops are non-existent here in the Twin Cities.Bummer...", "Date": "2012-03-22", "Author_Location": "Minneapolis, MN"}, {"Author": "Cheryl T.", "ReviewID": "Mh0Wl2k7kRNZ0GtiErtdWQ", "Overall": "4.0", "Content": "Filled my need for tonkotsu ramen, but not as big as portion as I'd like or I'm used to. I do wish they had noodle refills! They were closing when we went so I didn't want to bother asking if they would do so but I didn't see it advertised anywhere.The hiyayakko was BIG, lots more than usual, I wish the portions were switched!Hubby said he enjoyed his sushi, just wished the portion was bigger for the price.", "Date": "2012-02-28", "Author_Location": "Minneapolis, MN"}, {"Author": "Mike G.", "ReviewID": "eSUvc_-dbe02hEz2Zxsyew", "Overall": "4.0", "Content": "Great Bento box for lunch.  Tasty but nothing mind-blowing. A bit expensive but nice for a lunch date. Great and attentive service.", "Date": "2012-10-23", "Author_Location": "Eagan, MN"}, {"Author": "Sara O.", "ReviewID": "9bigJL01l_C2sT93ndlbIw", "Overall": "3.0", "Content": "I was excited to see this opening up close to my house so I thought I would try take out for myself and my husband a few nights ago.  The staff is soooo friendly!  Everyone from the hostess to the waitstaff to the chefs greet you upon entering.  The food is why I have to give it three stars.  We had the Yaki Soba (ramen noodles with veggies), chicken gyoza, and macaroni salad.  The gyoza were amazing - and my husband has tried a lot of gyoza.  The other two dishes were just a little bland.  The hostess had recommended a Tuna salad dish but as I am not huge on seafood I declined....perhaps that would have been a better option.  I will definitely go back to try a few different things.", "Date": "2011-10-27", "Author_Location": "Minneapolis, MN"}, {"Author": "Amy H.", "ReviewID": "D13jFgvbNY1WSHZ1bogniA", "Overall": "5.0", "Content": "Great place to hangout with friends( sake, beer wines) small portion of foods just about right for me eat! Great foods, sushi and especially kitchen cook foods!! Professional customer service!! I truly enjoyed dinning in that place every time I've been there!! Highly recommend!", "Date": "2013-09-26", "Author_Location": "Eden Prairie, MN"}, {"Author": "Zehr S.", "ReviewID": "FZ1DP1oC9FbQkORl_r2d_A", "Overall": "1.0", "Content": "...very disappointing, panda express? Very alike, s**ty stuffthis place is for those who think Panda Express means Chinese food, anything with a Zen in the name means \"good'so fake, not \"Zen\", not even an \"izakaya\".......nothing authentic, only trashy............................................­..................................................­..................................................­..................................................­..................................................­..................................................­.people there are nice, but what's the point???you know what i'm talking about if you are a PRO", "Date": "2012-06-08", "Author_Location": "Plano, TX"}, {"Author": "Anna H.", "ReviewID": "SUzfSEc9ouIWGd-FfS_lNA", "Overall": "2.0", "Content": "I want to like Zen Box Izakaya.  I really, really want to like Zen Box.  I'm in the neighborhood and pass by it every day, and all of the waitstaff is really very friendly.  The owner is very friendly, too.  So, I'd love it if I could really like this place.But... the food.  :(  It's overpriced and could taste a lot better. The Spicy Kimchi Ramen definitely was not spicy - it kind of lacked flavor.  The Kani Krokke were regular ol' crab cakes... for 12 bucks!  Four beers, two little (heavily breaded) crab cakes, and some non-spicy spicy ramen... and our bill was above $50.", "Date": "2012-02-01", "Author_Location": "Minneapolis, MN"}, {"Author": "Chris W.", "ReviewID": "MRMU5ABUu7vI75itkfuH3A", "Overall": "5.0", "Content": "Great Japanese food.  Fun atmosphere.  They do have real honest to god Japanese raman.", "Date": "2013-08-09", "Author_Location": "Saint Paul, MN"}, {"Author": "Dave M.", "ReviewID": "dfzWRjToYhPMXP_U7-lkDw", "Overall": "5.0", "Content": "Great food, nice atmosphere, reasonable prices. Five stars, in spite of the fact that our server was a screw-up.  He forgot to put in our order, putting us in danger of being late to the Guthrie. I could tell the other staff was irritated with him for other things he was or wasn't doing. However, several other servers stepped in, made sure we got our food and apologized profusely. We got two of our dishes comped and they offered us free dessert (we had to decline because of the time). I don't want to base this review on the poor service by one server. Perhaps he was having a bad day, family problems, health issues, etc. If so, good on the staff for picking up his slack. If not, I assume he won't be employed there for long.", "Date": "2013-08-14", "Author_Location": "Saint Paul, MN"}, {"Author": "Linda L.", "ReviewID": "-fl0E5uRYa-CB39kDnLDIA", "Overall": "5.0", "Content": "I love this place. The staff is super friendly, when someone enters or leaves all staff shouts greetings in jap. The menu is simple, straight forward and cheap. Their menu consist of appetizer size plates and food. It's great for if your not hungry enough for an entire entree or to came hang out with friends and share.", "Date": "2013-06-28", "Author_Location": "Saint Paul, MN"}, {"Author": "Sid J.", "ReviewID": "qt3ItvgCtcrw6ZPt6JCe8Q", "Overall": "4.0", "Content": "Amazing veggie ramen noodles, Tuesday night special. Awesome service as well.", "Date": "2013-03-30", "Author_Location": "Chicago, IL"}, {"Author": "Gen W.", "ReviewID": "xX2nSeGHvTfNhz_C6ZaThw", "Overall": "5.0", "Content": "My co-worker and friend who lived in Japan highly recommended that I try this restaurant. I finally did this Friday with my husband and I have to say I loved everything that I had. I would have to agree with my co-worker that it is Japanese comfort food and well worth the trip. I have had some of these items at other places but they did not taste nearly as good. Their mixed drinks were also a hit, I had a Lychee, sake concotion that blew me away. Cannot wait to go back and try some of the other dishes.", "Date": "2012-11-17", "Author_Location": "Minneapolis, MN"}, {"Author": "N B.", "ReviewID": "TNV-xt4ZyDdn5TsK8BnCKg", "Overall": "5.0", "Content": "Seven of us just had lunch.  Everyone was ecstatic about their meals, including the three year old.  Service was friendly and prompt.  Tuna poke a definite winner.  Come and enjoy.", "Date": "2013-12-27", "Author_Location": "Providence, RI"}, {"Author": "L T.", "ReviewID": "dxZIAUKZU91CyPvWcVne9A", "Overall": "1.0", "Content": "Awful. All hype and a poor selection of hurriedly made Japanese \"fusion\" dishes by over-eager but flaky staff who cannot multi-task.", "Date": "2013-04-20", "Author_Location": "Maplewood, MN"}, {"Author": "Brad J.", "ReviewID": "mVHRtil7XrvohHXQpE4Qng", "Overall": "5.0", "Content": "A great Japanese place. Part of the reason why I like is because it looks like what I imagine a Tokyo eatery to look like (except bigger). They do not have sushi rolls which I think shocks some people. Paying $12 for Ramen sounds crazy to some but its worth every penny! Chicken Kara Age is amazing. You cannot go wrong here.", "Date": "2013-03-01", "Author_Location": "Minneapolis, MN"}, {"Author": "Brian B.", "ReviewID": "u-Boqa78-Pe4oG_IicZRtQ", "Overall": "5.0", "Content": "I am huge fan of the Zen Box in the skyway, so I was very excited for this to open.  The atmosphere was very cool, they make use of the small space that they have.  We were greeted by almost everyone in the restaurant including the chefs.  We were sat promptly and recieved great service.  I was very impressed with the menu.  They do not have main dishes but a lot of small dishes that are a lot of fun to share.  We got three dishes along with white rice and it was plenty of enough for two of us.  Try the octopus balls, you will not be let down!I will come back to this place until I have tried eveything on the menu, and then come back to try things a second time.", "Date": "2011-09-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Thai L.", "ReviewID": "ihimP8szCmzzLVkuCE4rCw", "Overall": "5.0", "Content": "this place is so cool! reminds me of the cafes in tokyo and seoul. they do some sushi, but this isnt the place for that. this place is for bento boxes and japanese noodles. i love ramen noodles so i got the soy sauce flavored dish. it was amazing! just like in tokyo! the ramen noodles tasted fresh too. and the soft boiled egg added just the right balance.i was there for lunch and and owner came by to check on our dishes and chit chatted for a bit. she seemed pretty cool. will definitely be back for their dinner and happy hour soon!", "Date": "2012-01-07", "Author_Location": "Minneapolis, MN"}, {"Author": "doug r.", "ReviewID": "T7_UTgAjUPtbB3elx3YTsg", "Overall": "5.0", "Content": "i've been a huge fan of Zen Box in the skyway for years, and was really happy to see Zen Box Izakaya being built last summer.  the restaurant is excellent, with a few of my favorites from the skyway eatery amidst a larger and more varied menu.  they apparently have a fair selection of japanese beer, but as i don't drink much, i was more excited to see 1919 root beer on tap.the waitstaff was very friendly and prompt, and i was honored that the owner recognized me.  i had the chashu yaki, which was tender and delicious, and my wife tried the miso ramen, which she liked.  she liked the coconut gelato (recommended by our waitress) even more.  i opted for onigiri insted, which was excellent.", "Date": "2012-02-14", "Author_Location": "Minneapolis, MN"}, {"Author": "Eric M.", "ReviewID": "HKXFZ3xqhzJpMzZCrOdymg", "Overall": "5.0", "Content": "I've been twice now, and it's been great both times. I have yet to try the sushi, but everything else has been fantastic. I did a Tuna Salad the first time, and a Kimchi Sashimi salad the second, both were great. The last time we were in, we were shocked a bit when the bill came, the beer my wife ordered was $9, there was no mention of price anywhere prior, and while they have 1919 rootbeer on tap, they don't mention they charge for refills...guess we won't be doing that again. However the food was great, and we will drop in again for sure.", "Date": "2011-10-16", "Author_Location": "Minneapolis, MN"}, {"Author": "Zac S.", "ReviewID": "Q3FGbFIWpAo0eO--iI4XBw", "Overall": "3.0", "Content": "too expensive for what you get. I'd rather spend the same and go to Masu or less and go to Tanpopo. I was really hoping for a bento box dark Japanese feel to the place, but there are TV's and it's loud and clean. Feels more like a hotel lobby than anything else.", "Date": "2012-02-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Keith M.", "ReviewID": "jvEOnIKpDaUCHWTfJPDwxA", "Overall": "4.0", "Content": "What do the words \"brisket\" and \"tripe\" make you think of? Probably BBQ and Vietnamese or Mexican food, not Japanese, but they are and this is probably about the only place you'll find a number of izakaya/Japanese pub dishes. Even I was surprised by some of the offerings on the menu, including fermented soybean paste omelets (if you've had that paste before it's a very much a mood thing). Being it was my first visit, though, I was sticking with the basics: chicken kara age (fried chunks of dark chicken meat) and yaki tofu (skewers of breaded tofu that is grilled and served with their teriyaki sauce) both of which were quite satisfying. I just have to figure out what to try next: the takoyaki for sure(fried Japanese anything with tonkatsu sauce and Kewpie mayo is basically a sure thing) and then I should probably move away from the fried foods and branch out a bit. They have a number of vegetarian dishes highlighted and I think the tofu skewers I had were vegan; I didn't detect any meat/fish in the sauce. Dishes here range from $5 to little over $10 and portions are a good size: not so small that you'll need to order several for a meal.They do late night happy hours too (9PM Monday-Wednesday, 10PM Thursday-Saturday) so if you're looking to do some drinking that would be the time to go otherwise that is where things will get expensive. It was great to see they had not only Kirin, Sapporo, and Asahi on draft to focus on the drinking side of an izakaya experience, but even an ever-changing Japanese microbrew option, which of course inevitably comes with a price you'd pay for a hard-to-find Japanese import: $9 a pint. A minor detraction is if you're sitting towards the end of the bar the kitchen feels too open: white tiled walls, no frills kitchen sinks, waste baskets, etc are your ambiance, but thankfully (and I'm sure the cooks appreciate this too) the fluorescent lights are blocked off and only shine directly over the cooking surfaces in the back while the rest of the  kitchen is lit up with regular lighting. It's a unique little place on in what must be the city's newest downtown neighborhood, the Mill District, which I'm guessing was the Parking Lot District not too long ago judging by all of the parking lots on Google Maps where new buildings now stand.", "Date": "2012-03-13", "Author_Location": "Minneapolis, MN"}, {"Author": "Irina R.", "ReviewID": "_ZwS9uDhgeVJlcBu60NzYw", "Overall": "3.0", "Content": "Some items were good, some were just OK. Overall, the place didn't live up to the hype.  We had a group of about 10 people and ordered almost everything on the menu.  About 1/3 of the dishes were good, the rest - not memorable.  The wait staff was very friendly and accommodating.  However, the food has to stand out just a little bit more for me to return by my own initiative.", "Date": "2012-10-09", "Author_Location": "Minneapolis, MN"}, {"Author": "Beth K.", "ReviewID": "DJhnkYPMnvb2kpUMyj3CKw", "Overall": "3.0", "Content": "Salt. Please. Seasoning. Please. Okay, so this place has wonderful service and the owner is fabulous (she walks the floor, fills water, talks with customers, etc). Our bartender was so fabulously friendly. They are an eager staff ready to please. Awesome Sake and beer selection (Summit Red Ale, Fulton, and a few Japanese beers that are rarely found in the United States). Great prices during happy hour.The food, you ask?The food, well, was hit and miss. Seriously, I don't think anything was salted. Even the edamame was barely salted...and edamame demands some sea salt (I am pretty sure the edamame were talking to me, asking for more salt...but that could have been an effect of the awesome Sake I was enjoying). I had to douce everything in either soy sauce or salt along with black pepper and their \"spicy\" seasoning provided at the table. Oh, by \"spicy\", I mean \"not spicy\"...though I need to be up front that I have been on a mission to build a tolerance to heat in order to compete in some sort of ghost pepper competition, so my level of spicy no longer fits within midwestern spicy.So here is a rundown of what we ordered and my thoughts about each:1. Edamame (served chilled): Um, chilled edamame...nothing to rave about. I prefer hot edamame. Not salted enough.2. ZenBox Soba Salad: Asked for the dressing on the side. Dressing was not on the side. Had them remake. The buckwheat noodles had absolutely no seasoning on them. I could not taste anything. Just mushy texture. The rest of the salad was edamame (shelled), lettuce and some shaved carrots. I had to use plenty of salt, pepper and spicy seasoning to make it taste better than um, unseasoned lettuce. I wish the buckwheat noodles were the thicker version. These were angel hair thin. And did I say unseasoned and mushy? 3. Age Gyoza (crispy dumplings): We got the veggie version. Surprisingly not greasy. Great crunch. Great flavor. As a girl who does not eat fried food often, these were delicious and I highly recommend!4. Rustic-Cut Beef Tataki: I have no idea what makes it \"rustic-cut\", but this was my second favorite dish. The meat is lovingly tender and delicious (served chilled). However, it is served over a pile of raw onions tossed within a mediocre sauce. Luckily my husband is not home tonight, so I inhaled all the onions, but raw onions are not a widely consumed food. So be prepared.5. Aburi Hamachi: According to the menu, \"flamed-torched yellowtail sashimi with housemade ponzu\". Best dish I had. The yellowtail melted in my mouth. The onions (yes, again, onions) were at least semi-cooked. Order this.6. Ika Maruyaki: grilled calamari. I love being able to get calamari that is not deep fried. However, this calamari had not a single sprinkle of salt on it. I can not believe they did not season the calamari. Thank you for not dunking it in butter or oil, but please salt it. So sad. After I added seasoning, it was amazing! Okay, so for two people, we ordered way too much, but this is a great place to bring people who love to share (admit it, we all have those friends who protect their plate like it is a diamond necklace worn by Marilyn Monroe), but this restaurant is a place for people to share a bunch of plates. Each plate is a healthy serving, so do not go overboard (or like we did, go overboard and get to-go boxes).I specifically asked for the plates to be spaced so that not all of them were brought out at the same time. Depending on how many plates you order, I would recommend doing the same.Just make sure to be armed with salt.cheers.", "Date": "2011-12-08", "Author_Location": "Somerville, MA"}, {"Author": "Justin G.", "ReviewID": "7ZvDRdJnFuAuemepE3Y_hQ", "Overall": "4.0", "Content": "Zenbox was awesome for lunch. The vegetarian box lunch thing they offer is a killer deal. You get a bunch of food for $8.50, and all of it was good. The tofu was perfect and I'm always picky about that. The staff were all super friendly.", "Date": "2012-04-12", "Author_Location": "Minneapolis, MN"}, {"Author": "Tanya C.", "ReviewID": "118Q14cW-gH_u_0ur0sIfQ", "Overall": "5.0", "Content": "I really love this place - my husband and I come her at least once a month. In the winter I love the Nikujaga with brown rice and the spicy sweet potatoes. My husband loves the buta no kimchi (love the onions) and the chashu yaki. The ramen is wonderful! In the summer we like to bring our dogs and sit outside. If you're lucky they will have a special dessert - I will make a special trip for the cheesecake or chocolate mousse!", "Date": "2013-01-21", "Author_Location": "Eagan, MN"}, {"Author": "Joe A.", "ReviewID": "fs8EPmvpoTX1iXZCXKrSRA", "Overall": "4.0", "Content": "Have been wanting to return to Zen Box since we had lunch there several months ago (delicious). Last night  had dinner and we really enjoyed it. Excellent service (our server was happy to give us all the details of the food and sake he was serving us). Excellent food,  value, and FUN. We like the space too.Recommended!", "Date": "2013-01-19", "Author_Location": "Minneapolis, MN"}, {"Author": "Clayton K.", "ReviewID": "YVpS_KG5_AYhc_3MNwkTSg", "Overall": "4.0", "Content": "really good happy hour menu.  I usually get the Takiyoki balls super good seriously.The Ramen there is really good as well there is a Kimchi ramen and a \"regular\" I enjoy the regular a lot more than the kim.The servers their are really cool and personal many of them speak Japanese and are nice about teaching a little if you want to learn some words.Side note* Thier is no Sushi here!!! this is a bar setting so hot food only and cooked.this place also has really good sake and Japanese beers on tap.Check it out if your in the area.", "Date": "2013-01-07", "Author_Location": "Faribault, MN"}, {"Author": "Saby K.", "ReviewID": "2Mv9yot1wJLfLX1FoGgfpg", "Overall": "3.0", "Content": "I would have given this place four stars, but I have a preference in the type of Japanese food I enjoy eating.My friend is a huge proponent of Izakaya, and I am from s. Cal, and I haven't run into a Japanese establishment that serves food similarly. I am in favor of sushi, shabu-shabu, sukiyaki, and curries, so this isn't exactly a place I'd roll up in, but I would to try it out.The quality of the food was good, and going there during happy hour is the best bet. I had yakisoba, and I thought it was lacking in flavor. Perhaps it's meant to not be AS flavorful, and I admit I don;'t generally gravitate towards yakisoba. The other items we ordered, however, were delicious.I am still looking for a place that sells good croquette. My best memory was in San Jose. : (", "Date": "2013-01-01", "Author_Location": "St Paul, MN"}, {"Author": "j w.", "ReviewID": "r5NUslJ0IaLfdWnwM0-kdA", "Overall": "5.0", "Content": "So thinking about ramen the past few days made me walk to Zen Box Izakaya for lunch. If any of your friends want to know what good tonkotsu ramen should taste like this is place. The owner told me it took a year to get the broth right. He really got it right.  Pretty good maguro (tuna) sashimi for an appetizer.", "Date": "2012-10-10", "Author_Location": "Los Angeles, CA"}, {"Author": "Whitney F.", "ReviewID": "YM7dmSZAHDFdz0zp_D_zAg", "Overall": "2.0", "Content": "Zen box is fine... I don't dislike it, but with so many places around the 'hood I dont plan to go back anytime soon. We went with a fantastic group, when we entered all 12 people working loudly and awkwardly welcomed us. The food was again, fine. We split a few plates of rice, potstickers, tuna poka, ribs, and something else that was not super mindblowing. They are little plates and not work the price tag. Not bad, but with so many other great places popping up, not great enough...", "Date": "2011-10-27", "Author_Location": "Minneapolis, MN"}, {"Author": "Jerry W.", "ReviewID": "aNquU6qy9G-PCjTt9toCSg", "Overall": "3.0", "Content": "Ate there for the first time today.  The kimchi ramen was good.  $15 is a bit steep though.  Will try happy hour some time.", "Date": "2013-09-17", "Author_Location": "Minneapolis, MN"}, {"Author": "Stephen H.", "ReviewID": "jxEkAvR18WegLZWlRYY0WQ", "Overall": "3.0", "Content": "Went on Friday, April 19.  No reservation but plenty of room.  Seated and waitress came immediately.  This was our first time and waitress was very helpful in selecting items.  Shared a cabbage salad, the kimchi with squid, the chicken nanbam and chicken yakisoba.  The kimchi was ok, the others were excellent.  This is a low key restaurant.  Prices modest.  Would certainly go back", "Date": "2013-04-23", "Author_Location": "Rochester, MN"}, {"Author": "Swee L.", "ReviewID": "4RQ4LWZFnRhedGEQQ5pjeg", "Overall": "3.0", "Content": "I went in for dinner last week. Ordered \"Gyu Motsu Nikomi\", I wish the sauce/ soup was hot. It was 3 pieces of beef and 2 big pieces of beef stomach. The beef was good but I don't eat beef stomach. It's weird. I also got age gyoza, which was frozen and deep fried. Yakisoba was pretty good. I hope it's cheaper since the portion is really not big.", "Date": "2011-10-14", "Author_Location": "Minneapolis, MN"}, {"Author": "Mike D.", "ReviewID": "OXztA3aDxWA-y0fq0vHOfw", "Overall": "3.0", "Content": "I think I was quite disappointed by the experience here.  The food was actually pretty good.  I had the Chicken Karaage, Beef Tataki, and Pork Chashu.  The chicken and pork were pretty good.  The beef tataki was pretty darned small and fairly bland.I think my biggest issue with this restaurant is that it is quite expensive.  The whole meal was 32 dollars for just 1 person.  Rice is also not included with these dishes... I can't imagine how it would have gone if I had been in the mood for a drink.", "Date": "2011-12-03", "Author_Location": "Chicago, IL"}, {"Author": "Kate S.", "ReviewID": "PWgkH58frjMvXO_iN-Lfcw", "Overall": "4.0", "Content": "Asahi on tap!  Only place in Midwest. Awesome food and service!  Tuna poke bento box is amazing and a great deal!", "Date": "2013-03-09", "Author_Location": "Lincoln Park, Chicago, IL"}, {"Author": "Chue Y.", "ReviewID": "4_hznT9F-V116IdnT-Bp7g", "Overall": "4.0", "Content": "We walked into this place during a Surly night - which meant awesome beers for great prices! We had smoked meatballs (it was surprisingly tender and flavorful) and it went really well with the smoke surly beer.  We ordered the ramen and it was very delicious!  However, the broth lacked the flavor, depth, and richness of ramens that we've had in other places  on the coasts or in Japan.  Having said that, it was quite satisfying...", "Date": "2012-12-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Melissa B.", "ReviewID": "Dz-Yb4txSTyeNA5QEhcu2Q", "Overall": "4.0", "Content": "Happy hour menu every night from 9-10. Don't let the cheap prices and starburst graphics on the menu scare you, the food is surprisingly good. Good beer and sake selection, too.", "Date": "2012-07-18", "Author_Location": "El Segundo, CA"}, {"Author": "James B.", "ReviewID": "vc798A2X3WO__0NhIw5R6Q", "Overall": "5.0", "Content": "This place is great. I have been eating at Zen-box in the skyway for years. I am so glad they opened a full-service place.", "Date": "2012-02-03", "Author_Location": "St Paul, MN"}, {"Author": "I W.", "ReviewID": "_geyd92cc355hhMQpOFvMA", "Overall": "2.0", "Content": "Dashi in the ramen bowl had ZERO flavor. I had to dump a ton of soy in it just so it tasted like anything at all, so I ended up eating soy soup, essentially. The short ribs were good, although a little too much on the gristle (not the good kind of fat, but the kind that feels like a rubber band in your mouth). Udon or ramen bowl down the street at Origami is ten times better. I did like the atmosphere and wanted it to be good, but the food kind of killed it for me.", "Date": "2011-11-09", "Author_Location": "Minneapolis, MN"}, {"Author": "Jen J.", "ReviewID": "Q1ql3WGZpQ5OAXtQCHJ0MQ", "Overall": "5.0", "Content": "i was once in a bar in the east village and said something to the effect of, \"well, here in minneapolis...\" i was feeling so comfortable and at home, i had forgotten where i was. not normally a feeling you would travel across the country for, but i always find it remarkable when i find myself someplace that makes me completely forget where i am. i was pouring myself a cup of warm sake at Zen Box Izakaya when such a feeling came over me. it's a delight to have an authentic japanese place like this in minneapolis, and not just the psuedo-hip \"japanese\" wankery you find at moto-i. my companions had recently returned from a trip to osaka, and it was fun listening to them talk to the bartender, who was japanese, about the menu and cultural differences. the staff is super friendly, laid-back, and sociable. i tried the sake, asahi on tap, the vegetarian age gyoza dumplings, which were phenomenal, and the ramen noodles. the ramen was tasty and standard, but then the bartender broke out a little bottle of some japanese spice i'd never heard of, and that was something else. i look forward to coming here again and trying other dishes. they play japanese pop music overhead too, which went well with all the sake i downed.", "Date": "2011-11-27", "Author_Location": "Minneapolis, MN"}], "RestaurantInfo": {"RestaurantID": "5q--nTpoVNE2qe2tpd-1vQ", "Name": "Zen Box Izakaya", "Price": "$$", "RestaurantURL": "/biz/zen-box-izakaya-minneapolis", "Longitude": " -93.25961719999999", "Address": "602 Washington Ave SMinneapolis, MN 55415", "Latitude": " 44.9784334", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/ylEdLqLupUcQegYFJ3l05g/90s.jpg"}}