{"Reviews": [{"Author": "Lawrence P.", "ReviewID": "o2-w673zNRqgDnkx-biftQ", "Overall": "5.0", "Content": "This is one original place to have a drink!!!!! Loved it and hoping to go back when in NYC.We were waiting for our table at nearby Eataly, so the wifey guided our party of 6 a few blocks away to this place.  It's basically a bar inside a big library with books from floor to ceiling.  How cool is that!!! Not too many tables but enough to create a great ambiance, we all ordered our drinks and enjoyed the originality of this place.  Service was solid.Feel free to grab a book while zipping your drink... after all it is a library!!!", "Date": "2014-06-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Agustin K.", "ReviewID": "YLFVNdoGik8wPrdqdClmFw", "Overall": "4.0", "Content": "A great bar tucked inside NoMad.  I am great there is a separate listing for the library bar.  I came here around 6pm on Thursday and there was already a 30 min wait for the library seating.  The bar outside was packed with people of all ages enjoying their good looking drinks.I put my name down but was eyeing for seats at the bar to open up.  Got lucky and scored seats.  Part of the attraction is to watch the bartenders in action so we decided to stay at the bar even after our table became available.  Our bartender wS friendly without being overly intrusive.  He recommended 'hair trigger' and it was the best cocktail I've had in my live!!  (Not exaggerating)  Yes the price tag is alarming at $16 and they don't necessarily have to offer happy hour specials but for special occasions when you feel like manhattanites, this is a great grown up bar to linger and have great conversation (you don't have to scream to be heard).  Coming back soon hopefully.", "Date": "2014-06-12", "Author_Location": "Summit, NJ"}, {"Author": "David P.", "ReviewID": "UgJ7amrpsva4PDVwnA2sdQ", "Overall": "4.0", "Content": "Go here for a couple of drinks in a nice cozy setting.  There are drinking cards which represent the type of liquor (e.g. rum, whiskey, gin, vodka, champagne, etc.) and characteristics of the drink (e.g. spicy, boozy, classic, etc.)Most of the time the bartenders make a good drink; some misses along the way.  Pretty good service as well.", "Date": "2014-06-02", "Author_Location": "Manhattan, NY"}, {"Author": "Natalia O.", "ReviewID": "pRrfFFxEJkCi9CSSt7XrXw", "Overall": "5.0", "Content": "I highly recommend this place!! We went because of the great reviews it has and oh myyyyyy goooooooodness!! Not only did the place look amazing inside but the food was sooooooo delish. Everybody HAS TO try the skirt steak. That was my absolute favorite!  I never had such a juicy and tasty steak. Also, it's placed on these pieces of bread that soak up the delicious juices of the steak, which makes the whole plate just absolute perfection. As for drinks.. they were very different than anything I ever had but still very good. My highlight once again was the skirt steak.. TRY IT!!", "Date": "2014-07-15", "Author_Location": "Fairview, NJ"}, {"Author": "Kim N.", "ReviewID": "806cNlNjsFv6Q_nfH4fYig", "Overall": "5.0", "Content": "One of, what I think, is the coolest space in Manhattan. I love all of the Nomad's consumption areas and this one in particular. Get some food, drink or both in what feels like an olde English office. You're not going to get the same level of the restaurant but if you come for lunch and the resto is busy this makes for a good alternativ sans the Atrium", "Date": "2014-07-07", "Author_Location": "Mountain View, CA"}, {"Author": "J D.", "ReviewID": "xutSEFQsjdzsSuKHHCZyOg", "Overall": "4.0", "Content": "Stopped in to meet a friend for drinks at the Library Bar. The hostess was friendly-given the time of day it was fairly empty (4:30ish). The drinks menu had a bit of everything. I was unsure if I ordered something good-but it was GOOD.Service was prompt. We even tried the crudités. Nice dip!It was a nice spot to be able to actually chat, instead of people staring you down to get your seat.I'm sure it gets cozier the later the night goes... Def will try this one again!", "Date": "2014-07-08", "Author_Location": "Scottsdale, AZ"}, {"Author": "Mariel P.", "ReviewID": "bjGjspwZ1j0kaV5cLNvJHA", "Overall": "3.0", "Content": "Nothing special for a speakeasy. They have you wait while they have copious empty seats!Waited 40 minutes in the lobby sitting only to go stand by the overly crowded bar and be told it'll be another 2 hour wait for the library. As the night went on and we waited, I watched more and more seats become available and they still wouldn't sit us! They finally let us into the library about 40 minutes before closing, but it was not worth waiting for. After all that waiting it was clear they were closing soon and wanted us out. Yes it's a little cool having drinks in a small library and all, but the drinks aren't ones to remember and the fake busyness is not attractive.", "Date": "2014-05-25", "Author_Location": "Brooklyn, NY"}, {"Author": "Yomaris P.", "ReviewID": "mWW-fMtGQZqupeGm4ZwOrQ", "Overall": "5.0", "Content": "Great food, excellent drinks, excellent staff... Check out the new opening on the inside of the hotel... I love the atmosphere, the arrangement in the bar.Great for an intimate evening or just to hang out w friends....;)", "Date": "2014-06-14", "Author_Location": "Manhattan, NY"}, {"Author": "Cathy B.", "ReviewID": "G-uAkvAER-LDujP42_F1Cg", "Overall": "5.0", "Content": "Beautiful decor and atmosphere. I love these wonderful books surrounding me with a delicious cocktail. Waitress was knowledgeable and recommended me the English Heat; spicy and full of citrus. I don't know how it is on Fridays/Saturdays but I came on Sunday evening and we were able to get a table. Towards the end of our drinks, almost every table was full. My favorite part? How they let you read the books! It's so great to see people reading/checking out the unique books and enjoying a cocktail. You rarely see people these days with actual books- you know? My favorite is the New York section. Awesome reads.I will definitely be back here. My perfect library I never had.", "Date": "2014-05-12", "Author_Location": "New York, NY"}, {"Author": "M. M.", "ReviewID": "EB_61cZLYiCB7a_CIO2qpA", "Overall": "5.0", "Content": "Found myself in Korea Town looking for a nice bar for a drink with a colleague. Thank God for Yelp leading me to this place a few blocks away. No weird service issues as others described but it was just a Tuesday. Some tourists in T-shirts (step it up people- you're in the city) but mostly an after work crowd. I would recommend especially to my fellow library freaks.", "Date": "2014-06-24", "Author_Location": "New York, NY"}, {"Author": "Pimp D.", "ReviewID": "Te7z_M-97-ua7H93tgTm-w", "Overall": "4.0", "Content": "Competition for the hippest hotel in NYC with the Ace. Different scene vs the next door Ace Hotel (which btw also is awesome)...think trendy (NoMad) vs hipster (Ace). Cocktails in both venues are similar in their quality.Excellent cocktails created by skilled mixologists. At $16/cocktail, it's not cheap but you pay for quality. There is often a long wait to sit in the Library - was lucky and was seated in 10 minutes. Otherwise you can enjoy the same cocktails at the main bar, albeit in a standing capacity. I also recommend the fried chicken as a bar snack.Not as great as the Dead Rabbit...but very close.", "Date": "2014-06-08", "Author_Location": "Brooklyn, NY"}, {"Author": "Lili K.", "ReviewID": "DqMMPWrtDcKt9Q4OBeMu6g", "Overall": "4.0", "Content": "This is such a beautiful venue!!We came here for dinner, but also checked out the bar area earlier in the week.  I had their \"egg\" which consisted of a poached egg, quinoa and parmesan.  It was good but a bit too creamy and definitely a small portion with a heavy price tag attached to it!  Haha.  All the food was like that-the tuna was only tiny decorative pieces on a plate, and the beef was a bigger portion but will still leave you hungry.They also give you a potato/onion bread to start off with.  We noticed another table having fries so I asked about that since it wasn't on the menu-they said it was their only \"secret item\" off the menu.  It was pretty good with some lemon juice sprinkled over it-and cute little jars filled with ketchup and mayo-yumm.Come here to try some unique dishes and lounge around in a pretty atmosphere!", "Date": "2014-04-13", "Author_Location": "Manhattan, NY"}, {"Author": "Amy J.", "ReviewID": "YufI-yxlSNDrmEpFIL76_g", "Overall": "5.0", "Content": "A class act. I came here for drinks with a friend in my industry.  This place is gorgeous.  Attentive bar tenders, great drinks list, and a incredible cool vibe-  there was not much not to like.  You can put your name on the list to get a seat in the library for a more intimate drink setting.  The bar provides a great over flow and vibe.  I will be back- this may be my new go to for a classy cocktail and conversation.  It can get a bit crowded- but I completely understand why- and with a more mature crowd it's not that much of a problem. A neighborhood gem.", "Date": "2014-02-13", "Author_Location": "Brooklyn, NY"}, {"Author": "Candice C.", "ReviewID": "Ped8Jb6hpDnbHx-kjd1BYQ", "Overall": "5.0", "Content": "Oh yes!!! Such a classy place.  I went after work with a few of my girlfriends & I had such a good time. Great drinks, good conversation, chic ambiance...if only once, you should definitely check it out!This is not your $5 happy hour cocktail specials kind of place. So if that's what you are looking for, go elsewhere.  The drinks were $15+ but was worth every dime.  There was a 45 minute wait to get into the library, so we had our drinks at the bar until they came out and got us. Whether you are at the bar or in the library - it's a good time & pretty cool experience!", "Date": "2014-02-22", "Author_Location": "Brooklyn, NY"}, {"Author": "Sheng M.", "ReviewID": "XG67Pdf8IQvguhgNj5AmUg", "Overall": "5.0", "Content": "Super swanky place to grab drinks.  Cool atmosphere and bartenders really know their stuff here.  Get here early on a weekend night as they get pretty busy.", "Date": "2014-05-11", "Author_Location": "Seattle, WA"}, {"Author": "Brenda P.", "ReviewID": "x9PH9stfBVhl0W4QHwRwww", "Overall": "5.0", "Content": "Maybe it's the fact that we don't have many cool places like this in South Florida that makes me such a NoMad fan? I don't know. What I do know is that I am in love with this little space. Dark, quiet, sultry and quaint...beam me up!We were waiting to dine at Eataly and had a lot of time to kill. I looked up my bookmarks and this was one of my top spots. I directed our group of 6 as we walked there from Eataly. The streets and ambiance started to get a little seedier. Vendors from all sorts of stores and kiosks were screaming out to us in hopes we would buy something from them. Some did get uncomfortably close. The closer we got to NoMad some in our group started to request we turn back. We were from out of town after all and definitively not familiar with the area. I insisted we keep going and ultimately everyone was very happy that I did! It was really cold outside and this was just the perfect place to warm up. Book lined walls enveloped us as we slowly took off our many layers and settled into our cozy little table. We all ordered all sorts of cocktails, wine and beer and enjoyed our down time. There were other groups hanging out there just like us, a couple here and there snuggling in a corner, and many people enjoying the pleasurable solitude a good book can bring. Service prompt and attentive. By the time it was time to go, the drinks had set in and we were feeling very relaxed. The walk back to Eataly was more or a stroll. What vendors? I no longer noticed any uncomfortable seedy people nearby! Ha! This will be part of my NYC routine from now on. Looking forward to it.", "Date": "2014-01-14", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Philip C.", "ReviewID": "mkicjwyMkK26rBjQb-ZBFA", "Overall": "5.0", "Content": "Literally one of the only lounges I go to. Staff is AMAZING! I have never met a more helpful & respectful group of people.Literally feel like I'm in the Great Gatsby.Every lounge should look at this place as their model.", "Date": "2014-03-27", "Author_Location": "New York, NY"}, {"Author": "Al C.", "ReviewID": "POStmTppXcGClXwOh18viw", "Overall": "4.0", "Content": "This is quite a swanky place. Came here on a weekday evening and it was bustling--standing room only for us by the bar. Not a big deal, they have some counter-height tables that you can put your drinks on. The bar area, the restaurant, and the library area all looked so inviting; would love to be around during the morning or afternoon to lounge around and appreciate the space and all of the care and design that went into crafting it.The friendly waitress came by and took our drinks. I ended up with a rye old-fashioned. On point. Didn't end up staying too long, but it was a great way to kick off the night.", "Date": "2014-01-21", "Author_Location": "Emeryville, CA"}, {"Author": "Kiki P.", "ReviewID": "YLneK7ZoZMpN6yoKS8CjfA", "Overall": "5.0", "Content": "The NoMad Library is my favorite bar in NYC. The bar is set up as a library and boy does it look like a real library. They are several tables with comfy couches around the room and the walls are covered in book shelves with beautiful books. The lighting is dim giving the bar a cozy and comfortable ambiance. They have a wide variety of both cocktails and beer. They even have soft cocktails with no alcohol in case you have non-alcoholics in your group. I tried the basil-fennel soda, which was quite refreshing. The bar bites are tasty for bar food too. The fried chicken with chili, lime and yogurt really hits the spot.  NoMad Library is simply a MUST VISIT!", "Date": "2014-01-17", "Author_Location": "Boston, MA"}, {"Author": "Emily H.", "ReviewID": "z2yQc39lIZ5C9WlDHQ1fNA", "Overall": "3.0", "Content": "I really enjoyed this place, but I think it's the type of place you really only need to go once. The ambience and decor is definitely all it's hyped up to be. The cocktails were also delicious and a lot of fun, but very pricey so you can really only get 1 or 2 unless you're looking to splurge. The service was also very pleasant from the bartender and hostess.The food was also very tasty and the portions were good, but nothing was out of this world unique or delicious. Basically a fun place to try once to enjoy the venue, but the food and drinks aren't special enough to come back again and again.", "Date": "2014-05-11", "Author_Location": "Manhattan, NY"}, {"Author": "T C.", "ReviewID": "ovmt3kPJ0RhwvwIGob4QBQ", "Overall": "4.0", "Content": "Drinks are amazing! Bartender or waitress will work with you to find the perfect drink for you. If you can manage to get a table in the library, do it-but they reserve it for hotel guests generally.Happy hour is insanely busy and overcrowded  and this is a place you actually want to enjoy your drink so go when it's not the afterwork rush.", "Date": "2014-03-03", "Author_Location": "New York, NY"}, {"Author": "John B.", "ReviewID": "5MfyunOlGuEcTm1DUKxPjw", "Overall": "4.0", "Content": "Finally visited after months of people telling me how good it is.This ia a review on the bar only . Im yet to eat here but feel the urge is coming to try the best chicken in NYC.The bar is cool , not crazy busy but very civilised.Drinks were great , as was service. Great date spot and will definitely go back to try more drinks.I really want to add more but fear I was already 2 sheets to the wind from the flatiron room earlier.", "Date": "2013-11-16", "Author_Location": "Manhattan, NY"}, {"Author": "Madhuri I.", "ReviewID": "oGr7thVBNrj7LOBs0_VRXg", "Overall": "4.0", "Content": "Having visited several times over the past year, I am happy to announce that I have found my new favourite hotel bar in NYC. Although Lantern's Keep will always hold a special place in my heart, all my fave people at LK have since then moved on to greener pastures, and NoMad does me the favour of providing me a beautiful library setting to sip truly delicious libations. Don't care to lounge? They have high top tables  by the bar where you can stand and socialize with your friends (and other strangers who might rub elbows with you). In fact, the bar at the NoMad hotel has now become so popular that I can no longer waltz in at 10 PM on a Saturday night and expect to be seated immediately.. it takes a good 30-45 minutes.Among their drinks, I could recommend many but the particular standouts are the Start me Up among the darker spirits (a Bourbon/Ginger based drink), Petticoat about the light ones (a spicy gin concoction). Thoughtful that they are, there is also a selection of non alcoholic cocktails on the menu, which I very much enjoyed for the better part of last year.My main (and possibly only) gripe with this place is that their vegetarian menu options are very limited. That, and of course the raging popularity of this bar that has since translated into half hour plus waits for me. Now, why would I do that when M&H is just around the corner?", "Date": "2013-10-02", "Author_Location": "New York, NY"}, {"Author": "A D.", "ReviewID": "f-gWqlnzhEzoAH1uJPuqwA", "Overall": "5.0", "Content": "Fantastic room, cozy, warm, beautiful atmosphere. If you stay at the hotel, you can have a table pretty quickly, otherwise you may have to wait a little. This is the perfect hang out for a lazy sunday evening, a first drink on a Saturday night, a cute place for a date (although it's located in the Hotel, so your date could be suspicious of your intentions), and perfect for a drink after work any other day of the week.Great selection of wines and cocktails ($15). I would prefer the Jungle Bird to the Mint Julep (I prefer the one at Crown 81). They have a short snack menu, but it includes buttered radishes ($8), a delicious fried chicken ($15), and an interesting assortment of breads ($8). Definitely a good spot in the neighborhood, and a good alternative to the Ace hotel.", "Date": "2013-11-10", "Author_Location": "New York, NY"}, {"Author": "Alison C.", "ReviewID": "mLjHXqwBUY8-2NkMAQFOPg", "Overall": "5.0", "Content": "Fabulous service and innovative cocktails are served up in this seductive and classy book lair.  The patrons are all well-dressed and not afraid to order refined beverages, like my companion's requested Sazerac Old Fashioned.  (I do not recall ever hearing anyone specifically order Sazerac as a liquor...)  My cocktail of gin, raspberries, and egg whites was frothy and tart.  Their Bamboo cocktail is sadly off the menu, but can be ordered by VIPs, like another one of my lucky companions.  The unique concoction of East India Sloera Sherry, Amontillado Sherry, Chamery Dry Vermouth, Angostura Bitters, and Orange Bitters is smooth and possesses the perfect balance of smoke and citrus.The NoMad Library may be very pricy (house-made drinks come in around $15), but the sophisticated vibe is worth the visit, as it will make you feel like a million bucks as well.", "Date": "2013-10-17", "Author_Location": "Hoboken, NJ"}, {"Author": "Erica S.", "ReviewID": "EkWpu0JJvlUvTOn4EsHqag", "Overall": "4.0", "Content": "This bar slash library is a cozy place to wile away the afternoon or evening feeling fancy and inebriated. It's got great drinks expertly done. While not cheap, they are not expensive for being what they are. Then there's the bar area, which is livelier and has an upscale crowd, some staying in the hotels, others not. Like the older, more fancy schmancy cousin of the nearby Ace Hotel, the Library Bar is the perfect winter bar. Now if only they had a fireplace. I'd go for one of the inventive and high-quality cocktails over the wine, which was just aight all things considered.", "Date": "2014-01-07", "Author_Location": "New York, NY"}, {"Author": "Jackie B.", "ReviewID": "ccJLs7WPtKKF5vlKPiGH1w", "Overall": "5.0", "Content": "We visited so many places in Manhattan within 3 days that I almost forgot about NoMad!There is a nice menu selection of craft cocktails, I ordered one with gin. Also had a tasty nosh off of the bar menu. The highlight of the Library is that you actually feel like you are lounging in a warm but trendy library space. They have done a wonderful job with the ambiance. Good spot to bring a date before or after dinner.", "Date": "2013-08-30", "Author_Location": "Pasadena, CA"}, {"Author": "Sarah K.", "ReviewID": "wdlcoUYDAqkWFLfkDEv_8w", "Overall": "5.0", "Content": "Favorite bar.Drinks pack a punch and are worth their price.Setting is very intimate even when it's crowded. Great place to impress a date.", "Date": "2013-10-16", "Author_Location": "Tampa, FL"}, {"Author": "Blaine S.", "ReviewID": "w-w_H40VCgRkm36U7U_1-w", "Overall": "2.0", "Content": "I was in the library bar recently.  Here's the issue.  The library bar is a beauty, very nice.  Bartenders are really nice also.  BUT.  Listen Nomad, you're awesome but there are other games in town, so if you want to make me a nice cocktail in one of those little tiny margarita type glasses, then COME ON, fill the friggin' thing to the top.  How absurd to do your little cocktail tricks, charge people and arm and leg and then you can't figure out how to fill that tiny little glass to the top?  My drinks weren't even close to being at the top.  Ugh.  And I still left a really nice tip.  Nomad you've got to get a grip, your cocktails are good, but they aren't that good.", "Date": "2014-06-03", "Author_Location": "Manhattan, NY"}, {"Author": "Tonya C.", "ReviewID": "6yQsdG2Eakd2d1SUaBrnyg", "Overall": "4.0", "Content": "After leaving Temple Bar, my friend & I met up with one of her friends at this fantastic place.Really it's the scenery that's key. It's like drinking in some rich person very nice home library. Of course because it is some rich person's library you're attendance there is helping pay for it because drinks aren't cheap. The staff is okay- not horrible but not amazing either. The people leave very much to be desired- girls in cutesy cocktail type dresses and guys in jackets with colorful socks and loafers. There's not a dress code though. The hotel itself  looked pretty nice and may be worth a stay. I'd come back with some friends, but wouldn't dream of coming alone- eek! Talk about an evening of feeling like the odd man out.", "Date": "2013-10-12", "Author_Location": "Brooklyn, NY"}, {"Author": "Stephanie M.", "ReviewID": "fJ_bgnY9vt54Ivx-TnBtFw", "Overall": "5.0", "Content": "I am far from being a liquor connoisseur, but I know what I love, and I Iove whiskey drinks.And this place has an entire menu page of them.  It looks like rye is their speciality, but they also have a few bourbon and irish whiskey cocktails as well.  These were interesting mixes too - not just the standard whiskey+angostura.For example, we ordered the Matchlock which was a large ice-filled drink, bourbon-based and strongly spiced with vanilla, grapefruit, and ginger.  Normally, I can never tell what exactly goes in my cocktail, but in this drink I could taste the sweet, the spicy, and the tart aftertaste.  It was delicious, and beautifully presented.We arrived at the place at around 1am on a Saturday - it had a fair crowd, but wasn't too packed.  We were able to get seats at the bar, and have a conversation across the five of us without screaming.And what really struck me about this place was that the bartenders were not only knowledgeable, but totally willing to give suggestions and answer questions (like, \"what exactly are bitters??\"). Definitely not like the uptight service experienced at other cocktail bars where I pretend to know stuff for fear of being belittled.Anyway, great bar to indulge in that $15 cocktail.  Definitely returning to try the rest of the menu. :)", "Date": "2013-08-05", "Author_Location": "Manhattan, NY"}, {"Author": "Sandy C.", "ReviewID": "BeEr8FlYSndImuDFkcAapg", "Overall": "4.0", "Content": "Warm glowing amber lights that light up the perfectly lined glasses on the bar....extensive mixology cocktail list.....Slow melting ice cubes for whiskey....No attitude at the door... -  Savor the Perfection.", "Date": "2013-06-07", "Author_Location": "San Francisco, CA"}, {"Author": "Felisa F.", "ReviewID": "yhfosl_7H-n6f1JbYAA2nQ", "Overall": "4.0", "Content": "Even on a Sunday evening at 6:30PM, the Library is packed with hotel guests, regular folk, and foodie connoisseurs. The space is a lot smaller than I anticipated and located all the way to the back and far left of the NoMad Hotel. I had to ask where it was, otherwise I would have been lost for days. It is by no means a 'library' in the sense of noise level, crying babies, people talking, etc. However, the books and journals that line the walls are absolutely amazing! I would have loved to come back when it was empty and explore the shelves. I walked right in, which apparently, was the 'wrong' thing to do. There was no hostess at the hostess stand, how was I suppose to know that I should have made sure that no tables were reserved? The waiter came over to me apologizing that table wasn't cleaned off and called over the hostess to confirm my presence at the table [really..?]. The hostess in turn called over another waitress to take my drink order. I had the Petticoat [sichuan peppercorn infused gin, apricot liqueur, velvet falernum, and lemon]. It was sweet due to the lemon and apricot liqueur but left a spicy undertone on the back of the tongue because of the sichuan peppercorn. Definitely refreshing and nice for a summer's eve drink. It was $15, which is a bit steep and because it is in a hotel, I am not entirely surprised. I don't believe it's worth that much though. Would I come back? Sure. Yes, I am that pretentious and I'll bring my friends.", "Date": "2013-07-31", "Author_Location": "Brooklyn, NY"}, {"Author": "Denise S.", "ReviewID": "55jyI7l3kZh_Lex-jaEMHQ", "Overall": "4.0", "Content": "Visited the NoMad for an afternoon drink.  It was early so they had a selection of UNFREAKING BELIEVABLE pastries.  We had the library all to ourselves.  The bookshelves line walls, floor to ceiling; a very Ernest Hemingway feeling.   Seats are wonderfully cosy. The place is a throw back with an old boys club feeling where men would take in a drink, have a cigar and  and talk cross continent railroad deals.  Except this is NYC so no cigar smoking and also I'm not a man - but I was living that moment in my mind anyway.Great, Great Great gin drinks.  Be prepared to have more than one, they are yummy.", "Date": "2013-06-15", "Author_Location": "Ridgewood, NJ"}, {"Author": "V P.", "ReviewID": "8sq9b7AwIwmzQgJOi-LAMw", "Overall": "5.0", "Content": "Best cocktails in Manhattan.  Service was a bit slow but we would definitely return.The Matchlock drink was great - a must try!", "Date": "2013-10-17", "Author_Location": "San Mateo, CA"}, {"Author": "Victor W.", "ReviewID": "KcARNTQDhQGaHlEeKUZIYQ", "Overall": "3.0", "Content": "I am a nomad that likes to look for the next unique spot. So when my friend shared her secret hangout place I was thrilled. I love drinking in libraries...maybe it is because it reminds me of the fun times I had chugging wine at the college library during finals week. Alcohol did always bring out the creative juices in me. The decor in the library was beautiful, but unfortunately the waitress was not. Nasty and stupid, she gave us an attitude, and took forever to take our order. Once she proceeded to take our order she did not know anything about the menu. The place is great just come prepared to deal with horrible service", "Date": "2013-05-13", "Author_Location": "New York, NY"}, {"Author": "Scott B.", "ReviewID": "LauK6iz2v1Wl4LEVErEIfw", "Overall": "5.0", "Content": "Wow! What a classy place! I wished my living room looked like this place! It looks like a large, well-kept library in an old mansion--very masculine looking yet warm and inviting.The wait staff is amazing here, and the drinks are out-of-this-world. In fact, I had one of the best drinks I've had in the city last night when I visited The NoMad Library for the first time. It was the Matchlock, which was made w/ Rye, Bourbon, Absinthe, vanilla, grapefruit, ginger, lemon, and angostura bitters!  Delicious!!If you have a special occasion date coming up, take 'em here! This place is absolutely amazing!!", "Date": "2013-02-11", "Author_Location": "Brooklyn, NY"}, {"Author": "Rich T.", "ReviewID": "w2kY2rnJeHptSg5llNnvGQ", "Overall": "5.0", "Content": "The Library section of The NoMad's bar area reverberates with comfort, warmth, and an odd sense of power, which one can either ignore or simply acknowledge and move on. As one enters the back bar area with its limited seating and lighting effects focused from unseen points, The Library's entrance is on the left through tall curtains. There is a separate attendant stand there with a service area tucked away near it too.The Library is a comfortable and welcome addition to the bar area, but rather than being there in a support role of the bar, it stands equally with friendly waitresses, sommelier service, and light bar foods menu. As we darkened the doors there, we had just returned from a good round of strong drinks at The Greensquare Tavern and were ready for another moment to celebrate. To my surprise, most of the tables were marked as \"reserved\". I interpreted this as the management's subtle way of keeping the area autonomous and free of hangers on from the bar area.The guardian of the podium asked us if we were there for dinner and I added we were guests of the hotel with flash of my hotel card, which seemed to illuminate our path to one of the tables and two fat chairs. Looking into the greater area, there were a few people in suits having themselves an intense discussion (for world domination?) and there were the few ubiquitous Apple laptop users who might have migrated from the nearby Breslin/Ace Hotel lobby (always funny hipster scene with 50 people typing away and not talking). Settling in, we embraced the service of the restaurant's sommelier, who made an excellent reference to a sparkling Cremant de Bourgogne. We found his polite and educational notes to be very interesting and well sourced as well asked a few questions about the wine list.The Library's composition slowly became more crowded with the background lighting seeming to fade slowly and we saw evidence of \"power dinners\" and few \"hot dates\", which seemed to be pushing the waitresses to even greater heights of service. The Library reminded me of some other venues in NYC that radiated with luxury and a presence, such as The National Arts Club and The Campbell Apartment. It also reminded me of what an outstanding venue The NoMad is and why I look forward to returning there when I am able.", "Date": "2013-04-02", "Author_Location": "Jacksonville, FL"}, {"Author": "susan m.", "ReviewID": "32Kj5NH8Ntuu3qP8buzXug", "Overall": "1.0", "Content": "Many many open tables but I was told there is a 45-60 minute wait, at 4pm on a Friday. Don't they know who I am?", "Date": "2013-12-20", "Author_Location": "Manhattan, NY"}, {"Author": "Terri Y.", "ReviewID": "XRPh9ODE3BGcmUwKm6mO3A", "Overall": "4.0", "Content": "YES! A FAN! I LOVE their coffee selection @ The Library. LOVE the almond croissant. It's quaint, quiet, has good light, filled with books! It's a good place for a date if you ask me. You can make your date think you're very \"cultural\" if you take them here... which you are of course. You ARE on yelp learning about other's NYC life after all.", "Date": "2013-03-17", "Author_Location": "New York, NY"}, {"Author": "Vinson L.", "ReviewID": "1rVM7MSG44r1a6I4j3VZ2w", "Overall": "4.0", "Content": "Looking for a bar in the midtown area of Manhattan...well look no further. The NoMad Library Bar within the NoMad Hotel is your place to find some of the libations in the city. We stumbled upon this bar because of the other Yelp reviews and we were definitely not disappointed. It was a Saturday afternoon, around 4pm and the place was crowded - we found a small area near the bar to have our first drink and waited to be seated at a table (about 45 minutes later). But it was well worth the wait. The seating area is basically the library, hence the name, with books upon books around you. The atmosphere reminds me of a speak easy and definitely the drinks are what draws the crowd. The combination of flavors and alcohol would bring me back time and time again as a place I could relax and catch up with friends.There is quite a selection of mixed drinks and your traditional scotches, vodkas and others, but we had the Mint julep. Old Alhambra. Black Thorn, among other specialty cocktails that were on the menu. Definitely take the recommendation of the server if you are feeling adventurous and you will not be disappointed.Cheers!", "Date": "2013-01-29", "Author_Location": "Las Vegas, NV"}, {"Author": "Alex H.", "ReviewID": "lTWgBJmj8-LMEZVLPiR11w", "Overall": "4.0", "Content": "Coming from SF, where nearly every good bar is a hipster-filled Mission dive, I've got an unmet quota for a slightly classier drinking experience every now and again. I filled it last time I was in NYC with Nomad, with its dark lighting, chic furnishings, walls covered in leather-bound books, smells of rich mahogany. Ok maybe not that last bit. But the rest is all true, including actual books which is fairly impressive given the size of the place.Ok, so its a good scene, but ultimately I'm not giving 4 stars just for that. The drinks here are really, really good too. Think craft cocktails and a solid whiskey list. Aka something for pretty much everyone. Except maybe my SF hipsters...I don't recall seeing PBR on the menu.", "Date": "2013-06-27", "Author_Location": "San Francisco, CA"}, {"Author": "Mary T.", "ReviewID": "O6sibrv-92oIKjA9w3FNcg", "Overall": "4.0", "Content": "Being a book aficionado, I headed down here after taking in a Broadway show on a recent business trip. My main goal was to see the library, but I ended up spending most of my time at the bar, talking to the bartender and some of the locals.It was full, especially for a Wednesday night, but I was able to get up to the bar relatively quickly. After taking a cursory glance at the bar menu I asked Dom, the bartender, to simply make me a drink. He asked a few questions regarding sweetness, types of liqueur, etc. and then managed to blow me away not once, but twice, with drinks that I never would have ordered for myself, but were amazing.The prices are steep (my two drinks + tip was $40), but for an every-once-in-a-while treat, it's well worth the extra cash. Dom will treat you right, and if you're lucky, he'll share his secrets of both NYC and San Francisco.", "Date": "2013-01-17", "Author_Location": "San Francisco, CA"}, {"Author": "Rose W.", "ReviewID": "-1uppO4D3aIQY7_IJ9WQiw", "Overall": "4.0", "Content": "Sexy bar as how I recommend it, almost as if you were in another secret private club. Good looking people make it even better. Must have a drink here before dinning in the restaurant!", "Date": "2014-02-10", "Author_Location": "Australia"}, {"Author": "Julie J.", "ReviewID": "D3Una_EiDC9yL46Jq57nfg", "Overall": "4.0", "Content": "I stopped by The NoMad Hotel around 9pm on a Friday evening and had no problem being promptly seated in The Library.  I guess we got lucky.  I do think the set up for the bar / restaurant is a little on the odd side (as others have pointed out) but I guess that is what makes it unique.  The entire lounge is decorated as if you were in a study / library, hence the name.  The lounge has a nice upscale feel, but certainly not a place I'd like to go on a date.  In my opinion, it's a cool place to meet up with friends for a few cocktails or meet clients.  Menu is fairly limited - I had the beef tartar and to be honest I wasn't all that impressed with it.  Drinks are pricey, but that is to be expected.  Service is good, but not stellar.  Definite low-key vibe, but I am not sure I would want to spend a prolonged amount of time here.", "Date": "2013-02-17", "Author_Location": "New York, NY"}, {"Author": "Matthew H.", "ReviewID": "BKq3dJGL0UXpT4C6h3V9Kw", "Overall": "5.0", "Content": "We came here after dinner and some friends were staying at The Nomad because of that we were somewhat expedited to the front of the line.  So keep that in mind when you are staying at the hotel.  We got a nice little table in the corner with a few chairs and a small sofa.  The service was attentive and the drinks were pretty fantastic, I ended up having a few 40 Thieves and I have no idea how the bartenders got rye whiskey and pineapple to go together so well but congrats on that.  The main draw to this place is the absolutely gorgeous setting.  The library is just an ideal setting to get away from it all, have a few well crafted cocktails, and catch up with friends.", "Date": "2013-10-29", "Author_Location": "Philadelphia, PA"}, {"Author": "Mike E.", "ReviewID": "pFWCZJfNMlOJAFeVH8MpKg", "Overall": "5.0", "Content": "Very cool place to hang out. Drinks mixed the way they should!!! Food was excellentService was prompt!!! Definitely going to be there again", "Date": "2013-09-15", "Author_Location": "Manhattan, NY"}, {"Author": "Malcolm K.", "ReviewID": "VhWQ1tvZ1Ngnukvv8OFbuQ", "Overall": "4.0", "Content": "Great spot for a celebratory drink in Midtown Manhattan. That in itself isn't saying much, except for the fact that the cocktails here are light years ahead of most places anywhere. Also, the wood carvings adorning the bar are unlike anything I've ever seen. Huge lions heads or something. A dramatic touch to an already-impressive space. It feels like you're drinking cocktails in Jeffrey Lebowski's private library. I love it. Like myself, though, if you're not rich, this bar can be intimidating. You'll walk in and your brain will immediately begin to fire the 'I can't afford this place' neurons, which can be both healthy and exhilarating once you've started having fun here. And there is fun to be had; you just have to be careful spending the money to find it.", "Date": "2013-01-03", "Author_Location": "Brooklyn, NY"}, {"Author": "Ryan M.", "ReviewID": "XwY8Kdhfehrouz4vjK7E1Q", "Overall": "5.0", "Content": "The NoMad Library and adjoining main bar comprise the best hotel bar in the city. Helmed by EMP's Genius Beverage Director Leo Robitschek, the Nomad is bringing back the days when a Hotel Bar is a destination and not just a convenience for the guests. Stunning ambiance, impeccable service, flawless cocktail list and food by one of the most celebrated chefs in town. This is an unmatched combination. The only two issues are...1) It's popular, so it can get very busy after work at peak times2) Drinks are on the higher side at $15 for a proper cocktail, but the quality is extremely high, and the ambience and food make this a great place for a special night out.Absolutely recommended. On THE LIST:yelp.com/list/best-cockt…", "Date": "2012-12-29", "Author_Location": "New York, NY"}, {"Author": "Jennifer C.", "ReviewID": "5Ej7qgWidEJvYvRgbUe6qA", "Overall": "5.0", "Content": "Thought I was making a quick stop here last night to meet a friend, but wound up staying for 2 drinks!!!  I LOVED the place.  The service was great, the cocktails were strong, unique and delicious, and the ambiance was fantastic.  The walls in the NoMad Library are lined with bookshelves and make for a beautiful setting to enjoy a few drinks or shared appetizer.  Of the cocktails I sampled, my favorite was the Hair Trigger.  My table also split and enjoyed  the potato bread.  In addition to the very lengthy fancy cocktail list, there was also a \"soft\" cocktail list consisting of virgin mixed drinks - which I thought was fun and different.I really liked it here and cannot wait to go back.", "Date": "2012-11-18", "Author_Location": "Manhattan, NY"}, {"Author": "She Eats Real F.", "ReviewID": "sTad-adREf77h9Tgbyqn5A", "Overall": "5.0", "Content": "So elegant. Fantastic strong cocktails, attentive servers who aren't pushy. Laid back quieter environment, with plush seating and lots of books. This is the kind of place you want to come with a group of friends to have a debate, some laughs, and a few drinks while escaping the City. $15 drinks - well worth it and far superior I've pair $22-25 for!", "Date": "2014-01-19", "Author_Location": "Brooklyn, NY"}, {"Author": "Alex V.", "ReviewID": "_Cu-RDOZwXcJ6_a5pKjRVA", "Overall": "5.0", "Content": "Dimly lit and lined with books from floor to ceiling, the NoMad Library gives off a sense of old school luxe without being too over the top. A great place to entertain clients and friends or just to grab a snack and a drink. The cocktail menu here offers a selection of both classics and more inventive concoctions crafted from high quality ingredients. At about $15 a drink, the cocktails  are EXCELLENT and has a real kick to it. Confused about what to order?? Unlike others, I thought the service was decent. The cocktail waitresses are knowledgeable and provide superb recommendations, however they pretty much disappear after they bring out your drinks.I have heard many great things about their restaurant particularly the $78 foie gras and black truffle stuffed chicken for two. A visit to their restaurant might be in order soon...", "Date": "2013-05-21", "Author_Location": "New York, NY"}, {"Author": "Lindsay S.", "ReviewID": "GyILN7BgM4z2lRlBn49T1Q", "Overall": "1.0", "Content": "Very disappointed in this place. Arrived at the hotel which looked quite nice-went into the main lobby where my date and I found out that the bar was \"at capacity\" and we would have to wait.  Fine. The hostess mentally took our names down, did not give us a specific amount of time and told us to wait in the lobby. 10 minutes went by then 20 then 30 and we were still not seated despite the entire lobby clearing out. The hostess clearly saw us and did not come over to give us any update.  We decided to not stay because of the lack of service. Was not pleased.  Perhpas the drinks are good but did not find that out.", "Date": "2013-03-27", "Author_Location": "New York, NY"}, {"Author": "Ariel X.", "ReviewID": "cZQh-7FcgsWaZseqGEhLHA", "Overall": "3.0", "Content": "The Library in a nutshell: stylish 30-somethings sipping on carefully prepared drinks in a chill, yet luxe environment. The bar is beautiful and all of the bartenders wear what I can only describe as classy woodsman outfits, complete with matching vests. I got the coffee cocktail with cognac, vintage port, demerara, egg, and nutmeg, which somehow really did end up tasting like coffee.Although my friend and I didn't end up getting a table (we were told it would be 45 minutes to an hour), we were perfectly happy sitting at the bar. For the ladies out there, one of the hosts working at the Library is quite pleasing to the eyes. :) The layout is kind of weird because we had to go through the NoMad hotel lobby and the restaurant to get to the bar area -- not a big deal, but can be somewhat awkward. 3.5 stars.", "Date": "2013-05-28", "Author_Location": "New York, NY"}, {"Author": "Ro N.", "ReviewID": "KUEHuNSYn6PXkZu7Y0n4UQ", "Overall": "3.0", "Content": "Get the Hair Trigger - done.Place is super small and not easy to get to the bar.Okay scene......", "Date": "2013-04-15", "Author_Location": "New York, NY"}, {"Author": "Evelyn S.", "ReviewID": "4_9mnRZjyA4auMIUbRxnFQ", "Overall": "4.0", "Content": "It can get crowded in the bar area but the crowd wasn't too \"scene\"-y. The drinks were good but not amazing.That said, I love the library section of the bar. All the seats were comfy. The snacks were yum and it was quiet and old-timey. You just never want to leave.Also fantastic service all around. I'll probably come back but would mostly try to get into the library section...not so keen on the rest of it.", "Date": "2013-04-08", "Author_Location": "New York, NY"}, {"Author": "Megan C.", "ReviewID": "y3mm59re9fmyPWnvYt9YfQ", "Overall": "5.0", "Content": "Love this place.Desserts are a little on the small side considering the prices. Drinks and ambiance are fantastic. Great place for conversation for business or with friends. Also owned by the same group that opened The Ace Hotel two blocks up. Service is unmatched for the area. Truly fantastic.Date Rating: 8Pick up Scale: 6Strong Suggestion: don't come hungry.", "Date": "2012-09-05", "Author_Location": "New York, NY"}, {"Author": "Mike S.", "ReviewID": "wGB-WqJ8O25KV_MRxzPygQ", "Overall": "4.0", "Content": "Great spot for drinks! Classy atmosphere with a warm, cozy feel to it. The cocktails are delicious and the staff is accomodating. Can get a little crowded on weekends so plan accordingly. Oh yeah, and they have Pappy Van Winkle bourbon there. Automatic thumbs up in my book.", "Date": "2014-01-04", "Author_Location": "New York, NY"}, {"Author": "Myrtle B.", "ReviewID": "H1B16nra5MBJx115XpSQDg", "Overall": "5.0", "Content": "Obviously the ambiance here is a throwback to the old men's club having a night cap in the study before bed, which is pretty cool. What really made this spot stand out though was the unbelievably knowledgeable staff. Our waitress knew exactly what we would like based on whatever craving we described no matter how vague we were.", "Date": "2014-01-20", "Author_Location": "Seattle, WA"}, {"Author": "Todd A.", "ReviewID": "3n2Fu5QY_zKS940YJo3zUA", "Overall": "3.0", "Content": "3.5 Stars.This was one of those experiences akin to taking a shower together with someone for the first time where you have such high expectations but in the end you just wind up being sprayed with cold water and getting shampoo in your eyes.As I rode the rush hour 6 train to meet Lama for mid-week drinks, I had thoughts of how it would be cozy and relaxing and imagined what it would be like drinking in a reclusive millionaire's library.Well after getting out of the subway (and getting sprayed with cold water, courtesy of mother nature) I walked in to the bar and felt the sting of shampoo in my eyes.  It was more crowded than the train I was on 5 minutes earlier and was too loud to hear most of the conversation.  It took 3 minutes to find Lama despite being in a 300 square foot space and another minute to get to her despite only being 7 feet away.  Due to the layout, it's difficult to get to the bar.  The one saving grace is that once you get your drink, you are in for quite a tasty treat.", "Date": "2013-04-21", "Author_Location": "Manhattan, NY"}, {"Author": "Danielle T.", "ReviewID": "b74i7l_O3nSZQU45iRqLcA", "Overall": "1.0", "Content": "NoMad  Library used to be great because it was cozy, had a pleasant crowd, and had high class standards without pretension, but with luxury. The drinks were also delicious.Well, word must have got out and now all of New York comes to get their cocktails which have gone downhill in quality and to enjoy service which is clearly there to get people in and out. Line up, New York. Every drink tastes like grapefruit. My partner ordered a drink that clearly was misunderstood by the waitress (he asked for bitter, smoky, and dark and what he got was something pink with crushed ice with mint on it... on the menu but not appropriate to his taste). She must have noticed he wasn't drinking it, but did not say anything. In other places where you don't expect decent service, I would just ask for something else. Here, I expected her to say something. We left the full drink on top of the bill after we paid. Take it as a tip? I'm incredibly disappointed with the downhill momentum NoMad is achieving after such a wonderful start. I used to be a regular and now I just feel they are trying to hustle me out to fill my seat with someone who will appreciate a bunch of pomp with little flavor.", "Date": "2013-04-14", "Author_Location": "Manhattan, NY"}, {"Author": "Lorelei D.", "ReviewID": "Vo78YZglG141lXqYf8Mibw", "Overall": "4.0", "Content": "Great variety of cocktails and nibbles. Very crowded though, go early.", "Date": "2013-12-11", "Author_Location": "Queens, NY"}, {"Author": "Kevin H.", "ReviewID": "FuyNi2HWnvkO-c51lCMwJg", "Overall": "5.0", "Content": "Good variety of beers.  Actually have sour and saison beers AND good ones.  The cocktails are too end and the wait staff was very knowledgable about the beers and cocktails.  We came after midnight so we couldn't order any food but it all looked amazing.  This is on out list next time to come earlier and try the food.", "Date": "2013-12-02", "Author_Location": "Carlsbad, CA"}, {"Author": "Alice E.", "ReviewID": "m6mvrCOovQA25ks3ufzu7Q", "Overall": "4.0", "Content": "A really great place for an overpriced drink.  It gets crowed.  I go for a good work shmooze/ to get drinks with clients.  The snacks are good and portions are small with excellent presentation.  The non-alchoholic drinks are good too! service is fast but often a wait if you show up at 5.", "Date": "2013-10-04", "Author_Location": "Brooklyn, NY"}, {"Author": "Michelle H.", "ReviewID": "DOQ2nWWKGNc5a7RK2D65AQ", "Overall": "4.0", "Content": "This is probably one of my favorite places in the city to grab a drink. The drinks/wine list are great and the ambiance is perfect. It's classy, but not over the top and you can actually sit, enjoy your company and have a pleasant conversation. The minus one star is b/c if you come during busy time, the wait could be a little long and there really isn't a good \"waiting\" area.", "Date": "2012-12-14", "Author_Location": "New York, NY"}, {"Author": "Candi D.", "ReviewID": "d70ogJ0pOAlajUO8gqpvmw", "Overall": "1.0", "Content": "Again this place continues to disappoint with their now \"velvet rope\" attitude... True the cocktails are great but seriously it has been the same story.. The back bar was sparsely filled and there were SEVERAL empty tables in the library and still the power tripping hostess says 45 min to 1 hr... I say don't waste your time because u will always end up going elsewhere!!!", "Date": "2013-08-27", "Author_Location": "Waikiki, Honolulu, HI"}, {"Author": "L K.", "ReviewID": "xcuUQpeOArJpFf67oBGnUQ", "Overall": "3.0", "Content": "Well This Hotel Is very nice. I liked the decor. BUT the bar area was so dark, and very very loud. If you plan on bringing a first date, don't. Unless you're getting a table to eat dinner. That room wasn't as loud. After an hour or so I felt like I was losing my voice, kept saying what? It got annoying. And the music wasn't even good. The bar was packed at 605 pm on a thurs. Kept getting bumped. The libray was full and the dining area was getting full. It's a happening place, not sure about the patrons though. I saw a lot of girls who looked single, and old men gawking at them. Not super fancy, the old men in there was screaming! Sort of obnoxious. Not really my scene. If you're under 35 I'd say forget it.The wine was just ok. 12 bucks. If I could sit in the library area maybe I'd go back. But I doubt it. I like Gansevort parks views a lot better.", "Date": "2013-04-08", "Author_Location": "Manhattan, NY"}, {"Author": "Kevin W.", "ReviewID": "xKkE8XxeGgxElHHVfOeC3w", "Overall": "1.0", "Content": "This place is annoying and pretentious. Maybe it is SO awesome that they have to be obnoxious about it. Anyways, I didn't see what the big deal was. It's a nice looking hotel bar, but u can get that without the attitude at Ace Hotel nearby, or even 230 Fifth bouncers weren't as rude as the girls upfront of this place. One of our group finally came out for them to let us in. Once inside it did look nice, like a library. But wasn't so crowded that they needed to be rude. Nor did I see any celebrities that warranted this meat packing district level of pretention door policy. Would still like to try the restaurant tho as I've heard great things/reviews.", "Date": "2013-05-13", "Author_Location": "Manhattan, NY"}, {"Author": "Rebecca L.", "ReviewID": "fsDYFBzRBfNBgcZMcjD4_Q", "Overall": "3.0", "Content": "super expensive drinks ($15 for a beer, that's reasonable). par for the course at a place like this. for the money, Ace up the street is much more fun, but the enclosed atmosphere does provoke a certain kind of depth and exclusivity. Friendly waitress / great spicy bourbon cocktail. good for first (fact-finding) dates?", "Date": "2013-09-25", "Author_Location": "Manhattan, NY"}, {"Author": "Alice N.", "ReviewID": "ZGno6YG_vOKq09oWjfn3yQ", "Overall": "4.0", "Content": "The bartenders are excellent, and the ambiance is wonderful. There is definitely more of a range in ages, and the dress code errs more on the dressy side.Go for the Sancho Panza drink - it is absolutely amazing.", "Date": "2013-02-04", "Author_Location": "New York, NY"}, {"Author": "Ryna D.", "ReviewID": "3s6vEziE74PPwupEnczx1Q", "Overall": "5.0", "Content": "After our light dinner at John Dory my friend and I decided to come here for some fancy cocktails. She's been here before but this was my first as the first time I tried to stop by almost a year ago they were closed. Of course, the actual library area was at capacity so we had to be content with staying at the main bar area. We weren't complaining as we easily got drinks for ourselves. My friend got a tequila cocktail while I ordered the Sons of Liberty cocktail. My drink was fantastic! It was boozy but refreshing, aromatic and had complexity in its flavor. It was definitely one of the best cocktails I've had of late. I also enjoyed the gorgeous decor. Very classy and it would be perfect for date night. The drinks are pricey of course and each drink are about $16 or more. But over all, the atmosphere and the classy vibe along with the excellent mixologists make this bar worth it. I'm definitely going back!", "Date": "2014-01-25", "Author_Location": "New York, NY"}, {"Author": "Patrick B.", "ReviewID": "2WIHKFpbhoSrvMD-4_uQUg", "Overall": "3.0", "Content": "Executive Summary:.Décor/Ambience: All four rooms, Atrium, The Parlour, Library and the Bar are gorgeous in their own ways.  My favorite is the Library.  Dark, cozy, provocative, yet versatile; I would be comfortable bringing a date OR my boss here.Clientele: Ages 28-38 generally, even gender mix, but not really a place to try and meet people.  Come as a group.Drinks: Top-notch, highly recommend Satan's Circus (even though it's not on the menu right now).Food: Can only comment on the lighter fare offered in the Bar/Library.  Sweetbreads are great, fried chicken not so much.Music & Noise Level: Medium-quiet; great place for holding conversations.Pricing: High but fair for what you're getting.  This place is beautiful and it's inside of hotel...what do you expect?Would I Return?: Probably not after my most recent visit.Extended Version:.I've been here twice.  My first visit, I sat at the bar and had their cocktail creation, \"Satan's Circus\", and their sweetbreads.  Both are really nice.  I highly recommend requesting Satan's Circus even though it's currently not listed on the menu.  Bartender was polite, prompt, and great at what he does.Second visit, I sat in the beautiful Library and started with the fried chicken and a cocktail.  The fried chicken was absolutely disgusting.  Primarily dark meat that had a chewy crust as if it was microwaved and not freshly deep fried.  The sauce that accompanied it was un-inspiring.  I was so turned off I had to send it back, which was a process in and of itself.  My server never returned to ask if I was enjoying the food so I had to wait until she saw that I might need another cocktail to tell her that I would not be eating it.  I requested a cheese plate instead, which was much better.  She eventually told me she was \"able to get the chicken removed from [my] bill\"...As if that's a feat when a customer sends back a plate to the kitchen with a legitimate reason?  Overall the service was horrid.  I was shocked by how inattentive they were and livid when I was handed off to a different server halfway through service when it was time for my original server to clock-out.  I was of the impression that this place is trying to be more upscale and possibly even earn a Michelin mention.  But that will never happen if these kinds of practices continue.  I mean come on, this is Restaurant FOH 101: A server remains with her tables until they have finished, regardless of when they're scheduled to clock-out.Not as important, but not the best way to end a poor experience: They over-charged me for my cheese plate and was told \"Oh, you were given the cheese plate listed on our dinner menu.\"  Well, wasn't I seated in the Library with the bar menu? \"Yes well, I can see if I can have that price adjusted for you.\"  Come on guys, get your act together.I relayed this info to one of the managers on my way out and he seemed somewhat interested but not really sympathetic after giving me his card and saying, \"Let me know next time you're coming in and we'll buy you a drink or something.\"  Come on, people who go to establishments like the NoMad aren't looking for hand-outs to make-up for a poor service.  They either receive a proper apology and follow-up OR they stop going to that place altogether.  Unfortunately, it looks like I fall into the latter category.", "Date": "2013-07-08", "Author_Location": "New York, NY"}, {"Author": "Kelly L.", "ReviewID": "gdCMRz1hEh4-omGuJpfyaA", "Overall": "4.0", "Content": "Exceptional service, knowledgeable staff, oh and amazing cocktails. Low key setting, but definitely does not fail to impress. My only issue was a slightly inconvenient restroom (\"Take a right, then left, then down the stairs, then keep turning right etc\") with slight smell of puke (?) or something unpleasant. Would definitely come again, wait for party of 2 around 11pm on a Friday was 30 mins.", "Date": "2013-09-21", "Author_Location": "New York, NY"}, {"Author": "Pamela S.", "ReviewID": "b7AWcGKbO8GsfTUDd3CXwQ", "Overall": "4.0", "Content": "Decent place to meet for a drink given the library theme, though the immediate neighborhood isn't particularly nice. Might be worth calling for a reservation since it's more of a lounge and you're going to want to sit. Drinks are expensive, as one would expect at a hotel bar.", "Date": "2013-06-20", "Author_Location": "New York, NY"}, {"Author": "Nel A.", "ReviewID": "UehskLjUOO7lWBeAr4sn1w", "Overall": "4.0", "Content": "really nice girl seated us.  made is feel very welcome.  the waitress gave me a good dessert suggestion.  i asked for something not too sweet.  so she suggested the BRIOCHE WITH PEAR SORBET, LEMON & GINGER.  was great.thank you.", "Date": "2013-06-24", "Author_Location": "Manhattan, NY"}, {"Author": "Stephen F.", "ReviewID": "vqCGk-8NRQDiSRrDEGkXTw", "Overall": "5.0", "Content": "Love the atmosphere - it's like you're sitting in some billionaire's library.  Very relaxed scene. Upscale but not pretentious.  They make excellent drinks - true bartenders, not college kids.", "Date": "2013-03-13", "Author_Location": "New York, NY"}, {"Author": "James K.", "ReviewID": "XLwRQz--h1yGUHkgJI7rQw", "Overall": "3.0", "Content": "A bunch of us stopped in here on a Friday night for drinks. The bar was quite crowded and the menu was extensive and exciting. I liked my drink, it was smooth and complex. We didn't stay very long because of the crowd. The host and our waitress were both unpretentious and friendly.", "Date": "2013-05-10", "Author_Location": "Jersey City, NJ"}, {"Author": "Lucy C.", "ReviewID": "g6JVAWX2aojF7X9t93O25g", "Overall": "5.0", "Content": "Definitely some of the best drinks in Manhattan. I generally cannot handle strong drinks but these drinks were so good I inhaled them. Very beautiful and classy decor, pleasant staff, great variety of drinks (about $15/cocktail), and amazing seating in the library. However, the wait list for the library seating area can be anywhere from 30 mins to 2.5 hours. It's really hard to get a seat at the bar too, but if you kindly ask the bartender, she'll help you out. To get to the bar you have to walk through the dining area (NoMad Restaurant), which is equally beautiful with a variety of seating. The aromas of the food are unbearably wonderful. If you come here stuffed, you will inevitably get hungry again. I got the rosemary flatbread at the bar, which was really well made, flavorful, and just the perfect amount. It was only $6. Pretty cheap for such a nice bar. The crowd here is a bit older, most people come here after work for happy hour, but I found everyone attractive and respectful. Even though it was really crowded for a Wednesday night, it wasn't unbearable. Definitely my new favorite bar and will be frequenting here more.", "Date": "2013-11-14", "Author_Location": "Manhattan, NY"}, {"Author": "Jacob C.", "ReviewID": "uYqcVXe9FEJetwpe68W2bQ", "Overall": "5.0", "Content": "Went for drinks and snacks. Everything from interior to drinks were superb. Got great recomendations from the staff.Highly recomended!", "Date": "2013-02-23", "Author_Location": "Stockholm, Sweden"}, {"Author": "Jack H.", "ReviewID": "a_bJXsVSxdlM3jugNX6U9g", "Overall": "4.0", "Content": "This library bar turned out to be a cool place to take my lovely bride for cocktails and appetizers.  We ate radishes and crudite.  To drink, we had a Bijou and a Petticoat.  Then I ordered a nice glass of Chandon de Brialles, Savigny-Les-Beaune, Burgundy (a mere $23).  The library is impressive and somehow adds to the relaxing atmosphere.  Highly recommended.", "Date": "2013-06-25", "Author_Location": "Atlanta, GA"}, {"Author": "Meghan A.", "ReviewID": "5KI5i0RZrckTml7OEoZg4g", "Overall": "4.0", "Content": "Soooo sooo fun. We were feeling swanky, so we stopped by for an aperitif. The decor is formal, but modern, and we were able to sneak our way on to a common table in the middle of the crowded bar. You have to be quick though when people get up; this place is popular. We dumped our coats, scarfs, bags, etc.. on the lower level of the table, then ordered French 75's. The bill was around $20/pp grand total for one drink + tax/tip. But they were delicious, and well made, so we didn't mind paying the premium. Cheers.", "Date": "2013-02-10", "Author_Location": "New York, NY"}, {"Author": "B S.", "ReviewID": "S87RBenZMFgsaA6pACLyCg", "Overall": "4.0", "Content": "crowded, delicious and unique hand-crafted non-vodka cocktails at 15 dollars a pop (typical for New York).  despite the sheer density of patrons, still decent service (waitresses will come ask you for your order and check in on your instead of fighting for your turn at the bar), civilized, and gorgeously hip ambience.  reminds of a high class prohibition lounge. somewhat loud, but you can still hear your friends.", "Date": "2013-12-05", "Author_Location": "Walnut Creek, CA"}, {"Author": "Sydney K.", "ReviewID": "X4GhZEF-TsWyNkbGWTGxCA", "Overall": "3.0", "Content": "The cocktails here are actually pretty good, and at $15 a pop, not as bad as some other fancy cocktail bars, so I was pleasantly surprised. My issue, though, is with the bartenders. They seem to believe that they are very important people - look, we all think we're all the smartest person in the room, that's fine. But when I ask for a bourbon similar to one you don't have, and your response, as a fancy mixologist or whatever you want to call yourself, is \"I like a lot of different bourbon.\" with a look on your face that says \"Go. Away.\"...I just don't know. What gives? I like a lot of bourbon, too, but I can at least recommend one or two that are a bit different from the usual few that most bars have. Anyway, I'd probably take my parents here because they would get a kick out of it but I don't think I'll find myself back with friends any time soon.", "Date": "2013-02-26", "Author_Location": "Brooklyn, NY"}, {"Author": "Vespa R.", "ReviewID": "mTLG9xmjhMvl6kJjWdFnMw", "Overall": "3.0", "Content": "We had to come here twice (and early on a weekday) to actually get in. Drinks were tasty and service was good, also love the ambiance, but you definitely pay for it! Was nice to try, but not sure I'd be back (unless I could expense it!). Left feeling hungry (our appetizers did nothing to help that).", "Date": "2013-03-22", "Author_Location": "Stockholm, Sweden"}, {"Author": "Brave G.", "ReviewID": "WjlXSzUQeLpHNGsl950Pgg", "Overall": "5.0", "Content": "well this is nice. the new NoMad Hotel has a veritabler amusement park of ground floor lounges, bars, restaurants, hangout areas and \"The Library.\" you enter the hotel's main entrance on Broadway, pass through a vestibule area, walk past the smiling maitre d's, wind your way through and around the dining tables in the restaurant (sorry, eaters, oh, excuse me...), continue out the back, turn left, pass the bar, and on into the library. everyone out, last stop. there is no back door to the library. it's a high-ceilinged square dark paneled room with small tables, couches, armchairs and coffee tables. very olde-fashioned mens club in feel but without the british fat redfaced cigar-smokering hamfisted men with canes and bowlers, or those silver-haired lexicons of privilege. you are the privileged one today. the walls are lined floor to ceiling with real books made from paper and cloth which can actually be removed and read. a second floor wooden balcony railing of sorts encircles the room. anachronistic to a degree, yet modern in design. and obviously riding a newer form of nostalgia, fine by us, the place is a trip and a half. in every doorway stood a vibed up human (or two) to greet, welcome, smile, and direct us...into the next room. wouldn't want to get lost. hospitality with a capital H, i'm down. drinks are pricey although not precedent-setting. $15 cocktails, long list of substances, with creativity on full display, designed to make you feel you have to try them just to see what they do. there is a \"classic\" called \"morning glory fizz\" which contains no morning glories (its seeds can induce an LSD type of experience - yes i can attest to that), but that is the only nonsequitor i will offer in this review. this is a light scotch/absinthe/lemon concoction topped with about half a glass of wisked egg white foam, a lot like an egg cream. drinking this blended ingredient clash through the pretty stiff froth is something to put on a bucket list.  that's just one of a seemingly endless list of choicesif you don't drink, and decide to pass on the sugar flavors (a from-the-ground-up orange julius with real cream, oj, and orange blossom water?), there are excellent: pots of tea, which is brewed very strong -- lavender mint was our choice, and it was rich and sultry, which is rare. they are fine teas, and the selection is well varied, even japan is represented. food is also available in the library, we focused on the small plates. this first time out, the radish plate seemed the most exotic. these are red radishes dipped in tempered butter and chilled so they look at first like white radishes, or little radish balls covered in frosting. but it's just the cold butter coating. you dip them in a little pile of fleur de sel and there you go. they are quite amazing. you get six, and they are so rich you'll never eat them all. even sharing, you're doing well if you have more than two. the sequence of flavors is startling - this is a must have. the overall theme of the library, and the hotel, seems to be modern french.there is a fairly exotic assortment of types, so people-watching is well rewarded. japanese ladies, dark rock n rollers, trendies, tourists showing off their 10\" heels and big luxury brands, me in a t-shirt and coiffed mask... and yet the whole thing is low-key and relatively quiet. the music piped in was not astrid gilberto but could have been her granddaughter, that sort of thing. it's a good place to get into someone you like. you might actually find out if you like them. this is a wonderful place, day or night, your mouth will thank you for the flavors, and with the good rare food and exotic buzz, you can't go wrong. but what about all those books? there is no point in bothering to read them. you'll feel so good extroverting you'll never want to restrict yourself to the introspective interior book thing.", "Date": "2012-07-16", "Author_Location": "New York, NY"}, {"Author": "Bo J.", "ReviewID": "yYcRG-8ZGDRfoxPG7G5JWQ", "Overall": "4.0", "Content": "Came here with a few peeps. The bar gets pretty crowded, and it's probably not that worth it if you're unable to get a seat. The library on the other hand, is fantastic and has a nice, classy speakeasy vibe to it. The drinks are mostly pretty standard tasting, and a bit on the pricey end -- but hey you're paying for the ambiance. My friends got some pretty weird tasting drinks (one tasted like smoke...), but I got lucky and loved mine (Mott & Mulberry). Would definitely recommend checking out the Library and getting the Mott & Mulberry at least once.", "Date": "2013-04-24", "Author_Location": "Manhattan, NY"}, {"Author": "Ash C.", "ReviewID": "xP1av5IKWIs0KiO9QyQTWA", "Overall": "5.0", "Content": "mmmmmmmm...mmmm.mmmmm This is one tall drink of deliciousness.  If I could dream up my ideal space - a cozy nook of a space that is multifunctional for drinks, coffee, or pretty much any kind of rendezvous, this is it.  Everything here is just perfect, from the lighting to the design and everything in between.  My only question is, why doesn't NY have more spaces like this one?!  Amazing.", "Date": "2013-02-05", "Author_Location": "New York, NY"}, {"Author": "Natasha V.", "ReviewID": "6dKcc38Vk20EwfDra4fHxw", "Overall": "5.0", "Content": "Knowledgeable staff that know what try are doing and are very humble about it! Logan, Charles and Will are all great!", "Date": "2013-03-07", "Author_Location": "Carolina, Puerto Rico"}, {"Author": "Dorothy G.", "ReviewID": "DEOMuiv9XV1tV01cNi3aqw", "Overall": "3.0", "Content": "I have a love hate relationship with this place.  I love the atmosphere and the food ... and even the people ... but HATE the stuck up staff.  I have been coming to The NoMad Library and Restaurant and Bar since the second day they were open.  I raved to friends and co workers about how AWESOME this place was..Both my office and apt are very close by and  they do serve a yummy cocktail (Paris Is Burning).I popped in for a cocktail the other night and after being told that there was no room in the library (i see the MULTIPLE empty tables) had to wait 20 minutes before I finally got the attention of the bartender.  They are serving food at the bar now and seem to have NO interest in serving drinks.  The only reason I got her attention was because the VERY nice couple sitting at the bar had asked her to pay attention.  I guess it was bound to happen.  The once friendly and accommodating waitstaff...Now stuck up and rude.", "Date": "2012-10-23", "Author_Location": "Manhattan, NY"}, {"Author": "Jim D.", "ReviewID": "2ofGpQvqNbyh4oxSc_bA7w", "Overall": "4.0", "Content": "My first experience at NoMad was for drinks on a Saturday night, and that was a disappointment (details in an earlier review). However, I came back for a business lunch with a client and her agent, and while it was expensive (well, for my taste), it was worth it. The meals were on the small side, but I understood that going in, being a true \"fine dining\" experience, but the service and quality of the food were very impressive. I'd go back here for a meal fit to impress someone any time. As far as the nightlife aspect? Pass.", "Date": "2013-05-19", "Author_Location": "ASTORIA, NY"}, {"Author": "Livia C.", "ReviewID": "LL44kqeNNRwPB2I-FgtVXg", "Overall": "4.0", "Content": "First off, I would give this place a 5 star rating for the quality of cocktail & food. I reduced it to 4 because the service I got that evening wasn't stellar. Walked straight to the bar but there was a blockade of people sitting so really, no access. Server greeted us but didn't take an order... we waited aimlessly for 8 minutes... had to approach a random cocktail waitress to get seated. Minus that little hiccup, I highly recommend this place.", "Date": "2012-11-30", "Author_Location": "New York, NY"}, {"Author": "Jenn F.", "ReviewID": "qcV8Q9spWxChQftIa9yFEg", "Overall": "4.0", "Content": "The drinks are are artistic and delicious. The place is gorgeous, though in the main bar you essentially have to stand shoulder to shoulder with nowhere to rest your pretty little drink... but the people you're bumping into are a pretty charming if not a bit stuffy of a bunch so it is hard to complain. There's even a lovely menu of bar snacks (if you can give that name to artisan cheese plates and the fanciest crudites you ever did see). This is the kind of place that serves its own purpose - have a fancy drink with fancy people - and does it quite well!", "Date": "2013-01-07", "Author_Location": "Manhattan, NY"}, {"Author": "Pamj M.", "ReviewID": "vplOeiFQo1fvXMEnxq2sMQ", "Overall": "5.0", "Content": "Got seats at bar on a Saturday night with ease. Bartenders very professional.", "Date": "2013-01-14", "Author_Location": "Naples, FL"}, {"Author": "Dina S.", "ReviewID": "zia8eqcitTSSGfvv9HON0A", "Overall": "1.0", "Content": "Horrible management.  We arrived as part of a corporate event dressed elegantly in black tie attire.  We were told they were filled to capacity (although it was Wednesday night and the place was empty).  There are certain situations in which you are supposed to make an \"exception\" to the rules but the manager would not hear of it.  You do not reject people trying to meet the rest of their party while dressed exceptionally well.", "Date": "2013-05-05", "Author_Location": "Manhattan, NY"}, {"Author": "Kris W.", "ReviewID": "OpyNvjyM8b6NJenvkmv-BA", "Overall": "1.0", "Content": "nomad hotel male bartenders (not the library bar waitresses) , 1 guy in particular , are the most arrogant, stuck up bartenders ive come across nyc. excessive attitude. (seem like a crop of frustrated 30+yr  hipsters)", "Date": "2013-05-04", "Author_Location": "New York, NY"}, {"Author": "Arnav G.", "ReviewID": "jZDfgb2upU2U7rDDjxz23Q", "Overall": "3.0", "Content": "Food done to perfection (scallops soft as butter, seabass that fans apart with the tap of a fork), an ambiance lifted from the times of the East India Trading Company and Amélie's Paris, but a menu so cautious that it yields the meal unmemorable. Sommelier, at least on the Wednesday evening I stopped by, was A+.", "Date": "2012-12-24", "Author_Location": "Manhattan, NY"}, {"Author": "Angie W.", "ReviewID": "iTOJEsOA_wM3wpAqPFZ5ug", "Overall": "5.0", "Content": "So amazingly comfortable.  I arrived at the bar with a friend after work on a Friday.  The bar was pretty crowded so we asked for a seat in the library.  Dim, with brilliantly selected sofas and chairs that just invite patrons to settle in and really enjoy our drinks.  The drinks were really great - I got Start Me Up (strong, clean tasting) and Fourth...something...also very delicious.  To munch on we got the fried chicken - which was tremendously filling and very good - and the cheese plate and the salmon paste.  The salmon paste is very fishy, which was unexpected, but still, very good.  Because our food took slightly longer than usual, our server brought us a complimentary plate of the radishes.  The dish is literally 6 or 7 raw radishes with a little pile of salt.  How funny.", "Date": "2012-12-01", "Author_Location": "New York, NY"}], "RestaurantInfo": {"RestaurantID": "5Q4wp-rX4m5CxDjKZd7xMA", "Name": "The NoMad Library", "Price": "$$$", "RestaurantURL": "/biz/the-nomad-library-new-york", "Longitude": " -73.98906499999999", "Address": "1170 Broadway & 28th StNew York, NY 10001", "Latitude": " 40.745696000000002", "ImgURL": "//s3-media3.fl.yelpcdn.com/bphoto/O8hI8xW1e958doOdPR3fWg/90s.jpg"}}