{"Reviews": [{"Author": "Alan D.", "ReviewID": "xlwUjNnYh_vygWod0mInew", "Overall": "3.0", "Content": "I MEAN... yeah it's OKAY.But goddamn it's pretty expensive for something so... mediocre. It just doesn't seem worth the money you know? Because okay, I ordered a chicken sandwich, and I expected something a bit more, but not only did it come out like.... 15 minutes later, it came out really plain and boring.But let's not dwell on that negative. I want to focus on the positives. The alcohol, their specials on alcohol, and the fact that somehow, someway they make it taste so much better.Overall though, I honestly thought this would be an amazing place to eat when I was still in college because it was near THE SCENE... and it just looked like the typical college burger joint that everyone goes to.Unfortunately, I was left disappointed, but not let down. I got what I expected (at the last minute) and it was just MEH.", "Date": "2014-05-10", "Author_Location": "San Jose, CA"}, {"Author": "Samantha M.", "ReviewID": "AJ7wx6Oi6lzx6hfW1pjUTQ", "Overall": "2.0", "Content": "Came here for breakfast. I don't know how to say it in a nice way but the place smelled like a bathroom like they used the same mop water to mop the toilets and then the dining area. I know, I still ate there though. We sat at a booth. Note the seats were ripped. I do, however, like the diner decor and think this place has major potential since it is in a popular and up and coming area of downtown SJ. You order at the counter and they bring it to your table. I ordered the \"Belgian Waffle\" combo which came with a choice of bacon or sausage. I chose bacon. Got my order and was extremely disappointed because this was NOT a fresh waffle-it was a frozen waffle (like eggo). It was a large belgian waffle cut in quarters. It was cold and some of the pieces were burnt AND cold. I thought I could over look it with a little butter and syrup but It was so hard I couldn't even finish two slices. Bacon was thin and a little chewy.  My total for breakfast was about $10 for Belgian waffle, bacon, and water :(This place could be amazing.", "Date": "2014-07-14", "Author_Location": "Palo Alto, CA"}, {"Author": "Brittany L.", "ReviewID": "D7VwNao9qy9DOMduDzd56w", "Overall": "1.0", "Content": "How are there not 0 stars?- dirty - horrible food ~worst service in San Jose. San Pedro - shut these jerks down! How is this place still open and these people have jobs? Stay AWAY ...", "Date": "2014-07-05", "Author_Location": "San Jose, CA"}, {"Author": "Kaleena S.", "ReviewID": "FAbaYWJs3I-9UkP0e2xQeA", "Overall": "2.0", "Content": "The place was empty but my boyfriend and I decided we wanted a cheap burger (compared to others in the area). Now I know why it was empty. Worst hamburger I've ever had. I got a veggie burger which tasted like a frozen turned burnt patty, dry bun and no flavor whatsoever. The curly fries were good but expensive and fries cost extra. The beer was an okay deal. That's what the two stars are for.Overall, it's way overpriced for such a shitty burger. Mayo in a packet and pickles in a plastic container is just so lazy. Go somewhere else.", "Date": "2014-06-30", "Author_Location": "Fresno, CA"}, {"Author": "Paulina D.", "ReviewID": "-hLMt2jkSfS9P-x1LRs5Zw", "Overall": "1.0", "Content": "Crap diner with overpriced crap food and godawful service. You're better off going inside San Pedro Square Market for overpriced food truck-style noms. At least those stands will treat you like a human being. And the ambiance is much nicer.", "Date": "2014-06-29", "Author_Location": "Cupertino, CA"}, {"Author": "Daniel L.", "ReviewID": "Ff_MmztEJBRv7aoIVSqmAg", "Overall": "1.0", "Content": "So I found out why no one is ever in here. The food is horrible and the service is worse. They messed up my order twice and got defensive/rude when we just asked for a refund on the burger since we didn't want to wait another 20 minutes. Just avoid", "Date": "2014-07-04", "Author_Location": "San Jose, CA"}, {"Author": "Kait P.", "ReviewID": "j7GsZwfM-c8FujD1MY2k7A", "Overall": "2.0", "Content": "This place was a total bust! My boyfriend and I decided to come here because we've had been to this restaurant chain before and it's yummy. However, this place in general, was awful. My boyfriend tried to get water from the soda machine but it wasn't water that came out. It was like a sour sprite gone bad. Then, we waited for our food. Both of the meals were supposed to come with fries but nobody brought them to us. We didn't even try asking the employees for some because of how bad our food tasted. I had the french dip which was basically meat put between two buns. There was no flavor and half of my bun was missing. The sauce was bad and even my iced tea had an awful flavor. It was overpriced and not worth the trip. Atmosphere gets an A+; food gets an F.", "Date": "2014-07-05", "Author_Location": "San Jose, CA"}, {"Author": "Hunny J.", "ReviewID": "GWtJk4c4UBHbnmPhaBwogw", "Overall": "1.0", "Content": "This place blows. Frozen patties. Frozen everything. At least there's alcohol. I don't think I've ever had a shittier burger w a cold bun. Wayyyyy overpriced fries. I'd rather eat at mc Donald's. Two bites and I felt like I was chewing on cardboard.  If there were a zero star option, they wouldn't even deserve that. Really 40 bucks for two shitty burgers, cheap fries and Stella. Never again!", "Date": "2014-06-21", "Author_Location": "Rodeo, CA"}, {"Author": "Tom B.", "ReviewID": "P56KAxG9m931VnpcbWPVFg", "Overall": "1.0", "Content": "Very rude customer service. I ordered chili cheese fries and when I asked to split in half because they did not offer anything smaller, she rolled over her eyes. Also I ordered it to go. I waited at outside tables for my order which quite took long just for fries (like 20 minutes) and when she finally brought containers, she did not put them in a bag though it was order to go. When I asked about it, she rolled over her eyes again and told me to get it inside because they're too busy. The waitress seemed to be  a young immature HS/college age spoiled brat. The food was mediocre in quality and relatively overpriced at $6.50. Soggy and wet. It was not spicy at all but bland just with beans and melted cheese. Definitely not worth it.", "Date": "2014-06-30", "Author_Location": "San Jose, CA"}, {"Author": "Greg O.", "ReviewID": "NZFrKK-LUu_jhngkZe2fNw", "Overall": "3.0", "Content": "Decent burger with decent fries. Open to midnight and a short walk from the Hilton. All my love all my kisses.", "Date": "2014-06-18", "Author_Location": "Bothell, WA"}, {"Author": "Jay E.", "ReviewID": "-Mdxa89gIJugGVGaGKrYBg", "Overall": "1.0", "Content": "My buddy ordered a pitcher of beer & we didn't get it till 15-20min later!!! By far the longest wait to get beer & it taste it like crap!! Very bad service. This happen on USA vs Ghana World Cup match.", "Date": "2014-06-18", "Author_Location": "Gilroy, CA"}, {"Author": "Brittany D.", "ReviewID": "DLLETK1lK4BwzdSbGgMJbA", "Overall": "2.0", "Content": "Typical american dinner with James Dean, Elvis, Frank Sinatra, Marilyn Manroe on the walls. I just fell in love with the decor! I mean who wouldnt right?? Theres plenty of seating here, altough the times I've came hardly anyone here. The menu has tons of items you can choose from, I must say they serve breakfast, lunch/dinner.For just a regular chicken sandwich, 7.99 plus tax!! Not including any fries nor drink. Regular fries are over 2 bucks and the fountain drinks are 2.39..thats just crazy! so in total I spend over 15 bucks plus tip....=/I'm sorry but for some regular diner food, it should not be that much.", "Date": "2014-01-29", "Author_Location": "Sunnyvale, CA"}, {"Author": "Tiana M.", "ReviewID": "TxR8hZ8K3OdS-3ZRNhbqSA", "Overall": "4.0", "Content": "We went here during Fanimecon and it was delicious. They have great food and a really big menu selection. The service was average and the restaurant was pretty crowded. The prices are also pretty average.", "Date": "2014-05-24", "Author_Location": "Reno, NV"}, {"Author": "Allison F.", "ReviewID": "vnlvDty7DgseBdZ0EcA_mw", "Overall": "1.0", "Content": "Not sure if the ownership has changed here but the quality of the food has gone down dramatically while the prices have gone up quite substantially.I would always order a preset combination lunch that was generally good for a steak sandwhich and the prices for the meal was $8.99.  The prices is now $12.99 but the quality of the meat has gone down, less toppings offered, and the overall flavor has changed beacuse of the quality of the ingredients.I am telling myself to never go back.", "Date": "2013-12-13", "Author_Location": "Cupertino, CA"}, {"Author": "Elizabeth C.", "ReviewID": "G6J7nvc8tqyqiAHi2pRbjA", "Overall": "3.0", "Content": "Peggy sues is... fine.  Their fries are great if not a little expensive... especially when you get into the \"fancy ones.\" How steak fries became fancy I'll never know. They have what I like to call \"correct\" ranch which makes me incredibly happy. And everything else is basic diner fare...plus a bar.  (Their shark tank is sugary. Their car bombs are large. And their coronas are cheap.) I'm not sure I believe it when they say \"World's Best Milkshake\" but some vanilla ice cream and espresso goes a long way. Unfortunately the food takes WAY too long. I've been here enough times to know this wasn't a one time thing. 20 minutes for fries? An extra 10 when they gave me the wrong soup. Too much...", "Date": "2014-01-02", "Author_Location": "Union City, CA"}, {"Author": "Julia C.", "ReviewID": "tRdH8i1JFOnE0v1quw3k9A", "Overall": "2.0", "Content": "Yes the shark tank is huge, but its size is its only redeeming factor. A huge percentage is syrup. Basically sugar with a light drizzle of alcohol and some lime to garnish. This place is fun to hang out at, prior to a sharks game. Especially with a great people watching view that comes with out door seating. Just don't come here if you're actually hungry. The chicken and fries are like soggy cardboard with out seasoning.", "Date": "2013-10-21", "Author_Location": "San Jose, CA"}, {"Author": "Dan D.", "ReviewID": "0JVZGfow1K0bWzuI3SZZFw", "Overall": "2.0", "Content": "Wow, very disappointing. Peggy Sue's has been my pregame (San Jose Sharks) spot for over a decade, but the sentimental value is starting to wear thin.My dad and I stopped by for lunch before the Sharks game today. A few things that we noticed...1. Price has increased significantly (now $8.99 for a Chubby Checker WITHOUT fries or a drink)2. Both burgers were WAY overcooked 3 .Chili = canned Dennison 4. Isn't the cheese on the \"cheese fries\" supposed to be melted?I wish management would actually READ these reviews. Please stop cutting corners and give us back the old Peggy Sue's!", "Date": "2013-11-29", "Author_Location": "Santa Ana, CA"}, {"Author": "Brett R.", "ReviewID": "qKn-7nwnh4XVty0EHT65yQ", "Overall": "1.0", "Content": "If you're into a crowded joint with average food, broken toilets, $7 burgers that don't include fries, your wife getting the shits after and you waking up with a stomach ache, totally come here. you'll love it.", "Date": "2013-12-16", "Author_Location": "Victorville, CA"}, {"Author": "Madisyn P.", "ReviewID": "NhDVnqXzCQyFsNJjdwRr9w", "Overall": "1.0", "Content": "I ordered the mango milkshake and my fiancé had the root beer float. The ice cream was definitely subpar and overpriced. The mango milkshake tasted not like the fruit at all, very fake. We will not go here again.", "Date": "2014-03-09", "Author_Location": "San Jose, CA"}, {"Author": "Jennifer T.", "ReviewID": "-NAP1PPqibuH_mU47LLwLw", "Overall": "1.0", "Content": "Why does yelp not have a 0 star option?DO NOT EAT HERE!!! My 2 coworkers really wanted a burger and nothing opened until 11:30AM, so we went to Peggy Sue's. I wish I checked into the place on my Yelp app BEFORE ordering and not after.The burger looked like something that came out of the microwave. The patty was the thinnest patty I had every seen and it tasted like a mixture of hot dog and some unknown meat - definitely not beef.The food here is so gross I don't even know how it's still open to this day. So gross, so gross, so gross.....ugh....i shudder just thinking about how I even managed to eat some of the burger.....", "Date": "2013-08-09", "Author_Location": "San Jose, CA"}, {"Author": "Carlos L.", "ReviewID": "an4rxmIe2iP1q6avN-f6Pw", "Overall": "4.0", "Content": "My favorite drink is Shark Tank. Great drink overall and good value for $12. Will come back for one to pre-game for sharks game at the tank. Swerve was great for a drink , didn't get food but those burgers did look tasty.", "Date": "2014-03-17", "Author_Location": "San Jose, CA"}, {"Author": "c t.", "ReviewID": "UmuwU0S46-l3SA8fDqbAMQ", "Overall": "2.0", "Content": "1. Bad lighting.If you like to eat in your cubicle, you might like eating here.2. Outdated, tacky atmosphere.If you like eating in a gift shop on Pier 39, you might like eating here.Those are my two biggest complaints about this restaurant. You can tell that the people that run it are trying, but trying in the wrong/cheap direction. San Pedro Square is growing more sophisticated, so why not renovate and make this place the best burger place on the square? It settles for 'good enough.' I still get take-out here periodically so that I can eat it at bars nearby that don't serve food.  But dine-in? No way.", "Date": "2013-09-23", "Author_Location": "San Jose, CA"}, {"Author": "Braden K.", "ReviewID": "c1JrwHKKjxg_dvkwjJCl-g", "Overall": "2.0", "Content": "surprised I haven't stopped by this spot earlier..after hitting up blush and san pedro square on weekend nights, we usually stumble over to temple. this particular night one of my buddies found it appropriate to check out the GOLD CLUB on the way so I figured i'd need a snack to get myself ready for the itty bitty yitties club, 'know what I mean?!I ordered a hamburger, it was a bit pricey and the meat was overcooked. It was slightly too tough and even a little burnt.correct me if i'm wrong but a hamburger shouldn't have cheese, so it should have a bit more mayonnaise to compensate and keep the burger moist?the burger was SUPER DRY like that japanese jacket store at valley fair.", "Date": "2014-01-14", "Author_Location": "Honolulu, HI"}, {"Author": "Patrick L.", "ReviewID": "Hcp2fIT7K-EJ_dbk0t6RTA", "Overall": "2.0", "Content": "I took one of my employees to a Sharks game last night and asked him to choose the dinner spot - Peggy Sue's got the nod.  Geez kid, could you have picked a crappier place? The burgers were blah, fries tasteless and beers not cold.  Unimpressive performance, Peggy Sue.  Maybe Peggy Sue got married and left the restaurant to her unskilled sister to run...?  2 stars.", "Date": "2014-01-28", "Author_Location": "San Ramon, CA"}, {"Author": "Mike P.", "ReviewID": "qYGb5ac9hJULqwX1fKnWwQ", "Overall": "2.0", "Content": "This place is the definition of \"subpar.\"Well, they have nice TV's.  And the bar is pretty large.  But that's the only thing that's good about this place.When I ordered the Hot Rod, a burger with pepper jack and bacon, the cashier didn't know what I was talking about until I pointed it out. Hello?  Please learn your own menu.  I also got the garlic fries.  Service was fairly quick, but it didn't really matter.  The burger came with two thin slices of bacon (not even folded over to, you know, fit on the patty), a mess of plain jack cheese (thankfully melted), one tomato, a patty that was in no way 1/3lbs, and half a piece of lettuce.  Seriously?  WHO SKIMPS ON LETTUCE?  AND WHERE'S MY ONION?  The fries also strangely enough arrived on a second plate, but which also devoid of any garlic whatsoever.   It smelled like garlic, but when eaten they were just undercooked, soggy, and lacking garlic flavor.  That, for 4.95?  When the burger was 6.50?  Uh, pass.To top it all off, there is another Peggy Sue's on Park Avenue and the food in their pictures look SO SO much better (they give you an onion, at least, and fries are in a basket).  Whereas after eating here, I have to say I feel robbed.1.5 Stars.", "Date": "2013-07-25", "Author_Location": "San Jose, CA"}, {"Author": "Emily G.", "ReviewID": "9aY5gqGrjv0-m1aNCB4pog", "Overall": "4.0", "Content": "The food reminds me of food from my local mom and pop diner from back home. It's good but nothing too special, especially for the prices. The cashier was very friendly and gave us great recommendations on our drinks. The Shark Tank 32oz margarita is delicious!", "Date": "2014-01-26", "Author_Location": "Valencia, CA"}, {"Author": "Julie K.", "ReviewID": "WQywPhbfC49USy1ZS5I4uw", "Overall": "1.0", "Content": "Save your money and health don't eat here.  Ghost town when we walked in...that should have been a clue.   We ordered two burgers with fries and onion rings. The meat was not of beef, i think maybe it was rat meat.  Holy shat, how can they serve this as real beef?  We both took one bite and sent it back.  The guy (75 years old) told us nobody has ever complained before, but reluctantly refunded our money then would not validate our parking because we only paid for the onion rings and soda ($7), and he told us we had to spend at least $10.   I remember Peggy Sues when they used to serve Beef on the their buns....rip peggy sue.", "Date": "2013-08-01", "Author_Location": "San Jose, CA"}, {"Author": "Clarissa Y.", "ReviewID": "-Bm-7S2D58oa13hOEfDGCg", "Overall": "2.0", "Content": "I came here on the best day of my life, but Peggy Sue's did very little to help the fact.Why was it the best day of my life then?THE MRS. CARTER WORLD TOUR!!!My boyfriend and I were wandering around near the HP Pavilion hoping to find a decent place to find some food before heading over to the Beyonce concert and ended up at Peggy Sue's. Unfortunately, my phone no longer had any data and was unable to access Yelp otherwise I would've skipped the trip.Atmosphere:A tad bit tacky and overly \"American\", but it had its own strange charm to it. They have 2 large flatscreen TVs as well as I believe one other smaller one near the bar. Customer Service:The Indian woman was unenthusiastic, but we were also served by a chubby man who looked maybe Mexican or Filipino - he was very nice and a bit overly enthusiastic when my boyfriend ordered a pint of Guinness. \"Yeahhh! Guinness!! My man!\" Lmfao okay buddyy...Food:Here's the downer. I ordered Buffalo Wings and they were god awful. I am 95% certain that the buffalo sauce was nothing but tabasco sauce. It was overly spicy (neither my boyfriend or myself could handle it, and I'm normally pretty good with spice) and like I said, didn't taste like buffalo sauce. It just tasted like chicken in tabasco. Old, frozen chicken at that.Very disappointing considering it was the best day of my life and the meal I had was chicken I couldn't finish. The food was 1 star, but it was brought up by the friendly service and it was a decent place to hang out and kill a bit of time before the show.", "Date": "2013-07-07", "Author_Location": "Union City, CA"}, {"Author": "Winnie G.", "ReviewID": "trVX1C9EqwX1nmZWxg7sgA", "Overall": "4.0", "Content": "Meh. I mean the reviews are true, but I had a blast here. Being just about the only customer alongside with my roommate for one of our nights about town. We headed to Peggy Sues mainly for their Shark Tanks! But decided we might as well grab something to eat and kill some time. I wasn't expecting their food to be anything close to delicious, but I was pleasantly surprised. The bar tender/waiter/cashier/guy was so cool. He talked to us the entire time, made our drinks with an extra spike and he really was a great guy even when it was so dead on the inside. We opted for a bacon cheese burger with added avocado for all about 8 dollars total and two Shark Tanks (10). The Shark Tanks are basically 32oz of margarita that has 3 shots of either tequila or vodka, 2 shots of triple sec, lime juice and premium blue curacao syrup and their very special sweet and sour mix with salted rim and a lime wedge. It was the most legit drink of my life and it hit me really good. It's the best thing at Peggy Sue's. It's one of those things that you can only get here, in SJ, at PS, so you have to try it out. The burger was actually really juicy, though small in portion and not enough, but it was all the elements of a simple burger that was cooked right. We got bored so we ordered some garlic fries- which weren't garlic enough but the fries were done really well. Crispy, so we choked down most of it with adding ketchup. They actually offer seven different kinds of fries, so your options are endless. Walking into Peggy Sue's it's literally one of those been here since before time from the fifties diner that has all the posters, and the pictures and drawings and everything to give it that homey feel. Glad they're here. Take credit, valdate parking over 10$ purchase and indoor and outdoor seating AND their tv's have cable for all the sports going on. Go here if you trying to find a quiet place to drink and watch sports!", "Date": "2013-04-16", "Author_Location": "San Jose, CA"}, {"Author": "Aureliano C.", "ReviewID": "G5WyoyBahC_8c90BrNIX-g", "Overall": "2.0", "Content": "Don't be fooled by the flat screens, early Hollywood era memorabilia, and the $12 Sharkbowl margaritas. Only 2 beers on tap. Ordered the double cheeseburger called The Chubby Checker and apparently didn't notice that after 2pm there are no combos available. It's all a la carte. I still ordered the combo fries and VANILLA shake that my son asked me for.The kid who took my order brought us a CHOC shake after I confirmed my order w him because he failed to repeat my order to me before ringing me up. He was too preoccupied w a group of girls sitting at the bar. Chubby Checker would be pissed to be named after such a shitty burger!  It was super tough and of a poor quality meat. Flavorless & over cooked. Was like a cardboard & cheese sandwich. Sorry guys. But bein as I am spoiled by better burgers up north I gotta give it 2 thumbs down. And that is very hard to make me give a place that score. I'm usually lenient.", "Date": "2013-05-16", "Author_Location": "Redwood City, CA"}, {"Author": "Leslye S.", "ReviewID": "mE10Byb7M4ejPRFNAjHcEQ", "Overall": "3.0", "Content": "Peggy Sue's food is simply okay.  Nothing special but not terrible.  Came here on a Sat. Afternoon and the restaurant was disgustingly dirty.  Came with a co-worker from New York and she even said it was dirtier than any place in NYC she had ever been to.  Only reason I would come back is free validation with any purchase on weekends.  I think this alone is what is keeping this place busy.", "Date": "2014-01-15", "Author_Location": "San Jose, CA"}, {"Author": "Ben H.", "ReviewID": "vqCgXgIrkESuyEhLXOJdtw", "Overall": "4.0", "Content": "I'm always happy here drinking and eating with friends or by myself. You can't the prices on beer and food anywhere else on the street or in downtown for that matter. Unlike the other bars in the area you can rest assured no riffraff will be present here, this place flies under the radar due to the look of a diner but it's a great drinking spot that's open late everyday.", "Date": "2014-05-12", "Author_Location": "San Jose, CA"}, {"Author": "Fernando V.", "ReviewID": "6qzNgg8kqcHPjbjNpPSsIA", "Overall": "2.0", "Content": "Topical American dinner, with their food overly priced with no flavor and terrible service.The only good thing is their coffee. I probably wouldn't go there again.", "Date": "2014-03-02", "Author_Location": "Miami, FL"}, {"Author": "Bill M.", "ReviewID": "2CpHMUmdyDt2OZqK7ASGXQ", "Overall": "1.0", "Content": "Hadn't been in a long time and I forgot how bad it was.  We were in the neighborhood and just dropped in for an early dinner.  I'm not sure anything we ordered was up to McDonald's quality.  The chicken in the chicken sandwiches was tired and fatty.  All of our buns were super dry.  The kids' chicken nuggets tasted like some non-chicken product.  I can't wait for my next meal to get the taste out.If the bad quality isn't convincing enough, the prices are ridiculous.  One of our kids wanted a hot dog and they didn't have a kids' meal with a hot dog, so we paid $7 for a hot dog, $5 for a side of fries and $3.50 for a milk.  I hope I don't make this mistake again for a very long time.", "Date": "2013-10-12", "Author_Location": "San Jose, CA"}, {"Author": "Khanh T.", "ReviewID": "Tf26VGxHjzghMiSjaPTeoA", "Overall": "2.0", "Content": "I always stumble into this place in the wee hours of the night.Would I ever eat here sober? Absolutely not! Small portions, food is OK at best, and way way overpriced.Btw, I've had the most disappointing fish and chips of my life here. :(", "Date": "2013-03-19", "Author_Location": "San Jose, CA"}, {"Author": "Sherry M.", "ReviewID": "TrUw-LOcTwKyw7QGuwgl7g", "Overall": "1.0", "Content": "We ate here for the first and last time!  We ordered 2 burgers w/fries, 2 kids grilled cheese plates, 2 apple juices, 1 iced tea and 1 shot of fireball.  All that was $70!!  WTF?!  Now if the quality of the food was better then maybe I wouldn't complain as much but Costco's frozen burger patties are even better!  Not to mention we ordered our food at 6:58pm and got our food at 7:40pm.  It wasn't even that busy!  The server apologized but still!  Not going back there again!  We woulda been happier spending $30 at Popeyes!", "Date": "2013-12-22", "Author_Location": "San Jose, CA"}, {"Author": "Tamika B.", "ReviewID": "n3pLOfk9KZx5KZBA6Wss6w", "Overall": "4.0", "Content": "Thought I'd try something new. Amazing drinks! Huge burgers and loaded chili cheese fries. Shrimp and chips too!", "Date": "2014-02-22", "Author_Location": "San Jose, CA"}, {"Author": "Molly M.", "ReviewID": "IGyPRGmIfk0EnzSrLJXVcw", "Overall": "1.0", "Content": "The only redeeming factor about this place was the milk shakes, and even then, they were sub-par and somewhat expensive compared to that of a simple In-N-Out burger or some other fast food restaurant.I really liked the interior, since I'm a sucker for retro, so I guess that's something if some people like novelty over food . The decorations and furnishings are reminiscent of Red Robin, but the food is waaaaaaaayyyy worse. I ordered a regular bacon cheese burger and some regular, plain fries. Pretty hard to screw up, right?The patty was disgusting. It was bland and tasted overly-processed like a cheap microwaveable patty available at any grocery store for 75% less than what you pay here. The quality of the food does NOT correspond with the price at all, and my friends and I were rather disappointed. We wont be back next time we visit San Jose.", "Date": "2013-09-03", "Author_Location": "Danville, CA"}, {"Author": "Esmeralda M.", "ReviewID": "mqNrG8fDiedeanHKyD-bNw", "Overall": "2.0", "Content": "I've been here a few times before and it was a cool place to go and dine in. I went this thursday and as soon as we got to order our food I asked the cashier guy(owner ) how big their Caesar salad was... he walked away 3x during my order without saying excuse me . I can eat alot he said it was a good size and big enough. My bf ordered a burger and curly fries. The bacon was so thin and gross looking. The fries were the best out of both our meals. My 'good size salad' was big enough for a 4 year old to eat. Ridiculous!! I will give 4 stars to the shark tank drink. Mine was great. I asked for tequila. My bf asked for vodka and his didnt even taste like it had alcohol in it. The guys who work there need to pick up their pants too because they're all sagging. Probably last time I go there", "Date": "2014-02-02", "Author_Location": "San Jose, CA"}, {"Author": "Thomas B.", "ReviewID": "QX3J-qWy_fRi0c9k9H4ZpA", "Overall": "1.0", "Content": "What happened to this place!haven't been here in a long time, but i remembered they had great burgers.Used to be thick , juicy patties. basically all around good burger and delicious fries.To put it bluntly, the burgers are revolting. Thin, dried out patties. The meat looked like mystery meat, probably made from left over parts, (ears and a**holes). Bun was dry, bacon was mummified. I'm kinda mad i spent 7 bucks on it, could made some at home or gone to sliders on san carlos.If you absolutely have to eat here, get a basket of fries and one of they're 32oz beers. Only good thing in the joint!", "Date": "2013-03-05", "Author_Location": "San Jose, CA"}, {"Author": "Jessica C.", "ReviewID": "Jw0p-sD7b7DZrXYW5chefg", "Overall": "5.0", "Content": "Cute little diner open till 2am! Garlic fries and shakes! Right down the street from the Wagon, close by and great for when you get the munchies!", "Date": "2012-12-20", "Author_Location": "San Jose, CA"}, {"Author": "Shawn F.", "ReviewID": "Rj5G1yNaeHCqOlwoZMbHIQ", "Overall": "1.0", "Content": "We visited this place after a San Jose Sharks game. Two burgers and one order of fries. The place was 1/3 full. 40 minutes later we were still waiting for the burgers. The staff had lost the order. It took over 1 hour for the food. The manager did nothing to make the situation right. He looked at his camera system and found out his staff have the burgers to some drunk people at another table. We will NEVER come here again!", "Date": "2014-02-08", "Author_Location": "North Highlands, CA"}, {"Author": "Brian K.", "ReviewID": "_aUpLoNR5uMyvAAnpGxfAg", "Overall": "1.0", "Content": "I went here to have a late dinner with my girlfriend and brother because it was the only place open where we can eat a decent meal. However, we deeply regret going there. If there was a negative star rating I would give it because this place doesn't deserve a star. The quality of the food was bad and overpriced. Don't bother ordering the apple pie because it's a piece of small shit. They charged me 6$ for a piece of small crap which tasted very bland. The garlic fries were horrible because they were soggy and didn't have that much garlic making it bland.   In addition, I paid $5.50 for the fries and they give a little plate of \"sad\" fries. Overall, If there was a 7Eleven near there you should go there instead because they sell better quality food and more reasonable prices.", "Date": "2014-01-23", "Author_Location": "Inner Sunset, San Francisco, CA"}, {"Author": "Katherine C.", "ReviewID": "RepVbGIErpoGJaigdWVmKQ", "Overall": "4.0", "Content": "My friends and I had a late night post-bar hopping meal here. Pretty standard American food. We had their curly fries, onion rings and cheeseburgers. Really good. I love their onion rings. They were incredibly crispy, and the onion doesn't drag out of the breading.Good service, friendly staff. I think it'll be my go-to place for onion rings.", "Date": "2013-03-10", "Author_Location": "San Jose, CA"}, {"Author": "Chuck B.", "ReviewID": "2rFRz31F_mQQnYYOsTALWg", "Overall": "2.0", "Content": "Such a sad place.  This is not the classic burger-and-shake joint that you want it to be.The food is maybe OK, on a good day.The staff is laconic and aloof.The space is dirty, beaten, and cluttered.Take, for instance, the silverware.  They offer  actual metal spoons and forks but only plastic knives (they have a tersely handwritten \"For mayo only!\" under them).There are ragged paper signs taped to the wall, rips in the seat vinyl, throbbing music playing in the afternoon on a weekday (while all of their visitors are just trying to watch Stanford play in the Rose Bowl.)Here's the gist of it: they don't care about you.  They also don't understand that people want this to be a classic burger joint.  Nobody wants crappy neon bud light signs or miserable inkjet printed ads plastered everywhere.Peggy Sue, get your act together, you owe us \"the world's best shake\".", "Date": "2014-01-01", "Author_Location": "San Jose, CA"}, {"Author": "Kivani R.", "ReviewID": "5c6jsaY2bEi6vdV7_qLCfg", "Overall": "2.0", "Content": "Well, I tried Peggy Sue's for the first time last weekend. And I hate to say it but I wasn't too impressed. I sort of expected more from this place because of all the rave about it. Burger and Fries were less than mediocre (the quality of their beef patty's were as terrible as it gets). And the place definitely needs a make-over. Im thinking \"Restaurant Impossible\"?", "Date": "2013-02-12", "Author_Location": "San Jose, CA"}, {"Author": "Tess H.", "ReviewID": "P-I_dOhkdqwOJ4o_mycqfg", "Overall": "1.0", "Content": "If I could give this place 0 stars, I would. My boyfriend and I stopped by here before a Sharks game. Definitely not what I expected, in the WORST way possible. The server was incredibly rude- when giving us our food, he just dropped the plate in front of us, dropping a couple of fries on the table, without even apologizing. Then, I asked for a knife, and when he came back, instead of handing me the knife, like a decent waiter would, he just threw it on the table and left. Now for the food, I ordered a bacon cheeseburger, but you're seriously better off getting a burger from McDonald's. Trust me- this is not an exaggeration. Don't go here unless you're looking to waste your time and money.", "Date": "2013-05-21", "Author_Location": "San Jose, CA"}, {"Author": "Kenny K.", "ReviewID": "mh37MNW5xNVg0NlEVKmXew", "Overall": "1.0", "Content": "Been coming here for years before sharks games but in the last year or so, they jacked up the prices. Cashiers are not good about communicating add ons that are extra. Sharks special used to be $8 and now it's $13.", "Date": "2014-04-20", "Author_Location": "San Jose, CA"}, {"Author": "Susie O.", "ReviewID": "PmeTCl9JYYx15Z908p1xOg", "Overall": "1.0", "Content": "Came here for breakfast and now we know to never come back. Food tasted like the oil/grease they use to cook the food in, we ate stale bread, and old fruit. However, the staff was friendly.", "Date": "2013-09-13", "Author_Location": "San Francisco, CA"}, {"Author": "Jack T.", "ReviewID": "VQDpCkjZrj-7nn5SdXgzRw", "Overall": "2.0", "Content": "- Got order wrong even after clarifying- Food itself was not great- Just not good execution considering what it isCame with a friend and was not expecting much and they still had trouble satisfying that. Here's a specific example of what I think is wrong with this place: Fries.A burger joint should know how to do fries. The fries were awful. Soggy and gross. Places that do not specialize and have been open for months manage to get this right. Why can not they see this? And that's my point.Edible but I do not recommend at all. Any of the San Pedro eateries do food better and I think you can find better qualified burger joints elsewhere for sure.On the positive side, it's not super expensive.", "Date": "2012-09-23", "Author_Location": "San Jose, CA"}, {"Author": "Joe Y.", "ReviewID": "-ZgATgmSTtS4ry2KElBzmg", "Overall": "4.0", "Content": "I always hate when someone starts out a review by writing:I can't believe all the poor reviews for this placeHowever:I can't believe all the poor reviews for this place!!Most of the complaints seem to be how long the wait is when they're busy.  That should be a good sign that a place is popular.  If their burgers weren't good, why would there be a line??I sometimes work in the downtown SJ area.  I will walk a few blocks out of my way to get to Peggy Sue's.  My favorite burger is the Porky Pig.  Bacon and Cheddar added to a 100% Angus beef patty.  For a little extra charge, I ask to have Chili added to mine. AWESOME!!Peggy Sue's isn't upscale fine dinning.  It's American grub at a reasonable price.  There are over 40 kinds of sandwiches on their menu.  Something for everyone.  I'm hoping to stop in for breakfast someday.  The Peggy Sue omelet a local police officer was eating looked great.  Hey, if the police are eating here, it has to be good...", "Date": "2009-01-19", "Author_Location": "Livermore, CA"}, {"Author": "Bob V.", "ReviewID": "zqtefr8f8UHICdsPzZmXAQ", "Overall": "4.0", "Content": "I have gone to Peggy Sue's prior to almost every San Jose Sharks hockey game since the 2005-2006 season.  What originally attracted me to Peggy Sue's was the very affordable drinks.  Before games, its the only place that I know of that sells a 32oz. beer for $6, however, the selection of 32oz beers is minimal (Hef, Sierra Nevada, Budweisser, and Bud Light), but where else can you find a beer of that magnitude at that price.  They also have other beers from the bottle.In addition to the very affordable beer...$3 kamikazes!  They also offer a variety of other mixed drinks that are reasonably priced.  My fiancee's favorite being a \"Shark's Margarita\" (a teal colored margarita) for $5.Ok, now I'm starting to sound like a frugal alcoholic so lets talk about the food.  I can understand a lot of the negative reviews due to the quality of food, but what do you expect when you can get anything for about $4-8.  If I feel like getting a quick bite before the game, I'll just settle for the usual diner food such as a hot dog, hamburger, or wings with fries.  I see a lot of families where they appear to be enjoying milk shakes...I haven't tried those yet.Location is pretty nice.  You can park at the San Pedro Garage before games for $3, walk across the street to the diner, and its a short 10 minute walk with a bunch of other fellow fans to the arena.Bottom Line: I'm more than satisfied with this place for the cheap drinks and food before every game I attend.  The staff is always friendly and will remember your name after visiting a few times.  Go there before Sharks games!", "Date": "2009-03-06", "Author_Location": "East Bay"}, {"Author": "Mikey U.", "ReviewID": "NCFX6kc8Lpz4Jq7amqP0IA", "Overall": "3.0", "Content": "It was late in the day (Sunday of the San Jose Jazz Festival) and I started to get hungry. As I walked through San Pedro Square, a sidewalk sign caught my eye: in big bold letters, \"$1.50 Pabst Blue Ribbon on tap!\"I'm easy. In I went.The girl tending to the register was very patient, dealing with a squad of ill-mannered ruffians ahead of me, then [still] pleasant and friendly, if a little exasperated, when it came my turn to order. Smiling service?  \"+1\".The thick 50's diner veneer of rock'n'roll memorabilia and posters of classic Hollywood imagery sets a casual and light hearted mood.  The abundance of SJ Sharks paraphernalia reminds that you are in modern Silicon Valley.  Vintage black and white nostalgia and crisp black and teal fandom; the place has lots of flash, now if only the food had a little more flare...They've a lengthy lunchtime menu: burgers, hot and cold sammiches, hotdogs, and a few baskets of deep fried whatsits.  \"+1\" for being able to substitute any burger with turkey, chicken, or Gardenburger.  For a place with a couple \"best of\"s under their belt (Wave, Metro, though not recently), you'd think they'd sizzle up phenom-nomage; but I didn't find anything worth raving about...Someone needs to apply a touch-up to the carhop girl/statue._______________$1.50 PBR... what can I say?\"Can I have another?\" and \"+1\".Told you, I'm easy.", "Date": "2009-09-02", "Author_Location": "San Jose, CA"}, {"Author": "Jennifer W.", "ReviewID": "mKKhDCAkBVQszOVZHJeKNw", "Overall": "3.0", "Content": "I have nothing against Peggy Sue's. It's just an ordinary diner with the black and white tiled floor and decent prices. What I like is that it's open super early. Being in downtown San Jose, I've often found myself hunting for a place to grab a bite early in the morning. Peggy Sue saved me from Starbucks several times.Most memorable thing: the springy red cushion seats at the booths. seriously, you'll jump up as soon as someone plops down next to you!", "Date": "2009-06-05", "Author_Location": "San Francisco, CA"}, {"Author": "Tony S.", "ReviewID": "7wDMZVz9QQdfYQmSkciSPw", "Overall": "2.0", "Content": "This place should really be taken to task for its blatant false advertising as there is a sign promising \"The best hamburger in the world\".  I'm not sure which world they are referring to, perhaps the world of prison food, for the tasteless hockey puck of a burger that they served up did not live up to the obvious hype.I was suspicious how quickly our order arrived.  The burger looked like it had been cooked some hours ago and kept on a warm part of the grill and then served up.  It tasted about the same, a mass of grey meat in a spongey bun.  The fries were the saving grace, but they were obviously frozen so I don't think they can lay credit to those.  Frozen aside they were crispy and tasty.Gah, I'm still kicking myself for walking past Amici's and going to this craphole.", "Date": "2007-12-05", "Author_Location": "San Francisco, CA"}, {"Author": "Sarah J.", "ReviewID": "wr7-CaNk691rljeEJM4Mzw", "Overall": "3.0", "Content": "I want to give Peggy Sues more stars, I really do. Peggy forgive me, don't sue! (Ha, I've broken the pun ice Yelpers...it's all downhill from here)The strawberry milkshake was the hangover cure of choice for meself and hubby when we lived nearby in San Ho. It really is the bees knees, the cat's whiskers and the dog's testicles. The food was greasy diner fare, again perfect for booze-addled bods on a Sunday but... my major gripe with this place is the complete lack of atmosphere. Good grief, sell off the feckin jukebox and buy a few tumbleweeds and be done with it. Even on a bright, sunny weekend lunchtime on what could be construed as a bar and restaurant 'strip', there was never much life. Shame. People don't know when they're well off. Think of those poor starving Irish children...starved of a bit of sunshine...and fabulous milkshakes. Sniff...", "Date": "2008-10-18", "Author_Location": "San Francisco, CA"}, {"Author": "Warren W.", "ReviewID": "Gz32DOqkqlXHxghN1g-j-Q", "Overall": "3.0", "Content": "\"Don't they do anything here?\"My friend complains as we sit in a booth and he thinks a waitress will show up to take his order. He says it again as we sit down and we hear our order called. Yes, we have to get up and pick it up from the counter as well. It was totally dead too at 2pm, wouldn't have killed the cashier gal to do something for us. We even tipped her right after the order. It really is self-serve here. The food is simple and fair enough. You can't really screw up a burger worse than McDonald's. For the veggie inclined, THERE IS a veggie burger. Their \"Garden Burger.\" =) hOWEVER, there are so many superior vegetarian restaurants in the immediate vicinity that the only sole reason to eat here is cause it's close to the parking garage and you have a friend that must have a burger. Besides that, it's chill, it's simple. Nothing too impressive. Just a straight up 50's dinner. Self-service feel = minus 2 stars.The staff are pretty cool however. But yea, the 50s rock got to out of control haha, had to sit outside and enjoy the sounds of the street. ;)", "Date": "2009-11-09", "Author_Location": "San Jose, CA"}, {"Author": "CW P.", "ReviewID": "HmMdzXs7LsueWEIxhyTW8w", "Overall": "3.0", "Content": "I started working my way down the The Classics menu at Peggy Sue's last season, and I'm still working my way down this season.  I have only eaten somewhere else before a Sharks game once and that was because my friend was a vegetarian.  The reason? Free parking at the San Pedro Square garage, proximity to the Arena, and decent burgers.  The burgers are not huge, which leaves room for Peggy Sue's shakes or dippin dots at the Arena. They are not greasy, and the themed burgers, like the Rocky and the Blue Hawaiian, fit the cute diner theme.  I recommend the chocolate shake.The fries are nothing special.  Finally, I'm not an expert on family friendly dining, but I suspect this would be a good place for parents who want their kids to associate diner food and kitsch with hockey games.  That seems more special than a Happy Meal and Golden Arches before the game.", "Date": "2007-02-02", "Author_Location": "San Francisco, CA"}, {"Author": "Brando Calrissian ..", "ReviewID": "-ffND1Xy10McvxyXEpv-NQ", "Overall": "2.0", "Content": ":/ I went to Peggy Sue's tonight because of the other reviews on this page. Im not sure what type of food they are used to eating but the 4 and 5 star reviews are NOT deserved.Dont get me wrong, this isnt a bad place and the food is ok. Problem is the food is just ok. Everything tastes like the random baseball field vendor or american roach coach. In other words the frys / nuggets / onion rings / burgers are all frozen items purchased in bulk. Peggy Sues is only a diner becuase of the decoration. It even pales in comparison to chains like Jonny Rockets, Mels Drive Through or Dennys.If I found this place on my own (without reading 4 and 5 star Yelp reviews) my only real complaint would be the wait time.If you want something good and cheap you are much better off atSonoma chicken coop across the streetLa Victoria around the corner (yum)Togos down the streetQuiznos around the corner", "Date": "2006-09-30", "Author_Location": "Sunnyvale, CA"}, {"Author": "David L.", "ReviewID": "J7z3m6pfAxJGm9jA1Kv3Rg", "Overall": "3.0", "Content": "Peggy Sue's is a local San Jose establishment and this store is located within the San Pedro Square area (right across the street from the parking garage).  The restaurant is self-service, and there are both indoor and outdoor seating.  I'm usually not a big fan of pseudo 50's diner, but the food turns out to be all right.  Keep your expectations low and you won't be disappointed by this place.    We got an Avocado Jack Burger for $5.75 and make it a combo by adding curly fries and a fountain drink for $2.55 more.  The burger is definitely not gourmet by any stretch of the imagination, but it isn't bad either.  The classic cobb salad (with grilled chicken, $7.35) turned out to be a better choice and feels somewhat healthier (unless you drench it in the bleu cheese dressing).  The grilled chicken on the salad is surprisingly moist and tender.   Bottom Line:  Decent portion size and nice atmosphere.  Good family friendly place.", "Date": "2007-07-21", "Author_Location": "Fremont, CA"}, {"Author": "Shehryar S.", "ReviewID": "atLOlXplRyrvHxeEmpHxRA", "Overall": "2.0", "Content": "I've been coming here for years on Sharks game nights. It used to be really good, but over the years I've noticed the quality going down. My girlfriend and I decided that after years of being Peggy Sue's customers, last night would be our last time there.I will say though that this is an awesome place to go for pre-game drinks. The deals are fantastic. Beer comes out to $3.50/pint on tap. They have huge 32oz  margaritas on the rocks that are $7.", "Date": "2011-10-09", "Author_Location": "San Jose, CA"}, {"Author": "Bob S.", "ReviewID": "2rxdI_zNhkvA4_80RRAtAQ", "Overall": "1.0", "Content": "If I hadn't been so hungry, I wouldn't have kept working to choke it down.The burger patties were dry, thin, tough, chewy, flavorless.The tomato slice had a big hard unripe core chunk.The lettuce was nice and crisp, and the roll was tasty and fresh.", "Date": "2012-08-14", "Author_Location": "Campbell, CA"}, {"Author": "Alan G.", "ReviewID": "mQoIMgzilQdOm7a2k-qaGQ", "Overall": "1.0", "Content": "Worst place on earth. Food is horrible, Owner is a complete idiot. I was there one night and the owner would not let anyone used the restroom and then he pushed a girl who tried to used it.  Never never ever go here.", "Date": "2014-04-05", "Author_Location": "Burlingame, CA"}, {"Author": "Bobby l.", "ReviewID": "q5Lg7Oj4fgzH8MmlK_GN7w", "Overall": "3.0", "Content": "I ordered the 19b which is 3 hamburger pattys, chili, and an egg sunny side up.  And like every burger that has chili in it, all the chili goshes out =(  The burger was...just a burger.Nothing special.  The burgers are averaging $6 and usually doesn't include drinks or fries.  There are 2 TV screens to watch sports.  There are many burger variations, plus fish n chips, sandwiches, milkshakes.The location is a good location for the restaurant, but I feel that the food could use some work to make it stand out.", "Date": "2007-01-05", "Author_Location": "San Jose, CA"}, {"Author": "Ashley T.", "ReviewID": "1-XV-CIrBxPoGVF1Ii9QNA", "Overall": "3.0", "Content": "I came here late at night bar hopping around Downtown San Jose with a few friends. We came here for a sharks tank cocktail. It's a huge glass, the size of my face filled with ice and booze. I saw him put a whole lot of alcohol in it, I can't remember what exactly but it really did the job. Everyone in my party ordered a sharks tank and we tried to race to see who would finish first. Too bad the place was dead empty, no audience to see me win. It tasted like a really tropical margarita. You can definitely taste the tequila, orange, and lemon taste to it. I think there was a berry taste to it as well. I cant remember. If you're curious. You should try it. It's a really good drink.Peggy Sue's is really dead at night which makes it fun to bring a big crowd because you know you'll have a seat and the music isn't loud at all. You guys can just sit around and catch up on drinks. The decor is of a classic 60's diner and there's a hot cut out of Marilynn Monroe by the bathroom. PHOTO TIME!", "Date": "2011-09-25", "Author_Location": "San Jose, CA"}, {"Author": "Maronita I.", "ReviewID": "hxALO369EZ-ANGn7DLh3qg", "Overall": "3.0", "Content": "I worked at O'Flaherty's for 3 years...We got our food from Peggy Sue's...It's standard diner food.. many options. The staff is friendly and helpful.They have daily specials. Sometimes they make their own soup, usually very good. But if you like clam chowder... its ssooooo good in the bread bowl... add some tabasco and you got a winner.They have a small area set up as a bar to fulfill the longing livers of thirsty patrons, beers on tap and tasty shakes.I'd rec. the chicken sandwich or cobb salad.They also have great breakfast prices.Great place for kids. Fun environment with lots to look at and music to jive to. Gets crazy on Shark game nights... so go early.", "Date": "2010-04-02", "Author_Location": "San Jose, CA"}, {"Author": "Lucy D.", "ReviewID": "8xXmA0z9MS7fy_2Fl7Ueqg", "Overall": "4.0", "Content": "Great place to get some simple American sandwiches and breakfast and conveniently right across the tech museum.  The make sandwiches with plenty of veggies and meats. I ordered a simple BLT and couldn't even finish it. The inside has a cute oldies atmosphere and service is super friendly. This place doesn't give out fries or any other side dishes with their entrée, but for about $3 more, you can get a huge basket of fries or garlic fries with plenty to share. And since their sandwiches are filling, there is no need to order extra side dishes.", "Date": "2011-01-16", "Author_Location": "Milpitas, CA"}, {"Author": "Michael M.", "ReviewID": "EJXON-u9-B-yloYYUfBYUQ", "Overall": "2.0", "Content": "This place would get one star if it wasn't for the crinkle fries. I had a cheese burger with bacon, fries and a bottle of water. The fries were great! Nice, crispy and delicious. Too bad the burger wasn't as good. The meat was thin, dry and looked like it was sitting in a box in the kitchen then tossed on the grill to warm up. The bacon was OK, but had burnt bits on it which suggests that it was cooked on a dirty grill. The buns were super thick, dry and really cancelled out any burger flavor. Overall, the burger experience was lame. There was nothing about it that made it stand out among other burgers. Seriously, had I known this place was this ignunt (bad) I would have just gone to McDonald's. Also I thought the bathroom was really dirty. First, the door leading to the bathroom was absolutely filthy! Right above the door knob, you can tell thousands of people put their hands there and leave a nasty area of dirt which is really easy to spot when the door is pearl white. Inside the men's room it was pigpen. The stall door is barely hanging on and doesn't even lock properly. I'd like to thank the man who sat in the next booth to me for confirming that while I was in there. Also, thanks for burping really loudly too. That just added to the already disgusting atmosphere.", "Date": "2007-12-05", "Author_Location": "San Francisco, CA"}, {"Author": "Russell S.", "ReviewID": "mjWMlwVz_6fajfG7xmHy6A", "Overall": "4.0", "Content": "I've gone to Peggy Sues countless times since I first started eating here in 1996. When I was interning downtown, I ate here almost once  a week. Since then, I've always eaten here a few times before a Sharks game.The diner is 50's themed with decorations on the walls to match. There is also various sports memorabilia scatted across the walls and pillars. Almost every time I've gone, I've always stuck to the Sharks special. Two burger patties, cheese, bacon served on a roll with fries and a drink.  Why mess up a good thing?There is a side bar to fix your burger/sandwich up with all the fixings-ketchup, mustard, pickles, onions mayo etc.One of the best things about Peggy Sue's is the shakes. They are fantastic and come in a variety of flavors. I usually always go strawberry with the occasional chocolate. Two people can easily split one order. A shake is served in the glass and also a mixing cup that the shake was made in. If you plan to go here before a Sharks game, make sure to get there early. Seating can be tough to get either inside or outside.If you are not in the mood for a burger/sandwich, head across the street to a sister store, Sonoma Chicken Coop for pasta, chicken, salads etc.", "Date": "2010-03-01", "Author_Location": "Phoenix, AZ"}, {"Author": "Sara K.", "ReviewID": "ltTqtAvarneqNwrl9FahOw", "Overall": "4.0", "Content": "We like Peggy Sue's as a reasonably priced family place when we are downtown.   Burgers are good & not so huge that you leave feeling overly full.  Fries & onion rings are fine, nothing special.  My husband & one kid RAVE about the milk shakes & malts & I'm a fan of their chili burger.Several years ago I was downtown on a Saturday morning & stopped in for breakfast.  They have a very simple breakfast sandwich (fried egg, bacon & cheese on sourdough toast) that is SO GOOD!  I was with a friend & we both loved them. Service is pretty good & the food comes fairly quickly as long as you aren't there before a Sharks game.", "Date": "2007-03-03", "Author_Location": "San Jose, CA"}, {"Author": "Lorrie M.", "ReviewID": "4lq-uQai3gKNuXiALcBNgg", "Overall": "4.0", "Content": "I can understand mixed reviews of this place but I personally have had tons of fun here and really enjoy their food. All of their creative burgers are flavorful and comes out freshly cooked with fresh, crisp ingredients that you can add to your burger such as pickles and lettuce. I love their hot dogs because they just taste so ... hot dog-ish LOL ... it's like when you want a hot dog, you want a Peggy Sue's hot dog!They have gigantic milk shakes that many of my friends love (I simply just don't like milk shakes haha but I think they're decent) and the prices are not too outrageous for the downtown area + 50's look and feel.The only downside to this place is that it's not all that clean ... but hey I'm grubbing on a burger, who cares :)", "Date": "2009-02-19", "Author_Location": "San Jose, CA"}, {"Author": "Steph V.", "ReviewID": "TCMdmXHHYlAsjGOf5MJKXA", "Overall": "3.0", "Content": "This diner is in an ideal location on San Pedro Square. Close to clubs, bars, the Shark Tank. If you're craving some good ol' burgers, shakes and fries in the area, stop on by to Peggy Sue's. They're open til midnight and won't kick you out if you're still eating past closing. I've been here a couple times. Here's my two cents:+ Lots and lots of seating. I'm talking booths, tables, counters for your rumps to take a load off. + Beer and adult beverages. You can enjoy an affordable pint of beer at a price slightly less than the surrounding businesses. + Cute music that fits in with the time era and decoration. 50's 60's boop bop+ Friendly staff. You'll get a smile even late at night+ Clean, clean!+ Try the banana shake! Made with real bananas :)+ Burgers are legit and pretty tasty with bacon+ Don't forget the fries!!So why the 3 stars? I don't think Peggy Sue's compares to the other diners in San Jose, but I do appreciate the fact that they are staying open and keeping up with the hussle and bussle of the downtown community. Cheers, Peggy!Tip: They share a bathroom with O'Flaherty's Irish Pub next door. Make sure you don't accidentally walk into the wrong restaurant after draining the main vein!", "Date": "2012-03-13", "Author_Location": "San Jose, CA"}, {"Author": "Sara W.", "ReviewID": "PQ6ZlBCzc_4a0F5-WNBUpQ", "Overall": "3.0", "Content": "I really love breakfast and homey diners. There is that vintage feel with the old movie posters and 50's-ish setting. The food is reasonably priced; for two people, we get out paying $17 or so. I always get the Peggy Sue's omelet with no meat (I'm a vegetarian), and it's good every time, and sometimes too much food. Also, I work nearby and get the breakfast burrito for $2.50 frequently. I think the burrito is better than that from La Vic's because it's bigger, tastier, and more filling.", "Date": "2008-12-23", "Author_Location": "San Jose, CA"}, {"Author": "Will C.", "ReviewID": "aYAI51r7KIoMjsS8IcEj1A", "Overall": "1.0", "Content": "Yikes! Which group voted Peggy Sue's best hamburgers in San Jose? Makes burger afficiandos think that folks from San Jose think Red Robin is the Ritz. Went here last night prior to Sharks game. Ordered the Peggy Sue's cheeseburger. Burger came out warm (not hot) with the usual cheese, tomato, lettuce. Mustard and Ketchup I had to add myself.Overall impressions:- meat is tasteless- meat is dry- buns taste store bought- I don't care if the beef is 100% angus beef if I am not enjoying how it tastes- staff seems nice enough. very quick to clean off your tables. seating, however, is limited during sharks game nights. - veggies and tomatoes taste fresh, but I don't order burgers for the veggies.", "Date": "2010-12-22", "Author_Location": "Arlington, VA"}, {"Author": "JoAnne M.", "ReviewID": "ZKWu-fohdfatPbenk2yl8A", "Overall": "1.0", "Content": "I agree wit Michael M.s description of the burger... thin dry and probably sitting in a box in the back waiting to be thrown on the grill. The one and only time I have been there (I won't go back) I had the worst burger of my life.The restroom made me feel like I was in the mens room of the dirtiest nastiest bar in the world.  I couldn't let my 3 yr old use the restroom there.There are MANY other restaurants in this area to choose from before a concert or Sharks game at the Pavillion.", "Date": "2008-03-25", "Author_Location": "Fremont, CA"}, {"Author": "Patricia A.", "ReviewID": "rVjzNkyIg7bJPNB1ZF9c6Q", "Overall": "1.0", "Content": "So I've lived in Santa Clara/San Jose all my life (44 years) and went to Peggy Sue's for the first time tonight because we went to Christmas in the Park.  What a disappointment!!  The food was about what you could get at any low rate diner. Not bad but not good. The service is really what prompted my bad review. First of all the lights were off outside so we weren't sure if we could walk in or not. Then the guy who was originally at the counter to take our order looked like he got frustrated because we didn't spout off an order right away (we had to look at the menu). He went back to the kitchen and sent a younger kid with no personality to take our order. After we ordered we looked for a clean table (at least 6 of the 10 or so tables were dirty) and sat down.  We saw the kid who took our order mop under a table with one arm and managed to push all the items under the table to the back of the wall, I guess that's considered clean there THEN he left the dirty mop up against the wall by all the tables. No one of the staff was identifiable and it seems like they are all thirsty as camels because they frequented the soda machine often, even with short lived rush we witnessed a couple employees walk out from the back to fill their cups.  We got our \"over-priced\" food - almost $50 for three of us and ate. The dirty tables that we saw when we got there were still there and patrons were bussing their own tables so they could sit down until the laziest looking girl came out with a bussing tub to start doing her job.  She started cleaning a table off for a couple ladies after suggesting that they sit at another \"clean\" table right by the door.  I'm surprised they are still in business, it seems like its a family own establishment now......I'm sure they don't get much return customers, just ones that happen to stumble in because they surely have a prime location - lucky for them.", "Date": "2013-12-28", "Author_Location": "San Jose, CA"}, {"Author": "Rufina M.", "ReviewID": "1qCeaYf6swUrgSTcl125Rw", "Overall": "1.0", "Content": "The best thing about this place is the location. Food was bland. Garlic fries were cold. When we went to the counter their response was \"What - they're not warm?\" On top of that, there was no garlic to be found on the fries! Got attitude when we asked them to validate our parking. Don't waste your time or money.", "Date": "2013-11-15", "Author_Location": "Fremont, CA"}, {"Author": "Black K.", "ReviewID": "BITVKiYituIXnveo6nlESA", "Overall": "3.0", "Content": "I came here for a needed \"pitstop\" from the San Jose Jazz Festival. Although I was impressed by the decor, the food was ok. Nothing out of this world. I ordered a \"Hot Rod\" (Burger with Spicy Jack Cheese and Bacon) with Onion Rings and a Vanilla Milkshake.The shake was yummy. The rings were tasty. And the quality of the meat was on par. The only problem I had with the place-a big problem for a hungry man-is that the portions are sooooo small!Burger joynts in the Bay Area are a dime a dozen. There's one on every corner it seems like. And it seems like everyone of them have served much bigger portions than Peggy Sue's.One piece of advice, you have to self order your food. So don't stand at the front counter expecting to be seated by a hostess. And don't expect them bring the food to you either. Peggy Sue's is a self-serve organization. lol", "Date": "2009-08-09", "Author_Location": "Oakland, CA"}, {"Author": "Wilhelm Y.", "ReviewID": "g1JgW47FLTqudhP37hVahg", "Overall": "2.0", "Content": "I used to dine at Peggy Sue's quite often, but the quality of their food seems to be gradually going downhill.  Two visits ago I noticed that the bread on my burger was dry and not fresh.  It kind of just fell apart on its own.  It was around that time that they changed to the krinkle cut fries, and I don't know if its a different brand of frozen fries or bad oil.  I tend to prefer the meatier fries over the fast-food shoestring, but these krinkle cuts were not good.Prior to attending a Sharks game a friend had insisted that we eat here again.  I had a similar problem with crusty bread that could not hold up on its own, and the whipped cream (aerosol-dispensed) on my milkshake had a film on it.  Ugh!  To top the whole bad experience off a wicked chlorine-like smell in one corner of the restaurant left us and a few other patrons scrambling to other tables.Peggy Sue's use to be a great little diner with good burger combos.  It's unfortunate, but I can't think of anything good to say about it anymore.", "Date": "2007-03-12", "Author_Location": "San Francisco, CA"}, {"Author": "Sherri C.", "ReviewID": "Y2toNOFZsEP8qzcRbQN8rw", "Overall": "4.0", "Content": "I am not a diner type of gal.  However, the ratings are much too low for Peggy Sue's at San Pedro Square.  Here are the reasons why:1)  Excellent location2)  Easy parking3)  One of the only diners I know of with a full bar4)  Quick turn-around on orders5)  Open for breakfast with breakfast items on the menu6)  Promos and Happy Hour7)  Incredibly nice and dedicated ownersAside from reasons #1 and #2, comparable restaurants -- like In-and-Out Burger -- offer even more limited variety.  They may both be \"pick up your order at the counter\" places, but Peggy Sue's menu is far more comprehensive with regard to food and beverage items.  I will admit I don't really come here for the food; for me, the appeal of Peggy Sue's is that it's a great informal place to meet up with others before a show or Sharks game, or to have internal work meetings with my team during the restaurant's less busy hours.  Having the kitchen and bar available when you are there for whatever purpose is a bonus (working out strategy for projects can make people really hungry and thirsty)!  One extra star for the interesting and historical memorabilia that decorate the walls of this establishment and provide a comfortable, traditional atmosphere.", "Date": "2009-12-25", "Author_Location": "San Jose, CA"}, {"Author": "Wen C.", "ReviewID": "HbA_O-2IqFtnC9T2FiLm3A", "Overall": "2.0", "Content": "I place that sells nothing burgers should be able to turn out a damn good one.There is nothing special about Peggy Sues, their menu choices put you to sleep, nothing exciting or original here. Their burgers don't make an impact either, definitely no flavor explosion in my mouth . The quality of burger was also on the downside, the bun looked like the cheapest stuff u get at the supermarket. The portion was a lot smaller than most burgers you get everywhere else too.The only thing that tickled my fancy was the self-service condiment bar.", "Date": "2009-08-02", "Author_Location": "San Jose, CA"}, {"Author": "Nick W.", "ReviewID": "Aoi8Au7fVI_kQwrqcB_K6Q", "Overall": "4.0", "Content": "Love these burgers. Always great service, and never a crazy wait to get a table. The shark's special is my favorite, with a strawberry vanilla, or a banana vanilla milkshake. Do it!If I had one gripe, it would be that they leave the mayo out for you to help yourself at the condiment bar. Mayo is not something I like sitting out uncovered and non-fridgerated. Other then that, great place. Love the decor too.", "Date": "2011-01-25", "Author_Location": "San Jose, CA"}, {"Author": "Elea C.", "ReviewID": "RUODPSP9Dw_mjHYUlSersw", "Overall": "3.0", "Content": "Peggy Sue's is an old-fashioned American-style diner apparently frequented by the Sharks during hockey season. The decor is fun to look at -- with clippings of old newspaper articles, posters, autographed shirts, and other assorted memorabilia -- which is good, because the food usually takes a little while to prepare, even if there aren't that many customers. \rYou stand in line to order, seat yourself, and then pick up your food from the counter, so Peggy Sue's really isn't a place to go if you're looking for the whole traditional dining experience. Their saving grace comes in the quality of their edibles -- I love the curly fries here, and the milkshakes are awesome. Still, I don't come too often because it can be a bit pricey in comparison to its portions, and I fall under the category of 'poor college student needing to live modestly'.", "Date": "2006-09-12", "Author_Location": "Portland, OR"}, {"Author": "BeBe C.", "ReviewID": "Kp7DoLJ3LhjWxBRkoLXZcA", "Overall": "4.0", "Content": "This review is based on my last visit about 9 months ago. I recall that the burgers were quite good (my husband disagreed--he said they were just ok) while the milkshakes were excellent. The Pen Creamery in Palo Alto also offers great shakes but Peggy Sue's surely wins for the value.", "Date": "2007-08-15", "Author_Location": "Palo Alto, CA"}, {"Author": "Sarah M.", "ReviewID": "8_4hOd2ck7SQpwgPKP2LlA", "Overall": "2.0", "Content": "Mainly my review is based on the girls who work the register/call out the orders when they are done. Frankly, the food here is GREAT. I've never had an issues with it. The bartender is my favorite person ever and makes great drinks. However, the place should look into getting new people working the front.I understand that on game nights the place is PACKED. I know what that's like, at my job one of the days a week I have an hour to usually help 20 people. It sucks, but you get through it. Instead, the girl who was working last night was so frustrated and was showing it. Instead of listening to us order (even though she told us to order three times) she kept running around. Of coarse, even when I asked her to read the order back something was wrong. Oh boy.Once we got the food, another girl got into an argument with us about it being wrong. We ordered a turkey burger and a bacon burger. We ended up with two burgers. I told the girl this wasn't mine and she insisted I ordered wrong. Really? I don't eat red meat, so there is no way I ordered a hamburger, sorry there is no way. My receipt says turkey burger. What happened to the customer is always right?", "Date": "2011-01-16", "Author_Location": "Capitola, CA"}, {"Author": "Joe B.", "ReviewID": "cZ86YPXO5pD1kQgUjHtrfg", "Overall": "2.0", "Content": "We went to Peggy Sue's for lunch. The weather was great out. I was looking forward to a big juicy cheese burger. Too bad, i got my hopes up.I ordered a bacon cheese burger. It was ok. It wasn't great. Maybe a step up above Wendy's, but two to three times as expensive. The fries were awful and the onion rings were almost completely burned. The service was terrible. We must have stood in line for 6 to 8 minutes before they took our order. There was only two people in front of us. I can only imagine what it is like when the place is busy. The restaurant looks cool. They do sell beer and drinks. I might go try it again after work. I am not going ot write it off yet. There are so many restaurants in this part of San Jose that i don't want to settle..", "Date": "2007-05-01", "Author_Location": "Sacramento, CA"}, {"Author": "Leo T.", "ReviewID": "d57QE9T5L3qisceKCzwK7w", "Overall": "3.0", "Content": "Ambiance? It's dead....seriously. The burger's aren't THAT great in taste but they are above par when compared to chain places like JRocket's. Originality is at its best here for the names, but they really are just variations on a theme. It just doesn't cut it for all the reviews I've read. I eat big and they can provide BIG so there's a plus. But for the prices... not entirely worth it. When I think GREAT burgers, I think Five Brothers in Washington, D.C. (yeah, I go all over for burgers). Even Fuddruckers might be better... maybe even In-n-Out.. oh snap!", "Date": "2007-05-16", "Author_Location": "Irvine, CA"}, {"Author": "Stephanie B.", "ReviewID": "kDf4a7Q_C0dv_wyL_Prrxg", "Overall": "3.0", "Content": "The burgers are cheap and you get what you pay for. It's not the best (Crepeville in Davis, CA), but it's not the worst I've ever tried (my own homemade burgers? lol)..Their shakes are really good though. Authentic milkshakes--real deal, people.So I guess the only thing I REALLY liked about this place was their milkshakes and their garlic fries/onion rings/curly fries.:))", "Date": "2008-09-01", "Author_Location": "San Jose, CA"}, {"Author": "robert k.", "ReviewID": "pzEpFod1KtD5r15l9j-ZCA", "Overall": "2.0", "Content": "I don't know why I've been here more than once.  Everything is definitely 'meh'.  I think it's the location and the fact that it's just right there.  Going to a Sharks game?  It's right there.  Visiting SJSU with your parents?  Right there.  Tech museum?  Right there.Of course, once you get to know the area, you can find some better eats.  But since it's right there, it's always popular..To me, the burgers are middle of the road.  Meat is good, but the buns are dry.  The fries and rings are decent.  Of course the milkshakes are good (maybe that's why I keep coming back?) but other than that, meh.", "Date": "2009-10-12", "Author_Location": "San Jose, CA"}, {"Author": "Mark A.", "ReviewID": "wWhf0kSApydHZ8qE0cc9cw", "Overall": "1.0", "Content": "Not as good as it used to be. I give an extra star for convenient locations but thats about it. McDonalds did much better than the dry cheeseburger i had here. Used to be good. Not any more.", "Date": "2008-04-14", "Author_Location": "San Jose, CA"}, {"Author": "Jonathan A.", "ReviewID": "Hj7KOq-YWWj2RdP--EkubA", "Overall": "3.0", "Content": "The War Department, I mean the ball and chain, I mean my lovely GF and I rolled through here because we were waiting for some friends at nearby Firehouse, and were craving burgers.They were aw'ite, although my GF's cheeseburger was dripping mad grease like a meat sponge.Yeah, I said it.  Meat sponge.Nothing terrible, nothing spectacular, and will hit the spot if you are starving.But it will not fill the hole in your soul....", "Date": "2012-04-25", "Author_Location": "Mountain View, CA"}, {"Author": "Parisa V.", "ReviewID": "VCT4DOwShqiNkryoqPeydQ", "Overall": "4.0", "Content": "we ordered Mushrooms swiss cheeseburger, garlic fries and regular hamburger. I absolutely loved the garlic fries and mushrooms swiss cheeseburger. they are open until 2 AM, the price is great and I will definitely make it a habit to revisit soon.", "Date": "2013-11-09", "Author_Location": "Los Altos, CA"}, {"Author": "Ohr S.", "ReviewID": "rJOqfLsv1r_iYY1NB2sACg", "Overall": "2.0", "Content": "\"Meh\" is right. Nothing special, pricey for why you get. I suppose if I were a huge milkshake lover I might bump this up a star. As it is, I'd recommend you just walk your ass right 'round the corner and grab a Cuban sandwich and fried plantains in hot sauce at Los Cubanos.", "Date": "2013-10-09", "Author_Location": "Sunnyvale, CA"}, {"Author": "Phil L.", "ReviewID": "kHDdJTf_FKwqLR2qfNrHeQ", "Overall": "3.0", "Content": "In a downtown full of high priced steakhouses and fusion restaurants, Peggy Sues offers classic american food at a decent price.  Very popular to eat at before any event at the HP Pavillion just because it's close to the HP Pavillion and it's pretty much as close to fast food as you can get in the downtown area.I always get the Silly Philly special and I'll admit I can easily get hooked to this meal.  Philly cheesesteak plus fries plus drink for 6-7 bucks?  Not too shabby.  Salads aren't worth it, but if there was one reason to come check this place out, it's to try their many different types of burgers.Prices have gone up a lil recently as well FYI.", "Date": "2007-08-16", "Author_Location": "Santa Clara, CA"}, {"Author": "Lindsey A.", "ReviewID": "Qrz_6LgXX8ZgWwZ4osWSEQ", "Overall": "2.0", "Content": "My husband and I have lived in San Jose for 5 years now. We've always been turned off by Peggy Sue's, but haven't ever been sure why. Well, this time we wanted to use a $6 off coupon we had-- so we bit the bullet and went against our better judgment. At Peggy Sue's this afternoon, my husband ordered a Turkey burger with onion rings and I ordered the Miss San Jose (chicken sandwich with grilled onions, mushrooms, and barbecue sauce) with curly fries. Normally, with sodas our meal would have cost $20, which is outrageous. It was only really worth it with our $6 off coupon, which brought it down to a reasonable $14. The food was a'ight. It was something I most certainly could have put together at home, so it was nothing I would go out of my way for. Next time I get another $6 off coupon, I'll just get a milkshake or something low key. I have to say that we both agreed that it tasted a bit better than Mojo burger, but not much.", "Date": "2008-10-26", "Author_Location": "San Jose, CA"}, {"Author": "Shannon L.", "ReviewID": "uIhm2DshevRLQW8yzOWCOg", "Overall": "3.0", "Content": "We went to Peggy Sue's for breakfast. I ordered the pancakes and my wife ordered the veggie omelet. Both came with a coffee and small orange juice. My father-in-law skipped breakfast and went straight to lunch. He ordered the fish & chips.My pancakes were good....I guess it's hard to mess up pancakes. My wife thought the veggie omelet was just okay. It did have lots of vegetables. My father-in-law liked the fish & chips.Overall, we thought the food was decent and the prices were pretty good.", "Date": "2009-03-01", "Author_Location": "San Francisco, CA"}, {"Author": "Anna V.", "ReviewID": "qObfEIZ4QdNypru4vj5sCw", "Overall": "3.0", "Content": "I love diners with cool decor. This place has a good happy hour (I know, happy hour at a diner? haha). The thing that sucks is that they shut down their happy hour early on game and event days. Lame!Their food is okay - they come in good portions and they get to the point. Their chili cheese dog is good - they split the hot dog to make sure it cooks deliciously, the chili cheese topping comes in a generous amount, and they give you a nice side of diced tomatoes and onions for more toppings! Their burgers were alright... Some people may find them kinda blah. Their salads are overpriced and mediocre. This place is convenient to eat if you don't want to daddle around too long and don't want fast food. You pay for your order at the counter, seat yourself, and wait for your pickup number. It's in a great location - close to the shark tank, and next to some cool bars.", "Date": "2010-05-20", "Author_Location": "San Jose, CA"}, {"Author": "Michelle C.", "ReviewID": "BEshSiSsOmdqkzrhGzh0AQ", "Overall": "2.0", "Content": "Extremely mediocre American food and annoyingly kitschy decor. The staff is friendly, and my cobb salad had plenty of bacon, but for the price it's just not worth it.I could maybe drunkingly enjoy a burger here, but there's so many more options in the area I'd just as soon skip it.", "Date": "2010-08-21", "Author_Location": "Philadelphia, PA"}, {"Author": "Jennifer B.", "ReviewID": "iRajpYkOG56KK4_K6Zj1iw", "Overall": "3.0", "Content": "Basic diner food -- good for filling you up before hitting the bars or for sobering you up after hitting the bars.I've tried their soups, garden salad, chicken sandwich, turkey burger... I would never crave one of these items, but they weren't bad. Just nothing special. So many positives to this place though: awesome service, ample parking, walking distance from San Pedro bars/the Tank, reasonable pricing, open late -- hell, they even have a happy hour. The only downside to this dinner is the food!", "Date": "2010-10-10", "Author_Location": "San Francisco, CA"}, {"Author": "Allister D.", "ReviewID": "hJplYjs174x0diTTX52Y7g", "Overall": "3.0", "Content": "I was really excited to try this place out! I knew it was a typical old fashioned diner but I had to have it! My gf and I tried it out since we were craving cheeseburgers and shakes! we both had cheeseburgers, fries, and a strawberry shake. It honestly wasn't anything too special. The taste was good. Service was wayy toooo slow. They must have had only 1 cook in the back. The price was decent I guess for a diner?! not too expensive. The portions were aite? The bar was a bit to dark to see though. This is where they served sodas and sauces for your burgers and fries. The lights needed to be a bit brighter to me because I could barely see my shit.The best part was our shake! SOO good and not stingy about their amount of it! They had the tall glass plus an extra cup full of shake! YUMMI would come back Peggy, sorry", "Date": "2011-01-18", "Author_Location": "Sunnyvale, CA"}, {"Author": "Elaine N.", "ReviewID": "33LnZ_7y_JL_hbbixnKgww", "Overall": "3.0", "Content": "Right before Usher concert on Sunday, my group of girlfriends and I decided to eat here because we were really hungry.I ordered the Avocado Burger with added bacon because I love eating avocado with bacon. I thought the burger tasted plain and the texture was just okay. Nothing spectacular about it and the fries was alright. Overall, I would have to say this place is just A-OK!", "Date": "2011-05-31", "Author_Location": "Milpitas, CA"}, {"Author": "Ryan L.", "ReviewID": "gUqXXaOtYixZ8tLLqkJ8LQ", "Overall": "2.0", "Content": "Peggy Sue's is an burger joint that has a 1950's flair: chrome, oldies, burgers, shakes and fries.  I stopped here to try something new.  There was only one family here on a Sunday night.  I imagine this place is much busier when the Sharks are playing.  The menu has a bunch of uninteresting burgers, sides, shakes and salads.  I chose the Hot Rod and sweet potato fries.  It was served \"deconstructed\" which means that I had to put it together.  A hamburger patty covered in pepper jack sat on a bun.  On the side was lettuce, tomato, two full strips of bacon and two little packages of mayo.  Ketchup and Mustard was on the table.  The burger was fine but neither huge nor memorable.  I was annoyed I had to construct the burger myself and found the mayo packets a tad tacky.  The sweet potato fries were perfectly fried and very tasty.  The guy who took my order wasn't very chipper.  He didn't want to be there.  In the end, neither did I.  I don't expect to return here.  I prefer Red Robin way over Peggy Sue's.", "Date": "2011-07-18", "Author_Location": "San Jose, CA"}, {"Author": "Chris V.", "ReviewID": "vgDoS4LXgUn3ik_4NCnthg", "Overall": "4.0", "Content": "My friend told me to skip the fries, so I did. I had just a Teriyaki Burger. It was well-flavored, the bun had a good burger-y texture, and the meat patty was pretty solid. The lettuce and tomato came on the side, which might have been more helpful for avoiding a mess in the long run when I decided to eat it on the side and not to add it directly to the burger. It's no In-N-Out or a super fancy burger joint, but it's pretty good, albeit a bit pricey given the simplicity and size.Minus one star for not showing NHL games on a hockey night. I saw other places on this block that showing hockey or at least the highlights show on the NHL Network. They had soccer, college basketball, and college... volleyball? Bleh. Maybe minus another half star given the price concern.", "Date": "2011-11-24", "Author_Location": "Henderson, NV"}, {"Author": "Arman B.", "ReviewID": "5hFAcWnWXJVcWi_9c_9pEA", "Overall": "1.0", "Content": "I'm so sorry but I really felt like I was taken advantage of at this place. I typically wouldn't post a bad review if I felt like i just had a fluke bad experience or maybe if the cook wasn't on point or whatever the reason, but after checking the reviews (which I should have done before), I realized that this establishment has a reputation for bad reviews on the food. I have a feeling that they make their $ on the liquor so food isn't necessarily a priority, which is ok if it works for them. I ordered a chicken with avocado and received a dry chicken patty, cold bun, and 3 slivers of avocado that made me giggle. Overall it was overpriced cafeteria food. Hope they do something different because they seem like they could be a nice establishment.", "Date": "2013-08-20", "Author_Location": "San Jose, CA"}, {"Author": "Adrianna V.", "ReviewID": "3zM83rY0roxq1q5WQDtyyg", "Overall": "3.0", "Content": "I love San Pedro Square and would have never guessed this place served drinks until a friend told me about the famous shark tank! We stopped here before heading to Myth and shared since 32oz is too big for a girl who is under 5 feet (me). It was not as strong as I would have liked, probably because I'm spoiled with Patron and could barely taste the well tequila. Tasted very sweet so you could not taste the alcohol at all, sneaky! I did not try the food but really enjoyed how personable the staff was to our group, they conversed with us using our names and customer service like that stands out to me and will bring me back! This will forsure be a stop on my birthday night out.", "Date": "2013-07-07", "Author_Location": "San Jose, CA"}, {"Author": "Darrel S.", "ReviewID": "qViiY1NR2avO9QUSS_PzqQ", "Overall": "1.0", "Content": "Do not step into this establishment until they change management! Food is horrible! Jack in the box has better curly fries than this place! I ordered the boneless chicken wings. And i would rather go to McDonald's for chicken mcnuggets! I complained to the cashier and i asked to get their famous avocado burger and got a thin piece of what looks like soy meat or some fake meat you would get at you local Taco Bell! I gave them a chance to fix it but they failed!", "Date": "2013-10-05", "Author_Location": "Sunnyvale, CA"}, {"Author": "Tony M.", "ReviewID": "5Ub21fvyW6_zROelbUYNRw", "Overall": "1.0", "Content": "While visiting San Jose, CA. two weeks ago for the Barry Manilow Concert at the HP Pavilion, we decided to head towards downtown to grab something to eat after the show. There was not much open after 9:30 PM on Thursday but, I had been to this establishment before and when I got to North San Pedro, I saw it was open and since I had a burger craving, we walked in.The girl that was working the counter literally forced herself to respond to my hello and acted as though she was doing me a favor taking orders in between her conversations. I ordered us two double burgers with cheese and bacon along with two sides of fries and two sodas. She kept assuming I said onion rings and after the third time, she understood that I said fries. I kept my temper and patience in check but that was annoyance number one. After placing my order, I stood there and had to ask for my beverage cups for the self serve soda fountain.When the food was delivered, I had to call the server back as there was no bacon. The sever looked at the receipt as if he were puzzled. He took the food back to the kitchen and then came back and told us that there was an extra charge for the bacon of two dollars and change. At this point, I decided it was late and I wanted my food correctly. So, I got the change to give him and in fact, gave ten cents over and had never even gotten my change back. I never even got an apology from anyone there for their mistake.How tacky! It was the cashier's error and for customer service reasons, they should have complimented the bacon.As far as the food, I have had a much better food experience at Five Guys, Wendy's Sonic and Carl's Jr. The burger at Peggy Sue's was mediocre and had a frozen taste associated with blandness.The skimpy portion of fries were nothing to write home about either.The atmosphere is nice for a diner paying tribute to the past but they need to learn about customer service and how to train their employees to care about the customer. They also need to learn how to properly correct a scenario in a way that compliments the customer.The service for what was being charged was sub par and I shall not return. I don't know if this was owned by someone else about six or seven years ago but back then, it was good food and decent service.", "Date": "2012-12-18", "Author_Location": "San Antonio, TX"}, {"Author": "A E.", "ReviewID": "qKUFGX7RDtd2BKuPVn0SdQ", "Overall": "2.0", "Content": "Nothing noteworthy from the burger here.  The teriyaki burger was smothered in ultra-sweet teriyaki sauce (but then again, my bad for ordering a teriyaki anything in a burger joint / semi-fast-food-chain diner).  The fries are the frozen variety, so is the onion rings.  At least I didn't believe in their representation - \"The best hamburger in the world\" - and did not expect much of this place.  The interior looks like a tacky diner and a much better option is to utilize the outdoor seating, especially on a summer day, because San Pedro St is probably just about the only street in downtown San Jose where it is remotely nice to sit outside.Verdict: Peggy Sue's feels like a glorified McDonald's or Burger King, with a jukebox and outdoor seating area, and without kids meals with made-in-China toys and Ronald McDonald.", "Date": "2007-12-27", "Author_Location": "San Francisco, CA"}, {"Author": "Heather K.", "ReviewID": "4bm0bed0ZxpFifB9Cz7tUw", "Overall": "1.0", "Content": "I'm not sure how something so greasy can be so tasteless, but I do know one thing, this place blows!  I'll stick to In-n-Out for burgers and shakes (and save plenty of $$ in the process).Someone mentioned the bathrooms.  Um, I guess some haven't noticed, they share the restrooms with O'Flaherty's pub!   In fact, head out the wrong direction in the hallway and you'll end up in the bar.I'll never order food at O'Flaherty's, because I'm more worried that they also might share a KITCHEN with Peggy Sue's....", "Date": "2008-04-01", "Author_Location": "Johnson City, TN"}, {"Author": "Mike D.", "ReviewID": "S31xq7clzsR2iS2-KKhPMA", "Overall": "4.0", "Content": "I had a really good burgerThe meat was seasoned perfectly...the fries too.Comin back", "Date": "2011-07-24", "Author_Location": "Sacramento, CA"}, {"Author": "eric k.", "ReviewID": "NXtjFTQ51RKbwvImBWFqhg", "Overall": "3.0", "Content": "We'll stumble into here on the way to a sharks game or something downtown and no one can decide to go elsewhere.The food isn't bad.... but at the same time... nothing remarkable....  someone on the previous reviews said the burgers are worth a 20 mile drive or so?  I'm not so sure about that.They can get really busy in here sometimes, but when I do go... I'll usually order or share a shake, which are pretty good.  burgers?  they're ok....  prices are a tad high in that they are downtown SJ as well, which lends back to the convenience thing.  you'll usually get out of here for a about $12-15/person with a side and a drink.", "Date": "2007-06-30", "Author_Location": "Dublin, CA"}, {"Author": "Marion A.", "ReviewID": "CMoAW3SRI92kBGsmB4kmDg", "Overall": "2.0", "Content": "My husband and I come here for dinner before Sharks games sometimes. He gets the Sharks special; I get the Pineapple Hot Pepper Jack (except for that one time I got chicken nuggets - yucky! never again!). The burgers are good and the prices are decent. Their milkshakes are excellent - we're big fans of the strawberry and the banana  -there are chunks of fresh fruit!It's not a place we go to unless we're downtown for a game. But since we're in the area, looking for dinner, and burgers are burgers (not the overpriced crap they sell at the Tank), Peggy Sue's will have to do.", "Date": "2009-01-09", "Author_Location": "Fremont, CA"}, {"Author": "Brian I.", "ReviewID": "5Fz92jRo0EGUBEBQ_OdjEw", "Overall": "3.0", "Content": "Not a bad place if you're looking for Americana. Food was ok (ordered the avocado burger with fries). Service was friendly and very quick even on a Shark's home game night. Price was good for the meal and you can't beat $5 shark margaritas!My only complaint was that the fries were mostly undercooked.Would I go back again? Probably not given the many choices in the area.", "Date": "2009-03-20", "Author_Location": "Redwood City, CA"}, {"Author": "Dave D.", "ReviewID": "8dIrkOJ7ExOvtkIQRvslPA", "Overall": "2.0", "Content": "A quick lunch for two, especially when taking advantage of happy hour, shouldn't have to cost $17 - especially when all the food is mediocre.If you fix yourself a sandwich or a burger, because you are hungry it doesn't matter if the quality of the food is just okay.  If you go out to eat and all you get is \"just ok\" then you've wasted your time and money.The chicken sandwich I ordered was too salty.  The fries lacked enough salt and really were just \"Meh.\"  The Malt was okay, but nothing to write home about.I wish I had checked Yelp beforehand.", "Date": "2009-12-19", "Author_Location": "San Jose, CA"}, {"Author": "Paul S.", "ReviewID": "yv-WMAa3pOmdHTovrqvqCA", "Overall": "3.0", "Content": "After a fantastic dinner at San Pedro Square Bistro & Wine Bar, I just had to buy a chocolate malt for me and my best girl. She is so keen! One malt, two straws please!They serve up a mean malt here. Thick, creamy, rich. I will say that the service here is difficult to asess since you pretty much serve yourself. The cashier who took my order was very nice though. This place does lose stars since it took 20 minutes to get our malt. Pity.Great stuff to be had, as long as you aren't in a hurry and not expecting exceptional 50's service. If you want that, I know a great place in Greendale, WI...", "Date": "2010-02-14", "Author_Location": "San Jose, CA"}, {"Author": "Gabrielle M.", "ReviewID": "HM4AshkkZ05ndLALPikEYA", "Overall": "2.0", "Content": "I was hungry and I have been to Peggy Sue's a long time ago, like what I was 10. It was good back then.I ordered chicken nuggets and fries and clam chowder. I didn't think it would be top of the line food but I expected better.  The soup was watery and the chicken nuggets tasted like the ones you make at home in the microwave. The only good part of my meal was the fries. I definitely won't eat here again....", "Date": "2010-08-15", "Author_Location": "San Jose, CA"}, {"Author": "Trudy H.", "ReviewID": "B3SRcoIQKElIbypwTYkQBg", "Overall": "4.0", "Content": "Peggy Sue's has that cool 50s feel burger bar thing going on. It really feels like a diner. I ordered the hot wings. They are serious. My sinuses were cleared and my lips began to peel. i really appreciate that in hot wings. I have had hot wings at many places in several states and these were some of the best. Love their fries, plan or garlic ones.My friends that were with me had burgers and enjoyed them as well. The service was good. Only thing is that the drinks were a little flat. The service was good. I will definitely visit again.", "Date": "2010-09-26", "Author_Location": "South Florida metropolitan area, FL"}, {"Author": "Monica W.", "ReviewID": "Yyg2Kqd063GuOm_zNRGCOA", "Overall": "3.0", "Content": "My friend was craving a burger right before the ISA Bay Area show and as you have it, Peggy Sue's was right across the street from where we first found some street parking.  Peggy Sue's can be described as a mix between sports bar and a diner, it's cute, spacious and clean. You place your order at the counter, and despite having a pick up order sign at the counter they brought our food to our table. You fill your own soda, get your own condiments and silverware, and grab your own peperoncini. For a Saturday at 3 PM the place was fairly dead inside for a while.I went with a Peggy Sue burger for $4.50 which is just a regular hamburger and added fries and a drink for an additional $2.55. Burger comes with lettuce, tomato and a package of mayo. I was disappointed that it didn't come with any onions but I added ketchup, mustard, peperoncini, and two types of bbq sauce to my burger to dress it up. In the end, I'd say it was an unremarkable burger which needs extra flavor (and onions). The price for what you get isn't bad, the fries tasted fine but weren't that memorable. Peggy Sue wouldn't be my go-to place for a gourmet monster burger, but if I lived closer it might be my go-to place for a cheap and quick lunch.", "Date": "2011-09-29", "Author_Location": "San Lorenzo, CA"}, {"Author": "Patricia V.", "ReviewID": "haoX4rvrsB3kuIzF_sqvVg", "Overall": "3.0", "Content": "I dipped in here after finishing today's San Jose Rock n Roll 1/2 marathon but while checking out the menu I decided that my stomach wasn't really up for burger and fries. Seems like a cool little place and a flash back to the show 'Happy Days'.Burgers, fries, milkshakesJuke boxCheckered floorLittle round tables with formica tops.Happy people woofin down burgers.", "Date": "2012-10-07", "Author_Location": "Mountain View, CA"}, {"Author": "Glenn S.", "ReviewID": "oiQpgUnm0H70gQltJ7eVag", "Overall": "2.0", "Content": "I was disappointed! Thought this was going to be an old fashion burger, totally opposite. Patty was thin and tasteless and small. Fries were old. Don't think I'll be coming back.", "Date": "2013-07-31", "Author_Location": "Carmichael, CA"}, {"Author": "Julianna M.", "ReviewID": "JDjDc1e9I5JSe2zlEMK-gg", "Overall": "4.0", "Content": "Your typical diner food - burgers, fries, shakes. It's tasty and the drinks are good. I've been here a couple of times and it's exactly what you expect. I've been here when it's busy and quieter, but I felt that service was good and friendly. It's a good staple to have in the middle of San Pedro Square.", "Date": "2013-03-14", "Author_Location": "Campbell, CA"}, {"Author": "Erika M.", "ReviewID": "7XMf7N_3wDBANvtGkpbiAQ", "Overall": "1.0", "Content": "if only I could rate without having to give any stars, I would.went to Peggy Sue's for take out dinner for my husband. Wanted to surprise him with a good burger as he likes. But to my surprise, this place is dull from ambiance to the taste of the food. If you can call that food. It was practically a piece of rubber for meat and the lettuce as if had been sitting in the fridge for ever! There's no way I'm going back there even to ask for my money back.The employees sure make you feel welcome here:( old taste for sure.", "Date": "2008-08-27", "Author_Location": "San Jose, CA"}, {"Author": "Jason T.", "ReviewID": "XI85zdhdfS8Jwfz65HGRdQ", "Overall": "2.0", "Content": "Was there for a Sharks game this past weekend.  Ran short on time so we stopped by Peggy Sues for some quick burgers.  Ordered the Cheeseburger and Philly Cheesteak.  Both were sub par.  Tasted like something you can order at Denny's!Being that there was a Sharks game, 99% of the crowd were Sharks fans.  I assume they'd rather eat here than eat garbage-like concession food at the arena.  With that said, there was absolutely no seating.  Not much I can say that everyone hasn't already pointed out.  Avoid if possible!", "Date": "2008-12-08", "Author_Location": "San Jose, CA"}, {"Author": "James L.", "ReviewID": "AOALHLwagp-vI9XYDvaV0A", "Overall": "4.0", "Content": "Get the breakfast burrito with ham and bacon!!Park on the street if you can find one or just park in the garage right across the street, of course payment is required.Free parking afer 6pm, but then you'll miss out on breakfast time. Manage your time wisely-", "Date": "2009-02-12", "Author_Location": "San Francisco, CA"}, {"Author": "Audrey C.", "ReviewID": "DASK6Dz8QS9GqPO8WYC87g", "Overall": "3.0", "Content": "Why is this place a big deal? It's not flavored too much, the burgers themselves are just okay. I still prefer Foster Freeze down a few blocks from here. Those burgers are the real deal IMO. Its not even like a real diner. You have to stand in line to order. The inside is a looker though, always fun to brows the walls.", "Date": "2009-08-07", "Author_Location": "San Jose, CA"}, {"Author": "Kit K.", "ReviewID": "dPG5mknYNUOXJE64SzN3Sw", "Overall": "2.0", "Content": "OK! I work in downtown San Jose and I'm going to have lots of reviews of restaurants around the area.  Honestly, this place is one of the last places I would want to go eat lunch at.  Every time my co-workers ask me to go to this place. I always reject their offer. The burger is dry and no flavor.  The portion isn't great and the fries are ok.  There is nothing special about this place at all.  It is way over-price for you get here. The only good thing about this place is their shakes.  That is the only reason why I'm giving it a 2 stars.  Other than that, I dislike going there.", "Date": "2010-02-21", "Author_Location": "San Jose, CA"}, {"Author": "Amy D.", "ReviewID": "lX-O3Ga0reAfiO10QQNz1g", "Overall": "3.0", "Content": "I was hoping, with all these great reviews for milkshakes, that they would have real cream and not partially hydrogenated, fake crap on top.  I was pretty turned off and avoided the stuff.The fish and chips (which we had the privilege of paying $2-3 extra for at the bar next door) were decent.  I really enjoyed someone else's garlic fries.", "Date": "2010-12-07", "Author_Location": "San Francisco, CA"}, {"Author": "Gal B.", "ReviewID": "Sf5Mwj9Hve1hUbzFDYZWXg", "Overall": "2.0", "Content": "I was disappointed with the food. Granted, I ordered a veggie burger which can be bland. However, the avocado burger barely had any avocado on it. I could barely taste it. The bun felt store bought. There was a tasteless piece of tomato, and lettuce and no other condiments (a pickle, red onion? And the fries were not good. Its hard to screw that up! I do have to say the milkshake and service was good. But we both wished we went to in n out instead, and won't be back.", "Date": "2011-07-22", "Author_Location": "San Jose, CA"}, {"Author": "Emily P.", "ReviewID": "CblVlkWmdRf1OvZp0C0vvQ", "Overall": "2.0", "Content": "First I would like to say is that I LOVE PEGGY SUE'S!!! If you read My Reviews on the other Peggy Sue's location on Park you can see how much I love Peggy Sue's! BUT....this Peggy Sue's is totally different. Both Peggy Sue's locations are different owners and they have the same menu but make their food totally different!!! As you see the reviews on this location aren't great, PLEASE try other location! That place is yummy!", "Date": "2013-05-02", "Author_Location": "San Jose, CA"}, {"Author": "Monica B.", "ReviewID": "zJWEuomk0JRk6N923sqREQ", "Overall": "2.0", "Content": "This place is sort of a ritual before seeing shows at AMTSJ.  Since we come from the North Bay to see the shows after work, we rarely have time for a long sit-down meal, therefore Peggy Sue's delicious fried foods have been what hits the spot. Items on our favorite list include their Fish and Chips and Chicken Tenders (always fresh) curly fries, onion rings, garlic fries, and gardenburgers. Food has always been terrific and therefore not the cause of the low rating.Last night, we ordered the following:Kids Meal Grilled Cheese Sandwich with Curly FriesChicken StripsAnd it took FORTY MINUTES TO GET OUR ORDER. After the 15 minutes of waiting in line! Meaning, from the time we walked in the door to the time we got our food was an hour. For glorified fast food. Since we were forced to ask for to-go boxes when we picked up our food because at that point we had 10 minutes before the show and still had to pick up our tickets, it is doubtful that we will EVER come here again before the shows. Come here only if you have all the time in the world, not if you're going to a show at AMTSJ.", "Date": "2008-06-11", "Author_Location": "Marin County, CA"}, {"Author": "David H.", "ReviewID": "NQRS7JlG7vWfwGNrkMu6IA", "Overall": "3.0", "Content": "Ordinary and decent diner fare with reasonable price without the typical diner services that you can expect from the North East.I came here a few times during lunch because its very close to where I work.  Almost always, I order the lunch combo (burger of your choice, curly fries, and a drink) for $7.99 plus tax.  Since its self served here, I have not paid tips, and almost always have it to go and eat at the couple out door seatings.Only once did the casher asked me how I want the meat cooked.  But then again, who cares in a diner, because how often do doness come out the way you want for a burger this in-expensive.I do like their bacon, as its thick and crispy.  But, I am very certain that the bacon have been prepared long before I arrived.Although I do frequent this place, it did not make it as a \"destination\" for me.  It is just a fairly inexpensive and fairly quick place to fill my stomac during working hours.Parking can be a drag, but if you work close by, this place could be for you.", "Date": "2009-04-08", "Author_Location": "San Jose, CA"}, {"Author": "Jeff G.", "ReviewID": "AxKoNqtMLO6F40CfvP6vAw", "Overall": "4.0", "Content": "Excellent condiment bar, good selection of burgers and solid fries. Haven't had a bad dining experience at either location in about a dozen trips. Plus they recently started serving a buck-fifty pint. So, really, why the long faces yelp?", "Date": "2009-06-22", "Author_Location": "San Jose, CA"}, {"Author": "Joel E.", "ReviewID": "SycOI1RG8GZT0EXAE-328g", "Overall": "1.0", "Content": "Closed on Black Friday. Nothing on their website. Nothing on their front door, other than a standard \"Closed\" sign, next to the posted hours, which indicated that they were open from 9 a.m. till midnight. It looked perfectly normal for 7 a.m., except it was 11:45 a.m.All the neighboring restaurants were open. Was going to use a Groupon. Now will hope Groupon will issue a refund.", "Date": "2011-11-25", "Author_Location": "San Jose, CA"}, {"Author": "Bonnie S.", "ReviewID": "gMRpo5fLvwVDkqLI99XPpg", "Overall": "4.0", "Content": "FOOD:I got their Hollywood (avocado) burger and a banana milkshake. OK burger... BEST milkshake I've ever had! They use fresh bananas and leave tiny chunks unblended, which is nice cause it makes the shake taste really fresh. SERVICE:We went here last Saturday around lunch and the place was really empty. We were literally the only two people in the restaurant, and keep in mind this is during lunch time. There was no greeter to hand out menus or seat us, so we just went to the front to order. Waitress was friendly when she brought out the food and the food came fast though.", "Date": "2012-02-15", "Author_Location": "San Jose, CA"}, {"Author": "Justin B.", "ReviewID": "SQwMPVFAgZRyQxbqxXxsyA", "Overall": "3.0", "Content": "Peggy Sue's is your typical All-American diner.  If you set your expectations too high or else you might be disappointed, but if you're looking for a quick meal you might be fine with what you get from this place.", "Date": "2013-04-11", "Author_Location": "Seattle, WA"}, {"Author": "Samson W.", "ReviewID": "OG5sgOwv9sxiw6966_tOFg", "Overall": "4.0", "Content": "I finally had an opportunity to eat at the original location last Saturday as my friend suggested meeting at this place.  It was definitely daunting for me as there were so many good choices on the menu.  I finally decided on a pineapple bacon burger, which was pretty good.  Will not say that it is the best.  But then, it's not the worse either. I know from the past that they used to have a larger menu with both unusual names and funny names for their burgers and sandwiches.  They have since taken that out.I didn't try their shakes as I heard good things about it.  I might try it the next time that I go there.", "Date": "2008-06-26", "Author_Location": "Milpitas, CA"}, {"Author": "Joel M.", "ReviewID": "liDMMGpVEq2tMxNdyQhKvw", "Overall": "3.0", "Content": "Food is okay....not great, not nearly as bad as some have said.  I will agree burgers lack a certain something, but fries and shakes are good.  I like the condiment bar.   Gets fairly busy around lunch time.  Not a bad place to go if you work in the area and are tired of Togo's, Subway, etc, but don't want to spend a lot either.  Actually, the thing I like best on the menu is the Chili Cheese Fries.  You get that with a drink and your total is $6.66.  Eerie.", "Date": "2009-06-11", "Author_Location": "Stillwater, OK"}, {"Author": "RaeAnne H.", "ReviewID": "aLoVzrL0NxdYNtBwAs127w", "Overall": "5.0", "Content": "It's pretty upsetting when I read over the less than 3 start reviews. I think people are missing the magic of this restaraunt.  It is located in an almost perfect area that is family friendly and also caters to the needs of the party animals and bar-hoppers of san jose.  The prices are perfect for the food you get and recently the owners have made some major changes, most specifically the burger.  the burgers are now larger, seasoned and marinated for your taste buds pleasure.They offer a happy hour menu which is the longest happy hour I've ever seen! 3-7! thats four hours to get cheap food and drinks.Not to mention the full bar and the awesome bar tender they have on duty, who comes up with the most creative and well priced drinks you couldthink of.Peggy sues is the perfect late night spot to hang out at and to sober up. It has the best food on the block and i would chose it over disgusting la victoria's any day.it's really stupid when people complain about the service since it is obviously a self serve diner.  The cashiers are not paid to bring you their food and yet they always do unless its a busy sharks night.this place rocks and is one of the last honest and worthy places to eat in downtown san jose.", "Date": "2010-02-28", "Author_Location": "San Jose, CA"}, {"Author": "Tedd F.", "ReviewID": "csUX_Qpff44palko4Q90mQ", "Overall": "1.0", "Content": "Horrible horrible horrible!We ordered 2 burger sans bun and a large fries to share.   The burgers came out burnt and just that... a burger.  No lettuce no toppings (we were not even asked is we wanted any).  Just a big plate and a burnt small slab of meat.  The fries were old and cold.  We have to ask twice for silverware.  A total waste of $20.... yes $20!!!!!!!!!  For shit food.  AVOID even if you are desperate for food and they are the only place open.", "Date": "2011-09-17", "Author_Location": "San Jose, CA"}, {"Author": "Brad F.", "ReviewID": "FfTmuLiuwGVfeWBSWDtJaw", "Overall": "2.0", "Content": "This place serves what i would call a \"lazy burger.\"  A lazy burger that gives up and collects welfare from the state rather than picking itself up by the bootstraps and making something worthwhile of itself.  it didn't taste terrible per se, but it had that vague \"elementary school cafeteria\" texture to it.  it's like that scene with Michael Douglas in Falling Down where he goes into \"Whammy Burger\" and says \"now, look at this sorry, miserable, squashed thing\"  when comparing to what he received vs. what's advertised.   Yea, this burger was kind of like that.The tomato and lettuce that weren't all that fresh, and the condiments bar could also be described as \"lacking in motivation and initiative\" as well.  I threw half the salad away.... it was kind of 'clammy'The ambiance is neat if you're into the nostalgic thing:  big screen tv's, movie posters from America's better days gone by, etc.   But that's about it.", "Date": "2013-07-25", "Author_Location": "Hayward, CA"}, {"Author": "Seth H.", "ReviewID": "f4XUPES-pWz2-UefYTrt7Q", "Overall": "5.0", "Content": "You can't fault Peggy Sue's for being what they claim to be.  They are a cheap eats restaurant.  Cheap burgers, cheap fries and super cheap drinks (especially on Sharks game nights with 32oz $7 beers and monster $10 margaritas).Is the food high quality?  Certainly not but then why are you here anyway?  I loved that I could put what I wanted on my burger and it was ready almost before I sat down.  You also can't beat a mostly empty restaurant even on game day.", "Date": "2012-08-20", "Author_Location": "San Jose, CA"}, {"Author": "Sarah P.", "ReviewID": "4aC6Ma3xqfUfNEA5ndiiQw", "Overall": "1.0", "Content": "this place is not a good breakfast place.the pancakes were so thick it was unbelievable, the chicken fried steak is inedible and the burgers are ok.I would just never go back to this place", "Date": "2014-01-23", "Author_Location": "Fortuna, CA"}, {"Author": "Xiomara R.", "ReviewID": "Gn49ZPZ9nv3PGVVSyP8HBw", "Overall": "3.0", "Content": "So I haven't been here since for ever! The menu changed I'm not sure for the best. I was really craving this steak sandwich they used to have and when I went in they didn't have it. =[ But! they did have a delish Peanut BUTTER and BANANA Milk SHAKE which i gobbled down......", "Date": "2012-07-31", "Author_Location": "San Jose, CA"}, {"Author": "Tony C.", "ReviewID": "Oa7LlR_0NkAFqibxnENGJQ", "Overall": "3.0", "Content": "I like going to this place before Sharks games.  The burgers here are good but a bit on the expensive side for burgers.  The fries I usually skip because there is nothing great about them. I mainly come here for milkshakes.  They give you a large portion for your milkshake, a large glass and a bit under half of the large metal mixer they mixed it in.  It is totally filling in and of itself.  If you have a small appetitie just skip the burger and go for the milkshake.  Skip the chicken nuggets, they look like the ones you buy from the grocery store and heat up in the microwave.  They have 3 LCD tvs on the wall and I like all the sports and history memorabilia on the walls.  Its a great place to lounge around before or after games.Come here for the milkshakes or to hang out with fellow Shark fans.  If you want good cheap burgers, go somewhere else.", "Date": "2007-06-20", "Author_Location": "San Jose, CA"}, {"Author": "Chris L.", "ReviewID": "ep5H6qpcvrKHKEKbo0AKiA", "Overall": "1.0", "Content": "Burger meat was flat, tough, and tasted of salt. Only received 4 small onion rings. Chocolate shake was just vanilla sixty serve with chocolate syrup. Would rather have gone to Wendys.", "Date": "2013-05-25", "Author_Location": "Pacifica, CA"}, {"Author": "Frank c.", "ReviewID": "MpDFA_kOoBjKuyJsGdfUmA", "Overall": "4.0", "Content": "double cheeseburger awesome going back again today, in a word : delish!!the employees are casual and helpful. most importantly they have JAMO!!", "Date": "2013-07-11", "Author_Location": "San Jose, CA"}, {"Author": "Robert P.", "ReviewID": "0QMp3SbKgIKJd41NoBuGKA", "Overall": "5.0", "Content": "Burger was delicious!", "Date": "2013-05-08", "Author_Location": "Fresno, CA"}, {"Author": "Manish P.", "ReviewID": "p13roz5RQhmLMj7xa6PdDw", "Overall": "2.0", "Content": "Food is overpriced, portions are small and they get your orders wrong!There are other options VERY close to this place ... no need to go this place.One of the Yelp survey questions is \"This place is Good For\"? I would like to say \"Nothing\"!", "Date": "2013-05-20", "Author_Location": "Santa Clara, CA"}, {"Author": "Eric L.", "ReviewID": "xVJ8L7kJ2JJGMYt7ohWmjQ", "Overall": "3.0", "Content": "I find out about this restaurant online. According to MSN, this place is the BEST Burger Joint in Silicon Valley, so I gave it a shot. The burgers are average, the patties where small and.... Yea, it was JUST average. Honestly, I would rather go to an In-and-Out for better burgers, but at least I got to experience a 50s diner in the 21st century! WOW", "Date": "2007-09-17", "Author_Location": "San Jose, CA"}, {"Author": "Swiftly T.", "ReviewID": "zEGDc5mRJvhNHm7i5bHHvw", "Overall": "1.0", "Content": "I got a veggie burger and it was dry as hell with nothing but a piece of lettuce and a tomato on a bun they probably bought at safeway last week.I remember this place being better but haven't been in a long time.  I won't be going back", "Date": "2013-04-21", "Author_Location": "San Jose, CA"}, {"Author": "Supreet S.", "ReviewID": "olX_OQZ2HoTrWiM3D8RkGw", "Overall": "2.0", "Content": "A few of us came upon this place in the evening.  We were not impressed with this place to say the least.  I did not have any expectations.  The burgers and fries were tasteless (the quality of their patty's were as terrible as it gets).  We ordered shakes with our meal and they happen to bring out an extra one and charge us for it! We tried to argue for a refund on that shake but no such luck.  It is basically an old fashioned American diner with an Indian owner, which never goes over well.  On top of the poor service we found the food to be overpriced.  if you love greasy, over priced, no flavor burgers and sandwiches than this place, my friend, is the place for you! I will not be paying a second visit to this establishment.", "Date": "2013-05-07", "Author_Location": "San Jose, CA"}, {"Author": "nelle a.", "ReviewID": "fl4UwK_yAWxXQ5-bCaQ8GQ", "Overall": "1.0", "Content": "whoa peggy sue!...you sure do serves grody breakfast plates....i was totally fizzled.having a small glass of orange juice and a cup of coffee included with my vegetarian omelette won't make my plate appetizing...you know why?...your hash brown was disgusting! you're not suppose to boil the potatoes and put big chunks of green peppers with it!!!..what was that all about?...maybe you're trying to make a \"exclusive\" hash brown?..well, you better not name it hash brown...it's more like a potato salad sans the mayo.also, my omelette was distasteful!...why did you use monterey jack cheesse instead of the usual american cheddar cheese that a typical diner usesthe hamburger with bacon & swiss cheese was below average. the curly fries that went with it had a taste of \"old oil.\"what a disaster meal we had!...and there you are,  you got married with your high school sweetheart charlie....i wonder what he will do if he found out you don't know how to cook.", "Date": "2007-09-10", "Author_Location": "Burlingame, CA"}, {"Author": "Jen C.", "ReviewID": "6UETbuxQaLMBzo8NRGGOFA", "Overall": "5.0", "Content": "I LOVE Peggy Sue's in downtown!!I don't understand why they're getting low reviews!!  What's with the hate?? The ambience is great, the food is excellent, the $2 beer on tap is freakin' awesome!! The owners are cool and friendly. I will keep coming here as long as I live in San Jose! :D", "Date": "2010-12-27", "Author_Location": "San Jose, CA"}, {"Author": "Narelle P.", "ReviewID": "APPmyOMeQASyuiv1K6K1Wg", "Overall": "5.0", "Content": "my friend works there. always nice to see him putting it down for pegy sue's. I've been going there since i was a kid! love the location... this peggy sues is #1 in my book. the other one is ok....Cant wait to take my kids there... oh wait!... yes i can XD", "Date": "2012-08-15", "Author_Location": "San Jose, CA"}, {"Author": "jenn w.", "ReviewID": "5g0SVU8CdcM9WDL_PmIdGQ", "Overall": "3.0", "Content": "I really don't want to write about how this is an awesome place for pre-drinking before Sharks games because there just aren't enough tables.  Make sure you go early so you can grab a table, or while you are ordering, have your friends keep their eyes out for people leaving.  The beers are super cheap since you can get a 32oz for $7.  Or, you can get the crazy Shark tank cocktail that comes in a giant goblet for $10.  Because of the cheap drinks, it really is no surprise that a lot of people come here before events.  The food is not the greatest but it is decent and adequate.", "Date": "2012-01-06", "Author_Location": "San Jose, CA"}, {"Author": "Sdmomma R.", "ReviewID": "YrWYdgRiKe4YYEw-H9QFJw", "Overall": "1.0", "Content": "If you love greasy ass, over priced, no flavor burgers and chicken sandwiches than this place my friend is the place for you! Yuck! Can't believe I spent my money on this nasty ass food. Will not be coming here  ever again!", "Date": "2013-04-23", "Author_Location": "San Jose, CA"}, {"Author": "Tiff T.", "ReviewID": "rGKmBMXuu237VAPgenU7lw", "Overall": "4.0", "Content": "The hamburgers and fries served at Peggy Sue's are better than most places because it's not too greasy.  I usually order from the children's menu because I can't finish the regular sizes.  I like the \"Porky Pig\" and hot dogs.  The wait for the food can be long, but you can people watch on the patio or look at all the sports and other weird memorabilia on the walls while you're waiting.", "Date": "2006-01-31", "Author_Location": "Bellevue, WA"}, {"Author": "Laurie B.", "ReviewID": "jl__9KbV08NeEJ1gUtGMaA", "Overall": "1.0", "Content": "New Management = Cheap, Corner-cutting quality!  I've been dining here off and on since the late 90's and it used to be a great place. Just came in with a coupon that was still valid, but the miserly manager said they changed management recently and won't honor them. Lame. Why not instill customer loyalty in a rough economy and continue to honor the coupons? I would have gotten over the coupon issue if the food were still good.  No luck there.  My burger was over pressed, dry, and mealy.  I could have gone to McDonald's and the burger would have been a little better for a lot less.  The fries were also anemic - thin, barely any potato to them.So sad, this place used to have juicy burgers, thick fries, and better service.Last time we're coming here before they start charging for napkins!", "Date": "2012-06-03", "Author_Location": "San Jose, CA"}, {"Author": "Jason G.", "ReviewID": "exAa8c0XB4wmREHUST7mEg", "Overall": "1.0", "Content": "I've been coming to Peggy sues for over 15 years, mainly on SJ Sharks game night.  $32.58 for 2 \"Sharks specials\" (burger and fries with soda). They are officially over priced and won't see my dad and I again.", "Date": "2013-12-21", "Author_Location": "Hyde Park, Cincinnati, OH"}, {"Author": "Karen T.", "ReviewID": "QJtv46LGksa5QCgfiXSw2w", "Overall": "3.0", "Content": "in 'n out will still be number 1 in my heart when it comes to cheap and easy [that's what she said!!! kidding.  no, not really.] burgers, but this place is okay too, at least whenever i'm in downtown sj.  it's kitschy like mel's diner in sf and kind of like johnny rocketts, but not as expensive and a little less clean.  so... basically it's just okay.during my most recent visit i had the jack pepper hot cheeseburger, or something like that.  basically it supposedly had peppers and pepperjack cheese with bacon.  om nom nom.  bacon.  i friggin' love bacon.  the thick cut, the grease, oh, how my thighs would respond if i decided to go with a bacon filled diet!  ANYHOW, the burger itself was decent, nothing too special.  couldn't really taste the jackpepper or the slight kick that peppers usually have, but maybe i'm just used to spicier things.their garlic fries were good, but for the three or four dollars that they charged for it, i felt like they could have given us some more [maybe i am just greedy].if you're looking for an inexpensive place to go have lunch at- this could definitely be the spot.  just don't set the bar too high.", "Date": "2009-06-04", "Author_Location": "Cupertino, CA"}, {"Author": "Devon H.", "ReviewID": "ST8Mdl-ruXtao-Z7O-smJA", "Overall": "1.0", "Content": "The faux 50's sock-hop theme is tasteless and uninispired -- as is their food.", "Date": "2009-02-16", "Author_Location": "San Jose, CA"}, {"Author": "grey h.", "ReviewID": "FRB5Rs-MwGaf6h8zlAFClA", "Overall": "1.0", "Content": "Sooo its been a Long time since high school,  the time when everyone I knew who had come here had raved about it.  Unfortunately I never had the opportunity to stop by until now,  and I didn't bother reading the reviews because I qanted to try it based on here-say and not be biased.... I now wish I ate It back then so I can at least say what it was better than.  Honestly dissapointed in price for flavor point-WaYY OVERPRICED FOR LOW QUALITY-the patty was sooo blehhhhh and sure its customizable,  but u have to have a good base for it to get bettwr with toppings right? I was starving when I got here and bases on the fact that It couldn't appeal to my taste buds is just sad... The garlic fries only have garlic powder.... Not real garlic booooo.. The only tasty thing was shake and it was overpriced too...", "Date": "2013-10-17", "Author_Location": "San Diego, CA"}, {"Author": "Flo P.", "ReviewID": "FI115g7eJm43uPozQbJZdg", "Overall": "1.0", "Content": "Food is not good. Beer is not cheap. Service is bad", "Date": "2013-12-12", "Author_Location": "Downtown, San Jose, CA"}, {"Author": "Yvonne C.", "ReviewID": "s1_use8Z0gSCID9yp097rg", "Overall": "3.0", "Content": "Peggy Sue's is one of my favorite breakfast spots. For $3.25, you get a HUGE breakfast burrito filled with bacon, fluffy eggs, potatoes, and cheddar cheese that is big enough to feed 2 people. Another good deal is the $5.95 breakfast menu which features dishes like omelette's, pancakes, french toast, chorizo, and your typical bacon or sausage and eggs. What's nice is that coffee, juice, hash browns, and toast are all included with your meal, so it's an excellent value. Peggy Sue's makes a wonderful chocolate shake and feature a variety of tasty burgers. There is something for every body on their menu.", "Date": "2006-09-14", "Author_Location": "San Jose, CA"}, {"Author": "Tim W.", "ReviewID": "4Mn6ZU0HesypF6LC6ttB_w", "Overall": "5.0", "Content": "The staff has always been friendly to me and the food has always been delicious. The music is perfect for the vibe they are going for and it feels like a 50s diner (thought I can't say that I was alive in the 1950s). They do have slightly high priced burgers, but the ambiance is worth it. I really want to try their milkshakes next time I go!", "Date": "2013-01-27", "Author_Location": "San Jose, CA"}, {"Author": "Rich M.", "ReviewID": "ijwN3U1JIFmQHL07vY3yXA", "Overall": "2.0", "Content": "Absolutely the worst hamburger in my life. Dry, tasteless, could not  even finish it. Chocolate shake was excellent as were the curly fries, so gave them the second star. Place was completely empty. I snuck out before I could be asked how my meal was...but no worries, no one every checked on me.", "Date": "2012-09-09", "Author_Location": "Medford, OR"}, {"Author": "Lisa S.", "ReviewID": "8Qhhr37AA6092WvMWZDJTg", "Overall": "2.0", "Content": "The burger tasted burnt and flavorless. I would much rather eat at In N Out Burger and pay half the price. The fries tasted as if they were cooked in fish oil. This place used to be okay but has really went downhill lately.", "Date": "2012-02-27", "Author_Location": "San Jose, CA"}, {"Author": "Jonathon J.", "ReviewID": "CdbBN4dd5khLAE18oZaIbw", "Overall": "5.0", "Content": "The burgers here are incredible.  I live in Foster City and the drive to Peggy Sue's is worth it.  The fries are fresh and the milkshakes are out of this world.  Still, both only come in second to the burgers.", "Date": "2006-07-10", "Author_Location": "Foster City, CA"}, {"Author": "C M.", "ReviewID": "kLeJB4Zg24yEebm8Trv-9w", "Overall": "1.0", "Content": "Raised their prices again. Seriously? This place is a bankruptcy just waiting to happen.  What did I get for a breakfast burrito that now costs $1.02 more?  Crap that was inedible. I took a few bites and the eggs were so overcooked I just could not eat that garbage. What kind of moron can't scramble eggs?", "Date": "2013-11-01", "Author_Location": "Santa Clara, CA"}, {"Author": "Amber M.", "ReviewID": "ophkBFwPE2M_042BCnqgXg", "Overall": "3.0", "Content": "Was in the mood for a burger so thought we would give this a try.  Burgers are bit but a little dry.  Maybe that they are precooked and warmed up or just over cooked. Service is friendly.  Old time Dinner feel.", "Date": "2012-11-08", "Author_Location": "Santa Clara, CA"}, {"Author": "Kim T.", "ReviewID": "CTnnknpY21YuFaA1agDMyQ", "Overall": "3.0", "Content": "Great Before a San Jose Sharks Game for a Sharks Tank. You'll be happy you did it! Ive also had the San Jose Chicken sandwich i believe it was called. It was really good. I mainly go for the Tanks!!", "Date": "2011-12-19", "Author_Location": "San Jose, CA"}, {"Author": "Grant S.", "ReviewID": "XPsa8Y0QLbF0a_nAkr_weQ", "Overall": "1.0", "Content": "Not bad good, but over priced for frozen patties.... Customer service was garbage,....", "Date": "2012-10-23", "Author_Location": "San Jose, CA"}, {"Author": "Vicky T.", "ReviewID": "KDwleBeaSMqBl-91RrrhrA", "Overall": "2.0", "Content": "The combinations have great names, and they have some classic burger combos, as well as some combos to rep the sharks (hat trick combos). The place is your usual 1950s diner-esque type place. The portions are not anything fabulous, and the burgers do not stand out in any sort of way. Their fries are yummy (krinkle cuts) and their onion rings are pretty cheap (1.50 or something like that for a small-- which is enough for one person).  Reasonably clean, reasonable service, and lots of San Jose's finest (the sign of a decent diner: swarming with po-po). I might go here after going to the San Pedro theatre-- but not going out of my way to come here every time I am in San Jose.", "Date": "2007-02-19", "Author_Location": "Santa Cruz, CA"}, {"Author": "Cheri M.", "ReviewID": "ZaYrfAVPjoAv1J65jGA35g", "Overall": "4.0", "Content": "I love diners. I love bugers, fries and shakes so this place is right up my alley. Stopped here today with the BF after meeting a client. It was slow (around 4pm on a Thurs). The 50s decor is cute and I really liked the old newspapers. It's a lot of self service. They have a huge menu and you go up to the register and order your food & pay. I got a burger w/ jack cheese and avocado, curly fries and a strawberry shake. The BF got the peggy sue cheeseburger w/ curly fries. You get your own sodas and condiments at the little condiment bar (pickles, peppers, mayo, ranch..) ketchup and mustard is on the table. The guy who took our order was extremely nice and when the food was done he actually brought it out to our table. The milkshake was BIG and pretty tasty I prob won't do the strawberry again cuz it's got the strawberry chunks in it and they freak me out. I don't get strawberry yogurt because the chunks freak me out.. others may enjoy this but I dont. It was really good though despite the chunks. The burger was a little small but it was GOOD. The burgers are a little pricey so they should probably give you a little more bang for your buck. The curly fries were bomb. They have happy hour here too and the menu looked pretty good but we didn't get anything. Maybe next time.If in the area we would come back. Also parking was very convenient right next to the place and across the street.", "Date": "2010-02-04", "Author_Location": "Campbell, CA"}, {"Author": "Crystal V.", "ReviewID": "tKRvtVHtF36ly88M1ChfbQ", "Overall": "4.0", "Content": "Great food and shakes. I don't eat burgers so I can't describe them to you, but the hot dogs are good, shakes are AMAZING, fries are mediocre, and the decor and vibe are what you \"half\" come for here. Great for families? Kid dates, mom/dad date with kid(s), great for dates, especially if they're before or after a Sharks game!!! There is a soda fountain so free refills. Since this is a downtown city, free refills are lucky to come by. (won't see that in the city!!) so great place to come to. While you wait for your food check out the decor and teach your kid or date somethin'!!!", "Date": "2011-08-22", "Author_Location": "San Jose, CA"}, {"Author": "Frank D.", "ReviewID": "IP6xcqrDAurOQWegI6GTKQ", "Overall": "1.0", "Content": "The worst burger I have ever had, thiner then BK, dry and hard, the buns ware dry and tasted like they ware at least from yesterday, you would expect from a place that specializes in burgers to be better then the fast food chains,The one star is for the seats and the restrooms, at least you can seat down or use the restrooms...", "Date": "2013-01-31", "Author_Location": "Daly City, CA"}, {"Author": "mel w.", "ReviewID": "NrYFp-QMnVZqGFwd5rjqSw", "Overall": "1.0", "Content": "Extremely disappointed!!!  I've been going to Peggy Sue's for a long time and I will never go back.  I don't know if they're under new management or tight on cash...  But the burger was worse than a week old McDonald's burger!!!  Definitely not worth $6..  A plate of 17 fries for $4. 79!! I have always ordered the little bopper (now the little cheeseburger) and I ordered it today and the guy was like Ok cool...  Then when the food came out there were no fries..  I asked the girl where the fries were and she went to ask someone...  Then she came back and said that meal is only for 12 and under..  WTF?!?!  I've been ordering that meal forever!  The malt was not very malty and not mixed well at all.  Overall I will never recommend or come back here.  This used to be my go to place before sharks games..  RIP Peggy Sue's.", "Date": "2013-09-21", "Author_Location": "Sacramento, CA"}, {"Author": "Adrienne H.", "ReviewID": "itXca5eDPdyF6sx5NTpnMw", "Overall": "3.0", "Content": "It was 'OK'. I mean, personally, Sliders Burgers on Leigh and San Carlos is WAY better, but if you are downtown and you are craving a burger, than this is the place for you. I didn't eat any fries, but I did LOVE their malt shakes.", "Date": "2007-10-19", "Author_Location": "San Martin, CA"}, {"Author": "Jay S.", "ReviewID": "RUFPMonrW_bestxbWEHKew", "Overall": "3.0", "Content": "My kids and I always go to Peggy Sue's after we see a show at the Center for the Performing Arts. The food is decent but not spectacular. They have really good milkshakes and floats. Lately , we've been sticking to the fries and shakes just because we know that they can't possible mess those up. Definitely stay away from their restrooms because they are disgusting!!", "Date": "2008-03-16", "Author_Location": "Bay Area"}, {"Author": "Angela H.", "ReviewID": "yLSReaBcbM2bk2-NQD7kqg", "Overall": "3.0", "Content": "I basically needed to eat something. My well-done burger was cooked medium, but I didn't have the foresight to care. The shakes looked amazing. Fries were good -- curley fries, at least. Open past one.", "Date": "2009-06-08", "Author_Location": "San Mateo, CA"}, {"Author": "Bryan L.", "ReviewID": "BsUIDtkNDpfT7-ATHaRPbQ", "Overall": "2.0", "Content": "Eh, my Cousin and I went here before a Sharks game the other night.  Seating sucks on game days.  Food is overpriced and no better than school cafeteria quality in my opinion.", "Date": "2010-01-07", "Author_Location": "Hollister, CA"}, {"Author": "Leilani N.", "ReviewID": "NdhB-Z1kQTu0G8Vr85rASA", "Overall": "3.0", "Content": "To be honest, the fries aren't that great and the buffalo wings are way too salty. But, considering the options downtown, I'd rather eat here than most places. Things are decently priced, they offer alcohol, they have TVs to put up any games that are going on, and they have friendly service. It's a pretty standard, but consistent place.", "Date": "2010-06-18", "Author_Location": "San Jose, CA"}, {"Author": "Joanne S.", "ReviewID": "tp0BUeYy9pQUopO53POUJQ", "Overall": "3.0", "Content": "I used to frequent Peggy Sue's back in my college days.  I thought their food was the ish..but I was a poor college student and my food standards were a lot lower back then (i.e. Olive Garden was considered \"fancy dining\").I've been back a few times this year and, surprisingly, I still find their food pretty good.I'm not a beef eater, so I'm glad that they have some non-beef options.  Their regular turkey burger is just ok, but I ordered the turkey patty on a patty melt and it was really good.  It had just the right amount of grilled onions, melted Swiss cheese and mustard and the rye bread was grilled.  The turkey patty was juicy too!  One thing that I didn't like was that the cashier didn't inform us that substituting the turkey patty would be an additional $1.50.  Also, they charge extra if you want your onions grilled on a normally non-grilled onion burger.  I guess times are hard all around...so whatever.This is a good place for a quick bite if you're on your way to a Sharks game or concert at HP Pavilion.  It's conveniently located across the street from a big parking garage that's walking distance to the Pavilion.", "Date": "2010-10-06", "Author_Location": "San Jose, CA"}, {"Author": "C B.", "ReviewID": "f2iN_ZGWUXF_NYvMZjVpqQ", "Overall": "1.0", "Content": "Breakfast's are good, burgers are tasteless.", "Date": "2013-01-15", "Author_Location": "Sunnyvale, CA"}, {"Author": "Andrea B.", "ReviewID": "nIIdmCBWfCt5eYZHFnW5RA", "Overall": "2.0", "Content": "I give it a 2 star because the cashier was nice. I bought a large fry for$4.99 it was so small like a Mac Donald's kid fries. I asked the server if this was a large fry.  Just  in case they gave me the wrong order , he said yes this is a large fry. The hamburger tasted like cheap frozen meet it was not juicy at all. I think the owner is trying to cut cost. For two hamburger one soda and a banana split $30.00. It was not worth it and I will not be back.", "Date": "2013-10-08", "Author_Location": "Fremont, CA"}, {"Author": "Alexandra R.", "ReviewID": "50iCh0LN-_lO1334jR0c3A", "Overall": "3.0", "Content": "I came across this place because it across the street and around the corner from where i work (the tech museum!). i had heard good things about it from my coworkers but have to admit i was a little disapointed. I ordered a cheesburger, fries and a drink. Not too difficult right? well, they took forever to make it. the portions were rather small for the price and it was a very dead atmosphere. the only reason I eat there sometimes is because its so close to the tech. besides that, i wouldn't eat there.", "Date": "2007-11-29", "Author_Location": "San Leandro, CA"}, {"Author": "Scott A.", "ReviewID": "QlWd--IoH1yeE7kCDmWE0w", "Overall": "3.0", "Content": "Peggy Sue's is a good place to go before heading to the HP Pavilion to see the Sharks play. It can be hard to get a table sometimes, and you'll have to sit at a dirty one and flag the busser down to have them clean it. The burgers are pretty standard. They used to have names for each burger, but now I think they've gotten rid of that. The banana milkshakes are good too!", "Date": "2008-02-13", "Author_Location": "Fremont, CA"}, {"Author": "Katelyn A.", "ReviewID": "VHGYelIrVaU7BPxXAQJ4lg", "Overall": "2.0", "Content": "I think most of the food here is pretty standard.  I don't know why, out of all the places to eat downtown, someone would eat here.  The breakfast is decent, but the burgers and other entree items are merely a way to make yourself not hungry.  I will admit that the shakes here are pretty good.", "Date": "2008-07-18", "Author_Location": "San Jose, CA"}, {"Author": "Darren M.", "ReviewID": "0ULS7WmtfdLPIh8BU99NKw", "Overall": "1.0", "Content": "Ew this place is disgusting! It's basically just Johnny Rocket's with a different name and I really cannot stand it. I've had to go here a couple of times with friends and every time I cringe at the thought of their food as I walk into their dirty restaurant. Not to mention the bathrooms are always messy and the employees are pretty careless. AVOID!", "Date": "2009-02-14", "Author_Location": "San Jose, CA"}, {"Author": "Jackie J.", "ReviewID": "SXChO9rBOktwQdTZR43GCg", "Overall": "3.0", "Content": "I don't go to Peggy Sue's often but I think the food is pretty decent. I usually get the burgers and fries. There's parking across the street at the garage and it's walking distance to multiple places (clubs & HP).", "Date": "2009-12-31", "Author_Location": "Santa Clara, CA"}, {"Author": "H. L. L.", "ReviewID": "wpUbCMVXhBwpLt2oVwnYlA", "Overall": "3.0", "Content": "I personally like Peggy Sues but their prices just don't justify me coming here more than once a quarter, not because they're steep but not how much I would want to pay on the daily for burgers or fries.  Was really disappointed because I had planned on going to Scott's Seafood and didn't realize they didn't open lunch time on weekends...dumb. Oh well.Ordered: 1) Great Balls of Fire $5.95 - Angus burger with one big grilled pepper, cheese and jalapeno sauce.  This was good but it wasn't spicy the way I would expect it to be spicy considering how it's called \"Great Balls of Fire\" but it was good.  I had to add some jalapenos as well as tabasco sauce but whatever.  2) Chicken Wings (Spicy wings on a bed of fries) $5.95 -  The wings had a LOT of sauce and DEFINITELY had a good kick to it though I do remember getting a lot more wings when I went a few months back. We also replaced reg fries with garlic fries for an extra $1 or something? Still didn't taste much like \"garlic\" fries.3) Curly Fries $3.25 - I liked it.  It was perfectly crispy and rather large in size but they're still curly fries :)We went away with a lot of sauce to go with it and I enjoyed every bit of it despite the price I paid.  The service was fast and prompt.AND they validate parking! Definitely a plus!I will come back.", "Date": "2010-03-01", "Author_Location": "San Jose, CA"}, {"Author": "Lynda T.", "ReviewID": "PC_ZD7ZBOuIwdOXrpMMGXg", "Overall": "2.0", "Content": "... came here with my honey.. It was good, but fries were soggy and cold.", "Date": "2010-07-13", "Author_Location": "San Jose, CA"}, {"Author": "J R.", "ReviewID": "PTyhxSlhTyu3os0UJKz4rw", "Overall": "4.0", "Content": "Breakfast burritos!!!! I worked down the street and got breakfast burritos from here all the time! They were really good priced and filled me up! Actually I never even finish the burrito which means LUNCH TIME!!!!", "Date": "2011-07-11", "Author_Location": "Long Beach, CA"}, {"Author": "Joshua S.", "ReviewID": "OE-vmiC5SkHBuTnTwYUMgQ", "Overall": "1.0", "Content": "Had good service last time I came here a couple years ago. This time, I came here with some friends late at night and despite just having a few people in the restaurant we had to wait a full hour for our order. The worst part is that most of the food was terrible and one order was wrong, requiring an additional 15min wait. My meal was so bad, I could only take a few bites and ended up leaving hungry. With so many solid options in San Pedro Square, I can't see why I would home here again.", "Date": "2012-06-17", "Author_Location": "Santa Clara, CA"}, {"Author": "Summer V.", "ReviewID": "eprddHo_doSkUgbZjCECjQ", "Overall": "1.0", "Content": "Not letting me order a grilled cheese? Shame on you. If there is a portion on your menu that's for kids, Please write that on the menu. I can't read your owners mind. And refusing to make me a grilled cheese is rediculous. I will not waste my time again.", "Date": "2012-11-10", "Author_Location": "San Jose, CA"}, {"Author": "Kimberly C.", "ReviewID": "1Pnk-YE8wW6vAZFDNbaoRA", "Overall": "2.0", "Content": "The breakfast is 3 to 4 stars and the other food is about a 2. The menu is fun with so many cute names for the dishes. It is a diner don't expect too much and you won't be disappointed.", "Date": "2007-02-05", "Author_Location": "San Jose, CA"}, {"Author": "Liquidman ..", "ReviewID": "S4NRQD2jSZ9-WN_X4k_PXA", "Overall": "2.0", "Content": "Just not that great.", "Date": "2007-09-05", "Author_Location": "San Jose, CA"}, {"Author": "dave m.", "ReviewID": "2pE4tfNMMtWV2NtZaikKhg", "Overall": "1.0", "Content": "We went to Peggy Sues last night before the Eagles concert because they were not as crowded as some of the other restauraunts in the area. That was a huge mistake. I don't normally bash anyone but the service here was HORRIBLE! The main problem they had was the ONE guy they had to pour drinks from the bar was all over the restauraunt. So we ordered our food and drinks and the guy who was working the bar decided to start taking orders as well from the other cash register. He completely ignored me and about 5 other customers who were all standing there just WAITING to get our drinks? HELLO... I was about ready to go behind the bar and pour my beer myself. Then this idiot decides while he is taking new orders from other customers coming in that he will pour there drinks as he is taking there orders, but meanwhile we are all still standing around waiting for our drinks they never gave us. After 20 mins. of this BS I decided to get BACK in line to order food. When I finally got up to this guy he asked what I want? and I told him me and all these other customers would like our drinks. He told me to hold on while he was entering some tickets into the register which took him another 5 mins. just to do that. Then to top off our entire experiance evidently the girl who took our order accidently deleted it so our food never came. I had to get back in line a third time just to get that straightened out. We spent probably an hour there for this whole ordeal? The only one positive thing I can say is they gave me another beer on the house since they royally screwed up our entier order. As far as the food goes at this place it was just sub-par. In n Out makes a WAY better burger and fries. There are a lot of better restauraunts in the area, don't waste your TIME and money at this dive. If I had to rate the service I would give it a -10, unfortunately Yelp does not let you give a negative review, but they should for places like this. I can understand if maybe someone is off or made a mistake but just the complete lack of service here would make me never step foot in this place again. So Yelpers, Youve been Warned!", "Date": "2010-05-01", "Author_Location": "Santa Cruz, CA"}, {"Author": "Ernest C.", "ReviewID": "Ivq0V29sw7QzK_2o2IqgFQ", "Overall": "3.0", "Content": "This place has character and good food to boot. I love that it added some booz to the menu so I can get the drink I want before a sharks game...", "Date": "2011-03-22", "Author_Location": "Granite Bay, CA"}, {"Author": "Jacqueline N.", "ReviewID": "qFtjSdBmFMKpvFHwufgMAA", "Overall": "3.0", "Content": "Went here before the sharks game. Didn't eat too much. Got the hotdog-- not bad. I was expecting it to be cheap and blehh, but it was decent. And the only other thing we got was the Shark Tank drink. That was of course delicious. :]", "Date": "2011-05-03", "Author_Location": "Morgan Hill, CA"}, {"Author": "Ashley P.", "ReviewID": "-I4nqEhiJ5-qlvTAK9W8Mw", "Overall": "1.0", "Content": "I got a chicken sandwich and it was tasteless. I shared a basket of fries with my boyfriend and it was the same thing, tasteless. Everything seemed to be really expensive for what we were getting too. And the ambiance is horrible. So corny, so stiff, just a real bad vibe going down overall for me.", "Date": "2012-01-07", "Author_Location": "San Jose, CA"}, {"Author": "jenny t.", "ReviewID": "FDtNffHeRyYcpF-w6-bSoQ", "Overall": "3.0", "Content": "My first time at Peggy Sue's I ordered a regular hamburger but it wasn't that good and I never had it again.I've had their chicken strips and fish & chips which comes with fries or you can upgrade it with onion rings.At the price you're paying here, especialy in this area, there are no complaints.", "Date": "2007-08-16", "Author_Location": "San Ramon, CA"}, {"Author": "Jonas C.", "ReviewID": "lr9VbOVD5NGLSIIVoiJdaA", "Overall": "3.0", "Content": "It's a little more inconvenient for me to go out here, and to be honest, it's been a while since I've been here, but I suppose I should put up a post as well.  Ever since the place on Park matched the menu there isn't much difference save the ambiance.  Where the locale on Park trends towards a more \"Johnny Rockets\"-type diner look and feel, the San Pedro location to me seems more like a sports bar.  It's pretty dark and crowded inside (which is why I don't give it a 4), but there are TVs around to watch things.  I'd imagine it was originally designed to attract Sharks fans and might get rowdy during games, but I really don't know.  Anyways, that's that.", "Date": "2009-08-05", "Author_Location": "Schenectady, NY"}, {"Author": "iPunchfish -.", "ReviewID": "yXGtbAMqKymtmfW1wEHQ5w", "Overall": "3.0", "Content": "This place is a grease pit.", "Date": "2009-08-12", "Author_Location": "Campbell, CA"}, {"Author": "Sara B.", "ReviewID": "v_40RxCoc514mwbSHqqQ1A", "Overall": "1.0", "Content": "This was the worst meal I've ever eatin before.  For the price I had to pay, it was riduculous!  I ordered the chicken sandwich with avacado, and it was so bland, not even mustard made it taste any better.  My boyfried ordered the bacon cheeseburger, and he didnt even want to finish it.  The only thing we finished was the chocolate and strawberry milkshakes.  The chocolate one tasted like it was mixed with regular chocolate syrup. Boring.  The curly fries tasted like they get them from Jack In the Box.  If I wanted fast food, I would have gone there instead of paying $4.00 for fries.   The ranch dressing was watered down or something.  And to top everything off, it smelt like a portapotty in the resturaunt.  Not pleasing when your eating or ever!  It was a waste of time and money and I will never eat there again.", "Date": "2010-07-28", "Author_Location": "Fremont, CA"}, {"Author": "Andy M.", "ReviewID": "qOTHmC1AsWrpeNTLWKP_Nw", "Overall": "2.0", "Content": "Seriously awful food. Just terrible. The service is great, but that doesn't make up for the food. It's just terrible.", "Date": "2010-09-04", "Author_Location": "Sachse, TX"}, {"Author": "Michael G.", "ReviewID": "j2OGIQZZqGRuUbphKXh3pw", "Overall": "3.0", "Content": "Probably as good as I expected. Didn't think it would be great but I was happy with my food. I got a turkey burger and thought it tasted good and was not dry. They have sweet potato fried which is always a plus. My wife got a tuna melt which was just ok. The wait was horrid but then again there was a MNF game and a Sharks game so everywhere had a bad wait.", "Date": "2010-12-27", "Author_Location": "Santa Clara, CA"}, {"Author": "Meryshayne G.", "ReviewID": "ISGgxD4HcxYYtaX2Py1VqQ", "Overall": "3.0", "Content": "Peggy Sue's is just alright. I like the way it looks, that 50's diner feel. And I find that I get lost looking at all the memorabilia on the walls and such, but the food is just like any other place. Nothing really falls far from what it is. The bacon burger is a bacon burger and the fries are just fries. It's not bad and it's just okay.", "Date": "2011-01-19", "Author_Location": "San Jose, CA"}, {"Author": "Kris T.", "ReviewID": "4DAC7hHCmygmyX-KLXB0UQ", "Overall": "3.0", "Content": "Peggy Sue's is a great place for a quick burger for lunch/dinner.  It's not the fanciest in town but their food is good nonetheless. If you can, take advantage of their Wednesday lunch special ($6 for any burger with fries and a soda). Also, their breakfast burritos are surprisingly good too.", "Date": "2011-03-01", "Author_Location": "San Mateo, CA"}, {"Author": "James L.", "ReviewID": "s2j1M8W_BwFY1IDtwz1O_w", "Overall": "5.0", "Content": "I was starving for a breakfast burrito and decided to drop in and give theirs a try.  It was amazing and hit the spot.  I can't wait for the next one.", "Date": "2012-03-29", "Author_Location": "Los Gatos, CA"}, {"Author": "David G.", "ReviewID": "3be7Pa4G4De8HZiEU4ixxQ", "Overall": "4.0", "Content": "Good burgers and awsome milkshakes, especially the pinapple shake. My girlfriend fell in love with the 50's/60's theme. Over all good service and will go back again. They also provide parking validation for the garage across the street.", "Date": "2012-08-11", "Author_Location": "San Jose, CA"}, {"Author": "Maddie O.", "ReviewID": "0cU0NEKLGFWQrT7J_jiA1A", "Overall": "4.0", "Content": "Typical American diner. I love their curly fries , fish&chips , burgers and milkshaaake! But of course, i had better in Johnny Rockets, idk why but johnny rockets burgers are just D double o d good! Im giving this place 4 stars!", "Date": "2011-06-17", "Author_Location": "San Jose, CA"}, {"Author": "Vladimir M.", "ReviewID": "3mPj8as0Qhvht2453OVImQ", "Overall": "5.0", "Content": "I love this place, I've been going here for years and never get sick of it. Great prices,great food and friendly service! You can't beat that!!! Good job!", "Date": "2010-07-19", "Author_Location": "San Jose, CA"}, {"Author": "Adam C.", "ReviewID": "iC9gx6QbMuaj5N8yUImpsg", "Overall": "3.0", "Content": "Came to this place a few times and the food was alright. Pretty expensive for a burger and Johny Rockets its just right down the street. My girl likes it but its not so great for me.", "Date": "2010-08-08", "Author_Location": "San Jose, CA"}, {"Author": "Andrea M.", "ReviewID": "U7mpKcXe2svD4GRqWnem7Q", "Overall": "3.0", "Content": "This place is good like the reviews says. I ordered the sputnik because I can never turn down grilled onions. I was surprised when they asked how did I want my burgers because that never occurred to me. So I got a medium rare hamburger with grilled onions. very moist and juicy is all I can say for the copious amounts of napkins I had to use. The mint chip milkshake was good too. Will come again when I get the chance in the future.", "Date": "2011-05-31", "Author_Location": "Milpitas, CA"}, {"Author": "Josh M.", "ReviewID": "2Fl0KKnu9twXmUmcTdmUQg", "Overall": "4.0", "Content": "I've been liking this place since i first had it while attending SJSU in 2005.  I started off with the Superman Burger, which is a Swiss Cheeseburger with Bacon, and that is when i knew i was gonna be going back in the foreseeable future.  Every now and then i go back and have the Chili Cheese Dog, one of my personal favorites.  Before you get too excited to get their Chili Cheese Fries, find a person to share it with because there is hella, like \"Selena-concert\" hella.  The tuna melt is also deeeelish and the strawberry shake has that very classic strawberry shake taste that makes you wanna rock Long TAll Sally by Little Richard.", "Date": "2011-09-12", "Author_Location": "San Jose, CA"}, {"Author": "Frankie D.", "ReviewID": "4YSiqy94KYmPCpN7eMPzfg", "Overall": "3.0", "Content": "Nothing to write home about! I remembering this place being a lot better? Took a nose dive over the years I guess?  I just felt like something was missing after I finished my burger.. Milkshake was solid but I can't see myself going outta my way to come back!", "Date": "2012-06-22", "Author_Location": "Willow Glen, CA"}, {"Author": "Mike M.", "ReviewID": "OgJSwz2tuhBvYm9Ptpy3LQ", "Overall": "3.0", "Content": "I've only gone here for breakfast, so I can only review based on that. However, the breakfast is quite good. Nothing too special, just your standard breakfast food, but still good and reasonably priced. I do know that this Peggy Sue's serves country potatoes instead of hash browns now, which I frown upon. I know the other location downtown still serves hash browns, so whenever I can, I go to the other one. The bonus about this one is the TV's, so on Saturday/Sunday mornings in the fall, I can have a sit-down breakfast and watch football shows. Gotta stop by sometime for the actual diner food, and not just breakfast.", "Date": "2010-07-20", "Author_Location": "San Jose, CA"}, {"Author": "Carol W.", "ReviewID": "ULqJQSpsjxvFM7xORfjm1Q", "Overall": "2.0", "Content": "We were told this was a good place for breakfast 50's style, but we found it to be tired and unattractive.  Food was ok, orange juice was icky.  Service was friendly.  Eggs were cooked right, but just plopped on a bare plate.  Not that cheap, either.  Won't be back", "Date": "2012-01-28", "Author_Location": "Santa Rosa, CA"}, {"Author": "Ariel M.", "ReviewID": "N6OIQHHKC3UCbuiQ9EKe4Q", "Overall": "1.0", "Content": "Peggy Sue's used to be good. What happened? The food is so overpriced, I got the combo with fries for $5 and we only got a couple fries, McDonald's fries are better. The burgers had no taste. Never coming back!", "Date": "2013-05-24", "Author_Location": "San Jose, CA"}, {"Author": "Smeilla B.", "ReviewID": "M1MKt0JEygMmcNSlUdAEew", "Overall": "2.0", "Content": "I printed out the coupon from entertainment.com this morning that was valid from 10/02/2012 thru 10/16/2012, and went there for lunch.  I was told that the ownership has been changed, and they don't honor the coupons from the last owner.  And I was also told that they've posted the ownership change in the newspaper as if it was my bad that I didn't check the paper before I went there.  I don't think I'll ever go there again.  There's other restaurants in San Jose downtown where I'd rather spend my money.", "Date": "2012-10-02", "Author_Location": "San Jose, CA"}, {"Author": "Banjo J.", "ReviewID": "_vRhWlZPFDjwCpEEZg451w", "Overall": "1.0", "Content": "The burgers are gross, the food tastes like public school food.", "Date": "2013-05-05", "Author_Location": "San Jose, CA"}, {"Author": "Brittany R.", "ReviewID": "mPutt-0Qf-l0McD8A8u_PA", "Overall": "2.0", "Content": "Sorry Peggy Sue's, but your burgers have taken a turn for the worse and your staff is seriously creepy. While trying to get me and my dinner date to purchase a massive margarita, the guy at the register felt the need to address our relationship status, not once, but twice. I know it's a small diner, but try to act professional.", "Date": "2013-03-28", "Author_Location": "San Jose, CA"}, {"Author": "Lucky Gal ..", "ReviewID": "oi_fmqnVfj37KqdClegNRA", "Overall": "2.0", "Content": "There's nothing more awkward than walking into a diner-themed restaurant and hearing Mexican music coming from the kitchen.  Of course this is nothing new since we have such a large and growing Hispanic population in San Jose.  Ok, lets get straight to reviewing about the last and only visit I made to Peggy Sue's.  Since it was my first time at PS, I decided to order the Cheeseburger with avocado.  Lets just say that it was one of the most boring burgers I have ever tasted.  I can't believe they pride themselves on being the best burger joints in town.  In-and-Out is way better than this.  It hurt to have paid over $20 for two cheese burgers, one large order of fries, and two solders (came with my hubby).  Not having combo meals for choices didn't help either.  We ordered everything separately.  They only had the Shark special (for hockey fans) but we didn't order that because we wanted a cheese burger with avocado.  It was around $6 for the burger itself!  The only thing I like was the decor.  There was also no ambiance to this location.", "Date": "2008-02-26", "Author_Location": "San Jose, CA"}, {"Author": "Alex L.", "ReviewID": "_G3f6p9Qn_52WfE5IPtuSg", "Overall": "1.0", "Content": "It was a pretty slow Monday night when my girl and I decided to stop by for a quick dinner. After deciding what we wanted to eat, we went up to the cashier to order. I could immediately smell the booze off the drunk waiter who took our order. We then seated ourselves in a booth next to the door when 5 teenagers walked in to be seated at the bar. The waiter, whom I soon found out was named Joey due to their loud obnoxious behavior, seemed to be serving alcohol to minors. Not only were they screaming and shouting, they found it entertaining to throw pennies everywhere at each other which undoubtedly found its way toward our direction. The food was a rip off, I felt that if we had gone through a Jack in the Box drive thru we would have been treated with more respect and paid less for better tasting JUNK FOOD.If you ever pass by, NEVER ENTER. The customer service was terrible, as the waiter simply \"tossed\" the plates on our table letting fries fall right off our plates. Someone should inform authorities about the underage drinking and this Joey character should be fired for his unprofessional and horrible service! Never in my 27 years of life did I ever experience such cheap behavior.", "Date": "2013-01-30", "Author_Location": "Fremont, CA"}, {"Author": "kim t.", "ReviewID": "NPHH5Qu6t0w_hce-W6pgyQ", "Overall": "1.0", "Content": "Went here for lunch on a Sunday. We were the 1st ones in the restaurant and we had never been here before.  I wasnt sure if we were suppose to wait to be seated, or seat ourselves or order at the counter and be seated.  The guy at the counter didnt say hi to us, smile or tell us what to do. So anyway, we looked at the menu and I figured we just order it at the counter and then seat ourselves.  I ordered a peggy sues cheeseburger which was dry, nothing fabulous and I think I'd rather have a burger at in n out. At least its juicier!  My hubby ordered a dry steak sandwich which he didn't think was great either.  So a combination of service without a smile and crappy food, we will not be back.", "Date": "2009-08-30", "Author_Location": "San Jose, CA"}, {"Author": "Jenny M.", "ReviewID": "mRdD2UxI-AOcCgoWcSloXQ", "Overall": "1.0", "Content": "ew dont go here. nothing special at ALL about this place. i had a bacon cheeseburger and it really just tasted like something i could have made at home. the patty was overcooked and dry and its just sooo normal. for some reason i was expecting at least some kind of special sauce..but no. and don't get any of the condiments! who knows how long those pickles have been sitting out there. and i had ranch with my curly fries..and the ranch tasted a little sour...GROSS!! i'm assuming its been sitting out there for at least 4 days..dont you have to refrigerate ranch?! i spent $8.41 for a bacon cheeseburger and curly fries...too much for something you can get from a BBQ.", "Date": "2010-03-29", "Author_Location": "Union City, CA"}, {"Author": "S T.", "ReviewID": "w-MyUe-2GgsZ8ZlKtbSiwA", "Overall": "1.0", "Content": "This review is for breakfast.  Sadly this is not worth the effort.  I don't know how you mess up breakfast staples and have them taste bland, but that's what they did.  And limp bacon, does anyone like that?", "Date": "2012-11-07", "Author_Location": "Milpitas, CA"}, {"Author": "Eric L.", "ReviewID": "JIsT_HlTHRqO-bT1RrdfTg", "Overall": "3.0", "Content": "ive only had the burgers here, but they were pretty good.  in comparable price it is definently better than johnny rockets.", "Date": "2008-04-18", "Author_Location": "San Jose, CA"}, {"Author": "Monica S.", "ReviewID": "RprLnSBdC_pUw-zQz9NiTw", "Overall": "2.0", "Content": "A couple of friends and I were at a music competition at SJSU and decided to do some coupon eating (2 for 1) at Peggy Sues. When I presented the coupon, the cashier said they weren't accepting coupons that day because of the basketball game playing on the TV. Hmmmm. There wasn't that many people eating at the restaurant and those that were, weren't watching the game. One star lost. My patty melt and my friend's burger with jalapeño jack cheese met our expectations, but not the curly fries which were not curly, but skinny sticks. I must have received the bottom of the barrel. Another star lost. Although, my friend did say I was better off with the non-curly curly fries than the onion rings he ordered. My other friend's mocha shake was good, except that Peggy Sues forgot to make it and my friend had to go back and remind them. Maybe they were the ones watching the game. My rejected coupon left me with a sour attitude.", "Date": "2010-03-22", "Author_Location": "Saratoga, CA"}, {"Author": "Dina S.", "ReviewID": "b-3-BfHA_Z6GHgqg8FDnUA", "Overall": "1.0", "Content": "When I heard about the terrible experience my family had at Peggy Sue's, I had to warn others!!  My husband and two kids decided on Peggy Sue's before the Van Halen concert.  When they got there, the line was pretty long and it took a while to get through the line, maybe 15 minutes.  Apparently, there was an older gentlemen, who appeared to be the owner, not doing a lot of anything, while the son took orders and the wife ran around like a one armed woman in a wallpaper hanging contest trying to fill all the orders.  My husband said that they waited 45 minutes for their food.  They would have left after 30 minutes but felt stuck since others places were probably crowded on a concert night.  While they waited, they started hearing complaints in the crowd.  People, like Jim, another reviewer, were trying to get their money back.  My family said that the food was decent but NEVER AGAIN will they go back here!  Be warned fellow Yelpers!", "Date": "2012-06-07", "Author_Location": "San Jose, CA"}, {"Author": "Nick C.", "ReviewID": "vgfE_3SBXR0bKSlDkKqCJQ", "Overall": "4.0", "Content": "Reviews that don't like Peggy Sue's burgers are off, in my opinion. I've never had a bad burger at Peggy Sue's. I started going there before Sharks games when the restaurant was a hole in the wall on East Santa Clara Street.", "Date": "2012-09-13", "Author_Location": "Oakley, CA"}, {"Author": "Nicola L.", "ReviewID": "kyVxK1JWM6F2-El7smXshw", "Overall": "4.0", "Content": "Peggy Sues...Listen up people, if you want a really nice meal, there are plenty of other places in San Jose to go.  If you want decent food, decent prices, quick service and a fun atmosphere, hit up Peggy Sues.  I've been going here for a few years before the Sharks games, and their pre-game drink specials can't be beat.  Where other places charge you $5-7 per pint, Peggy's gives you a great deal ($3 per pint).  Its a great location, and the food is definitely better than most options for the speed/quality/price.", "Date": "2010-01-06", "Author_Location": "Ben Lomond, CA"}, {"Author": "Raina P.", "ReviewID": "81PfOmNDqg0b6YFDh3Od3g", "Overall": "1.0", "Content": "This place has to be the worse place ive ever eaten!  The food and the service was horrible and I mean NASTY! Burger King has better This place has to be the worse place ive ever eaten!  The food and the service was horrible and I mean NASTY! Burger King has better pattys than they do ! I never knew owners talk crazy infront of the customers to the workers !Snapping his fingers at them ! This place has to be a joke ! His name was Shiraz R Jivani said he owned it for 8 years ! never knew a burger could taste so bad. Never have i ever had to return food! I mean never!  The owner gave me such a hard time he wanted my id to return  said corporate needed it ? Wtf he was so mad that i said the quality of the burger was horrible ! He had people waiting in line he was yelling at kitchen workers to get the Fucken order off the truck ? I mean what kind of place is this ? How can people let their franchise buisness become like this?? wow! Never will we ever walk by this filthy place and spend a Dime!", "Date": "2013-02-20", "Author_Location": "San Jose, CA"}, {"Author": "Larry F.", "ReviewID": "ssSkip71sFCcGqi1_cD9_w", "Overall": "5.0", "Content": "We just had an absolutely outstanding experience with Peggy Sue's under it's new ownership.  A year ago we booked the restaurant for a private party of 80 teens for our son's Bar Mitzvah celebration.  Two months prior when we called to discuss details we learned that the restaurant had been sold.  Despite the fact that the new owner was not told of our private party or of the substantial deposit we had paid, he assured us he would honor that contract and would treat our son as his own. That is exactly what he did!  He and his son Saif went out of their way to attend to every detail and to make this party special and memorable.  Our son and his 80 guests LOVED the party.  The owner brought in extra staff and coordinated every detail with us so that all the guests were fed together and the party could run smoothly.  What really added to the fun of the evening was seeing all the Peggy Sue staff rocking out to our DJ behind the counter.  They were having as much fun as we were!  Both the owner and his son were present for our party and worked throughout to ensure it's success.  The owner's son is a true gem!  We have been getting nothing but rave reviews on this party - thanks Peggy Sue's for a wonderful evening.  P.S. Your shakes are the best in town!!!", "Date": "2012-08-27", "Author_Location": "Campbell, CA"}, {"Author": "Jay D.", "ReviewID": "jMFhhIkCxTxjTIvvlnb7Gw", "Overall": "1.0", "Content": "***DO NOT EAT HERE** horrible burger.i ordered the avacado burger and got ONE thin slice of avacado. the lady at the cash register was rude and messed up our order. we said potatoe fries she  gave us regular fries. it was a fun atmoshpere but very crowded. i will never recomend this place or eat here again. the quality of food is definetly low and horrible. the prices are high and you do not get what you pay for. go next door or a few doors down better food.", "Date": "2011-10-19", "Author_Location": "Roseville, CA"}], "RestaurantInfo": {"RestaurantID": "5qxk6xc2cJMk0qbn1ojRYQ", "Name": "Peggy Sue’s", "Price": "$", "RestaurantURL": "/biz/peggy-sues-san-jose", "Longitude": " -121.89332144042", "Address": "29 N San Pedro StSan Jose, CA 95110", "Latitude": " 37.335594030625195", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/gB7d0GU0U9lV5hPmO08_hg/90s.jpg"}}