{"Reviews": [{"Author": "Annie J.", "ReviewID": "kqk6-1wyBhgTasNZ1rbOnw", "Overall": "5.0", "Content": "After two years, it's about time I updated my review for Columbia City Bakery. This place is the heart and soul of the Columbia City neighborhood, and in my humble opinion, the best bakery in Seattle. We still love the sourdough bread, the ham and gruyere croissant, and the amazing fruit danishes. But pretty much everything is good here. You can't really go wrong. The cookies (try the Columbia City chip!), strike the perfect balance between crunchy and soft. The cardamon coffee cake is dense and delicious. The quiche (which you can get by the slice or order a whole one in advance) is out-of-this-world. And, I'm happy to report that in the two years since I first wrote my review, they have seriously upped their lunch game. You can now get a variety of pretty dang tasty sandwiches. I am partial to the BLT (with thick-cut bacon and roasted tomato), the ham with cornichon butter (on baguette), and the salami on pretzel bread. They also have a variety of natural sodas to choose from.So, to sum up: Columbia City Bakery is the best. Come on down to Columbia City and you'll find out why.", "Date": "2014-06-25", "Author_Location": "Seattle, WA"}, {"Author": "Daren D.", "ReviewID": "kGl1A-Yo6wFxJ3pvgEkudQ", "Overall": "4.0", "Content": "Probably my first \"I thought I'd reviewed it already\" in a long time. A recent weekend dawned on me to visit here:I parked like a BAWSS down the street by Empire and moseyed on over here. Turning right at the door entry and OH... nice line you guys, sweet! While working the line, I caught glance of the neat crowd that morning, the warm homey atmosphere (despite somewhat cramped when busy), the tasty things on display and that awesome retro rotating dual-overhead fan assembly! It's like they took 2 old retro modern fans and swapped them on a typical ceiling fan unit - and at a perfect slow rotating speed.'Got me a nice latte, a morning cinnamon bun(?) and one of the simple cookies up top. Usually cinnamon bun things I've gotten around have that nice sweetness but dry/hard bun. This one was pleasantly chewy enough AND some sort nice jam filling (maybe a cross between raspberry, fig and marmalade?). Tasty(!)Can't believe I missed this place. Put yer thumbs up! =)", "Date": "2014-05-26", "Author_Location": "Seattle, WA"}, {"Author": "Teri S.", "ReviewID": "XVlxhcsoy02OqX-TamFc_w", "Overall": "4.0", "Content": "I love this bakery for the bread! I've tried lots of different kinds and the crust, texture and taste have all been wonderful.There sweet treats, on the other hand, are a disappointment. It took me a while to give up, I love baked treats so I tried a lot of them, but none of them tasted good enough to be worth splurging on. They are OK, but I like to save my indulgences for something amazing, not ordinary.The staff can be slow, but they are always pleasant.", "Date": "2014-05-08", "Author_Location": "Seattle, WA"}, {"Author": "Ryan N.", "ReviewID": "mjaauAVuONrarCOTGfdD8g", "Overall": "5.0", "Content": "Review based on the food along. Service is sometimes questionable. You know that bread you're eating for starters at a lot of the trendy restaurants around Seattle these days, including the best french toast you'll ever taste in your lifetime? Yup, this is where they get it from. The pastries are fresh and made and baked daily. Including their super chip cookies, which I swear I could eat all in one day. It's so good, I ordered it as favors for our wedding. Just call a day before and they'll have it ready - yeah that fast!", "Date": "2014-05-05", "Author_Location": "Seattle, WA"}, {"Author": "Julie F.", "ReviewID": "9YO4H25urER3_77FUFbDsg", "Overall": "4.0", "Content": "Oooooh the bread. The bread. I've never had better. I take back my earlier \"bleh\" review. We also had some desserts, and they were delicious too.", "Date": "2014-06-23", "Author_Location": "Seattle, WA"}, {"Author": "Katie H.", "ReviewID": "C9OD2ASuW0dkRgt6J4qS3A", "Overall": "4.0", "Content": "Looking for yummy things?  This is a place you can get them, but don't wait to be amazed.When I think of a place like Bakery Nouveau, that is a bakery that made me go, \"Oh, wow!  NOM NOM NOM.\"  Columbia City made me go, \"Hm, yummy.\"  If you happen to be in the area and are looking for a bakery, this is a good place to get good stuff.  It's better than what you get in the grocery store, even though it is a little pricey for what it offers.Truth be told, I haven't had they savory items from here, and maybe that is what they do best.  I have had the cookies, they were good, not great.  A little overdone.  Their cake is nice, it has a good crumb and isn't too dry (which happens a lot).  Their muffins are nice and dense, and they are good enough that I am interested in more than just the top.What I don't get is that this place is always packed (a kudos to the good people they have behind the counter because they keep that line moving).  For the same price, I can go elsewhere for better.Will I be back here?  Definitely, when I am in the area.  Will I go out of my way to go here again?  No.", "Date": "2014-04-16", "Author_Location": "Seattle, WA"}, {"Author": "Rachel P.", "ReviewID": "6ZRcfuLUp6TtFDo9y7WzWA", "Overall": "5.0", "Content": "Every time I come here my day gets a little better. Really love this home town feel coffee shop and bakery. Pistachio wheels are my favorite!", "Date": "2014-06-22", "Author_Location": "Warrenville, IL"}, {"Author": "Chi P.", "ReviewID": "KA1NIUvRunuvIwqgVMAVZw", "Overall": "5.0", "Content": "Best bakery in town. Very nice croissants and baguettes. I came here with a friend who was French and he said this is the best place that you could get French pastries. Good price too!", "Date": "2014-06-23", "Author_Location": "Seattle, WA"}, {"Author": "Monica B.", "ReviewID": "gzUsn5lU16tbGVDh0OD-rQ", "Overall": "4.0", "Content": "My first experience here was not great so I held off on a review. Basically, after having lunch nearby, my family and I stopped by to see if we fancied anything in the case. Nothing called to me and we instead decided just to get some drinks. My partner asked for a drip and the response was a bit condescending when paired with a slightly turned up nose and the words, \"Is that all?\" After that, I knew I would go back because I assumed it was just an off day. I'm glad I went back. It was a much better experience and staff members were smiling and friendly. This time, there were tons of things in the case and the chalkboard I was interested in. Unfortunately, most of the specials were sold out, which was expected on a Saturday afternoon. We ended up getting a brownie, pistachio cake, and coffee cake. The brownie was soft with a tiny bit of a shell on the top. The chocolate was rich and had a fudge-like quality in the middle. The pistachio cake was the star of the show for me! The frosting on the outside was the perfect consistency and held the pistachios well. The cake was moist and flavorful. The real kicker was the bit of lemon essence in the layers of frosting on the inside. That subtle, citrus flavor pulled it all together. The coffee cake was made with pears, cranberry, and cardamom. Those ingredients worked really well together with the mild flavor of the pears, bit of tartness from the cranberries, and kick of the cardamom. Overall, it was a good visit and again, I'm glad I went back.", "Date": "2014-03-20", "Author_Location": "Seattle, WA"}, {"Author": "Gar L.", "ReviewID": "Dh1tgI8AkES3EPQDn2DxUA", "Overall": "1.0", "Content": "What a horrible experience. Just went into the bakery around 4:30 and it wasn't busy at all. I order a loaf of bread and ask for it sliced. Not the most difficult of requests, but somehow they manage to have me wait 15 minutes for it ... There were about 7 employees working at that time, and the ones that weren't actively making bread in the back were standing around talking. So there's absolutely zero justification in having a customer wait 15 minutes for bread to get sliced. What ended up happening was the cashier realized I was waiting for so long and ran back to slice it herself.This service is a joke. I will not recommend this crap to anyone.", "Date": "2014-04-28", "Author_Location": "Seattle, WA"}, {"Author": "Lindsay S.", "ReviewID": "zkh34TrIZPTEFEAlo6zPnQ", "Overall": "5.0", "Content": "Excellent baked goods. My personal favorite is the fresh fruit danish. I've never had a better one anywhere.", "Date": "2014-06-14", "Author_Location": "Seattle, WA"}, {"Author": "Christopher M.", "ReviewID": "M1qh6aXQUGn5nsQYHS389Q", "Overall": "4.0", "Content": "CCB does a lot of things very well. Ive had cookies, cakes, bread and (savory) stuffed crescents. The staff is always friendly and it's an added bonus they are within walking distance of my home.  I know their baked goods are supplied to many businesses across Seattle so they do a good job of spreading the wealth as the saying goes. If there is 1 complaint it would only be that sometimes I get there too late in the day and the slices of dessert are all gone with only whole cakes and pies left. But that's more of a reflection on me than them.Protip: Make sure you check out the baked goods on the wall near self serve coffee they are easy to miss if you are focused on the display cases", "Date": "2014-04-24", "Author_Location": "Seattle, WA"}, {"Author": "Ryan C.", "ReviewID": "1JhsSfaXc4Jh3r7BzSs0Iw", "Overall": "4.0", "Content": "I was on my way to a bridal shower and needed to grab a quick dessert. I live in Columbia city and had never been in and I thought this would be the perfect reason go. The smells......oh my goodness it smells fantastic. I smelled it before I could see it and that made me happy. There was a line and plenty of people sitting and indulging in pastries which was an obvious good sign. I wanted to order a few pastries to go and the lady at the register recommended I get the cookies instead. Honestly, I wanted to order one of everything and then eat a baguette, just because I could.... Anyways. They came packaged and wrapped in a cute container, perfect for a bridal shower. There was a healthy serving and combination of  cookies and all of the girls loved them. There was not a single cookie left. They offer many loafs, baguettes, pastries, cakes, sandwiches, quiches, and more. I have no doubt they are all fantastic, I can't wait to come back.", "Date": "2014-04-04", "Author_Location": "Seattle, WA"}, {"Author": "Celeste Y.", "ReviewID": "yiyQLbCZgjnzFSaW288kYA", "Overall": "4.0", "Content": "We've been here a couple times on weekend mornings for some breakfast pastries. I judge every bakery on their traditional butter croissants. Honestly, Columbia City's isn't one of Seattle's best. They do, however, have quite a smorgasbord of offerings (all of respectable quality).A standout to me is their Torta Rustica. These are so savory and delicious, albeit a little pricey at $5 a pop.I enjoy that they open at 7:00 a.m. even on weekends, but prepare for a wait. The line is usually to the door as early as 8:00 a.m. Usually it goes pretty quickly, unless you order an espresso drink. Those can put you back an extra 5 to 10 minutes if you're in a hurry.", "Date": "2014-03-26", "Author_Location": "Seattle, WA"}, {"Author": "Alden C.", "ReviewID": "y3UrK5h62WmBD3BPv8CRWw", "Overall": "5.0", "Content": "This bakery is pretty amazing! Apparently lots of other people think that too because the place was packed and there was a line of people waiting to order. The line was managed well and the flow moved at a brisk pace.There are just so many things to pick from here! All kinds of different breads, cakes, sandwiches and more!I went with a slice of the Tea Spice Bread which was absolutely fantastic! I also got a mocha which was nice and rich. Perfect on a drizzly winter day! I think I found one of my premier bakeries in town!", "Date": "2014-01-08", "Author_Location": "Tacoma, WA"}, {"Author": "Jonathan L.", "ReviewID": "3z4ThuSxb17f8YnACd95Kw", "Overall": "4.0", "Content": "Good Pan au Chocolat. Nice latte. Pretty bad chai. Smells amazing in and around the building. Great for a quick breakfast on the run.", "Date": "2014-03-16", "Author_Location": "Spokane, WA"}, {"Author": "Alanna M.", "ReviewID": "Qh1f1w26DFsBgeOC_dvm9A", "Overall": "4.0", "Content": "I love this bakery!  I love every aspect of it.  I love that it's not a chain.  I love the fact they are fairly small that their products are noticeably awesome.  Don't let the tiny space and minimal seating fool you.  They've got a great selection of breads and baked goodies.  Their cakes are beautiful and heavenly.The barista made me a mean latte.  It was delicious and smooth.  Their homemade caramel sauce is money!", "Date": "2014-01-03", "Author_Location": "Seattle, WA"}, {"Author": "Molly M.", "ReviewID": "m4My4Dn4HY498cKSuT6JKg", "Overall": "4.0", "Content": "Columbia City Bakery has great bread & amazing treats! I wish I could eat their blondie bars every day.", "Date": "2014-05-11", "Author_Location": "Seattle, WA"}, {"Author": "Masil M.", "ReviewID": "BsUdy7RHnw7Dz1p3bOSnAQ", "Overall": "4.0", "Content": "I enjoy  many of the items they have here at Columbia City Bakery.  I am particularly a fan of their pretzel items.  The pretzel hot dog is my absolute fave.  I like to grab a pretzel dog or a sandwich and then head over to Seward Park for a picnic.  I also like their coffee quite a bit.  I do not like their lines.  While not the slowest coffee service I've experienced on a regular basis, it's up there.  I like that they have a strong community presence at various farmers' markets.", "Date": "2014-04-14", "Author_Location": "Seattle, WA"}, {"Author": "Nancy C.", "ReviewID": "oimBE231ART1PEfUQaUuXw", "Overall": "3.0", "Content": "After my haircut I decided to go for a 4 min walk to this bakery since I've been wanting to try it.Tried their tres leche and it wasn't what I expected/tried else where. I haven't tried a tres leche that has a hint of coconut to it like the one here. Taste wise it ok, maybe bc I've tried other ones and had my mind set in how it should be vs what it really is. I will have to try the ham and cheese croissant as one of my friends recommends.", "Date": "2014-01-14", "Author_Location": "Renton, WA"}, {"Author": "Katy H.", "ReviewID": "axjgRWmX3yz_8Tst3Jy9dw", "Overall": "5.0", "Content": "I had one of the absolute best sandwiches here yesterday. In fact, I had half of two different sandwiches and both were awesome.Running some errands in Columbia City, I popped in here around 12:30pm to pick up a baked goods order for my boyfriend. Since it was lunchtime I thought it would be perfect to also pick up a treat like a scone or muffin or something. Then I noticed a fridge with pre-made sandwiches and it was all over. There were great choices to choose from but I couldn't decide between the tuna and a mortadella with red peppers. My boyfriend suggested we buy both and we sat down to enjoy them. One bite in and I was in heaven! I bragged to my boyfriend about how good the mortadella sandwich was and he said, \"Oh yeah? Try THIS!\" and handed me his tuna sandwich. WOW! You can really go wrong with tuna if you don't get it from a great spot and this tuna sandwich was easily the best I've ever had. Very fresh, very light, lots of pickles and red onion - just perfect.We swapped again and ended up eating about half of each other's sandwiches. They were large in size and very filling. Definitely made for the best (fast) lunch I've had in a long while. I don't think I can drive back through here without getting those same exact sandwiches again and again.", "Date": "2013-09-10", "Author_Location": "Seattle, WA"}, {"Author": "Bob Z.", "ReviewID": "bY0OeeE21Wl4azSUL48oZw", "Overall": "5.0", "Content": "Still liking this place. Joe (a coworker) and I took the bus from our offices in the old Amazon building in the ID to Columbia City. We each ordered one of everything. They laughed and said they get that a lot, but we said no, we really mean it. One of everything each, except we cleaned them out on the pretzel knots.We walked ten minutes later, each down $101.38 plus tip, but carrying four boxes and two bags of baked goods. And a couple of lattes and smiles. We hopped back on the bus, headed back to the office, and about an hour later everything had been demolished except a couple little tubs of mustard. I personally think it's wrong to have pretzels without mustard, but apparently not everyone feels that way.We got lots of thanks from people who really enjoyed the food.", "Date": "2013-09-26", "Author_Location": "Kirkland, WA"}, {"Author": "Kat A.", "ReviewID": "qqtPfkB77G4V4NrWLkvyQw", "Overall": "4.0", "Content": "Delicious pastries of both the sweet and savory varieties. My favorites: pistachio snail, tres leches cake, focaccia.They also have a bunch of fresh bread options, which are a great addition to any meal. This place is almost always crowded, so if you're there at peak time plan for a small wait.", "Date": "2013-12-04", "Author_Location": "Seattle, WA"}, {"Author": "Andrea J.", "ReviewID": "j3dWGWLePh-mbxmuL3Qmew", "Overall": "5.0", "Content": "My newest fantasy is a bake off between Columbia City and Bakery Nouveau where I am the judge and must do a side-by-side taste test between every quiche, eclair, cupcake, cake, cookie, croissant, brioche, ficelle, focaccia, and french bread. Only then would we know which is the best bakery in Seattle. Until this fat-kid fantasty comes to fruition, I am content saying that Columbia City baked goods are of a quality that is difficult to match in this city. I've eaten many loaves of bread produced here as well as the bostok and the kitchen sink cookie so I am not an expert on everything sold here, but someday I would like to become one.", "Date": "2013-08-12", "Author_Location": "Seattle, WA"}, {"Author": "Erica W.", "ReviewID": "XMwWGde4FzqBUn4eOsqAqg", "Overall": "1.0", "Content": "Even though I've lived in the area for years, I'm just now getting around to seeing and eating at all the new places around. One day while leaving Island Soul, my mother and I stopped here to see what all the buzz was about...and honestly, I still don't get it. When we walked in, the staff was rude, and this to me is an automatic deal breaker. I don't care how great your product is, if you don't care enough to respect your patrons, your business is dead to me. As we looked into the case to see what items we wanted, the bitter old woman behind the counter seemed as if she couldn't get a hello out of her mouth or at least offer some assistance to us. We eventually picked out what we wanted and she literally tossed my lemon tart into the box without any care (smashing my whipped cream and smearing the lemon filling on the side of the box) then sent us up to the register where we were greeted by another uninviting employee who with no hello, no greeting blurted out a total and barely looked us in the eye. At that point I was done with them and their crappy service...it pains me to say, the lemon tart was actually not that bad but not good enough to step food in this place again.If this is the way you treat your patrons I hope you go out of business soon and leave the neighborhood, it was just fine without you.", "Date": "2013-08-16", "Author_Location": "Seattle, WA"}, {"Author": "Mindi A.", "ReviewID": "EUI1shlXXMFhfqdJG_4lEg", "Overall": "3.0", "Content": "This gets a 3 star because there were no baked good available that I could eat (I am lactose intolerant) and it made me sad because everything looks sooo delicious! I did order a rice milk latte and it was very tasty.", "Date": "2014-04-01", "Author_Location": "Everett, WA"}, {"Author": "Faith C.", "ReviewID": "X1la8VNjTowBUSf0DeupTA", "Overall": "4.0", "Content": "This is my go to spot for coffee and a quick bakery snack. I try not to stay too long in the cafe because I am always tempted to try more bakery goods. The people are chill and down to earth. I love it in here.", "Date": "2014-04-05", "Author_Location": "Seattle, WA"}, {"Author": "Samuel B.", "ReviewID": "66zkeJ5RJBiNu--aQ3lt4Q", "Overall": "5.0", "Content": "Start with the walnut ficelle. Then work your way through the bakery case. Don't leave without a triple mocha. Take two napkins---one for the crumbs and one to wipe the smile off your face. Repeat as often as necessary.", "Date": "2013-10-20", "Author_Location": "Austin, TX"}, {"Author": "Wennie H.", "ReviewID": "apJU6eLQDfT613JHytdIhA", "Overall": "4.0", "Content": "My friend told me about this place having the best blondies...I'm not exactly a blondie kind of girl but I figured I'd give it a shot. I had a \"date\" planned in the area so it worked out well (and I surprised her with a sweet treat)! I actually didn't really like the blondie because there were walnuts or some kind of nut that I didn't enjoy. She loved it though...so I need to thank the bakery for making me seem like an even better catch! That being said, I did also pick up the Columbia City Cookie and that was awesome. Toffee and chocolate equates to yummy in my tummy. The cookie wasn't as soft as I usually like but still good! Service was awesome and the shop is extremely cute.I will definitely be coming back!", "Date": "2013-08-19", "Author_Location": "Bellevue, WA"}, {"Author": "david tetsuo b.", "ReviewID": "zaxdTDg78-SRQa8oioeK1g", "Overall": "5.0", "Content": "Columbia Chip cookies best cookies I've had in a long time. Breads are delish and always enjoy their espresso.", "Date": "2014-03-19", "Author_Location": "Seattle, WA"}, {"Author": "Melissa A.", "ReviewID": "K3KPk23LaNnceFA3MkSvfA", "Overall": "4.0", "Content": "Great bakery and great coffee. I can't think of any of the pastries I've had there that weren't good and boy do they make a good cup of coffee. Their freshly baked breads are also delicious. Every time we're in the neighborhood we stop by to pick up some fresh bread for dinner.", "Date": "2014-02-25", "Author_Location": "Seattle, WA"}, {"Author": "Angie L.", "ReviewID": "9wD3c0-ZEromzyBVVyuNwA", "Overall": "1.0", "Content": "We have all experienced this before... The food is excellent, but service absolutely sucked.  In those situations, 9 out of 10 times, I will still go back because well.... The food speaks for itself.  Service is important, but the food outweighs service any day.  And that is why I have continuously come back to this bakery.  But really now... I've had it with the way the employees act and treat me.  What customer wants to be treated like crap or as though they're inferior? Seriously... The employees are so snobby and rude every time I have gone in.  Get off your high horse.I'm officially done with this place.", "Date": "2013-04-07", "Author_Location": "Seattle, WA"}, {"Author": "Rachel H.", "ReviewID": "lDbM6YC5YzW6BLIQbqtZIw", "Overall": "4.0", "Content": "Small but delightful baked good case at the Columbia City Bakery.Really wonderful breakfast sandwiches and a pistachio snail that is really a must order.  The danishes and breakfast fruit tarts are very pretty.  Expresso fine, def not their sweet spot. You will wait a very, very long time in the lines here, but once you taste that pistachio snail you will forgive and forget!Grab and go sandwiches are french-sytle with butter on fresh baked crusty bread, with good ham, grainy mustard and cornichons.", "Date": "2013-04-13", "Author_Location": "Seattle, WA"}, {"Author": "Crystal D.", "ReviewID": "dTJ6GKtm8MQZpCXTmSrKrQ", "Overall": "3.0", "Content": "Pros:   Great food!!!Cons. Unfriendly staff.Will I return?  I do all the time.  It'd be nice if the staff broke a smile, or even gave a good morning, but I'm there for the food and not the staff.", "Date": "2013-06-23", "Author_Location": "Seattle, WA"}, {"Author": "Chelsea J.", "ReviewID": "w1e32FrVYg3Vb_2JYTk9PQ", "Overall": "5.0", "Content": "The pain du chocolat easily ranks among the top 5 pastries I have had the pleasure of stuffing in my face. Ridiculously good. All the pastries and baked items seemed reasonably priced in the $2.5-$4 range. My americano was excellent with a nice crema. I also enjoy their baguettes. They have very high quality goods here and I'd recommend them to anyone!", "Date": "2013-03-04", "Author_Location": "Seattle, WA"}, {"Author": "Hedy D.", "ReviewID": "iGjVf0XjHmAvwYMx2phacg", "Overall": "3.0", "Content": "I try their cupcake and it was a bad ideal. It was so sweet .maybe next time I try something else .", "Date": "2014-02-12", "Author_Location": "Tacoma, WA"}, {"Author": "Tamra G.", "ReviewID": "SD3m0Crgyw5WDLLwdrBofw", "Overall": "5.0", "Content": "This bakery is awesome! A pretty big selection of pastries and breakfast items. I definitely want to try the strata when I'm here next. I swung by right after eating breakfast at Geraldine's and I only felt like being a semi-glutton this particular morning.  I got the Blondie and holy moly. This thing changed my entire perspective on cookies. Cookies used to be a nice to have. Never necessary but good in a sugar pinch. My entire perspective on cookies has been wrong. Cookies can save.Please try the Blondie. Make sure you have a big glass of milk. The pairing is life changing.", "Date": "2013-08-19", "Author_Location": "Seattle, WA"}, {"Author": "Beatrice L.", "ReviewID": "gjO79e0xM84PXUAcXCnqvw", "Overall": "4.0", "Content": "love their pastries. love their veggie torta. love their selection of dessert cakes. Love the smell of the place as I walk in. love their coffee. im glad this place is w/i walking dstance from my woek.", "Date": "2014-04-13", "Author_Location": "Seattle, WA"}, {"Author": "Arry Y.", "ReviewID": "aqDrv9AyP_o28KxvgAEwdQ", "Overall": "4.0", "Content": "Our new neighborhood bakery!!!!!  :)  The staff at the bakery so very friendly and nice.  Went there recently for Pi Day (March 14) to pick up some delicious pies for a hosted dinner at a friends' place.DELICIOUS!  Very well made, artistic presentation, extremely yummy.  We had the apple crumble and an almond cardamom flavored one.Will most definitely go back when we decide to cheat with sweets.", "Date": "2013-03-25", "Author_Location": "Seattle, WA"}, {"Author": "Kelly M.", "ReviewID": "6sY0zgQzbvCe-lzlrV1CxQ", "Overall": "4.0", "Content": "Finally took some time and ventured into this little bakery the other day. I don't live very far and I've passed through Columbia City plenty of times but for some reason I rarely stop by local places.It could be that I was nearly famished but the Rustica Torte was utterly delicious! It was hard to decide what I wanted to eat but the torte looked so yummy I just couldn't resist. I also got the strawberry rhubarb danish and a short macchiato. My complete brunch was filling and very satisfying.Service is fine, up to par. The barista was a sweetheart. There are so many tempting treats I want to try. Gameover for my diet lol. Portion to price ratio is fair, completely worth it.", "Date": "2013-05-19", "Author_Location": "Seattle, WA"}, {"Author": "Louanne S.", "ReviewID": "Rf4Ns1MHxR5ZX5TteZVmew", "Overall": "4.0", "Content": "I have been craving a piece of cake for weeks now, so on Sunday, Sept. 15th, I walked into Columbia City Bakery for the first time.  It was bustling with activitiy and I did not mind at all having to wait my turn.  I ordered a \"Sunday Slice\" of yellow cake with mocha frosting.  The $4.00 slice was very generous in size.  I also ordered a Blondie.  I asked the staff to choose a loaf of bread for me and he chose potato bread, which I will sample tomorrow.The cake was a huge disappointment.  It was dry, very, very dry and tasteless.  The mocha frosting was very tasty but also crumbly and dry.  This slice of cake seemed days old to me.Now the Blondie was the most delicious cookie bar I have ever tasted.  It was amazing!  Moist, buttery and rich, very dense with no dryness, and positively studded with large chunks of walnuts and lots of tiny chocolate morsels.  It was thick, chewy and a decadent treat!Then next day, we tucked into the Roasted Potato Bread and it was extremely soft inside, yet with a great, almost creamy texture, and an awesome dark crust.", "Date": "2013-09-15", "Author_Location": "Kent, WA"}, {"Author": "Colin R.", "ReviewID": "aVfCH7yvaiKRf8CvL1Sisw", "Overall": "5.0", "Content": "Ham and gruyere croissant is spectacular! One of the best I can think of!", "Date": "2014-01-27", "Author_Location": "Irvine, CA"}, {"Author": "Charles J.", "ReviewID": "OuTP7rpJIoXBTvrPyXBpYw", "Overall": "3.0", "Content": "I agree -- the pastries are to die for. Although pricey, they are yummy.But if you just want a good, plain cup of coffee -- bring your own. The drip coffee gets pretty nasty. So I decided to \"help it out\" with some creamer. They've got two or three UNMARKED metal creamer pots on the self-serve counter. \"Well,\" I thought, \"I'm willing to gamble. I'll either get half-and-half, nonfat, or whole milk. Any of those would improve the coffee.\"  I grabbed the closest one and poured.Surprise!  It was soy milk. (ugh). Probably the one thing that could make the coffee worse than it already was.Next time, I'm bringing my own coffee!", "Date": "2013-03-26", "Author_Location": "Woodinville, WA"}, {"Author": "Ninette C.", "ReviewID": "p4vntxG0nenkNyw30KD6rQ", "Overall": "5.0", "Content": "30 day challenge review 11/5:Columbia City Bakery will always be remembered for introducing me to tres leches cake. It is seriously moist, soft, milky goodness! Sweet but not too sweet. Nom nom nom.I also like the little touches they have such as coffee in their chocolate frosting for their cupcakes. The cookies were whatever. Also, of course, anyone who has been to any of the number of Seattle restaurants serving Columbia City Bakery bread knows that it's delicious.This place is cute but its crowded. The staff is nice but they don't really have time to chit chat. Whatever- just give me more tres leches cake!", "Date": "2012-11-05", "Author_Location": "Seattle, WA"}, {"Author": "Katie O.", "ReviewID": "hnSBH3vey7S7mvArLCA4kg", "Overall": "4.0", "Content": "While waiting for our spot at Geraldine's, we wandered across the street to see what the bakery had to offer. We figured it would be good considering there was a line out the door. Pros:Cute placeDelicious baked goods (try the pistachio snail!)Good varietyCons:Super slow taking ordersEven slower making coffeeBasically, if you have plenty of time, make sure you hit this spot up. If you don't have time, just move on.", "Date": "2013-04-07", "Author_Location": "Renton, WA"}, {"Author": "Morgan R.", "ReviewID": "hj6lEe3-dbz6H7_YU8Hogw", "Overall": "5.0", "Content": "The best baguette in townWe don't get to this bakery often enough -- but when we do, we always get a baguette or two, and often a pistachio snail, a croissant or some other pastry.   This bakery makes the best bread in town, and the restaurants that serve their bread is proof enough.   If you want a baguette on the weekend, go early - by noon they're usually all gone.", "Date": "2012-12-29", "Author_Location": "Seattle, WA"}, {"Author": "Sara F.", "ReviewID": "Vm0ylWyVeeQkgEFW4HT1kw", "Overall": "4.0", "Content": "I love this bakery. I would've given it 5 stars a few months back, but they keep messing with their muffins. They were perfect when they were called brown butter muffins, but they have been going downhill over the past few months. Good bets are cookies (frosted shortbread is especially good), pretzels, and focaccia. Can get a bit crazy in here in the mornings, but worth the wait. Yes, the service is kind of rude, but it's not like you have to actually be served by them at a table. It would be wonderful if that could be improved upon though.Please bring back brown butter muffins. No need to mess with the perfect recipe!11/10: Editing my review. Service has definitely improved recently. Still disappointed with the crappy muffins. My boyfriend got the berry coffee cake the other day and it was amazing and moist, basically a big version of the muffins. It's a good alternative for others who miss the brown butter muffins.", "Date": "2013-08-20", "Author_Location": "Seattle, WA"}, {"Author": "Rich T.", "ReviewID": "Pj2BJUj69ivnvLnJnK0y1g", "Overall": "5.0", "Content": "Weve tried lots and lots of bakeries in Seattle looking for the perfect bit of French baguette. Something to bring the memories back of a week spent in an apartment with a view of the Eiffel Tour and shopping at the local market for everything wonderful. Well with Columbia City Bakery, we've found an amazing substitute. We will literally drive five miles to buy a baguette. No it doesn't keep for more than a day or two. But it is true perfection. I've had friend literally eat an entire baguette with nothing more than a little butter and ask for more.  The other things there are excellent too and I'd give them four stars for that,  but six stars have to go to them for the baguette. We love essential, three sisters and all the other wonderful local places but they truly standout.", "Date": "2013-01-27", "Author_Location": "Seattle, WA"}, {"Author": "Quynh H.", "ReviewID": "BQUW82CQ2_ysS3Wb6xON6A", "Overall": "5.0", "Content": "I've lived in South Seattle my whole life and I visited this bakery for the first time I think last year? Should have went here sooner, I love love love it, one of my favorite bakeries by far in Seattle. My best friend loves the pretzel knots and my favorite are probably the almond anise cookies. A great selection of sweet and savory/salty items, they also cycle through different items so it's never boring going in there. Some items are kinda pricey (like a dollar for a small cookie? but 0.50 for a knot! everything else I feel is fairly priced, croissants, etc.), but everything's fresh and you'll feel great about supporting a local business.", "Date": "2013-03-26", "Author_Location": "Seattle, WA"}, {"Author": "Joey H.", "ReviewID": "QqabWKV717krGDfDORffIA", "Overall": "4.0", "Content": "Definitely delicious pastries and bread, and wonderful coffee. The location is perfect and the shop is laid out well. But the prices are a bit extreme. $6 for a small loaf of bread is tough for a lot of people to swallow.", "Date": "2014-04-02", "Author_Location": "Seattle, WA"}, {"Author": "C M.", "ReviewID": "8LudWKCvFGg2Adtp3u9GOQ", "Overall": "5.0", "Content": "This is the best bakery north of Portland! If you can't bake it this good at home, why bother trying when you can easily pick up a fabulous loaf at Columbia City Bakery. These breads sport an incredible, nice rise, bubbly texture, delicious fresh milled wheat taste and dark crusty finish. Superb scones and lots of other breakfast items keep us Columbia City neighbors happy each morning. If they are not cleaned out of their heavenly flaky buttery croissants, don't leave without one, or two... The cardamon coffee cake is to die for!Fit for the seriously Swabian trained appetite I acquired living in Stuttgart: try their REAL pretzels. These doughy and fresh pretzels come in several manifestations including hot dog rolls. The buns are PERFECT for the picnic or backyard bratwurst barbecue. Those pretzel rolls sop up beer and onion braised brats and kraut like they were made for business. Not bad just plain with a swipe of mustard either!There's a nice assortment of excellent desserts, although not as huge a selection as the boulangerie in West Seattle. This is a wonderful place to grab a breakfast goodie, a fresh tasty artisan lunch sandwich and magnificent dessert to take home for later. It sure gets busy here, but service is efficient, friendly and ever so courteous. Kudos for keeping the long lines moving. I have never experienced poor customer service here. They do sell out of things (no surprise), but there's always something else worth trying left in the case or display. This place is the best reason I work in and commute to Columbia City!", "Date": "2012-11-04", "Author_Location": "Seattle, WA"}, {"Author": "Katherine S.", "ReviewID": "e2E5dYqVY_d6WhO9J46UuA", "Overall": "5.0", "Content": "Their WALNUT CROSTINI is the best I've ever had!!! Highly recommended. They have good coffee as well as other delicious pastries but I would for sure try their crostinis!", "Date": "2013-09-06", "Author_Location": "Kirkland, WA"}, {"Author": "Kristin C.", "ReviewID": "LECz-dSkwTqgytnRaeccpg", "Overall": "4.0", "Content": "I don't know if it was the cake, my company, the location, or all the other customers. But I'm in love, that's for sure. I do love a good local bakery, so after walking by here on my way to Brunch, I knew I had to stop in on my way back. I am so glad we did! There were so many great treats to choose from. Fresh baked breads, bagels, cupcakes, etc. We went with the chocolate whiskey cake. The frosting wasn't the best, but the cake itself was moist and tasty.  I love the location right on Rainer in the middle of Columbia City(my new favorite neighborhood). The place was packed with locals, grabbing breads to go, or enjoying breakfast with their friends and family. I do love a good coffee and pastry for breakfast. I wish I had a place like this in my own neighborhood! A good neighborhood bakery can really help define a neighborhood, and I think this places does for Columbia City. So fantastic!", "Date": "2012-09-05", "Author_Location": "Issaquah, WA"}, {"Author": "Sara S.", "ReviewID": "QBxyrzYyagEF3gf-K5tCeg", "Overall": "5.0", "Content": "OH, you delicious baked fluffy salty pretzel you - how are you only $2?  I love you.This is one of the best spots in the CC neighborhood.  Just filled with pleasant, friendly people enjoying a pastry or a beverage and nice company.  Plenty of seating, in or outside.The people who work behind the counter are unbelievably sweet and smiley, which I appreciate of course.Also, I don't know what Chris S. is talking about - my mama bought a bear claw and and it was not $4.50; it was around $2.  (Same as my pretzel, which was worth every penny.  Dare I say, even better than the ones from Leavenworth?  Yes.)", "Date": "2012-07-18", "Author_Location": "Seattle, WA"}, {"Author": "Clover A.", "ReviewID": "YAzlNcS5aU-EcKuzh3qzyg", "Overall": "5.0", "Content": "I understand I've just said this bakery is perfect. And nothing's perfect, right?Their ham and gruyere croissants are.Their chocolate cake is.The way they always have different yummy shortbread iced cookies that make my daughter's heart skip a beat is.The way the staff makes my coffee like they're making it for their best friend who they also have a crush on is.The way you can always count on them to have something totally amazing in the case to take and WOW someone is.Their cute and hip and sweet staff are.So it's not perfect, but it's perfect for me.", "Date": "2010-07-26", "Author_Location": "Seattle, WA"}, {"Author": "carrie L. B.", "ReviewID": "sIamMa3u7k_YUZXn2Lqqxw", "Overall": "5.0", "Content": "My hips and butt are begging for mercy, my gut runneth over, but how am I supposed to say \"No\" to my daughter's pleading sugar eyes when she begs to go to the bakery for breakfast in the morning before school?Besides, even though my thighs are saying no, my mouth is thinking yes, yes, YES!So every day, for the past three days, we've had breakfast at the bakery. Every morning my daughter has a baguette roll with jam, 1/2 a strussel bar (she saves the other half to put in her lunch bag), a glass of milk and an \"Orange Orange\" Vitamin Water. So if that's what you're into, you can get yourself that for breakfast. I'm just telling you so you know.But if you want a tall double latte, served in a proper cup with saucer, made with high quality beans ground the moment your beverage is ordered and a different delicious pastry to go with that dreamy latte every day, then you've come to the right place. On Wednesday I had a delectable pain au chocolat. My only criticism was that it was TOO SMALL!!! Dang it was good, though. And I just couldn't look like a pig and order another one. Plus, it really wasn't too small, it was just right. I wanted it to last forever. Yesterday I had a buttery slightly zingy orange ginger scone with that yummy crunchy sugar stuff on top. And this morning I had a ham and Gruyere croissant. All that melty cheese in those flaky buttery layers... be still my heart. But not literally. Because although delicious, it also tasted heart stopping.As I dropped my daughter off at her school around the corner, we agreed that we'd only, in future, go once a week. My poor over worked jeans are saying a silent prayer of thanks.", "Date": "2007-05-25", "Author_Location": "Seattle, WA"}, {"Author": "Calvin Y.", "ReviewID": "iUXZ1m-oxztSilrgw5Qjyg", "Overall": "5.0", "Content": ":: takes a deep breath :: Besides loving the smell of a fresh bakery, this place is definitely a breath of fresh air!   They have such a wide spectrum of pastries that it makes decisions incredibly difficult.... which is good, but bad for my love handles because I intend on making multiple trips back.    After some friendly advice, I decided on the Bostok (Brioche bread + almonds + powdered sugar on top).  The nice part about the Bostok is that you can really taste the orange blossom water.  $5.10 (with tax) for a tall coffee and one big pastry.  Not too shabby.  P.S. --- They have Vanilla Sugar and that makes drip coffee so much tastier.", "Date": "2010-01-26", "Author_Location": "Renton, WA"}, {"Author": "Will L.", "ReviewID": "5J81Ewa3VMOSxhxVVFDUZA", "Overall": "4.0", "Content": "I happened to come in on the three year anniversary of the Columbia City Bakery. Portions of their proceeds were being donated to UNICEF. \"Cool,\" thinks me. \"I didn't send my nickel back to UNICEF this year and I was feeling guilty about it.\"Ok, I wasn't really.The Columbia City Bakery is one of those establishments in this little neighborhood village that fills me full of delight that I moved into this southern Seattle area. The folks behind the counter are friendly, their baked goods are delicious, and they make great coffee. Having just ate an Ethiopian lunch down the road at Fana's in Ranier Court, I decided to treat myself to a chocolate croissant and a cappuccino. Technically, you're not supposed to drink cappuccino after about 11am, at least according to some crusty Italians I met in Padua, but this ain't Padua. Sorry Crusty Italians!I also grabbed a couple chocolate cream filled baked goods that were similar to an eclair but not named \"eclair.\" I have no idea what they were called, as it was some French word and the only french I know and remember I learned in the movie Top Secret:\"Latrine, Chocolate Mousse, and Deja Vu...\"\"Have we met before?\"Oui Oui!Anyway, I hung out at one of the tables and sipped my very-frothy cappuccino, read a paper, and enjoyed watching several parents wander in and spoil their toddling kiddos with cookies and cupcakes.", "Date": "2008-10-14", "Author_Location": "Los Angeles, CA"}, {"Author": "Claudia C.", "ReviewID": "1z9Ylu06fR1dCyLUxRNxZA", "Overall": "5.0", "Content": "wonderful place. not to many dairy free options but the cookie i got was delightful and well priced. and the coffee that i got was great. they worked with me when and my odd request of wanting a soy milk latte with light on the soy milk. they basically made me a americano with steamed milk. it was nice. and i didn't even notice they have soy milk to the side with the rest of the milks for americanos. and the vanilla sugar was great. vanilla beans in the sugar. so nice. just with they had nutmeg but the cinnamon was good.", "Date": "2014-04-02", "Author_Location": "Lynnwood, WA"}, {"Author": "Kiki M.", "ReviewID": "x1WwB74Zkk92l9dW_7tk_g", "Overall": "4.0", "Content": "I love bakeries. Let's get that out in the open right now. Hell, I love anything sweet. I had heard great things about this bakery and since I just happened to be in Columbia City, I decided to stop by.You walk in and it feels like a breath of fresh air. its medium sized yet open, very clean and minimal. You've got your tables and chairs, the display, the kitchen, and an area for utensils, coffee enhancers, garbage, and recycling.  There is your tour of the place. After my visit to Lottie's Lounge my sweet tooth was kicking so I decided to head over to Columbia City Bakery. I am greeted by a smiling gentleman. I browse the shelves. There is plenty to choose from. Bars, cakes, cupcakes, cookies. It was a saccharine wonderland. There is also an extensive bread selection. After pondering my choices I settle on the chocolate cupcake with white frosting and mini chocolate chips sprinkled on top. After I am all checked out, I sit at a table and dive in. I force my fork through the mile high frosting and thick cake. I put it in my mouth and am surprised to find it sweet but not overwhelmingly sweet. It was subtle and good. I finished up and with my belly full and my sweet craving calm leave.I will return to Columbia City Bakery. I simply have to try more tasty sweet concoction and get myself some bread to go.", "Date": "2009-04-09", "Author_Location": "Seattle, WA"}, {"Author": "Lissa M.", "ReviewID": "8sL74m1c572MnW7RFyJstA", "Overall": "5.0", "Content": "I can't believe I haven't written about the Columbia City Bakery yet.  It's one of my favorite places on earth.For my birthday, I ordered a whole cardamom pear coffee cake.  They told me they would bake it the night before, but when I picked it up it was hot.  And let me tell you, I like chocolate and bacon and french fries as much as the next girl, but this coffee cake? It's the world's most perfect food.Until you start sampling the croissants, sandwiches, gougeres ...If you value your figure, do not visit the Columbia City Bakery.  Leave the treats for me.", "Date": "2009-05-14", "Author_Location": "Seattle, WA"}, {"Author": "Christy A.", "ReviewID": "2VzoKPFE-wsVgA0HL6FKoA", "Overall": "5.0", "Content": "This place makes me want to move to Columbia City just so I could have breakfast here whenever I wanted (which would be every morning).  This clean, comfortable shop is fun and inviting, serving up beautiful baked goods, delicious coffee (top-notch soy latte) and customer service that is a cut above the competition.  I got the feeling that the staff were treated well and genuinely liked working there.  After three weeks of staying in the area, I was already a \"regular\" of sorts.  The jubilant staff (how can they be that cheerful first thing in the morning?!?) remembered my name and my drink.  By the third week we even had inside jokes (and I think one of them involves me being known as leggings girl after I came in with my workout clothes on...not sure if this is a good thing...but I'm glad some of the staff there also appreciate a good pair of leggings!)I tried their homemade granola bar which was tasty and wholesome.  In a moment of weakness I had a savory scone (really not supposed to eat baked goods) but it was totally worth it.  On one occasion I casually \"interviewed\" other patrons while waiting for my coffee, and they gave the croissants and breads two thumbs up.  I noticed that the music is always great, and staff and patrons just seem happy.  The vibe is contagious.   I can't wait to try the quiche, which looked and smelled lovely coming out of the oven.  I really can't think of any cafe/bakery I would rather visit.", "Date": "2009-08-05", "Author_Location": "Seattle, WA"}, {"Author": "Ariel S.", "ReviewID": "QwhiZcfpUGw9_U3Q2uvnzQ", "Overall": "5.0", "Content": "The pastries are amazing ... I had a fruit & cream danish that was totally nuanced and flakey and delicious. And while I can't vouch for the coffee, I will say chai drinkers, take heart! They serve Morning Glory. We've also starting picking up a loaf of bread for the weekend -- the potato loafs are my fave, thick and round and soft and sumptuous. ALL HAIL CCB POTATO BREAD!This is also a total gentrification station. When I was at the bakery this morning, there was a photographer taking pictures for a Seattle PI article about gentrification in Columbia City. This bakery is definitely part of the \"change\" that's transformed the neighborhood from a slightly-sketchy transitional 'hood into a boutiquey scene. That is not a critique. I love this place. Well-worth a drive.", "Date": "2006-12-10", "Author_Location": "Seattle, WA"}, {"Author": "Erin A.", "ReviewID": "vZzjw7sq1ad_Fp6A_V_c5w", "Overall": "4.0", "Content": "What a cute little bakery! The place definitely smells good! I wanted to order a piece to take home to my roomies. I asked the worker what his favorite item on the menu was and he picked out a chocolate cake with what seemed like maple icing. I just got done checking out the menu for the 2nd time and I want to come back for the tiramisu. I'm the type that is trying to give up sweets... but, all the items on the menu look and sure does smell good!", "Date": "2013-10-21", "Author_Location": "Mesa, AZ"}, {"Author": "Jay S.", "ReviewID": "A46KMNZxZsWYbwuF7e51AQ", "Overall": "5.0", "Content": "My husband and I lament Columbia City Bakery didn't exist when we lived nearby  - it might have kept us in the area longer!I sneak over here when I'm in town to grab a delicious variety of pastries, and will work my way to savories with due diligence!  Masterful French pastry classics, beautiful tres leches, black bottom cupcakes, moist danishes and profiteroles,  gorgeous breads and chocolate chip cookies my children adore.   Most pastry items run in the $3 category.  Breads are in the $4 range.  Very reasonable for the quality and infinitely worth the satisfaction.Solid coffee to go with your selections - good lattes.Bonus:  they have a program to train locals.  Bonus Bonus:  They are offer a subscription program that delivers!!", "Date": "2011-07-15", "Author_Location": "Tacoma, WA"}, {"Author": "Jim E.", "ReviewID": "VtHCnXv1xW3WdTwSErdYKg", "Overall": "1.0", "Content": "I'm sure they will forever be a great bakery, but I'm officially over the CCB as a cafe and a place to spend time.  Done.   The staff was perfunctory and exasperated to the point of being rude, which is understandable because the place was clogged with a unique strain of doting Columbia City moms, their strollers, and their kids.  ...the kind that interact just a little too loudly and publicly with their children, for everyone else's benefit and to demonstrate how awesome, insightful and hip of a parent they are to everyone within earshot.    Simultaneously times 10, that was a little hard to take. There was not a free seat to be had, even hoping to share a table.   I ate my cookie sitting outside, with a dog lashed to a stroller growling at me the whole time.  Granted, it's in the middle of Winter break and all kids are home, so this may be atypical.   Plus, I'm not sure a venue should be blamed or their clientele.   I'm pondering these good questions from the Starbucks across the street, enjoying the sort of breakfast snack and laptop time I was hoping for at CCB.    I usually do anything I can to favor a local business, so that's saying something.", "Date": "2011-12-20", "Author_Location": "Seattle, WA"}, {"Author": "Carla J.", "ReviewID": "tdQAZkOmbM0tmlhbSyIZrA", "Overall": "5.0", "Content": "Ham & Cheese Croissant, tres leche, sweet potato baguette EVERYTHING I have put into my mouth has been wonderful! I love this little spot of heaven! Everyone is so nice and friendly, even when the line is to the door!", "Date": "2010-12-06", "Author_Location": "Seattle, WA"}, {"Author": "Jens J.", "ReviewID": "3w6dw5J4uiSHTe4M5ogf1g", "Overall": "3.0", "Content": "Upon entry, I was surprised not to catch a whiff of anything baking.  Instead, it smelled like cleaning solution.  That is, except by the cash register, where the customer standing next to me exuded eau de hippie.  The bakery was buzzing and all the tables were taken, so this place is popular.  But I was underwhelmed by the selection.  I'm guessing Col. City Bakery focuses on breads, and not so much on treats.  But anyway, the blondie I had was excellent with a pleasing moist density to it and a good mix of nuts and chocolate chips.  The babka, while having a nice pull-a-part texture, really didn't have much flavor.  It needed more cinnamon and could have stood to be sweeter.They have coffee, soda and other drinks, but no milk.  No milk??On a positive note, the gal at the counter was friendly and very helpful.", "Date": "2009-06-19", "Author_Location": "Seattle, WA"}, {"Author": "Lori M.", "ReviewID": "7MWHkT97TB8EDiygFGnoTA", "Overall": "5.0", "Content": "Fantastic bread. I really wish this place were closer. We stopped in after lunch at Island Soul next door to pick up some bread to make Vietnamese sandwiches. The bread had a great crunchy exterior (without being rock hard) and a soft interior with good chew. They had lots of tasty looking pastries and pies in their cases, but I was on a bread mission. So I can't really speak to whether the pastries are as stellar as their bread.The location itself seemed kinda small if you wanted to go in there to enjoy a pastry for any amount of time. Come here and get some bread if you're in the area.", "Date": "2010-12-05", "Author_Location": "Seattle, WA"}, {"Author": "Mairead R.", "ReviewID": "y-TpKAI63-16S4MmZw4RDQ", "Overall": "3.0", "Content": "I'm sorry, in advance, for the whiney tone of this review. I tried several treats and found each one slightly off. The staff were welcoming, the atmosphere warm and filled with the scent of fresh baked goods. Presentation in the case was particularly lovely. However...The tomato, bacon, and lettuce sandwich on sweet potato roll was too small for the size of their filling. Tomato jam too acidic for the sweet potato roll. Carrot cake was frosted with buttercream not cream cheese frosting. A poor choice since it was very buttery and gloopy. Cake was decent but felt course compared to the frosting. Chocolate croissant was dry and the chocolate inserts were rock hard. Perhaps I got a day old croissant but it was off putting. Perhaps an off day? I love Columbia City and want to support  this nice bakery. Will try again and report back.", "Date": "2012-01-06", "Author_Location": "Seattle, WA"}, {"Author": "Bridget L.", "ReviewID": "m03yOoQ37gRwqKlsC_uXvw", "Overall": "5.0", "Content": "The only bread worth eating in this city!  They also serve a good granola.  It will make you think you're eating healthier!Once in awhile they have a upside down cake that changes with the season.  A wonderful dose of childhood nostalgia!And if you get the pretzels or pretzel dog....DON\"T FORGET TO ASK FOR MUSTARD!", "Date": "2007-11-15", "Author_Location": "Seattle, WA"}, {"Author": "Steven C.", "ReviewID": "Sq4vsdmQwoKKmWtavvKY3A", "Overall": "5.0", "Content": "Ok, to say that they have the best ciabatta in the world would be an understatement( rumor has it they shipped real ciabattians to make the bread every morning)..And super choco chunk cookies that come in bags of 12 'cause 6 just aint enough, But enough 'bout that...Have you tried the gougere? If God made savory treats this is what he/she would make. And the staff, can't say enough about the staff they are a friendly bunch with knowledge of baked goods to spare. Thank you Columbia City Bakery for all the savory goodness..", "Date": "2009-03-05", "Author_Location": "Seattle, WA"}, {"Author": "Amy B.", "ReviewID": "7OfL7w1QfS054d9IysGsHg", "Overall": "4.0", "Content": "The Columbia City makes some awesome breads, and cookies, and cakes - anything with flour, really.  I've always been very pleased with the toothy chewy breads that this bakery cooks up.My only complaint is that the bakery seems to be very intent on using flax seeds and oil at every turn.  I know that this stuff is mega healthy, but sometimes you just want a chocolate chip cookie!I adore their stand at the Wednesday markets - they have one of the most popular booths in the place and offer fantastic fresh baked breads and sweet things available at very fair prices.", "Date": "2007-09-09", "Author_Location": "Seattle, WA"}, {"Author": "Richard U.", "ReviewID": "c2c74f1_LcNrX_h8oFhlSg", "Overall": "4.0", "Content": "This place is pretty great!  Reminds me of one of my favorite bakeries back in Michigan .  Cozy atmosphere inside with an eclectic crowd ranging from Seattle hipster, elderly couples, cramming collge students or families with small children.    This is a temple to all things carb-related!  Crusty baguettes, tasty and interesing cookies, buttery croissants (and pain-au-chocolate....yum).  The cakes looked so good I think I might just buy one and nurse off it for a few days.  They do have an espresso bar so you can stay caffeinated while you down another cookie or two or three.  For those tea afficionadoes out there, they do serve tea by the pot and pretty cheap. Its Mighty Leaf so its the better of the bagged stuff, not completely loose leaf.  But who cares!  I had the peanut butter and jelly cookie and pain-au-chocolate which were fantastic!  great place to do some work, have a nice chat or totally blow that diet you were hoping to stick too...(not me).", "Date": "2010-09-17", "Author_Location": "Seattle, WA"}, {"Author": "Cynthia L.", "ReviewID": "9ez_Y1t6XJ7-tcFmnqs4Aw", "Overall": "4.0", "Content": "Gruyere and Ham Croissants. That could be my whole review right there, but I know that you would come after me with chainsaws and sharp objects.They are SO good in fact, I had a \"croissant-off\" with a friend that works as a chef. Confident on my part, yes, but I knew that Columbia City could win the duel. His choice of croissant to offer as a fighter: Macrina's Bakery.We met in a dimly-lit hallway in an unnamed office park in Bellevue (neutral ground), holding our bakery boxes, warily eyeing the other. After some teeth-gnashing and smack-talking, we got down to business.  We each had brought one judge for the showdown. We needed neutral parties to taste our offerings, although I truly felt that his case was already in vain. (He had brought PLAIN croissants: mistake #1.) The judges tasted our respective goods. I removed the ham from mine and ate it with gusto. I have had Macrina's plain croissants before and enjoyed theirs as well--though not with the same enthusiasm as CCB's. We all noted that CCB's croissants were heavier, richer and firmer in texture than Macrina's and the judges were weighing their choices. But then...a pivotal moment arrived: Everybody became thirsty from eating the croissants. I deftly reached into a grocery bag I brought specifically for this purpose. I could see my friend's mouth open in slow-motion, \"Noooooooooo!\" as I handed them a refreshing beverage to cleanse their palate. I looked over at him with a look of triumph on my face: mistake #2, my friend.The judges raised their hand to vote: Macrina - 1... Columbia City Bakery - 1.Dang it, why didn't we bring THREE judges?! Both my friend and I had to own that mistake.  Summary:Prices = Pricey, but then again, they're a preferred bakery for many famous restaurants in Seattle, so what can you do.Service = 50/50 hit-and-miss. Sometimes bright and cheery, sometimes...not.Atmosphere = Bustling and neighborhood-y.Food = So good, I'll go to battle for their croissants, bread and cookies.", "Date": "2012-07-17", "Author_Location": "Seattle, WA"}, {"Author": "Sophie J.", "ReviewID": "Q1NbPBNtwxGeINwpPf0ISA", "Overall": "5.0", "Content": "If only I could make it here more often, kind of a trek (especially now that I live in Ballard!) but worth it!The danish is absolutely divine and they have some interesting seasonal combos, I think one that I got once had blood oranges in it, yummy!If you are a bitter chocolate fan, the chocolate croissants are for you.And a friend believes their ficelle (kind of a thin baguette) is the best he's had after visiting Paris.And you can't go wrong with the Pistachio Pinwheel!  I need to try their babka...never seen that anywhere in Seattle, just on Seinfeld!", "Date": "2006-11-23", "Author_Location": "Seattle, WA"}, {"Author": "Leonardo R.", "ReviewID": "ysdkrQhtc8LinBMRHX8TPg", "Overall": "4.0", "Content": "I first was introduced to their bread in a restaurant and after a little research found out where this was and its only 10 minutes away from me;) although i haven't tired a lot of their products i can tell right awasy they have some great ones! the focaccia bread its my favorite with some olives and olive oil,the staff is real nice!!the sell some pretty coffee mugs and shirts on the side!i will definitely recommend this place for people walking around the Columbia city hood to stop get a coffee and some good treats !!\\ipb", "Date": "2010-10-03", "Author_Location": "Seattle, WA"}, {"Author": "Jamie J.", "ReviewID": "3gE4tXbTLAQDa08RPv5NBw", "Overall": "5.0", "Content": "This is my favorite bakery/coffee joint in town... why? First off, this little cosy nook is perfect for a coffee date with anyone. I actually went on a date here with someone and it was perfect. Just the right amount of space but still had that cozy atmosphere that I was looking for. It's surrounded by such a cute little neighborhood in Columbia City too. The smell is amazing. It's kind of surreal. Mhmm I can smell it now. Fresh baked goods and hot coffee. Mouth watering. Their service was great too. Funny folks behind the counter who have the patience you need in coffee shops to wait on indecisive coffee feigns.They also have really good coffee and even better desserts! Give me a good latte and a nice dessert and I'm set. I loved it. The price isn't too bad either. The highlight of this place is definitely the desserts and goodies. I would recommend the Carmel bar. Thick and gooey and just delicious. I also had a bite of the cookies and they were really moist and sweet.  Overall, for great coffee, amazing desserts, friendly service and a low price tag... This is it.EAT it up...", "Date": "2010-03-08", "Author_Location": "Seattle, WA"}, {"Author": "Matthew L.", "ReviewID": "BZtlTDea_raSWcnUhouv3A", "Overall": "1.0", "Content": "I rated this bakery 1 star for the awful hipster wanna-be lousy attitude and service. The baked goods are good, but the service is ridiculously flawed.I visited the Bakery last Wednesday, in the afternoon, and the experience was so bad I feel compelled to complain. I've tried their products often, but only purchased from the Farmer's market.I was stunned by the careless service and the lack of engagement by the counter attendants. They were indifferent to the point of rudeness, except with their interaction with each other behind the counter.I wasn't given what I ordered, which was particularly annoying with the lack of attention of the counter attendant. When I asked for a bag for my purchases The girl behind the counter dramatically looked at her co-worker, rolled her eyes and told me in a condescending tone that'll be 5 cents, Which isn't an issue at all, The issue is the rude and unneeded behavior.While I enjoyed the bread and the pastries ( even the ones I didn't order). The attitude and lack of customer service is insufferable, and inexcusable.", "Date": "2013-07-19", "Author_Location": "Seattle, WA"}, {"Author": "Vicki L.", "ReviewID": "unNiXsw2I4bRPVcoxtjb7w", "Overall": "5.0", "Content": "Let me start off by saying I am a carbohydrate fiend. I'm Dr. Atkins' worst friggin' nightmare. I probably purchase at least 2 full sized baguettes a week, and you better believe I eat those suckers up!Having said that, Columbia City makes hands down, my favourite baguette in the entire city (thus far). I've ordered baguettes from a ton of bakeries in the area, but CC's got the baguette down to a fine art. There are varying types of baguettes - some are light, fluffy, relatively substance-less, and good for sandwiches (think banh mi style baguettes), and others are wheat-y, dense, moist all-around and hearty (Wild Wheat, Tall Grass, Grand Central Bakery baguettes all fall under this category). Columbia City makes a baguette with a crisp, crunchy exterior encasing a deliciously soft, air-y center. It's the quintessential \"fancy cheese\" baguette - that is - you can't put anything less than 5 star locally produced raw milk / chevre style cheese on this baby - or just eat it plain and unadulterated.I've yet to actually make it to the bakery itself, but I stop by their table every single Sunday at the Broadway Farmer's market and always, without fail, pick up a baguette and a pretzel, and like always, I am never disappointed by their quality and consistency! Keep up the good work guys.", "Date": "2010-08-23", "Author_Location": "Brooklyn, NY"}, {"Author": "Maria K.", "ReviewID": "oTXIiORwpJDQU_1Vbxy2SQ", "Overall": "4.0", "Content": "A hustling, bustling bakery with no shortage of amazingly looking and tasting goods for decent prices.  The decor was simple and understated, but it fit perfectly.  I stopped here for a mid-morning snack with a friend and was overwhelmed by the variety of options - everything from whole cakes to smaller cookies, mini macaroons.  Although the place was packed, they were able to move everyone quickly through.  I absolutely adored the beehive frosted shortbread cookie I had.  It not only looked amazing, but was also delicious (something not all bakeries can achieve).  The almond macaroon I had was also a true bargain at just $1.  This place is a true asset to the neighborhood.", "Date": "2012-04-29", "Author_Location": "Seattle, WA"}, {"Author": "Yen T.", "ReviewID": "99rQnR-fPY-Cut68ABaeLA", "Overall": "3.0", "Content": "A 3 from me means:  You'll have to coerce me into coming here; but I'll do it rather willingly.Definitely not a place to sit, drink her beverage, enjoy your baked goods, and read your book.... but as a bakery, it was pretty good.My chai, however, sucked.  It tasted like steamed milk; not sweet and definitely did not have any spices it in.  Sad.", "Date": "2009-03-19", "Author_Location": "Thousand Oaks, CA"}, {"Author": "Dominique F.", "ReviewID": "PBPn7YMjcopEWN8Bl52jcA", "Overall": "5.0", "Content": "I love how chill the place is.My friend and I came in and brought a couple of baked goodies, and they were both delicious!Def. recommended; you could even come here and get some work done!", "Date": "2011-08-02", "Author_Location": "Chantilly, VA"}, {"Author": "Nathan J.", "ReviewID": "2Ye2-gu1zQZa5qvGZcxKzw", "Overall": "2.0", "Content": "My review is for the bread only.I couldn't be less impressed by a 4.5 star reviewed bakery than i was with the quality of the bread here. It seemed to be put together carelessly and rushed. The baguettes I purchased were slashed 7 times, and seemed to be baked dry (no steam in the oven possibly). The end result was a very flat, almost oval shaped, depressed baguette. Now this isn't a deal breaker if the taste and texture is superb. However, the crumb structure was terrible once I cut into said baguette. One entire side was an air bubble, like literally from crust to center for the majority of the length. Ok so maybe they all are not perfect right? I've had 4 baguettes from Columbia City Bakery, and all have had the same crumb structure problems.I may seem a bit petty, but a baguette is far and away the most important item a bakery can produce. Its also the most simple, thus I require a much higher level of quality.   I have heard the pastries are nice, but seeing the care that went into the purchases I have made I don't think I will be giving them a try.", "Date": "2009-02-05", "Author_Location": "Denver, CO"}, {"Author": "Val J.", "ReviewID": "E6QQTHgsVuOLkMjb8ndDRA", "Overall": "5.0", "Content": "I popped in here on a whim in search of a gluten free snack.  Sour cherry bars....Fabulous! Going back today for more.", "Date": "2013-11-16", "Author_Location": "Bothell, WA"}, {"Author": "Alison V.", "ReviewID": "Ne2NNmQ_W91w_JMGMDGJTw", "Overall": "5.0", "Content": "So I've only been here once and momentarily but what I took home was delicious!  I didn't try any of their coffee or anything like that, I was only there for the pastry.I got an almond macaroon - for $1 - which was beyond heavenly.  Fresh and not too crunchy.  Also, an apple thing that the boyfriend ate.  But what really wowed me was the blondie.  Not many people make a good blondie anymore.  However, Columbia City Bakery impressed me with their deliciousness.  I\"m looking forward to treating my mom to her favorite treat when she comes to Seattle!", "Date": "2008-04-21", "Author_Location": "Albany, NY"}, {"Author": "Sandie L.", "ReviewID": "bodLlFsBpCTvIWcQ1FPIAg", "Overall": "3.0", "Content": "I love that this place offers outdoor seating!  My friend Julie L and I had a great time drinking our cool drinks and tasting our treats while we \"window shopped\" from our seats =DThis place was very crowded and seems to be crowded each time I pass by, which is always a good sign for me...... I ordered my iced soy mocha and lemon ginger scone.... results were:  scone very tastey, and coffee okay.  I will definitely be back again to try more treats, but will pass on the coffee.I am a little sad that the savory scone had pork, but it looks like they might have other veggie options so I think my next trip will be early morning vs late morning/noon.", "Date": "2009-07-11", "Author_Location": "Seattle, WA"}, {"Author": "Amie S.", "ReviewID": "sVxqKSy8uClu6voYPrDcSQ", "Overall": "5.0", "Content": "Columbia City Bakery is a winning stop for soups and sandwiches, savory and sweet croissants, veggie and meaty quiches, plenty of other yummy fresh-baked seasonal pastries, and the BEST cupcakes in town! I was taken in by a savory croissant topped with butternut squash, caramelized onions, and goat cheese, but a simple chocolate cupcake with vanilla frosting rocked my world! The cupcakes are square, which is cute, but I'm talking about super moist cake and perfectly silky smooth butter cream! In the end I had to cut the cupcake in half and make it into a pseudo oreo just so I could grab it with both hands and get serious about each and every delicious, cakey, frostingy bite. Luckily, it's a very mellow neighborhood establishment with friendly staff who understand the unchecked deliciousness of their product, and don't judge customers for slamming the baked goods down their gullets. There's enough seating that any patrons who were put off by cake inhalation could distance themselves. I'm sure there were families averting their children's eyes from the frightening table manners....but a person cannot be responsible for etiquette in the presence of cupcake perfection!", "Date": "2008-12-12", "Author_Location": "Seattle, WA"}, {"Author": "Christopher S.", "ReviewID": "-F0eGJelXIIbHeBgw3LrHg", "Overall": "4.0", "Content": "Best baked goods in Seattle. Minus 2 stars for the price. A bear claw costs close to $4.50. REALLY.  It's super delicious but that's just lame. Their bostok is easily as good as the famous twice baked almond croissant from Bakery Nouveau.I know you're saying to yourself 'he said minus 2 stars for the price'. Yes I did, but the place seriously rallied with super cute barristas (female) who dress very nicely (I'll leave it at that).  So + 1 star. Yay.", "Date": "2010-08-31", "Author_Location": "Seattle, WA"}, {"Author": "Mr. F.", "ReviewID": "jsUbKpy045oA7lxNW_nc5w", "Overall": "2.0", "Content": "The place smells great--like the Honey Bear Bakery, if you remember that from Seattle back in the day. The people working there clearly were not interested in treating my gf and me with a modicum of warmth. I asked a question of a young woman and she and the guy working next to her got into a small disagreement about how one of their items is prepared. He headed to the back and even more loud discussion ensued. In the meantime, they acted as if I weren't even there. So I left. Remember when the service economy was about service? Yeah. Not anymore.", "Date": "2013-06-03", "Author_Location": "Seattle, WA"}, {"Author": "Richard B.", "ReviewID": "I64Q0GEWfvjo-lNUoH9mWQ", "Overall": "3.0", "Content": "CCB is a bakery with good pasty, coffee, and comfortable areas indoors & outdors to enjoy both. Pistachio Snail, Danish with sour peach, and Boska all good ways to linger on a Sunday. It's a busy place but if you ask for help or an opinion you'll certainly get it. Looking at 16 items in the display case and the lady behind the counter gave a recommendation, clearly it pained her a little...like asking her to pick a favorite child. Why people choose to go to the Starbucks kitty-corner to this place when a better experience is a few steps away is beyond me.Open layout, only encumbrances tend to be the line on the weekend.", "Date": "2009-08-20", "Author_Location": "Seattle, WA"}, {"Author": "D.J. Y.", "ReviewID": "AK97NBAsUEAJFWxq9Im4ew", "Overall": "4.0", "Content": "OMG enough said...get there NOW!Baguette was to DIE for, I kid you not.  Perfectly crusty outside, almost foamy yet full of body interior....drool... just for this baguette I would sell my first born...ahem don't tell her I said that...Found out about this place from a French restaurant we found in Madison park, asked them about the bread they served and they pointed us in their direction....DROOL....  Bread....I LUV this bread......period.....", "Date": "2012-04-04", "Author_Location": "Shoreline, WA"}, {"Author": "Marie B.", "ReviewID": "psNMGMZA4QKme_3bnZXOxA", "Overall": "5.0", "Content": "Back again this time with a college friend in tow. Pretty much a repeat of what was experienced from my previous post - so it is consistent and maintains the high quality. Plus the counter staff are super friendly and make a killer mocha.  Plus this time got to say hello in person to business owner, Evan Andres. The glass case full of lovely pastries, cakes, cookies, and desserts. Quality sandwiches available to take and go. Baskets full of an assortment of artisan breads. Next time I'll be back because I saw a tres leches confection.", "Date": "2013-09-26", "Author_Location": "Shoreline, WA"}, {"Author": "Amary N.", "ReviewID": "Eli7kiMKJ5H855UES3BzOg", "Overall": "5.0", "Content": "I love the service here! The best!! What's not to love about their pastries?One could argue about the very brown Danish pastries. That's a matter of preference.  I highly recommend people to stopby this place.  You'll see many of their loyal patrons. Keep up the good work!", "Date": "2008-03-15", "Author_Location": "Seattle, WA"}, {"Author": "Mike T.", "ReviewID": "xpmo7OJzT9OT1QaIo_dN7g", "Overall": "4.0", "Content": "This is the place for fresh baked goodies in the southend.  Every morning they roll out an amazing array of baked goodies starting in the morning with different types of croissants, muffins, scones, quiches, and my personal favorite the meat torta!  A rustic mix of egg, onions, bacon, on a fluffy pastry dough.  Think of a messy lighter version of a quiche.The artisan breads are done just right with nice crusty outsides with fluffy chewy insides and the afternoon selection of simple sandwiches (tuna, ham and cheese) make for a perfect light lunch.  The space itself is nice and open with a few tables and a cooler to pick out your favorite cold drink (i.e. juice, soda).  In nicer weather you can grab a seat at one of the bistro tables on the sidewalk.  When you're there do me a favor and look up at the rotating ceiling fan.  It's pretty cool.", "Date": "2010-02-15", "Author_Location": "Seattle, WA"}, {"Author": "PathGeek G.", "ReviewID": "vBCycJkY2PD6AJhp8YczQg", "Overall": "4.0", "Content": "There is one enormous downside to this place: it's popularity.It's in my neighborhood, so I frequently use it as a goal for a long walk-- coffee midway, and all. The line is frequently out the door.  I'll wait.  The latte's are wonderful. I haven't looked to see what roaster they use, but the latte is rich and bold, with marvelous woody and smokey but not overroasted undertones.  Pastries are swoonable.  Evenmore--having lived in Philly and considering myself a connisseur of soft pretzels, theirs come very very very close to being as good as .....nope, can't make myself say it. You get the idea !", "Date": "2013-10-14", "Author_Location": "Seattle, WA"}, {"Author": "Mikiko T.", "ReviewID": "RMJMRAU9DD7PmtLnZDtJSg", "Overall": "5.0", "Content": "The bakery was so cute -red door, friendly staff, and very clean, open space. :) And OMG, they make such a perfect chocolate croissant!Chocolate is not overpowering, perfect layers, what a perfect piece of croissant! I am ready to jump in my car and drive over there again :)", "Date": "2009-04-06", "Author_Location": "Seattle, WA"}, {"Author": "Sean D.", "ReviewID": "wLwIdGp--yXYyuTHgR4pIw", "Overall": "5.0", "Content": "Oh my lord. I live for both the Tomato Jam and Ham sandwiches. So. Amazingly. Delicious.I dream about them.The quiche and the tortas are great as well. The cookies too. The granola. The coffee! The bread. I'm getting hungry just thinking about all the delicious options.The bakery is also selling Approve Ref. 74 cookies as well to help fund the campaign. This is an awesome gesture.Delicious!", "Date": "2012-08-24", "Author_Location": "San Francisco, CA"}, {"Author": "Sasha D.", "ReviewID": "NWR-7atNXS_8xoQ8bDgQuA", "Overall": "4.0", "Content": "Yeah a local bakery that consistently produces fun treats and good breads and rolls. The breads are worth 5 stars most of the time and the selection shows a wide range of styles. Every so often they go a bit too healthy and produce a brick. Pastries are often very well produced, but have not reached the 5 star quality of Sweet & Savory in Mt. Baker. The croissants are buttery and somewhat flaky as to be expected for a general bakery. They are however, far more consistent then most other bakeries. Addendum : I had the chance to compare Sweet and Savory with Columbia City croissants and both are superb and each a little different. Just an aside. Please don't call what's happening to Columbia City gentrification. In my twenty plus years living in the south end I've not seen any of the landed gentry moving in here, but middle class working folks with families. Really I've not seen one fox hunt or olympic sized swimming pool here. It's deslumification. The crime ridden blight is moving elsewhere as the housing and commercial stock is too valuable to allow to rot.", "Date": "2007-05-31", "Author_Location": "Seattle, WA"}, {"Author": "Casey P.", "ReviewID": "790OUdvVSNr8SDOk8ZEYqg", "Overall": "5.0", "Content": "Great place for breakfast or 2nd breakfast or brunch or well you get the point. They always have something new to try whether it's sweet or savory and the trusty regulars. My favorites have been the cardamom coffee cake and ciabatta loaf. The ordering and seating is a little bit crowded but you figure it out.There is a credit card fee for under ten dollars, just get a couple things to go.", "Date": "2012-07-16", "Author_Location": "Seattle, WA"}, {"Author": "Jon L.", "ReviewID": "B_cy3tmWU3s9lltm7R-WkA", "Overall": "2.0", "Content": "With the opening of Light Rail to Seattle, I took a trip to Columbia City, a neighborhood which I have not visited in the 3 years since I have moved to Seattle. The specific place of my trip was Columbia City Bakery. It is on the shopping and dining corridor on Rainier Avenue.Having trekked out in hot weather to get here, I got an iced mocha to start. I picked up some potato and ciabatta loaves, as well as a slice of the cardamom coffeecake. The iced mocha was okay and actually seemed interesting similar to a Vietnamese iced coffee to me. The big disappointment to me was the bread. Both loaves were soft on the inside and hard on the outside. This is generally is okay by me, but I was put off by the burnt flavor of the crust. The inside of the bread appeared also a bit slight. As for the cardamom coffeecake, this was very good. It appears that I would be better off with the pastries here over the bread. Although it may have just been the varieties that I picked out. They did have a walnut loaf that looked intriguing however.", "Date": "2009-07-19", "Author_Location": "Bellevue, WA"}, {"Author": "Jean Y.", "ReviewID": "oQbmUIstIEJQV1r3ZlCw6w", "Overall": "3.0", "Content": "-5 stars for bread-3 stars for interior and atmosphere-3 stars for other baked goods-2 stars for location The baked goods my friend and I tried, a slice of cheesecake and an apricot tart, were fine but not exceptional. At around 3pm on a Sunday, there weren't a lot of choices left (no croissants!), so if I come again, I will try to show up earlier.The roasted potato bread we bought for dinner was very good. I've had their bread at local restaurants before and knew of Columbia City's good reputation.I liked the clean, spacious interior. Only one other customer was here when we arrived, and two more dropped in during the half hour we sat here. Not quite a warm and lively cafe atmosphere, but good if you need a quiet place to do work while snacking.Unfortunately, the location of Columbia City is very inconvenient for me. Seattle has other good bakeries with good breads on par with those of Columbia City, many of which are available at my local QFC or PCC. Much closer to home, Macrina Bakery sells comparable potato bread. If local grocery stores stocked Columbia City bread, I would buy it, but I don't plan to drive half an hour through unpleasant parts of Seattle just to come here. (Note: A few farmers' markets in Seattle sell their bread. See website for list.)If the location isn't a problem for you, I do recommend this place.", "Date": "2010-08-26", "Author_Location": "San Francisco, CA"}, {"Author": "Sheila L.", "ReviewID": "6BNWdKQa5-S-O1J1jrWqzg", "Overall": "4.0", "Content": "Love this cute bakery that's located in the heart of Columbia City (hence their name). :)They have a plentiful selection of baked goods and even fresh-made sandwiches that you can take on the go. My favorite has to be their sour batard bread which Geraldine's (across the street) serves with their brunch dishes. Mmmm... Definitely have to come check this place out!", "Date": "2010-10-31", "Author_Location": "Renton, WA"}, {"Author": "Patrick D.", "ReviewID": "BocxPp3QI9g9Y_Z9ErOyDw", "Overall": "3.0", "Content": "1 star for location and distribution, 5 stars for their sourdough bread. They make the best sourdough bread in Seattle, hands down. Very airy, moist crumb, substantial tangyness, beautiful outer crust.  Unfortunately it's a giant pain in the butt to get. They distribute to a few locations across Seattle, but all of those locations sell out of the sourdough in an instant because they only distribute 2 or 3 loaves.According to the lady at the Cap Hill farmer's market (where they were sold out) they only make a handful of loaves per day because it's labor intensive. Well, raise your prices or hire more bakers. If you can't produce enough of your product to ever keep it in stock reliably, you're doing something wrong. The sourdough loaves are $4.25 but I'd be willing to pay up to $6 for them. They're that good. Since Columbia City is an inconvenient location (it's a 20 minute drive from Cap Hill, and is not on my way to anything useful), I've started looking into just making my own sourdough bread. We'll see how that goes! :)", "Date": "2011-05-16", "Author_Location": "Seattle, WA"}, {"Author": "Jen C.", "ReviewID": "e32tAQ4f4J4mdFxVrzdGfA", "Overall": "5.0", "Content": "It's in the neighborhood, and the best place I've found so far, within, to get sweet and savory treats. I like the bare bones-ish interior. It reminds me of coffee shops of my youth. We used to take our art supplies with us and make crafts while we sipped mochas (the gateway espresso drink for the youths). Ah, good times. While I haven't broken out the scissors and glue here, I think I just gave myself a good idea!The coffee here is great. I usually get a savory treat and a sweet treat... quiche and columbia city cookie  or pretzel dog and columbia city cookie. I love the cookies :) The people that work here are quick, friendly and efficient. Great neighborhood spot!", "Date": "2008-07-26", "Author_Location": "First Hill, Seattle, WA"}, {"Author": "John M.", "ReviewID": "JyL-rA7O41TsgYLgg4u7JQ", "Overall": "5.0", "Content": "We live on the eastside, but have two favorite places we hit almost everytime we cross I-90.  They are Mutual Fish, and Columbia City Bakery.  Now before you try to figure out how these two places can be talked about in the same sentence...let me tell you why.....They are both the best at what they do and happen to be near each other.Columbia City Bakery makes me salivate just writing this review.  My fav is the fruit scone.  However the hamburger buns (potato bun) is the only way to eat a burger.", "Date": "2012-05-02", "Author_Location": "Sammamish, WA"}, {"Author": "Nick B.", "ReviewID": "NXTaGX-i8c1GBxVuaWUZ2w", "Overall": "5.0", "Content": "I just want to add to my first review that there are some ABSOLUTELY AMAZING (yes the all caps is warranted) sandwiches in the fridge container opposite the register.I just want to make people aware because I didn't notice them until I had a hankering for a sandwich over a sweet.  Now normally, you may shy away from a sandwich already made and sitting  in a fridge over some fresh baked goods.Think again!  This sandwich has the best bread ever and is just so flavorful.  My favorite is the Turkey, I really recommend you give it a shot next time you drop by!", "Date": "2011-02-21", "Author_Location": "Seattle, WA"}, {"Author": "Jessica S.", "ReviewID": "v6VBfEGnryiV_f8TodT8GA", "Overall": "4.0", "Content": "This bakery is practically in my back yard, and it helped make my move from Capitol Hill to Columbia City worth it! The bakery sets itself apart from the many other fine bakeries in Seattle with its vanilla bean cream - try a profiterole (like a cream puff) or a slice of white cake. These bakers have the vanilla bean flavor dialed! The bread is fantastic too. Don't just listen to me though - I caught the guys from The Corson Building buying bread there just the other day!The bakery is quite the social scene weekdays and weekends, and I've met dozens of other parents there just hanging out. The staff is pretty cool too. The pastries have a strong European influence (a lot of German goodies as I've learned from my German au pair) and aren't heavy on the sugary thing. I'm an unstoppable sweet tooth so initially wasn't enthralled with the baked goodies. However, I've come to appreciate the originality of many of the ingredients deployed and the many wonderful qualities of breads and pastries that aren't dripping in HFCS.", "Date": "2009-08-05", "Author_Location": "Seattle, WA"}, {"Author": "cindy w.", "ReviewID": "-aqh97tpeJZLJ4139Q1vNg", "Overall": "3.0", "Content": "I am writing a second updated review.   I gave it 3 stars this time due to the Luke warm service.   I have noticed many times after ordering my pastry and after paying, I don't ever get a \"thank you for coming in\" comment.  In fact, I don't even get any comments.  Perhaps it is small problem but I would think the service can be more friendly and appreciated.   I also wanted to mention the long wait to make coffee even when it isn't very crowded.   The coffee is much better down the street at Tuta Bella anyway.  I still may come back every so often but I will look for other bakeries in the area that is much more friendly.", "Date": "2013-02-24", "Author_Location": "Seattle, WA"}, {"Author": "Virginia D.", "ReviewID": "EdoMCaJ3mAWY25pwecihPQ", "Overall": "2.0", "Content": "this review is based purely on their vegan selection. or lack thereof.it's such a hipster 'hood, I expected some vegan pastries. alas, they had none. I had the granola bar, which was tasty (& technically NOT vegan b/c it has honey.... I am a very bad vegan...)... but that's no consolation when I was longly admiring all the scones, muffins, morning buns, etc. CAN I GET ONE FREAKIN' VEGAN PASTRY???my latte was pretty good. my non-vegan daughter & sister loved their goodies.", "Date": "2013-04-05", "Author_Location": "El Cerrito, CA"}, {"Author": "Elena M.", "ReviewID": "0hcheFb1tjXps3ZZyF0tVg", "Overall": "5.0", "Content": "Delicious desserts!  Scrumptious breads!  Friendly staff!  And, now, Columbia City Bakery is selling \"Equality Cookies\" to support the approval of Referendum-71, whose passage will help bring us one step closer to true equality for ALL residents in the state  I am proud that my neighborhood bakery is taking this stand.  And proud that my neighbors are supporting this cause.  [Mr. H. stopped in this afternoon to pick up some bread for dinner and some Equality Cookies for dessert, but cookies were sold out.  Too bad for us.  But, good for the cause.  And, we'll definitely try again another day.  And, we still got to have the bread tonight.]", "Date": "2009-09-06", "Author_Location": "Seattle, WA"}, {"Author": "Chris B.", "ReviewID": "UzudcI758DYK0WGxXXBgkQ", "Overall": "1.0", "Content": "I don't normally write reviews but this place has the worst customer service!! A Chinese restaurant has better customer service  than this over priced bakery!!  The staff is super snobby and never greets their customers!!  Yes the Pastries are very good and a hip place to be but the vibe sucks!! Do not support this establishment filled with pretentious aholes!!", "Date": "2013-03-13", "Author_Location": "Bothell, WA"}, {"Author": "Alli D.", "ReviewID": "_xJCxlh_1VWzpXFiLc9n4g", "Overall": "4.0", "Content": "None of the three people working here when I went in this afternoon remembered to make the latte I ordered. I waited five minutes and then reminded them. They didn't apologize. But the weird thing is, I still love it here. The giant chalkboard advertises the goods of the day, but by the time I went in (about 3 pm), most of it was sold out. Still, the selection of pastries in the case was expansive, from cookies to scones to biscotti and cakes. They make baking a pure artform.After seeing so many restaurants serve their products, it was nice to see the actual place! Next time I'll try to get to Columbia City before everything is gone for the day!", "Date": "2011-08-15", "Author_Location": "Seattle, WA"}, {"Author": "krisztina g.", "ReviewID": "Bu-mVJb7ZI-4j6LtaiS1eg", "Overall": "3.0", "Content": "I have been here on numerous occasions to get myself a morning pick me up. I really enjoy the fruit danishes. I am not a huge fan of super sweet things and these danishes have a nice balance of sweet and not sweet which prevents it from being overpowering.They also have a great selection of other pastries and sandwiches!I do however not like their croissants, i can't figure out why but they just don't taste good to me.disclaimer--It's a busy place so finding a seat may be hard!", "Date": "2010-08-08", "Author_Location": "Santa Monica, CA"}, {"Author": "Brynne H.", "ReviewID": "ckIrSotxoWA9lYHJT4BHlw", "Overall": "4.0", "Content": "Sourdough bread.  Really, I cannot get over how good their sourdough is.  I swoon over, I dream of it, I've composed insanely long love ballads for it.  Okay, not really, but it is some damn fine bread.Actually, all the bread that I've bought here has been fantastic.  They all pass the olive oil test: how does it taste with just a drizzle of fine quality EVOO? Marvelous, that's how.Not quite as impressed with the bakery goods, which was a bummer.  I'm going to give them the benefit of the doubt and assume that it's because I usually stop in after 5, and maybe by that point they've dried out enough that they're just not perfectly fresh.  I'll have to try one sometime first thing in the AM and see what I think.", "Date": "2011-03-26", "Author_Location": "Seattle, WA"}, {"Author": "Priya S.", "ReviewID": "LZVKSuBTxLycusFirkmXgw", "Overall": "4.0", "Content": "I've loved the bakery since it opened.  Some of their dishes cannot be beat.  I ordered the veggie torta today (a savory bread pudding), and it wasn't quite as awesome as it usually is.  It was still quite tasty, but the asparagus was overcooked and almost burnt.  That said, it still met the craving, and I enjoyed my time outside eating it up!", "Date": "2013-07-01", "Author_Location": "Seattle, WA"}, {"Author": "Quynh-An P.", "ReviewID": "pr7Y6lfF-cYQywJRqzeyAg", "Overall": "5.0", "Content": "Columbia City Bakery has some of the best bread/baguette in Seattle.  There's a reason most of the restaurants around have Columbia City Bakery as its bread supplier.  It's really freaking good.I've only had the bread here, so I can't vouch for anything...but who cares about anything else when you can get bread this amazing?!?!  It's so crusty on the outside and so soft on the inside...it's the best of all worlds.It's a beautiful thing.  If you ever need to give me a present and don't know what to get me, just bring me a loaf of the baguette from here and you will have made me the happiest girl.  It's really that good!", "Date": "2010-10-16", "Author_Location": "San Francisco, CA"}, {"Author": "Sin-Yaw W.", "ReviewID": "wdRjKTdzPmD8NiVYRT0bkA", "Overall": "4.0", "Content": "We don't drive far for cakes, but kid was in the search for a hazelnut cake and this place came out.  It is about 15 minutes from Seattle downtown and on we went for an adventure.The long line of Friday breakfast time is encouraging and the place is clearly a local favorite with many yummy looking offerings.  Bread, cake, tarts, cookies, etc.  Everything was tempting.  In addition to the hazelnut cake, we bought scones and they were very good.  I like my scone crunchy and flaky.  Theirs are soft and yielding like bread, but delicious nevertheless.The hazelnut cake took some serious evaluation over the next several days.  Kid and I agreed that it is delicious and nicely made.  I like my cake fluffier but kid convinced me that is just not how hazelnut cakes are. It is a dense cake, very chocolate and nutty, and just the right sweetness.  It goes perfectly with a good cup of coffee.", "Date": "2011-05-16", "Author_Location": "Seattle, WA"}, {"Author": "Nana I.", "ReviewID": "-OpPcguZKEXY4upH-EIxUQ", "Overall": "4.0", "Content": "I've been told many times that this bakery has the best breads in the area. I only got to try the bread in sandwich form when I stopped by but I'm still fairly convinced that the statement above is true. A little disappointed that all their sandwiches are pre-made and refrigerated but the flavor of both bread and filling (tuna) was still intact & delicious. We (my mom aka bakery-partner-in-crime) also had a danish that was overflowing with blueberries which I just cannot get enough of! It was perfectly golden brown, brushed with a sweet glaze & every bite was filled with juicy blueberry goodness. Although a bit out of the way, I'm definitely willing to go back just to buy a loaf of bread &/or that danish!", "Date": "2011-09-05", "Author_Location": "Seattle, WA"}, {"Author": "Becky G.", "ReviewID": "g4aI-lh9S5mEcgcDd9LlXw", "Overall": "4.0", "Content": "My friend Vienna was telling me how good this bakery is so I had to stop in to grab a quick lunch.I got a Tomato Jam sandwich with goat cheese and arugula, YUM.I never see tomato jam and I'm always craving it.(under $6!)My boyfriend got a ham and cheese croissant, it was yummy too.We tried their dill bagel chips, I didn't see them to buy but they were yummy too.They just put out a loaf of whiskey cake and Jack was very tempted to get some.I would highly recommend this place if you want something yummy.Could have been a little more friendly.", "Date": "2011-09-06", "Author_Location": "Seattle, WA"}, {"Author": "Hana P.", "ReviewID": "eX8qj2z_KJwdDuuk1DssFA", "Overall": "4.0", "Content": "As soon as you walk into this bakery, the aroma of sweet and savory breads and pastries begin to fill your nose. I recommend their Kitchen Sink cookies, a yummy cookie concoction consisting of oats, cranberries, and various other awesome ingredients. I also love their pretzel dog, ham & cheese croissant and cakes!The staff can be a little snooty, but the delicious bakery items I get make up for it. Love the feel of the place, very natural and basic! I recommend going here on the weekdays after 2p, because weekends are way too crowded for my liking.", "Date": "2012-02-22", "Author_Location": "Seattle, WA"}, {"Author": "Robert V.", "ReviewID": "lNk-NeFzjalTWQ5YVkEi6g", "Overall": "2.0", "Content": "So, this is a tough place to review.  The baked goods are yummy, but the prices are much higher than the food/atmosphere merits.  The staff is always friendly, but never fast.I'm so torn because I want the CCB to be the epitome of cute neighborhood shop, and visibly it is, but it has the overall feel of a yuppie establishment.  Also, I find that there is very little that I can have from here as everything contains some sort of nut or fruit that will make me swell up and die.  I would love to see a more diverse selection.Sorry if I'm harsh, but I really wanted something different from the Columbia City Bakery.", "Date": "2010-03-18", "Author_Location": "Seattle, WA"}, {"Author": "Katherine T.", "ReviewID": "Ah5DvDbeMnqem0MB09ikug", "Overall": "5.0", "Content": "I go here almost every day. OMG good sandwiches (TURKEY!!!!!). I wake up late just so I can eat lunch and go here. Also the tarts, the frangipane (I'm sure that got misspelled almost as badly as I pronounce it) is amazing. Seriously, like 5 times in the last week. And I live in North Seattle.", "Date": "2010-06-06", "Author_Location": "Yakima, WA"}, {"Author": "Dennis S.", "ReviewID": "kVLXXKMYgJH3sohrNI8sSQ", "Overall": "4.0", "Content": "A great bakery that's much needed in Columbia City. This place is hopping, especially on Saturday and Sunday mornings. Entire families will go here to sit and enjoy beverages and baked goods.I tend to always order their pear danish but everything here seems to be stellar from what I've tasted.The service here is good. Of course, when it's busy the customer service is compromised but what can you do but be patient because you need what they have LOL.I'll order a coffee or even a mocha when I go here. It's good and strong enough. The price for some of the items at this price is a little high, but that's to be expected from a popular place that located right in the heart of vibrant and revitalized Columbia City.", "Date": "2011-02-27", "Author_Location": "Seattle, WA"}, {"Author": "Rich S.", "ReviewID": "1iJ9afuaNEe3F457nYSYEg", "Overall": "5.0", "Content": "Every now and then, as I'm working in my office, my mind wanders back to the delicious bostok pastry served at Columbia City Bakery. Thick brioche bread, covered with a layer of sliced almonds, powdered sugar with a hint of citrus and other flavors.Wander in (best in the off hours, when you might find parking outside or a table inside - they're not that big), order a pastry and coffee, read the paper or get on-line for a bit, and before you leave, buy a baguette for home.  This bakery is wonderful, the bread is for real, and the atmosphere isn't just neighborly, it epitomizes much of what I like about Columbia City.", "Date": "2011-06-25", "Author_Location": "Seattle, WA"}, {"Author": "Ken Y.", "ReviewID": "3-BleGnSoYw6iaPgm0FEPQ", "Overall": "5.0", "Content": "Seriously delicious baked goods here, and the staff is always friendly. It's hard *not* to stop by when I'm in the neighborhood. My faves here are...the tomato jam sandwich...only for folks who are into chewy bread with a generous coating of crunchy, flavorful seeds (I'm vegetarian, so I haven't tried their meaty sandwiches.)the focaccia, whose herby tomato sauce is robust and has a bit of kick (maybe some chili in there?)...and they might heat it up for you, if you're real nice-likethe tahini cookies...little morsels of sesame seed-coated heaventhe dilly chips...thinly sliced (pretzel?) bread discs toasted to crispy perfectionthe walnut crostini...generously brushed with olive oil and also toasted to a crisp--goes great with a cold beerstout cake with espresso icing...speaks for itself, I think. (..and if you're into cardamom, look for the cardamom coffee cake.)and for the slightly more adventurous, the Sicilian prune cookies, which are more like delicate bars...a prune filling with nuts and hints of orange (maybe some zest?) between two, light layers of cake/cookie and a flaky topOf course, there's lots more to try. Oh, just a note that the savory scones can have bits of bacon/ham in them. The health nut scone (slightly sweet) tastes better than it sounds or looks (with all those flax seeds and whatnot), but I do find it a bit on the dry and crumbly side. I suppose loading it up with butter and white cake flour would be--how you say--less healthy. OK, time for me to get some tahini cookies...", "Date": "2011-09-22", "Author_Location": "Seattle, WA"}, {"Author": "Miki C.", "ReviewID": "lgZW59V8FCw7V7klzDz-fw", "Overall": "4.0", "Content": "I love this bakery. I agree with another reviewer, that I wish there was more diversity in the selection. I have nut allergies and gluten-sensitivity. But their baked goods are so darn good, that I can't stay away. I love the bran muffin, croissants (although not the best in the city), and the pre-made lunch sandwiches.The staff is always friendly to me when I go in every week. It is a great neighborhood bakery, and beats even any bakery in Capitol Hill. The bakers here are serious about their craft and it shows in their wonderful baked goods.", "Date": "2010-06-27", "Author_Location": "Seattle, WA"}, {"Author": "Andrea K.", "ReviewID": "B-6uk59KAodmp3bCDk2njQ", "Overall": "5.0", "Content": "This is probably a superfluous review because there are so many rave ones, but I'm feeling Yelp-y today so here. goes:Went here with my partner in pastry exploring crime on a Sunday morning. Was worried we'd have to wait in line forever. Luckily, the line wasn't bad at all and they were moving quickly. In fact, I'm pretty glad there was a line because otherwise I would not have had adequate time to figure out what to get. So many options, seriously. So many! Ended up getting the mini-rhubarb tart, a pain au chocolat, and an ice coffee. All delicious..so delectably flaky! I managed to save the tart for when I got home (talk about will power, huh?) and when I microwaved it, it was so warm and delightful (fear not, I made sure to eat a good chunk of the crust before doing so, so the crust didn't get mushy). People were super friendly (case in point: I spilled my coffee .2 seconds after receiving it, they made me a new one ASAP and didn't give me dirty looks).Definitely would go back...there are about 50 more things I want to try there (profiteroles, anyone?). At about 10:45-11 on a Sunday they were running out of a few flavors of scones and muffins, so I may have to bust my ass up a little earlier the next Sunday I check it out.", "Date": "2010-07-05", "Author_Location": "Seattle, WA"}, {"Author": "Eric P.", "ReviewID": "fmyu6lZ8_pOkL2C0Veh3VA", "Overall": "5.0", "Content": "All right so we got over here because of the great reviews Empire Espresso received - they had nothing to eat so we wandered around the corner and tripped onto Columbia City Bakery - they saved our day!!Such a great, hip, quaint spot that was fun bustling, and quintessential Seattle \"neighborhood\" joint.  Staff was super friendly and patient even with the line out the door.  Had some quiche, ham and Gruyere croissant, and pretzel knot - all fabulous.  Can't speak to everything yet, but will give as much as we can a shot in the future.Brilliant little place and YES we will be back again very soon!", "Date": "2010-09-05", "Author_Location": "Seattle, WA"}, {"Author": "Trang H.", "ReviewID": "9TdKFX8lPjrmv4C0VyiMRw", "Overall": "4.0", "Content": "There's not much more to be said for this bustling bakery that already hasn't been said.  The pastries and breads are delicious and the service is friendly.  Some things to note:-Parking can be tough, especially on the very popular weekends.-They charge $2.50 to write a message on a cake, however, their chocolate cake, which I ordered for a friend's birthday, was the best I've ever had.  -It's not cheap, but the price reflects the quality and the quality is outstanding.-On a whim, I bought one of the 6'' coconut cakes on display and while overall the it was delicious, the cake portion was slightly dry.  I'm wondering if it was a day old?   However, it was still good, and polished off quickly.  Lesson learned:  if you can, pre-order your cake so they can make it fresh.Other than that, sit back, relax with a good cup of coffee, yummy pastry and enjoy the people watching or catch up on some reading at this friendly neighborhood spot.  Just don't do this on Saturday or Sunday mornings, when the place is packed and folks are on the lookout for a table!", "Date": "2011-06-16", "Author_Location": "Seattle, WA"}, {"Author": "Ann W.", "ReviewID": "yVsC5jIHj7dLrOtc5ARQew", "Overall": "4.0", "Content": "I give my gluten free diet a break when I see Columbia City Bakery's chewy and fresh pretzels!! It is so worth the pain and bloating. But on days when I can't stand the pain, I will go for one of their gluten free choices: sour cherry bar or almond anise cookie. They also have a few vegan options--the ginger cookie and those addictive pretzels. I took one star off my previous review since I tried their coffee, which was not very good. I had a hazelnut latte and I did not taste the hazelnut; it was actually quite bitter and tasted a little burnt. Oh well, it won't stop me from being a pretzel monster!", "Date": "2013-02-03", "Author_Location": "Seattle, WA"}, {"Author": "Lisa M.", "ReviewID": "MCBJLe7MEoxSvTZYuXPxZQ", "Overall": "5.0", "Content": "Love Love Love this place. Holds a special spot in my heart as the only place I've discovered in the US that really makes baked goods comparable to those found in france. Their coffee is also good", "Date": "2013-01-26", "Author_Location": "Crolles, France"}, {"Author": "Steven H.", "ReviewID": "O8epNe783AV62DRJh-6Kcw", "Overall": "4.0", "Content": "Honestly, I think this place may be going downhill. I have been here many times, and it used to be an amazing place. Very hip, and accepting. I visited recently, and the customer service was..not rude, but somehow irritable, and cold. The coffee was mediocre, but the pastries are good. What really turned me off was the customer service, if the workers are in the customer service industry, then they should be working for the customer. I will definitely give them another chance, but for now? a downer cafe if I ever saw one.Edit:I went back here yesterday, and the customer service was much friendlier, I must have caught the current staff on an off-day. The coffee was much better, and I enjoyed my visit. Still pricey, that hasn't changed in the past week ;) Either way, keep it up!", "Date": "2011-02-06", "Author_Location": "Seattle, WA"}, {"Author": "Kelly A.", "ReviewID": "JkjRm4bLCT9odXpWIpnSPQ", "Overall": "3.0", "Content": "You will LOVE Columbia City Bakery's food but when things get busy, re-think your choice and try some other place. I've seen people wait up to 30 minutes (!) for an espresso drink and the help seems to get stressed out a when business is hectic. No one ever seems to have the time to explain their many, many offerings and the people who work the register often seem clueless. That said, we are ADDICTED to the Mortadella sandwich and the Loki Roll (an amazingly chewy, crunchy salmon sandwich). But when we come here, it is definitely for a QUICK visit so we can get out of the chaos ASAP. This is unfortunate because I like to linger and have a dessert (or two) and maybe a coffee. It may be delicious but not worth the trouble and agitation.", "Date": "2013-06-07", "Author_Location": "Seattle, WA"}, {"Author": "Josh C.", "ReviewID": "EIhE_rT-sfY3PYeWGJLYuQ", "Overall": "5.0", "Content": "This place is the daily bright-spot in my new neighborhood.  The baked goods are off the charts....The coffee is excellent and the staff is better.I am one who needs my savory morning breakfast (on the go) to function, and they do it well.  If that was a good thing, then the sweet pastries are better.I can't speak enough praises about them!", "Date": "2011-02-03", "Author_Location": "Seattle, WA"}, {"Author": "Brent C.", "ReviewID": "9YwGThsfjLjm0nOmJi9swQ", "Overall": "2.0", "Content": "Home of the Brickhard Baguette! My girlfriend and I bought a baguette here last Sunday. We had some of it that night with dinner. By the end of dinner both our jaws were hurting from trying to chew on this thing. I had some more today (3 days later) and I could not bite through it.1 star for a terrible product+ 1 for good customer service and no line at the register.", "Date": "2011-11-09", "Author_Location": "Seattle, WA"}, {"Author": "Joe P.", "ReviewID": "j4BxuvywiZd3Wl-WNgxXqg", "Overall": "3.0", "Content": "I used to go every every weekend, but decided against going any longer because of one thing: rude customer service.Don't get me wrong, the pasties are really good. I really like their bostoks, and would go back every day if I didn't think the people weren't so obnoxiously snobby and had an air of \"a-hole-ness\" about them.", "Date": "2012-10-15", "Author_Location": "Seattle, WA"}, {"Author": "Ushuaia F.", "ReviewID": "e_nOa-3feL0A21bOtThSNw", "Overall": "2.0", "Content": "This is a cute place, the pastries are cute too; If you are on a diet, the half size croissant might be right for you. But come to think of it, since they butter up their prices, your may end up with an indigestion. The good news is, they have very few choices of cookies, pastries or bread; it took me less than one minute to realize that I was in the wrong place. Two stars for trying to revive this neighborhood.", "Date": "2013-12-30", "Author_Location": "Seattle, WA"}, {"Author": "Mike V.", "ReviewID": "j9wzzwJlAoXO2Vr8P3sksA", "Overall": "5.0", "Content": "amazing coffee and baked goods!!! need i say more?", "Date": "2014-01-07", "Author_Location": "Seattle, WA"}, {"Author": "Kimberley D.", "ReviewID": "1OQ693kzxyRzNZvq92xoNw", "Overall": "5.0", "Content": "i went here on the recommendation of someone online as part of a search for the perfect pastry & the perfect coffee. OMG SO GOOD. totally worth the drive down there, even if you live nowhere nearby. i tried the cinnamon buns which were like a cinnamon bun without frosting squished into a roll... except also light and fluffy like a croissant. (the actual croissants were sold out, unfortunately.) i decided to try the bear claw on the advice of the previous poster. i usually don't like them... i tend to find them too sickly sweet. this was an exception: the perfect balance of sweet and sourdough-y. the espresso eclair tasted quite fine. the homemade granola and yogurt also rocked. and they made a delicious latte to boot. very recommended.", "Date": "2006-11-04", "Author_Location": "Seattle, WA"}, {"Author": "Anju N.", "ReviewID": "XRDg20zGXvUudLbAYgxf1Q", "Overall": "5.0", "Content": "Delicious chocolate chip cookies. Also had an iced latte on a hot summer Seattle day that hit the spot!  The cupcakes and cakes look scrumptious though I didn't try them. Next visit for sure!", "Date": "2013-11-30", "Author_Location": "Bellevue, WA"}, {"Author": "Libby C.", "ReviewID": "x3eKp2tthcd8pFpudA-jmQ", "Overall": "5.0", "Content": "The food, the coffee, the atmosphere, the staff = grade A.  All the other reviewers are correct.  What I want to cheer them on for is their community work.  Every year I see them participate in Lifelong AIDS Alliance Dining Out For Life.  It's also standard to go in and see \"Marriage Equality: cookies or some such thing.  I freaking love it.", "Date": "2012-11-29", "Author_Location": "Seattle, WA"}, {"Author": "Martine W.", "ReviewID": "lyeus7myfLTFMxl91o3C_g", "Overall": "5.0", "Content": "OK, so I have put off writing this review due to a conflict of interest.  But since people are doubting the thoroughness of research for the Great Croissant Tour of Seattle, here it is.  My friend Cassie is a baker here which makes me already love this place.  Even if I didn't know one of the bakers and respect her work enormously, the pastries here speak for themselves.  I have to say I think the bread and cake I had here was better than the croissants, but the almond croissant I had was a little piece of heaven so that tells you how good the bread is.  I also think the cafe is a cute little place to hang out.  I only wish it were closer to home!", "Date": "2008-03-03", "Author_Location": "WA, WA"}, {"Author": "T A.", "ReviewID": "z41u6Jfwqi8viMwC6kid9g", "Overall": "5.0", "Content": "highlights:the pistachio snail is what happens when french pastry chefs fall in love with middle eastern sweets. the pain au chocolate is dreamy. the breads are phenomenal. the frenchified bear claw is a masterpiece.obviously, i avoid this place for health reasons.", "Date": "2012-12-25", "Author_Location": "Seattle, WA"}, {"Author": "amy c.", "ReviewID": "pBeogJGUz-DLDGK79f4h-w", "Overall": "5.0", "Content": "Good coffee, amazing pastries. I wish they had a few more gluten-free options, but the few they have are perfect for my son. I'd recommend the Bostak for a sweet treat... yum. This is a great place to get a hostess gift too. Packages of cookies, amazing bread, etc...", "Date": "2013-12-02", "Author_Location": "San Diego, CA"}, {"Author": "Sheila Y.", "ReviewID": "JMgg8UYporJX6k6MUNXWLA", "Overall": "4.0", "Content": "I love me the pretzel dog rolls at Columbia City Bakery.  I have been known to order four or five...bag em up...throw em in the freezer and pull them out for just out of the oven goodness.  I have also ordered their German-style Vollkorn bread (full of nuts and oats) and all their little tarts and pastries are divine.  This is a great place to stop after you hit up the Wednesday afternoon farmer's market and hey while you are at it you might as well head down the way to Tutta Bella for a pizza to share with whoever your partner in crime may be at the moment.  This was my Columbia City circuit once a week last summer and boy do I miss it!", "Date": "2007-06-26", "Author_Location": "San Francisco, CA"}, {"Author": "Jeff L.", "ReviewID": "kGmypCXjn3sOSh5mObz1-Q", "Overall": "5.0", "Content": "I can tell you why I'm in a recession.  All my money is going to this place! This place sells crack with yeast wrapped around it.", "Date": "2009-05-14", "Author_Location": "Woodinville, WA"}, {"Author": "Rassamee H.", "ReviewID": "b9gHVvJNz6Xa2trjHZKK0A", "Overall": "5.0", "Content": "Delicious, somewhat pricey, but worth the splurge. They serve Caffe Vita coffee, which I enjoy, and the baristas are always really friendly. I used to know people by name, but there's been a bit of a turnover:( I am always torn between the chocolate crossiants and the danishes. Their savory crossiants are also yummy. And being in grad school, there have been times when I have been able to study there. Of course, I stuck out like a sore thumb with all the babies and families and cool people. That won't stop me though:)", "Date": "2007-06-12", "Author_Location": "Oakland, CA"}, {"Author": "freckles a.", "ReviewID": "3yKzJ4g48dHN5mzeSmrEpQ", "Overall": "4.0", "Content": "Good artisan bread and sandwiches for lunch! The sweet pastries are very tasty too!I've tried the sandwiches at B.Nouveau and they are okay but the bread there doesnt really stand up to C.City Bakery's.I've also tried Grand Central Bakery too...and C.City Bakery wins over them too.", "Date": "2012-11-15", "Author_Location": "Seattle, WA"}, {"Author": "Timmmaahh W.", "ReviewID": "78HHxNwsxU6hr_y0IhHHUQ", "Overall": "4.0", "Content": "All I can say is Ham & Gruyere croissant.  Damn that is tasty.  The place is hopping every time I go and they have such delicious treats.  My favorite neighborhood bakery for sure.", "Date": "2008-12-27", "Author_Location": "Seattle, WA"}, {"Author": "B S.", "ReviewID": "H-yf8WbegDZ9HcVvAwOtQw", "Overall": "5.0", "Content": "I have not found a bread or bread product I did not LOVE here. Must haves: Perfectly delicious baguettes, pistachio pinwheel, and cookies. I only wish it could be closer to my home. Oh well, I will just visit as often as I can.", "Date": "2008-08-17", "Author_Location": "Seattle, WA"}, {"Author": "Kozby E.", "ReviewID": "HQ2H83rHK2xO0hLjP2vuAw", "Overall": "4.0", "Content": "Cozy lobby area, open kitchen and variety of delicious sandwiches. In the area, that's  one of my favorite spots. The staff is very friendly and lattes comes with artistic figures on the foam:) Parking might be a challenge but this is just the area like that. There must be more parking in the back of the block. I am going back:)", "Date": "2012-10-22", "Author_Location": "Puget Sound, WA"}, {"Author": "Jennifer S.", "ReviewID": "V5NOobykRgRvwePahXLdsA", "Overall": "5.0", "Content": "The bread here is the best! I am so happy to have this bakery in my neighborhood, however I did talk to a woman that came from West Seattle to buy her bread!", "Date": "2013-04-03", "Author_Location": "Seattle, WA"}, {"Author": "Aaron H.", "ReviewID": "No48rB9g94hnT4eJwLelXw", "Overall": "4.0", "Content": "Yes, the service is off on some days....and yes, the debit charge of .50 is kinda cheap (but I get the business side of it).  Bieberle, quiches, cinnamon twists, hamburger buns, sourdough loafs, and pan au chocolats are all great though.  To boot this is my neighborhood so i want to keep supporting the local business even with its short comings.  When you go in just have cash, be prepared for a little attitude, and enjoy your pastries.", "Date": "2012-06-10", "Author_Location": "Seattle, WA"}, {"Author": "Sara N.", "ReviewID": "xh8-6r4Eq4q831GJfOrZPw", "Overall": "3.0", "Content": "Well, I feel badly that I am the first to write a non 5 star review of this place. I really want to give it 5 stars, and I really will go back and try it again. I think that I was expecting it to be out of this world, and since it took us a while to get there..first, we locked our keys in the house, and we had to break in to retrieve them..then, we hit traffic on I-5 (we live in Ravenna), then, there was a huge detour and all this construction on Ranier Ave...and, so when we finally arrived, an hour later, I was thinking, DAMN, this better be excellent. I was picturing a place where we would feel like lingering, cozy and warm...and, this place while smelling sweet of pastry and yeasty goodness, was a little bare bones in the atmosphere respect. That is ok, though..that said, the pastries looked delicious and I had a hard time deciding and went with an apple swirly looking croissant-like pastry. While the texture was perfect, that balance between flaky, crisp and chewy, the flavor lacked. I liked that it wasnt super sweet, but i think at least the added sugar and maybe a touch of cinnamon would have brought some more flavor to the dud apples inside. Funny, I am not usually an apple pastry person, so I think that I should have gone with my ultimate, pain au chocolate..but, the look of the apple pastry drew me in, and I was a little disappointed. Again, I hate to break the 5 star roll. I love to see small bakeries succeed, and I love that this place is doing well, so I will be back. I will say that I also bought the Volkhorn Bread, which has transported me back to Swiss/Germany..it is good.", "Date": "2007-04-02", "Author_Location": "WA, WA"}, {"Author": "Something Like a Phenomenon S.", "ReviewID": "rFvQynzFPMLHHxpw_2Zv0Q", "Overall": "3.0", "Content": "4 stars for the cardamom coffee cake.  Minus a star for the lackadaisical service I received from the counterperson.  Neither a \"can I help you?\" or a \"thank you\" during the entire interaction which--thanks to her Dark Lady of the Sith attitude--was brief.  The other counterpeople seemed nice, but I got stuck with Asajj Ventress.  Go figure.", "Date": "2009-08-17", "Author_Location": "Seattle, WA"}, {"Author": "Ken L.", "ReviewID": "Q2VqtierJI3QOrZRzU5Lfw", "Overall": "4.0", "Content": "Excellent bakery.  The baguettes, bread, sandwich rolls, and pastries are fresh and tasty.  I usually grab a few sandwich rolls and the beloved banana danish, the best dessert ever made!  I am so sad today because I dropped by in the afternoon and they were OUT of danishes!!  :(  Mental note to self: make sure you get there early for danish you dodo!", "Date": "2010-04-10", "Author_Location": "Renton, WA"}, {"Author": "Rachel G.", "ReviewID": "EHHuf6TkHNi04GO-P9HChg", "Overall": "3.0", "Content": "Grabbed a few treats here the other day for a little tea party I was having. The place is adorable and I can see myself hanging out there getting some work done but the pastries I got were just OK. The mini-strawberry rhubarb pie was the best thing I had next to some lemon cheesecake. I wasn't a fan of the square cupcakes with way too much frosting. I could take it or leave it.", "Date": "2011-05-04", "Author_Location": "Seattle, WA"}, {"Author": "Touch M.", "ReviewID": "6Ca36uFgm0fv5DRPLwZovA", "Overall": "3.0", "Content": "i really want to love columbia city bakery. bright and airy. great aromas of baking yummystuffs. fresh flowers adorning tables. what's not to love? and coffee's good. first time i went there i got a slice of the cheesecake, chocolate pudding, and fig danish. all decent. my gripe, though. is with the service. yes, we're served swiftly, but the couple of strange encounters i've had with the staff manning the counters have left a bad taste in my mouth - enough for me to resist going back even though i pass by fairly often. two or three times now i've attempted to  order a macchiato. each time i've been \"corrected\" and asked whether i really meant a latte instead. hmmmm.. i can't help but perceive a bit of condescension there. i'm not a big coffee connoisseur - but living in seattle you do pick up a few things. that on top of the sometimes indifferent demeanor of some of the staff leaves me feeling \"meh.\" not so impressed. i'd probably do a four star, but the above incident has repeated itself so i'm kind of weary. anyway, i did also order a birthday cake from here and had great service over the phone. although the cake (a lemon buttermilk cake with cheesecake frosting) turned out kind of dry and i found the flavors to be just okay.  i'm not giving up on this place yet though. i still very much like the atmosphere and lighting and appreciate what they have to offer. and i've yet to try some of the savory items and sandwiches. so there are things that can change my mind. and i'd still recommend that you try it out for yourself. but i'll be ordering my coffee from around the corner instead from now on. ;)", "Date": "2011-03-14", "Author_Location": "Seattle, WA"}, {"Author": "Joel L.", "ReviewID": "bYoUmOKpwLt25x2FtGY6Ng", "Overall": "5.0", "Content": "Really good baked goods.  I pick up an assortment of pastries from here when I'm trying to impress people.  Tasty and unique.", "Date": "2008-12-14", "Author_Location": "Seattle, WA"}, {"Author": "Fred N.", "ReviewID": "7Xrenh0xQLTYXAPNp-EivQ", "Overall": "5.0", "Content": "I love this place.  Great atmosphere, friendly staff, and delicious baked goods.  Also, since it's in Columbia City, the city provides free wifi - so you can drink your latte and eat your YUMMY croissant (with their jelly, which is key) and work on your computer... assuming you're not distracted looking at the cool art on their walls.", "Date": "2008-12-18", "Author_Location": "Seattle, WA"}, {"Author": "Mei-I F.", "ReviewID": "6m3B-HNINpzHmxgkdcVYqg", "Overall": "5.0", "Content": "I used to work at a restaurant that served their house bread, the crusty white loaf, and I seriously could not get enough of it!  Now that I don't work there anymore, my pants feel loser.  I know their secret.  They put crack in there.  It is the best artisan loaf ever.  Their baguette is also among the best I have ever had.  There's crack in there too.  The restaurant would also order other varieties of bread (broiche, potato, etc.) and they were all carb heaven!!  So I have never actually been to the bakery itself, but I can definitely get a taste what is to come once I step foot in there.", "Date": "2009-09-30", "Author_Location": "Seattle, WA"}, {"Author": "Tonya W.", "ReviewID": "qYzz2oC9sRkPEqe9NcBuTQ", "Overall": "5.0", "Content": "OK, so I just go here to buy their Goat / Sheeps milk cheese . But the rest of the stuff looks yummy too. The cheese? AWESOME!", "Date": "2012-11-29", "Author_Location": "Seattle, WA"}, {"Author": "MiChin L.", "ReviewID": "bkjGmRotpCA9Dqf1QAXJlA", "Overall": "4.0", "Content": "This place would be perfect if the hordes of screaming kids and their overly-lenient parents (\"Trevor, I already asked you nicely to stop licking people you don't know!\") would go away.  That small tidbit aside--the ham and guyere croissants will call to you in your dreams. Although your butt may soon be overpopulated with cellulite because of that lovely buttery goodness, you only live once and you will regret not enjoying one of these at least once a week.", "Date": "2007-05-07", "Author_Location": "Seattle, WA"}, {"Author": "Erin K.", "ReviewID": "3Yp4k-v9SYEy4gM_RPElIw", "Overall": "4.0", "Content": "After a delectable breakfast across the street at Geraldine's, stopped in for cookies, muffins and brownies.  All of which, according to friends who quickly inhaled them down, were delicious and remarkable in every way.  No line, beautiful breads, fudgy brownies.  Go there.", "Date": "2008-03-03", "Author_Location": "Gig Harbor, WA"}, {"Author": "Ariana G.", "ReviewID": "c36at32MH4v7SkJFHdZ12A", "Overall": "3.0", "Content": "I don't find there selection of baked goods that amazing, a lot of stuff is dry and just sugar and flour...where is the fruit and more interesting baked goods? However, their bread is great and their pretzels even better!", "Date": "2008-10-07", "Author_Location": "Seattle, WA"}, {"Author": "Sara H.", "ReviewID": "72bYxMcmODGIS3WH7Fw33A", "Overall": "5.0", "Content": "I live down the street, jealous?", "Date": "2011-06-11", "Author_Location": "Seattle, WA"}, {"Author": "Lori D.", "ReviewID": "s6tJcJFKkcULFuhB-DLAgQ", "Overall": "5.0", "Content": "My newest favorite is the lemon ginger scone. This scone is the best I've ever had. Perfect texture - not the too doughy or the too hard that have led me to toss a scone after the first two bites. No, this scone is flavored with just the right combination of lemon and candied ginger bits to make me want to keep eating a second and third immediately. Amy, my favorite barista, turned me on to these and the only thing wrong is that sometimes they aren't quite out of the oven when I arrive early in the morning!Thanks, CCB!", "Date": "2007-12-29", "Author_Location": "Seattle, WA"}, {"Author": "Sasha C.", "ReviewID": "2ugL1l_MCjNayLpOihbwaQ", "Overall": "5.0", "Content": "I live in the neighborhood and it makes me so happy to have such a community-minded business in our area.  The pastries are DELICIOUS!  I've had cookies, cupcakes, and a morning muffin there, all of them were fantatsic.  They actually have a huge variety of baked goods so I'm looking forward to trying a bunch more...it'll take me a while to get through all those options!  They deliver service with a smile, everybody I've encountered working behind the counter is helpful, patient and friendly.  But the thing that seals the deal for me is the fact that they support many worthy social justice causes.  It makes their sweets taste even sweeter.  Thank you Columbia City Bakery!", "Date": "2012-08-01", "Author_Location": "Seattle, WA"}, {"Author": "wade m.", "ReviewID": "UVO9TKi0j-GbUuisL-GQDQ", "Overall": "4.0", "Content": "Good pastries and tea, and a relaxed atmosphere. The Sweet and I sat for an afternoon on their sidewalk. The fruit tart was very good, with more custard than most. The pretzel would have used a bit more salt. They serve Honest Teas, which are always good! Lots of families walked by, and inevitably a pre-verbal toddler would waddle up and point at the bakery, with pleading eyes toward its parents. Clearly this is a well-loved neighborhood bakery, with a relaxed atmosphere and plenty of friendly people.", "Date": "2009-08-31", "Author_Location": "Oakland, CA"}, {"Author": "dave m.", "ReviewID": "M18CDTq4FZw6ojryz9Hxcw", "Overall": "5.0", "Content": "This place provides a much needed service in this neighborhood: delicious breads and pastries prepared daily.   I've found good bakeries are had to come across in some other nearby neighborhoods, evidenced in the patrons who come from all around to visit the bakery.  Yes, they are a bit expensive, but you pay for the quality of the food, neighborhood atmosphere and quaintness they bring to Columbia City.   I'm willing to pay a bit more than at the supermarket to keep this place thriving and fresh bread readily available.   I love the ham and  gruyere croissant, the tuna fish sandwiches and the p&b cookies.  I", "Date": "2010-04-25", "Author_Location": "Seattle, WA"}, {"Author": "Erin W.", "ReviewID": "tVuKXqOf1Ne5do50Sp18bA", "Overall": "5.0", "Content": "just picked up some bread for thanksgiving! i don't know if i can save it until tomorrow... it smells so good! i am super excited about the yam rolls, yum. i also got a mocha, it was amazing! nice latte art, and they even cleaned my gross old mason jar that i wanted my drink in (!) with sweet smiles. goodness i love this place. my son ate a shortbread cookie, it took him only seconds. :)the cakes and pies looked pretty amazing... wish i would have bought one!the service was above average, made my day.", "Date": "2011-11-23", "Author_Location": "Seattle, WA"}, {"Author": "Chris B.", "ReviewID": "wOqBxN9kIGaPRoGqgfdIZA", "Overall": "4.0", "Content": "Last Thanksgiving they even had pies available the day before - even if you didn't order one! Apple pie is awesome. The reusable pie tin is also great if you made your own pies. But don't start making your own because then you might stop going to the bakery. Great cookies, too.", "Date": "2008-11-07", "Author_Location": "Boston, MA"}, {"Author": "Madeline W.", "ReviewID": "rKASXGPSLcQi-JVPjhlwdw", "Overall": "5.0", "Content": "The employees here are so friendly and give great advice on what to get.  Everything I got here was delicious and the bread (especially the apricot and walnut bread) is amazing.  Can't wait to go back!", "Date": "2012-03-08", "Author_Location": "San Francisco, CA"}, {"Author": "Jacquie P.", "ReviewID": "1AkJrToSCbUX1ZpCsHHqlA", "Overall": "4.0", "Content": "Everything we tried here was wonderful. I wholeheartedly recommend the bostok! It has a fun, bustling atmosphere and friendly staff. Prices were comparable to other indy bakeries in the area and it seems to get just as busy. I stopped in at 7:30am on a Saturday and all the little tables were already occupied but there was plenty of street parking outside so I have a feeling it fills up with the local regulars pretty quickly. Welp, no need to go into too much detail considering the millions of other great reviews, so I'll just say big thumbs up!", "Date": "2011-06-28", "Author_Location": "Seattle, WA"}, {"Author": "Melissa J.", "ReviewID": "WwTbTWXeDHfcLDibXDXG6Q", "Overall": "4.0", "Content": "Columbia City Bakery has good coffee and yummy sweet & savory baked goods.  I'm a fan of their breads, but the cake is where it's at.  Get one of these for the next office party, slice thin (rich stuff!),  pick up a bottle of cheap bubbly, & you'll be the Employee of the Year.", "Date": "2009-01-20", "Author_Location": "Seattle, WA"}, {"Author": "See Y.", "ReviewID": "NhEFeAlwHgzhKrfMeFwz2g", "Overall": "2.0", "Content": "Service leaves something to be desired. This seems to be the common theme with this bakery.  The only reason I buy overpriced bread here is to support a small business.  I don't even like bread, but was willing to support the business until tonight.  I walked in, and asked for a bread advertised as $2.50.  She charged me $3.  Perhaps I should have said something, but with a selection so small, this mistake should not have occurred.  Don't put up one price then charge me something else.  I think she was just being a jerk to me, because I asked whether they could slice my bread and she said they couldn't.  Oh, well.  That's the answer, fine, but don't be a jerk to me just because.  I can easily take my business elsewhere - so keep the 50 cents.", "Date": "2011-05-16", "Author_Location": "Seattle, WA"}, {"Author": "Avian N.", "ReviewID": "WwrxXHocfDSUNK6wEhTbYA", "Overall": "5.0", "Content": "I really love Columbia City Bakery because, not only are their goods delicious and appealing to the all the senses, they're very involved and give back to the community. The youth nonprofit I work for (the Service Board) were in need of some food for our annual retreat, and they came to our rescue with a huge donation of sandwich rolls! We still had some left over after we came back, and because the quality of their bread is so amazing, it'll last us a couple months if frozen. Thank you Columbia City Bakery!!!", "Date": "2012-02-21", "Author_Location": "Seattle, WA"}, {"Author": "Tina H.", "ReviewID": "uceXnrbB10xy1_zdMjy1DA", "Overall": "5.0", "Content": "Mmm!  I absolutely LOVE their columbia cookies.  Something about them makes them extra special.  Is it the type of sugar?  The tiny chocolate chips?  Their pistachio pinwheels and babka are also perfectly delectable!", "Date": "2009-03-17", "Author_Location": "San Francisco, CA"}, {"Author": "Kristina L.", "ReviewID": "agPfl3nuhncbj5zPr3BOsg", "Overall": "4.0", "Content": "This place was great!  We had a croissant with ham and gruyere, a chocolate pastry and a brioche.  Everything was super delicious, light, flakey and buttery.  We also had lattes.  It's a small bakery but cute.  It was pretty busy on Veterans Day morning.  Parking is a bit of a problem, but that can be expected off the main drag in Columbia City.  Other times I've been by the lines have been long and it can get sort of loud - its difficult to make yourself comfortable when there's a line of people bumping into you while you are trying to eat.", "Date": "2009-12-02", "Author_Location": "Seattle, WA"}, {"Author": "April F.", "ReviewID": "MwCJGyqRuBH18x3NIG7zFA", "Overall": "3.0", "Content": "Cozy lil joint! Found this place from walking around the area. Walked in and it smelled delicious (as expected). It's a small place but it makes it cozy. I had a lemon bar and my GF had their lemon meringue pie. Both were tasty. Umk.....that is all", "Date": "2011-08-20", "Author_Location": "Salt Lake City, UT"}, {"Author": "Laleh J.", "ReviewID": "PhwWI1FvUrTKbBSGn_tX-A", "Overall": "5.0", "Content": "This place is GOOD!", "Date": "2012-07-10", "Author_Location": "Seattle, WA"}, {"Author": "Sarah G.", "ReviewID": "rilKX4eFs_uoh78aFXIILw", "Overall": "4.0", "Content": "While the coffee and cappuccino are nothing overly exciting, the atmosphere, local art, service, and baked goods are brilliant!  We picked up a very rich and moist chocolate pound cake, chocolate cake (with a touch of salt in the chocolate buttercream frosting + delicious candied lemon and cranberry on top), and their almond-rich cassata. The baked goods are aesthetically impressive and I would definitely bring these to small, intimate gatherings with friends!   Single slices were about $4 each and 3 slices easily served four people sample of each.", "Date": "2008-12-17", "Author_Location": "Los Angeles, CA"}, {"Author": "Lydia N.", "ReviewID": "fQ2KNkdNfRBpzSGMqKWtOQ", "Overall": "5.0", "Content": "The BEST pretzels ever! They look so adorable with their skinny tops and big fluffy bellies. The taste is perfectly balanced and definitely more than just salt and dough. Perfect treat while at the farmer's market (though the actual shop isn't too far away..)", "Date": "2010-06-01", "Author_Location": "Bellevue, WA"}, {"Author": "Neal M.", "ReviewID": "3T7kyIeWFuvGEys4sxW6Sg", "Overall": "4.0", "Content": "I have been twice only but am wanting more.  The brioche is really great here.  I have also had desserts that were fantastic: pistachio snail, tasty croissants, etc.  Columbia City Bakery even has a very fine cup of coffee.", "Date": "2009-12-02", "Author_Location": "King, WA"}, {"Author": "Sarah M.", "ReviewID": "gNSafYyRPt0l1Hm_bcpwNQ", "Overall": "4.0", "Content": "They know how to make a good latte here and the barista is cute and friendly. I love the deserts and got some amazing passionfruit tartes here a few months back. This is a very family friendly place. I sometimes wish it was little less busy on the weekends. Be sure to check it out on the first friday of the month when Columbia City has it's BeatWalk and the stores stay open late.", "Date": "2008-05-30", "Author_Location": "Seattle, WA"}, {"Author": "april d.", "ReviewID": "MwRQMDDNXMqYwYzRgkjqsA", "Overall": "4.0", "Content": "Great little cafe and I would probably say its more of a cafe than a full fledged bakery.  To me a bakery is a place to get a huge selection of breads, pastries, cakes and pies and may just happen to serve coffee too, Columbia Bakery is kinda the other way around.  That said their baked goods are really delicious and their coffee really good.  Seattle has very few real bakeries (I'm used to the dedicated bakeries like San Francisco has a lot of) so my criteria and expectations are high.  All in all though, a great little spot to meet with friends or read the paper while you sip your coffee and grab a quick bite.", "Date": "2008-06-12", "Author_Location": "Seatac, WA"}, {"Author": "Lisa A.", "ReviewID": "3i4TgS7cCgRyIbHV-C4yfw", "Overall": "5.0", "Content": "I've only been here twice, but I love their variety.  Not only can you get the sweet stuff, but they also serve savory pastries like scones and croissants.  The ham and gruyere croissant was absolutely amazing!  The perfect amount of salty, buttery, flakey goodness in one pastry.  I've also had the chocolate cupcakes and hazelnut cupcakes.  The frostings are a perfect balance of sweetness, but not too sweet, that compliment each bite of the cake.  Yuuuummmmm...my mouth is watering just thinking about their display case.", "Date": "2010-08-23", "Author_Location": "Seattle, WA"}, {"Author": "Jillian A.", "ReviewID": "lcVNC4j04j8o_q2XN43l7g", "Overall": "5.0", "Content": "The chocolate pudding is so amazing.  Thick, rich, creamy and deeply chocolate.  The mochas are delicious and the taste of the espresso really comes through.  The blondies are such a wonderful dessert!", "Date": "2010-07-31", "Author_Location": "Seattle, WA"}, {"Author": "Cody E.", "ReviewID": "_AvcCIIRFU1mGpLokZxu_Q", "Overall": "4.0", "Content": "My friend and I were eating our way through Columbia City, and stumbled across this bakery.  We had already eating lunch at Empire and  went to a BBQ place (because you will not get full on Empire sandwiches).  This was our final destination for the day.  Columbia City Bakery had all the traditional fare, but seemed to add the details that make the difference.  What caught my eye this day was their selection of pretzels.  I ate a half dozen pretzels knots (little knots of pretzel dough that turn into balls of chewy goodness).", "Date": "2010-09-24", "Author_Location": "Tacoma, WA"}, {"Author": "Todd D.", "ReviewID": "2SSvxQuvkp8J0TaIyS97Cw", "Overall": "4.0", "Content": "5 stars for the coffee and 4 for the pastries.  5 stars for the  bearclaw.", "Date": "2010-10-16", "Author_Location": "Seattle, WA"}, {"Author": "Valisa H.", "ReviewID": "ii0HrWIBLRev_0OWpRYYSg", "Overall": "3.0", "Content": "I had to review this place again since someone brought me a sandwich from here. It was absolutely incredible!! My mouth is watering just thinking about it. Now if only you dropped that ATM card fee you would get my full 5 stars. :)", "Date": "2012-06-20", "Author_Location": "Modesto, CA"}, {"Author": "Evan S.", "ReviewID": "gQnOiF7z1nh9_Q9dm6Xk3w", "Overall": "5.0", "Content": "Without question the best bakery in Seattle.", "Date": "2009-03-14", "Author_Location": "Seattle, WA"}, {"Author": "amelia A.", "ReviewID": "4KTi5d6uJhpmz3vi3kJfww", "Overall": "5.0", "Content": "I love their pretzel bagels and ham n' cheese croissants. Everything else is also good.", "Date": "2009-09-30", "Author_Location": "Seattle, WA"}, {"Author": "Garth W.", "ReviewID": "RSbsYlYUa3NhhyVfW3UH6w", "Overall": "3.0", "Content": "Like other neighborhood folks, I ache for the C.C. Bakery to be, well, something just a bit better.  But it isn't.  I still go there, but only for specific items.Pros:  Delicious breakfast pastries (bear claw my fave, pain au chocolat, pistachio snail); truly fresh-squeezed O.J. (not \"fresh\" from a carton); very friendly staff; only place like it in Rainier Valley; kid-friendly.Cons:  Pricey; sloooow if you order an espresso drink; inconsistent  quality on espresso orders (I no longer get coffee there); kid-friendly (being kid-less, it feels more overrun with kids than kid-friendly to me); crowded / uncomfortable seating area.", "Date": "2010-03-30", "Author_Location": "Seattle, WA"}, {"Author": "Annie B.", "ReviewID": "JwTDtlEbyhg4byMlxthoRQ", "Overall": "4.0", "Content": "I love this place and would love to give them 5 stars BUT I can't seem to leave there without spending less than 10 dollars on a breakfast.  Their torta is incredible and I offer succumb to the pastries calling my name for dessert.  Plus their fresh squeezed oj is healthy.  How can I pass that up?", "Date": "2011-06-25", "Author_Location": "Seattle, WA"}, {"Author": "James M.", "ReviewID": "0xW-u2Xw2wtLTFjkS8ivaQ", "Overall": "5.0", "Content": "Dangerously good bread. We like all the different loaves, with the multrigrain sunflower seed, pain de campagne, and the potato loaf being our go-to's. I like the potato buns (toasted) and seeded dinner rolls for my burgers. My son likes his pretzel knots. My wife is quite happy when I return with a profiterole or tres leches cake. And their baguettes are worthy of their citywide reputation.", "Date": "2011-08-14", "Author_Location": "Seattle, WA"}, {"Author": "A N.", "ReviewID": "bJ9M6e3ZU7sTLur7DM08aw", "Overall": "4.0", "Content": "I love the cardamom coffee cake and frangipane tart, as well as the awesome selection of coffees--all bold and delicious!  When I visit it's usually on a Sunday around breafast.  We put our name on the list at Geraldine's counter and then walk over to the Columbia City Bakery for coffee and pastries to take home for the weekend.  We never manage to walk out the door without taking a  sample of our goodies.  The Columbia City Bakery has ruined many a breakfast, because by the time our table is ready I've already had my desert and eaten it too :)  I don't live close but anytime I'm in the area I'll stop in at this delicious bakery!", "Date": "2011-09-05", "Author_Location": "Burien, WA"}, {"Author": "Mo J.", "ReviewID": "NKgpLcqhOU0bQjBbnSQLeQ", "Overall": "5.0", "Content": "Beautiful baked goods with simple ingredients.  Loved everything I tried here: the chewy bread rolls, cheesecake, and muffins.  The staff was very accommodating re: my questions about allergens as well.  My favorite bakery during my stay in Seattle!", "Date": "2011-11-01", "Author_Location": "Washington, DC"}, {"Author": "Marales Q.", "ReviewID": "6igTIruF7l9lCouz1O07hg", "Overall": "5.0", "Content": "Lovely little lime tarts, awesome bread and a blond brownie like Grandma used to make. They also have good coffee to go with. Staff has a kind of cool vibe. I haven't yet tried the sandwiches that everyone is raving about, but now I have something to look forward to.", "Date": "2012-09-16", "Author_Location": "Seattle, WA"}, {"Author": "Alex S.", "ReviewID": "ssQfRNwgys9-3owPUJlx6w", "Overall": "5.0", "Content": "Horrible, evil bakers of my frustration!I feel like a chump paying those prices for baked goods, and then I eat those baked goods and they're unbelievably delicious and I think the prices are totally worth it -- which makes me feel like an evil Seattle gortex yuppie.Plus, everything in there will make you gain five pounds just by glancing at it.I'll probably go back tomorrow on my way to work. Did someone say bear claw?", "Date": "2008-12-14", "Author_Location": "Berkeley, CA"}, {"Author": "Damon H.", "ReviewID": "HWMWGkjuO3RjlSgYgbMpyA", "Overall": "5.0", "Content": "My favorite bakery in the area and one of my favorites in all of Seattle - and I am an experienced and hard-core coffee and bakery person.  Nice and cozy and full of a real mix of local folks.", "Date": "2010-05-19", "Author_Location": "San Francisco, CA"}, {"Author": "Liv G.", "ReviewID": "qwcOQD-rh52a2lVTKRseXA", "Overall": "4.0", "Content": "Very cute bakery with a fantastic but rather small selection of cookies, cakes, breads, etc.  You can eat in or take out and watch the work going on in the kitchen while eating in.  Coffee is good and the people working there are very friendly.", "Date": "2010-05-15", "Author_Location": "Seattle, WA"}, {"Author": "Dana M.", "ReviewID": "6BrsgD5F121IWLdteMbrCw", "Overall": "3.0", "Content": "Yummy baked goods, so-so coffee, not so great service.", "Date": "2010-09-16", "Author_Location": "Seattle, WA"}, {"Author": "N. W.", "ReviewID": "HYRTqzjsEZaX69unoKNJkw", "Overall": "2.0", "Content": "The first, and last time I went to Columbia City Bakery, I was waiting behind four little kids who took 10 mintues to order sparkly cookies. That's not exactly what my reveiw was about, but it was still annoying. Then after waiting for 10 MINUTES, I get to the first spot in line. I had my eye on the chocolate bread and attempted to order it. However, the cashier was being incredibly rude, and kept on correcting me on how to pronounce it. The chocolate bread I ordered was good though.Four stars on food.One star on service.", "Date": "2010-09-19", "Author_Location": "Seattle, WA"}, {"Author": "Cassie S.", "ReviewID": "Xn5VnreRYZPCaOKsqWGELg", "Overall": "5.0", "Content": "Uh, awesome! Stopped in on a whim and got a loaf of focaccia bread, a ham and gruyere croissant, and an orange spice cookie. The croissant was delightful...lots of cheese, crispy flaky croissant that seemed to melt on the inside. Bread made excellent sammich. And the cookie was small, but cheap, very orangey and soft. Will most definitely be back....wish they were on the Eastside.", "Date": "2011-01-28", "Author_Location": "Bellevue, WA"}, {"Author": "J. Lamont C.", "ReviewID": "Z2Rj6fZHwWjv3WuIXMq8Hw", "Overall": "5.0", "Content": "A bakery and a cafe! I definitely prefer this place than the Starbucks down the street. The decor is really cute, too. I ordered a brownie, and it pretty much melt in my mouth. If you love chocolate, you would love their brownie. I'm sure everything else on their menu is just as amazing!", "Date": "2011-08-11", "Author_Location": "Seattle, WA"}, {"Author": "H C.", "ReviewID": "OsYPbDMlOhPUUgbVsyoGbA", "Overall": "4.0", "Content": "This is a great neighborhood place to walk to. I haven't had the bread, but I trust it's great. I have had many of their desserts and they are good! I love the mini cookies they have here.", "Date": "2011-12-21", "Author_Location": "Seattle, WA"}, {"Author": "Rachel L.", "ReviewID": "dm_SkX-AT4lYuTeC5P49gQ", "Overall": "5.0", "Content": "If you live within a 5 mile radius, there's no excuse not to come to this bakery.  I have tried almost everything in there.  I could go on for hours, but I'll be brief.  Favorites: ham & gruyere croissant (seriously, best I have had), savory/sweet scones (perfectly sized, not too heavy, but SO flavorful), any fruit pie/cupcake/coffee cake, cassata/lemon pistachio cakes, all cookies, all the quiches/tortas, multigrain sunflower bread, hamburger/hotdog buns and the coffee (True North).  Skip (or at least on your first visit): babka (dry and lacking flavor), pistachio snail (not enough pistachio or puff pastry, oddly enough), olive bread (so hard I had difficult even eating it).Know before you go: this place can get busy, so don't go in if you are in a big hurry.", "Date": "2009-09-28", "Author_Location": "Oakland, CA"}, {"Author": "Laurie P.", "ReviewID": "fib7daJMjpLWOGKhF4bO7A", "Overall": "4.0", "Content": "My friends P., D. and I were on our annual Bakery Crawl last week surveying some newer pastry shops and revisiting a few.  Columbia City Bakery was second on our list after a trip to Belle Pastry in Bellevue.We ordered a chocolate croissant, plain croissant, almond frangipane tart with cherries, a pear danish and I bought a baguette for later.  We tend to judge bakeries by their croissants and this time P. suggested we be a little more scientific.  So we had brought an extra croissant from Belle Pastry to compare after we visited our three bakeries for the day.  (See my reviews for Belle Pastry and Bakery Nouveau).  Croissants were very good and better than Belle Pastry - more fermented flavor and great bake.   Frangipane tart was perfectly done and both P. and D. were sold on it.  I tried the baguette later than evening and was disappointed.  Although it looked beautiful and crumb structure was nice, there was no flavor.  I have had their baguettes several times before and this one was flat.  Great location for Columbia City Bakery and nice store front.  Staff was very helpful and quick.  Not sure I'd want to hang out here more than a short time as the music is always very loud - not really relaxing on a Sunday morning.  But the staff always looks like they're having fun.", "Date": "2010-05-31", "Author_Location": "Redmond, WA"}, {"Author": "Ben G.", "ReviewID": "x0bAJIITPSe0CuqYZzqsRg", "Overall": "5.0", "Content": "I love this bakery! All the employees are super nice and funny. The pbj cookies are a must try and the pretzel knots with cream cheese are a perfect little snack any time of day. The baguettes are everything you can ask for - a crunchy yet thin crust and light, fluffy interior with a wonderful flavor that just leaves you wanting more. Really, everything on the menu is great... they wouldn't make it if it wasn't. This is a world-class, honest bakery with (hands down) the best pastries around!", "Date": "2010-12-30", "Author_Location": "San Francisco, CA"}, {"Author": "Putty S.", "ReviewID": "jOKSwmGgMqGSVhw5fN3LGQ", "Overall": "5.0", "Content": "Great baked goods.  Definite must tries are: sandwiches, cupcakes, pistachio snail, and carrot cake!  Iced cookies could be better.", "Date": "2011-04-15", "Author_Location": "Soquel, CA"}, {"Author": "Debra Y.", "ReviewID": "1OgKBQbdwGWD4LaJjgBgKA", "Overall": "4.0", "Content": "I love this place.  I am more than willing to make the drive from Renton, just to get a loaf of their amazing bread!  I haven't tried their pastries or cakes, but the lemon bars are tart, with true lemon flavor on a buttery shortbread crust.  They have a selection of colorful sugar cookies in shapes that always surprise me.  Roosters, cars, ladybugs.  They just make me smile!  This bakery is not inexpensive, but  it's well worth the price. So far, the sugar cookies have never made it back down Rainier to Renton.  A sugar cookie, a cup of their great coffee, and that drive is heaven!", "Date": "2011-05-26", "Author_Location": "Renton, WA"}, {"Author": "Louisa D.", "ReviewID": "4Aqxzhj5D99MGqK0c8YyyA", "Overall": "5.0", "Content": "The pastries have already been covered as fan-fulfilling-tastic and everything I've eaten here has been exactly as I'd want it.I just want to add that in this coffee-mad town, it is rare and wonderful to come upon a bakery that also knows how to make a good cup of tea.And CCB does.It's simply bagged tea, but the water was hot enough and the tea was a delicious brand I'd never had, (Mighty Leaf), and am now buyng.", "Date": "2011-07-28", "Author_Location": "Seattle, WA"}, {"Author": "Christine O.", "ReviewID": "bCZESGRcdW1IbHhslztnlg", "Overall": "4.0", "Content": "Great place to meet friends - if you can find room to sit and chat.  The bakery is always full and the baked goods are always wonderful.  With summer came the outdoor tables. YAY!", "Date": "2013-07-14", "Author_Location": "Seattle, WA"}, {"Author": "A C.", "ReviewID": "CBc46MmW9fORE9Z8VcNCTw", "Overall": "5.0", "Content": "This is THE place to get bread. When i moved here I missed the bread from La Brea bakery in L.A. I still miss it but with Columbia City Bakery, I'm more happily resigned to go without the olive bread and sourdough batard, knowing of the amazing ficelles, seeded buns, and other delicacies that await, freshly baked at Columbia City Bakery. They have great doughnut cupcakes. The poster who said the Bear-claws and Croissants were perfect was not lying, If you've run into them and been unimpressed, prepare to be properly reacquainted here. Another really amazing creation is their upside down fruit cakes... pastry should come like this more often; a perfectly executed union of fruit with light and scrumptious cake. Another thing you should try is their savory crumpet.  I like to take those and split them in half for breakfast, then slather cream cheese and roasted jalapenos on them and eat them with a cup of homemade cafe de olla.", "Date": "2006-11-12", "Author_Location": "Seattle, WA"}, {"Author": "Jodine S.", "ReviewID": "n3BA4abLzmLvo9SbqgwH9Q", "Overall": "3.0", "Content": "I really want to like it here.  I do enjoy their bread, but I really believe in judging a bakery by its pastries.  I have tried at least a dozen different things, and every pastry/cake/dessert is over-buttered and too dense.  I think the prices are really high, and I don't mind paying a lot for a good bakery (i.e. Macrina), but at Columbia City Bakery, it's plain robbery.  From their chocolate pudding, to brownies, to whiskey cake, to spice cake, to their pumpkin pie, it tastes like a glob of butter mixed with whatever flavoring they are claiming to feature.  I'd love a great bakery in Columbia City, and their desserts and cakes are truly beautiful, but not worth actually putting in your mouth.", "Date": "2010-12-24", "Author_Location": "Seattle, WA"}, {"Author": "Liz O.", "ReviewID": "7zlYVIIER4l8NJCJYHGDLQ", "Overall": "3.0", "Content": "First of all, this place should have a 3-dollar-sign cost rating, for sure. As a person who occasionally enjoys baking at home, I appreciate the cost of quality ingredients and the labor involved. The marzipan filled bear claw pastries are consistently buttery, flaky and delicious. The seasonal apricot-almond cookies are chewy, spicy and remind me of German Lebkuchen. Well done.The tres leches cake was outstanding the first time I had it. Imagine mini pound cakes baked with butter and cream. Then after baking, the little babies are soaked in a sweet cream mixture. The result is a dreamy, creamy ,sweet uber moist confection. I eagerly anticipated my next trip to the bakery for more tres leches cake. Sadly, the second time the cake was somewhat dry and less flavorful. I ordered a caramel latte, containing house made caramel sauce. Sounded good. And it was. After my last sip, I looked into my cup and saw a yellowish, jelly like substance. Looked like a loogey. Yuk. Big turn off. So... now I go in and grab my bear claw. Then go over to Empire for coffee.", "Date": "2010-12-18", "Author_Location": "Seattle, WA"}, {"Author": "Ian D.", "ReviewID": "lVo3KoSRx_E9IbHblVAayA", "Overall": "5.0", "Content": "What a great bakery! The ham and gruyere croissant is a staple in my diet! And the service is very good as well. They've got very good baristas as well. My only complaint is there are rarely new items, which is a bad thing when I'm there several times each week! They need to put those baking skills to use and expand the menu a bit.", "Date": "2008-04-08", "Author_Location": "Seattle, WA"}, {"Author": "Edwyn A.", "ReviewID": "4j3_aY4YQNp3nrV3FYc37w", "Overall": "5.0", "Content": "great neighborhood bakery and coffee shop. how can you resist the bake goods...  and with a double expresso - why not?", "Date": "2008-08-22", "Author_Location": "Austin, TX"}, {"Author": "Abby W.", "ReviewID": "l_ajIzYzNUEFoJ0F02bjpw", "Overall": "5.0", "Content": "Excellent! Great selection, best sourdough I've ever had... Which is a lot.", "Date": "2010-10-27", "Author_Location": "Seattle, WA"}, {"Author": "La L.", "ReviewID": "HesFFcn2cqZ70ZOqclXKsw", "Overall": "4.0", "Content": "i have issues with the over-bakedvery very brown pistachio snails and bear claws.  but love their walnut levain!service is awesome too!", "Date": "2008-03-13", "Author_Location": "Seattle, WA"}, {"Author": "kate o.", "ReviewID": "XC816Jz_9WvbHS5TGXoQAw", "Overall": "3.0", "Content": "I used to love this place,  was their customer since their shop opened. However, since they became popular, their services became less friendly and courtesy. My little son love cheesecake here and they seemed to make it less often, which he could accept  that and just chose something else. Sadly, we went at 5.05pm. today and they closed at 5.00pm, so I asked if we could just do take out bakery in the showcase for my son. Answer was no!  We were closed!  I felt bad as a mother, who drove my little son there just to disappoint him. I wondered how much worked they had to do just to make their customers happy and return. Maybe they didn't care to lose some at this point.", "Date": "2010-04-24", "Author_Location": "Seattle, WA"}, {"Author": "Alicia N.", "ReviewID": "EnLjvrQqTq3G9RxU2jwG6A", "Overall": "5.0", "Content": "This place is AMAZING!! i love their Focattia bread and multigrain sunflower...both are to die for!! the pastries are delicious. i recently had one of their brownies and it was like chocolate butter. Best brownie i ever ate. i also enjoy their other baked good like the blondie and bear claw. i wish they had a bigger place though. during rush hour it gets really hot and claustrphobic. if you haven't been i highly recommend to stop by and grab something to go.", "Date": "2011-04-07", "Author_Location": "Seattle, WA"}, {"Author": "Leah S.", "ReviewID": "ge4D1tFKAIcRCvgWWZtQlQ", "Overall": "5.0", "Content": "Big fan.", "Date": "2012-03-03", "Author_Location": "Columbia City, Seattle, WA"}, {"Author": "Arthur M.", "ReviewID": "R-uuYBjH7gvE3SVehk4BWQ", "Overall": "5.0", "Content": "This is, hands down, the best danish I have ever had.  Ever.  I'm sure everything else is good, but the danish is just so good that I can't bear to go there and not get the danish.  MMMMMmmmm.", "Date": "2012-03-29", "Author_Location": "Downey, CA"}, {"Author": "Giovanna L.", "ReviewID": "5iEuiBohH-V3bLcaEq73YA", "Overall": "2.0", "Content": "The product is fantastic, but the service has been so unpleasant on several occasions, that I have stopped going in. Most recently, five of us went in for pastries and coffee, my guests all excited about the pastries and bread I had touted. After an unbelievable display of rudeness by the two girls/young women behind the counter (in response to our question, one turned to the other who literally crossed her arms over her chest and rolled her eyes while mouthing \"no\" in clear view of us all). We looked at one another in disbelief, turned and walked out (and drove to Both Ways for fantastic food and friendly staff). I mentioned this experience to a friend at the Columbia City farmers' market this week, (as I was buying CCB bread from the very nice and competent employee there) and she matched that and raised me one. Two other bystanders piped up with similar tales. Owners, are you listening? We love our neighborhood bakery, but we cannot tolerate that kind of behavior while spending our hard earned $!!", "Date": "2011-08-19", "Author_Location": "Seattle, WA"}], "RestaurantInfo": {"RestaurantID": "5RsMlvclPDaaRlJ-43ey7w", "Name": "Columbia City Bakery", "Price": "$", "RestaurantURL": "/biz/columbia-city-bakery-seattle", "Longitude": " -122.2850549000000", "Address": "4865 Rainier Ave SSeattle, WA 98118", "Latitude": " 47.558346700000001", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/CUFw80y7KmNy979afAJKXQ/90s.jpg"}}