{"Reviews": [{"Author": "Wild West R.", "ReviewID": "g49Vwb0xR-M2zkTNLARSJg", "Overall": "4.0", "Content": "Writing a review on this place makes me happy. I was visiting my mom and stepdad and Three Flames was recommended to them from a friend. I'm not a big fan of chain restaurants (I'm hoping for obvious reasons) so I was enthused to try this independent place. Booking a reservation by phone was easy and convenient. My folks are in there 70's and 80's, so they don't get around quickly. From the moment we arrived, we were treated with patience and kindness. We were seated immediately and I believe Renee was our waitress. Service was prompt, friendly and courteous. Her knowledge of the menu and ability to make recommendations was extraordinary. Where can you order scalloni these days? My prime rib was delicious too. My stepdad loves to tell cornball jokes and Renee not only put up with them but laughed at them too. :) The prices are dynamite for what you get, especially in the Bay Area. I can't give them 5 stars simply because I don't think they are trying to be a 5 star restaurant, and that's O.K. They are very good at what they do.I look forward to dining here again and recommend you give it a try too if you're looking for a good meal at a reasonable price.I almost forgot... the artichoke mashed potatoes were the bomb!", "Date": "2014-06-27", "Author_Location": "Roseville, CA"}, {"Author": "Liana H.", "ReviewID": "qzU4sMhyj4BceaE4CxEWtQ", "Overall": "4.0", "Content": "I have been here two years in a row now for their Easter Buffet. I don't celebrate Easter, so I hang out with the Catholics who like to have a good ole feast for the holiday. The brunch buffet is pretty dang good, I must say. For 28.99 you get the vast brunch buffet, as well as AYCD champagne, mimosas, coffee and tea. Sodas and anything else from the bar is extra.  Once you party has arrived, you are seated at your table, drink orders are taken and then off you go to the buffet. Here were my favorites: Blintz,  Deviled eggs, Bruschetta, Pasta Salad, Eggs Benedict, and French Toast. They also have different cuts of beef, crab legs, smoked salmon, shrimp, loads of breakfast foods like pancakes, eggs, potatoes, bacon, sausage as well as every type of deli salad you could imagine. You really get your money's worth at this buffet. I wish that they had labels of what the dish was because some are a bit hard to identify. I will probably be back next Easter!", "Date": "2014-06-01", "Author_Location": "San Jose, CA"}, {"Author": "Sal E.", "ReviewID": "kiLlJTgGemOsZ1-4Qe0k0Q", "Overall": "4.0", "Content": "Artichoke Mash - Amazing!Excellent bread, olive oil, salad, chicken marsala, & fish trio special.Even the drip coffee is excellent.Service is above average.Overall experience was great.", "Date": "2014-05-20", "Author_Location": "Los Gatos, CA"}, {"Author": "Jim D.", "ReviewID": "JXKKDXnUmiPyj_xPDl_CfQ", "Overall": "3.0", "Content": "While appearing to be on the surface more upscale than most chain restaurants, Three Flames is in fact well past its prime looking old and dated.  Most everyone there was probably 70 years old and older, which seems to be their prime clientel. The food was classic mid-west.  That is to say lots of food and mediocre with gravy on the steak and the salmon drenched in butter though my wife specifically requested no butter at all. The steak and salmon were good pieces of meat, but the preparation came close to ruining both.The salad likewise was drenched in ranch dressing and consisted of head lettuce, a few tomatoes and onion. Non descript at best.  The bread was OK.The staff was friendly but befuddled.  I didn't see any staff member there likely under the age of 50.This is the kind of place you bring your elderly grandparents so they can take a mental trip back to the past.  However, if you are a traveling business person alone or with a client, young dating couple or even a 30-40 year old married couple seeking to get away from the kids for awhile, this place probably isn't going to meet your expectations.", "Date": "2014-07-15", "Author_Location": "San Jose, CA"}, {"Author": "Myriam D.", "ReviewID": "97NYAAQsFOFiZ9aKbinm9g", "Overall": "5.0", "Content": "If u are looking for a delicious steak try this place.  Their three flame special steak is my favorite. Its Under 20 dollars and you get two choose 2 sides with your steak plus a salad. They also have karaoke nights and a bar but its more of an older crowd.   Their food is great and their servers are really friendly and they are always checking up on you making sure everything is ok.", "Date": "2014-06-26", "Author_Location": "San Jose, CA"}, {"Author": "Tina W.", "ReviewID": "-0NefDyMBtLu2v4yb0bN4A", "Overall": "1.0", "Content": "Horrible horrible horrible attitude, service and food.I have attended 3 times during Happy Hour which turned out Unhappy.The only reason I returned was because friends were meeting here.Two different days, I was waited on by a Renee - her attitude is horrible.Everytime I go in, she is never friendly, warm or even nice.When she wants to make a statement - it is cold and hard.The food sucks.  First time I ordered was for a chief salad and there was almost nothing on it, just lettuce and a couple pieces of tomatoes.  The other two times I ordered the hamburger.  The meat was so hard I could not cut it with a knife or fork and it was very very dry.  I ordered a coke and when I asked for a refill, I was told not nicely that I would be charged for the refill. I didn't mind, but it was the attitude in which it was stated to me.  My friend ordered Nachos and it was missing the sauce on it. When he said something \"Renee\" gave him attitude.  I asked for water with ice to drink.  I was told she would have to charge me as a regular drink for the water.  The month before she gave it to us no problem along with the coke I ordered.  A friend had ordered so much food, she needed a container to go.  Renee told her she would have to charge her for the container and double the price for the food as it was Happy Hour and everything was half off but not allowed to go home!!  Since when if we paid for it?  The month before we did not go through that.  I told Renee, boy,,when you get done with us you are going to know all of our names - there was about 12 of us.  Her response was...Yeah when I get done with you, you will know what the rules are during Happy Hour!  The bartender there was not nice either.  I sat in the booth area behind the table the first time I went there.  He came by, yelled that he needed the walkway and gave me a dirty look.  Yesterday, the waitress was no where to be found so I asked that same bartender (Italian/hispanic looking) if he could please provide us salt/pepper for our table.  He walks in the back, goes back to the bar, starts to do something, then he gets the salt/pepper shaker out and strolls back by the table and hands it to me.  He was in no hurry to serve me at all.   My friend brought cupcakes because we gathered to celebrate a birthday.  Renee the waitress comes up to her not in a friendly way and says \"You cannot bring food in here.\"  My friend said,,Funny they let me do it during Karoke what's the problem now?  We are celebrating a birthday..then the waitress walks away.If Renee the waitress and that bartender want business or at leas my business, they are going to have to change their bad ugly attitude.  I walked in Happy.  I walked out Unhappy with negative negative feelings/thoughts about how I was treated of which I did not deserve.  I hope someone that owns this business reads these reviews because that waitress and bartender are HORRIBLE...", "Date": "2014-05-08", "Author_Location": "San Jose, CA"}, {"Author": "Renae I.", "ReviewID": "jKHCXLb9okwNLs8WSQ51iw", "Overall": "1.0", "Content": "DO NOT GO HERE. I WAS SEVERELY DISRESPECTED BY THE OWNER CHRISTINA AND WAS TOLD THAT MY FAMILY HAD COMMUNICATION ISSUES. I WAS ALSO OVERCHARGED 50.00 AND THEY ARE DOING EVERYTHING THEY CAN TO NOT REFUND ME.  THE STORY IS BELOW. 1. My husband and I were overcharged an amount of 50.00.  We signed off on a receipt that was 40.05. Two staff members had communicated that the gratuity was already included. When we looked at our statement, we were charged 90.05. My husband called and was told by the manager Christina that the gratuity was not included in the bill, and the EXTRA fifty dollars was the gratuity. If so, communicate correctly with your employees because they are giving out false information and IF fifty extra dollars was the gratuity, why didn't the receipt reflect that? We sure as heck didn't give a 50.00 dollar tip for that cold and tasteless food. 2. I called to get the fully story and was told a different story than my husband. The owner Christina told me that my family, did not put in enough paper money and that was why my card was charged an extra 50.00. When I said that signing off on a 40.05 dollar receipt when I was charged 90.05 in actuality  was unethical and poor communication and wrong, the owner Christina said, \"I think your family has communication issues.\" And hung up. That is unethical and severely disrespectful and ILLEGAL.If you do have the unfortunate experience of eating here, do not pay with card.They have been reported to the Better Business Bureau.", "Date": "2013-12-10", "Author_Location": "San Jose, CA"}, {"Author": "Roberta M.", "ReviewID": "XvD2D1n7kfoN-gK1csZYvg", "Overall": "2.0", "Content": "sighing...alright food was OK when we finally received our main course after an hour.We arrived @ approx 6 pm on a Sunday evening.  Staff were polite and apologetic as apparently 2 people called in sick today.  OK...got it... and most of us understand but  also:  many of us spend our work week taking care of others and sometimes we just want a simple decent dinner out minus drama.Its tiresome to hear several times during the course of our experience that \"sorry the cook didn't see the order for your appetizer\" or \"sorry we are all out of the dessert you ordered\" or \"hey take your time ordering because it means I get to rest for a minute\" Geez...the parking lot here is always full on weekends so presumably management should be better prepared with staffing and supplies.  Also dislike feeling like apologizing myself to staff for simply showing up and making an uncomplicated order for 2.  Yeah the food was OK and so were the cocktails.  Yes, we were given a free dessert due to the wait but I'd really rather just have our entrees show up in a more timely fashion and ( once again ) minus the feeling like we were contributing to staff overwork by just showing up.", "Date": "2014-06-01", "Author_Location": "San Jose, CA"}, {"Author": "Sean M.", "ReviewID": "BrLn9CNiUI9Zc1BEzIMrLA", "Overall": "4.0", "Content": "House salad - 4 starsNY Peppersteak - 5 stars of awesomenessCalamari - 3 starsCrab cakes - 4 StarsThe service is better than average and willing to accommodate us when we requested a different table.Trying to decide what wine to go with our steak dinners I noticed a bottle of BR Cohn Cabernet Silver Label for under $40. OMG! We had to get one and loved it so much we drank it before dinner so we got another. Would have had another bottle of the BR Cohn if I didn't have to drive home.If after dinner you are not done for the night the bar was hopping with a live band. Restaurant is quiet and romantic while bar is upbeat and lively.", "Date": "2014-01-03", "Author_Location": "Newark, CA"}, {"Author": "Michael S.", "ReviewID": "FyvkZdBgmCdPo0I4x4W7Ng", "Overall": "5.0", "Content": "I attended a family reunion event here recently, and I was pleasantly surprised at the quality of the food and atmosphere.From the outside, this place is just a restaurant in a boring strip mall. You would not expect great things from looking at it.Inside, the lighting and layout of their larger event area was warm and inviting. The buffet-style food that was served was better than I've had at any non-wedding event I can remember.", "Date": "2014-01-03", "Author_Location": "Dublin, CA"}, {"Author": "Julie R.", "ReviewID": "N_DZ3ow_9uGbXVC72-sEXQ", "Overall": "5.0", "Content": "We just had a large, very high maintenance banquet at this location and they were wonderful.  Everyone is still raving about the pasta.  The service was great and they were so accommodating.  If you need to have a banquet, look no further.  Had a great time singing karaoke in the bar after as well.", "Date": "2014-03-24", "Author_Location": "Campbell, CA"}, {"Author": "Isabel G.", "ReviewID": "kHJqwUCd8n3kQ5wtwQyBQA", "Overall": "1.0", "Content": "**********WARNING************** if you consider yourself everything other than WHITE please Do NOT GO INTO this PLACE. They are racist at this location and they don't like serving you or find a way to rip you off or make it uncomfortable to be there. We went with a group of 6 girls on the bar side. My friend was the designated driver that night and the waitress kept demanding she buy a drink because they had a 2 drink minimum. She explained to her that she was DD, but the waitress wouldn't let up.  Our table was buying drinks we ordered more than two drinks. She was finally done with my friend then she moved on to me. I was dancing so I went to the bar to ask for a glass of water. The waitress came up to me told me same thing it's a two drink minimum I told ok not a problem. I had my first drink when I got there and I would be buying a second one. She wouldn't let up I told her that once I finished my first drink I would drink the second one. She yelled me told me I was being nasty.. I was stunned specially since I know that I never said anything bad to her. This is the last time I will ever come to this place we went on April 25th at 9pm my Waitress was this older lady in her 50's with a boy hair cut with red hair. Please avoid this place!. I enjoy giving good places good reviews and this place is just awful.", "Date": "2014-04-30", "Author_Location": "San Jose, CA"}, {"Author": "Irma R.", "ReviewID": "pME2P0eOo9u61hXqmh9h0w", "Overall": "1.0", "Content": "My boyfreind and I choose this restaurant for our family Thanksgiving dinner. Our reservation wait was over twenty minutes.  The staff was understaffed. Our waitress was very unattentive. As our food was served. we waited for steak knives for a long while. Wich made our food cold and undisrable. We where never offered water, wine or bread refills. Until we finally where able to flag the nearest busser whom was rudely approachable. It just seemed like if you weren't a regular. Then service must wait. Sad to say,for our horrible experience we will forever not reccomend dining at  Three Flames on a holiday.", "Date": "2013-11-29", "Author_Location": "Morgan Hill, CA"}, {"Author": "Liz C.", "ReviewID": "r9DW1Dp62atEjyzp0z74QQ", "Overall": "5.0", "Content": "I have to respond in reference to Linda's poor rating.  This large party comes to the bar and orders more food than any person could possibly eat in one sitting.  They have the waitress tending to them constantly asking for refills of diet coke and water.  Unfortunately for Renee, she's had to wait on them both times they've come in.  They obviously come in just to take advantage of the great prices on the happy hour menu by ordering too much food and asking to box it all up to take home.  Renee is always pleasant and attentive to customers.  These people are just plain obnoxious.  If you want unlimited refills of diet coke and water and cheap food go to Hometown Buffet!", "Date": "2014-05-23", "Author_Location": "Stockton, CA"}, {"Author": "Rex M.", "ReviewID": "Onc7e7ZhuaXbinRx3qP0Gw", "Overall": "5.0", "Content": "Went there for lunch with some friends we got a table right away. Our server 'Renee' greeted us with a friendly attitude. Renee took our drink order and returned quickly with them.....big plus in my book. Renee answered all our questions about the food, made suggestions on what we might like. Renee gave us all the time we needed to order, we got our food in a timely fashion. I have to say the food was great and so was the service.", "Date": "2014-05-20", "Author_Location": "San Jose, CA"}, {"Author": "Marilyn P.", "ReviewID": "-gXAtBswQkhL9tQfEk3OdQ", "Overall": "1.0", "Content": "My family and I came here to celebrate Mother's Day and BOY, were we disappointed.  There were 5 of us altogether which we all ordered steak and only 2 out of 5 of us got our steaks the way we actually ordered.  To begin our celebration, the waitress started greeting us by saying what a busy day it had been for her and how she was NOT together by then.  We didn't think much of it and was understanding thinking it was Mother's Day and the restaurant was busy.  We still expected the food to come out right since we were going to pay full price for it though.  She then took our order without any problem, so it seemed.  Little did we know that she totally forgot to put in our appetizer order so our calamari came out after our steaks, and only after we asked her about our appetizer.  To make our experience worse, our steaks did not come out as they should have.  The medium-well steak came out well done and the medium rare came out medium and dry.We had a good time nevertheless, but only  because we did not want our special day to be ruined, but it could've definitely been better.  The star was NOT for the food or the restaurant service but only for the bartender because he was the bomb.", "Date": "2013-05-12", "Author_Location": "San Jose, CA"}, {"Author": "Violet J.", "ReviewID": "5kLtWn1UVtesLHxYKq1Qdw", "Overall": "1.0", "Content": "If there was a lower rating than this, i would use it.  I can't seem to get rid of this experience from my mind, it was so hurtful, that I'm writing this review 5 days later.  We had never been here before and my friend and I thought it would be a nice place to have a nice enjoyable meal.Arrived at Three Flames, walked up to the receiving podium to begin the wait to be seated; no one showed up.  The restaurant was not overly busy. After what felt like an eternity I began to get restless and looked around for help, my friend kindly said to me \"they will show up\" at  this a waitress poked her head from around a corner and said \"I'll be right with you\".  She eventually seated us.  I asked for a Bloody Mary and we placed our order.The Bloody Mary came as a red color liquid in what seemd like a  4oz glass. Could barely taste the alcohol, no celery, no seasonings, a complete joke.  When I asked the waitress what had happened to my bloody mary she responded with \"Oh, I'm sorry\" accompanied with a fake smile, like she just didn't give a dam.My friend's spaghetti was cold noodles with some ragu (barely warm) on top.  My fish was flat, under-microwaved with what looked liked tired vegetables.  I was embarrased for the both of us.Forty dollars later and a tip we walked out of there wondering what happened?Later, when I talked to my family and friends about this experience, I was told this restaurant does not like people of color and this is what they do to not have us not come back.  My friend and I are senior citizens and he has a disability.Well, if you are this sort of person that enjoys hurting others this is the restaurant for you; but if you are a decent, concientious human being you will stay away from this establishment.", "Date": "2014-03-14", "Author_Location": "San Jose, CA"}, {"Author": "Laura G.", "ReviewID": "7RjFFQVH90sMqo-RpFnIZw", "Overall": "3.0", "Content": "This does have an older feel to it.  My 80 year old father loves this place.  The manager comes to say hello, they do a good job at acknowledging regular customers (plus my father is a hard one to ignore).Service was outstanding.  I noticed that the majority of the steaks had a sauce, so I opted for the fish grill - chargrilled tilapia, fresh salmon, and prawns served with a orange-basil butter.  Being from Los Angeles I did the whole \"orange basil butter on the side, no rice, double veggies\" special orders were happily accepted.  The dish was OK, I felt that the Chargrilled tilapia was maybe pan fried - lightly.  It was solid and good.", "Date": "2013-04-22", "Author_Location": "Stevenson Ranch, CA"}, {"Author": "Myra I.", "ReviewID": "O15bLvF_EcxrlOpSxw8H_g", "Overall": "4.0", "Content": "I booked reservations for Love Day 2014.  Sue the hostess informed me that they were booked.  After giving her the sob story about how every restaurant is booked, she was very kind to \"squeeze\" our reservations for 4 in.  She adviced me to show up early.  We showed up and were promptly seated while there was a line stretched out the door with folks hoping for a table.  As busy as it was, our waiter was in good spirits with a sense of humor and very prompt.  Food was delicious and prices were resonable.  I will be back!!  Thank you 3 Flames for making Love Day an enjoyable evening.", "Date": "2014-02-18", "Author_Location": "San Jose, CA"}, {"Author": "John K.", "ReviewID": "LDbpHeeQG6hIfjXiJZMJuQ", "Overall": "5.0", "Content": "We have been going to the Three Flames for years and always enjoy the lounge, restaurant and banquet areas.  Things we love:Staff- Jose is a caring owner his staff in all areas never disappointsCocktails - are reasonable, the bar menu is great especially during half price happy hour; If we make it to karaoke its so much fun.Food - love the tri tip, the salmon is always cooked to perfection and the salad is simple but deliciousThere are three reasons we like going out,1. People2. Food3. AtmosphereThinking about last night The Three Flames hit them all, we had another great night out.", "Date": "2014-02-05", "Author_Location": "Los Gatos, CA"}, {"Author": "Dewey M.", "ReviewID": "GE9RX1ji3Sobe2cWV2XYZg", "Overall": "5.0", "Content": "3 Flames serves me up a perfect meal each and every time I go there. Their steaks are as good if not better than Morton's, Flemings or any other area steakhouse. Actually I would go as far as to say they are better as they offer a California flare the others do not;  they have specials with Shallot Merlot sauce, Gilroy style, etc. Tonight on the special menu they had Hawaiian Opakapaka (Pink Snapper) -- i rarely see this is California. I opted for the turkey as it is thanksgiving and I cannot get enough. The turkey was cooked to perfection/. I finished off with an incredible pecan pie and a perfect cup of coffee all provided with excellent service. Laslty, I want to commend them on their dinner salad - yes dinner salad - the greens are always garden fresh and their dressings are quality.They have a lounge I always eat in and the have a formal dinning room.", "Date": "2012-11-21", "Author_Location": "San Jose, CA"}, {"Author": "Kathie C.", "ReviewID": "Uuy2n1hCFt2XMLXDz99WZw", "Overall": "5.0", "Content": "A few days ago, my husband and I dropped in at about 3:30 intending to eat dinner. We asked to be seated in the bar which is the only place they offer their happy hour prices, and we were delighted that we did that! We each had one beverage, ordered the outstanding and delicious appetizer of sirloin steak / mushrooms and French bread, and we thoroughly enjoyed ourselves! The ambiance was joyful, the holiday decorations were charming, and it was clear that this is a place where community members meet to do business, and enjoy each other's company.  The waiter was awesome, and since we are from out of the area and needed to drive home before rush hour, we decided to go home after only appetizers. What a pleasant experience - we intend to be back when we need to be in San Jose next time.", "Date": "2014-01-08", "Author_Location": "Salinas, CA"}, {"Author": "John J.", "ReviewID": "qK5r4ANDKGJPhh9w47jkaA", "Overall": "4.0", "Content": "Three Flames is a conservative American-style restaurant with a classic menu, and is very different from the restaurants I'm accustomed to going. When you go in, one of the first things you see is an antique cash register with buttons that I'm unsure how to describe. The lights are dimmed to a modest glow, and you can choose to sit at a booth against the wall or a table. The clientele tends to be more mature than I am, and the prices are meant for a higher income bracket. The closest thing I can compare to Three Flames would be Black Angus, except Three Flames is a step up and has a wine menu.  I glanced at the regular menu, but my gaze quickly focused on the dinner specials (and their prices thankfully cap at $25). I can't really say that I've had any of the dishes they were offering, so I just picked the most expensive thing on the menu: the New York Strip Steak with Shallots and Merlot sauce. I ordered my steak rare, and just ate the bread that was provided as I waited. The server gave me my choice of salad or soup, and I chose the Cream of Cauliflower soup. It had pieces of actual cauliflower in it, so I could tell it was the real thing and made fresh. Then came the main course. I got a baked potato, and sauteed broccoli in a cheese sauce with my steak. I am not accustomed to this type of American food since the closest thing I've ever had was Black Angus and maybe Red Lobster, but my steak was very good, and it edges out the competition purely based on taste. It was juicy and the color was spot on for rare steak. I enjoyed all the items on my plate.Should you come to Three Flames? Is it worth it considering you could get the same type of food at other cheaper American eateries? Hmm, I think it's worth it if you're looking for a nice quiet place to enjoy your evening, like if you're celebrating a birthday or anniversary. For myself, I came here because my mom purchased a certificate on Restaurant.com, and I thought \"why not? If I don't like it, I'll just write it on my Yelp review later.\" But I enjoyed it; the food is definitely delicious and the ambiance is relaxing (for people who like the quiet). Personal biases aside, I think Three Flames is a good restaurant, and a great restaurant for its category.", "Date": "2013-08-18", "Author_Location": "San Jose, CA"}, {"Author": "Jennifer n.", "ReviewID": "n5kzOVXd1vYf_1WuNHLqUw", "Overall": "4.0", "Content": "My friend heard of this place from a friend so we decided to check it out.For some reason, when we arrived, we were hesitant to come in. You know how you have a feeling it would be filled w/ old people and you'd be out of place??? We sat in the car and had to figure out a game plan in the event we walked in and didn't like the atmosphere. What were we going to say and how do we get out? LOL, so funny! I stayed by the door while he peeped in just as if we were about to rob the place or something. I got the cue and we walked in casually. The bar was on the left of the entrance and the restaurant was on the right.This definately was not a happening place BUT I like it. :)The place reminded me of an old classy place.The music were oldies but goodies. I heart 70's-80's music. (anyone that pms me crap about it can talk to the hand!)CALAMARI- is the second best I have had and the 1st was at the Ritz Carlton in Half Moon Bay. It was a lot for $9 and the calamari were so tender and crispy on the outside. NUM NUM!STEAK AND SEAFOOD COMBO- was good but loved how they split the meal into 2 separate plates and the presentation was nice. We had the baked potato and our server placed the sour cream and butter right in front of us. It was a pleasant experience here and I am surprised. I would come back .", "Date": "2009-06-09", "Author_Location": "San Jose, CA"}, {"Author": "Julie K.", "ReviewID": "fhRWbHB3onIg7ZiUycx-bQ", "Overall": "3.0", "Content": "Announcer: \"The sun is set. The stars shine in the sky. The night air is tinged with anticipation. And it is time to meet The Continental.\"Remember Christopher Walken's SNL character ?I always think of him when I dine at Three Flames, because this is truly continental dining, with perfectly cooked steaks and massive baked potatoes. It's definitely old school, and most of the patrons are retirees, but that shouldn't make you flee like the women The Continental lured into his apartment. Instead, settle into one of the booths, order a martini, and wait for your thick, juicy steak to arrive with your baked potato prepared tableside with sour cream, green onions, and butter. The flavor of the steaks will make you say \"Wow! Wowee-wow-wow-wow!\"The wine list is small, but so is the markup. There isn't much in the way of fine champag-neh, either, but stop by the bar/lounge on your way out and enjoy some some septuagenarian karaoke for a good time.", "Date": "2010-03-20", "Author_Location": "San Jose, CA"}, {"Author": "Chuy F.", "ReviewID": "QvdkoI7lBcU83zLdhuxgPw", "Overall": "2.0", "Content": "This is just a low scale restaurant dressed up to look way better than it is. When I first stepped into this place I was surprised to see how nice it was on the inside. The decor was nice and I thought I was going into a more upscale restaurant than what I was ready for .Salads were drenched in dressing and had soggy leafs, food was not nearly as tasty as it should have been for the price, music was way too loud, and the woman taking our order was very short and rude. Go blow your money somewhere else and skip out on this place.", "Date": "2011-07-10", "Author_Location": "Fullerton, CA"}, {"Author": "Weide Z.", "ReviewID": "iwnU8phEH2U7p7M5ZL-wAg", "Overall": "4.0", "Content": "This is a review of the Karaoke at Three Flames..For 30 something years now, ever since he gave us that wonderful plaintive anthem of the Vietnam era \"What's Going On?\" I've always wanted to *be* Marvin Gaye. Finally, for four minutes Sunday night, thru the magic of karaoke, I *was* Marvin Gaye.. (uhm except for a few split seconds at some of the *high* parts where I obviously could *not* have been Marvin Gaye, because if I *had* been Marvin Gaye my voice would have, at those points, transitioned to a unearthly falsetto soaring to the heavens rather than, uhhm, doing whatever it was doing.. whatever.. it was still all good)..Connie Taylor, who is hosting karaoke at the Three flames on Sunday and Monday nights, has a truckload of Motown cuts that some of you might be interested in checking out.Then on Tuesday and Wednesday nights, Dougie Rose, is doing a country-radio-sponsored karaoke show.. (altho.. his songbook seems to have just about everything.. and some of the most lushly-orchestrated karaoke cuts of Frank Sinatra songs I've encountered anywhere) The Three Flames has a good sound system, a great dance floor, and lots and lots of regulars (mostly mid-life and up) who love a little old fashion slow dancing. It's kind of neat to see them enjoying themselves the way they do on the dance floor. Crooner renditions of old standbys like \"After the Loving\" and things tending more country western are appreciated and danced to.Tips for Connie's show: In addition to her regular songbook.. be sure and check out her much bigger binder labeled \"More\" this lists all her songs in CAVs Super CDG format.Suggested song selection criteria.. play to the crowd the first part of the evening with some slow-danceable songs.. then for your last round.. experiment with her Motown selections.. I'm going back there for more of that.Tips for Dougie's show: If you *ever* wanted to sing \"Luck Be a Lady\" *with* full, lush orchestration AND the *prelude,* it's right *there* for you..", "Date": "2008-01-17", "Author_Location": "San Jose, CA"}, {"Author": "Kelly D.", "ReviewID": "7ol6XulOujoff9ozhGEXhQ", "Overall": "1.0", "Content": "This place has been here FOREVER. Meeting the parents for dinner and this was their choice. The young girl who greeted us was terrible. No smile upon entering the lobby, not genuine. I felt like we were a major inconvenience. Very condescending about our seating, offering us a booth in a tone as if we were a group of children. I don't know if she was riding the express train to Bitchville that night or if she is just rude all of the time. If I wasn't with my parents, her attitude alone would have made me leave. She was NOT warm or welcoming, and she didn't even try to fake it. We were also asked four times if a booth would be ok in this really weird manner that made me wonder if the booth seating there was some sort of major insult or something. The whole thing about the booth was really weird. The booth was fine, by the way. So it makes the questioning even more puzzling.On a side note, yes, this is the place where seniors dine. I don't think they let you eat there unless you are with someone over the age of 60. Seriously. Not that there's anything wrong with this, but it was kinda funny. I am guessing these people have been dining here since day one.The part in the dinner menu made me giggle: All entrees come with a vegetable and a starch.I don't think food has been referred to in that manner since the 70's, and I am guessing they never bothered to change that part of the menu since the restaurant opened decades ago.The food is your typical american fare. Steaks, chicken, starches (potatoes). You get a basket of warmed bread before dinner, which wasn't bad but I was really hungry. I ordered grilled chicken. I had the minestrone soup and it was very salty. The chicken was ok but salty, grilled veggies had a lot of lemon. I liked my garlic mashed potatoes (my \"starch\" choice - hahaha). My dad's steak wasn't done the way he asked. My husband didn't like his calamari. My mom said her meal was ok, but this was her way of saying it was underwhelming.I wish they didn't salt the heck out of everything. All the old people with hypertension are being done a tremendous disservice by being fed such salty fare. And I felt kinda icky after the meal because of it. The table service was quick and thorough. This was probably the better part of the experience.As we left, the rude girl at the front forced a goodbye, but still no smile.", "Date": "2010-05-09", "Author_Location": "San Jose, CA"}, {"Author": "Vivian B.", "ReviewID": "BblvTS9598kIL7qCKPNxzA", "Overall": "5.0", "Content": "I took my boyfriend there for his birthday and they were awesome! I have high expectations for restaurants. The food was timed well and has been delicious every time I've gone.Love the staff, they are very attentive, polite, professional, and personable. I'm not sure if the waiter was actually sure which wine should go with the filet mignon. (Sounds SOOO snobby! We had no idea and were like, \"you're the professionals, help us!!\" We put that guy on the spot and he played it nicely) I told the waiter it was my mans bday, so they brought out orange sherbet, on a plate which read \"Happy Birthday\", written by the chef with different flavored syrups. My boyfriend could see a smiling waitress poking her head around the corner right before they came out to sing, adorable.There is a bar attached with karaoke as well. If you go for dinner later in the evening you will hear the madness coming out of that microphone. Hehee =)NY Pepper Steak: Black pepper corns & bacon gravy stuff on top! YES! The clam chowder is  fantastic. They have a great menu.", "Date": "2013-09-05", "Author_Location": "San Jose, CA"}, {"Author": "Dave L.", "ReviewID": "GDcJj_oRSm8fyz8WIvwCMw", "Overall": "2.0", "Content": "We went for the \"special\" thanksgiving dinner and that will be the last time we hit this overpriced dump. Since grandad wanted to eat at 3, we elected to split the roast lamb \"special\" for which they charged us an additional $3.95, which is all right as split charges go (Hawg's does NOT do this to you though). When the food arrived it looked like it had been plated by a four-year-old with no sense of presentation. three thin slices of lamb, a shitty looking scoop of jackets-on mashed potatoes and a few green beans that literally looked like they had been thrown on the plate. The salad was NOTHING more than a handful of tired bagged mixed greens (Costco leftovers?) Never again.", "Date": "2011-11-26", "Author_Location": "San Jose, CA"}, {"Author": "j j.", "ReviewID": "DfIUt0Y1rNGUTGbiapTGzA", "Overall": "5.0", "Content": "This is one of my go-to restaurants when I crave for PRIME-RIB.  Yum yum good and their waitress, Rosanna, is very nice and always take care of her customers...like us.", "Date": "2014-04-03", "Author_Location": "Fremont, CA"}, {"Author": "Vicky T.", "ReviewID": "JrKEtw1u-0vlaW1fhmVUQg", "Overall": "3.0", "Content": "If you wonder where to go once you have hit cougar-dom on the puma stage of your life then this is the place.  After the YEE several SBCers wanted to continue the 50s theme by hanging out with folks who were a part of that time period...it was hilarious. the food Salad dressings are made from scratch... the bleu cheese was good the fried oysters were nommy and 6 came in an order lots of steak around the table lamb with mint jelly escargot???-- need to try that one next time..it is hard to find good snails the dessert amaretto gelato was delicious flan was also good the bathrooms nasty has hell... no matter if you are 21 or 51 I suppose the bathroom is a place where folks totally don't care.. it was disgusting the lounge escorts??? two drink minimum when you sit down in a chair?? shakira and lady gaga mixed with the beegees? YES! 40+ dropping it like its hawt.. YES! could we have been their grandchildren? YES! am I going back!! HELLZ YES! Saturday nights are poppin!!", "Date": "2011-04-11", "Author_Location": "Santa Cruz, CA"}, {"Author": "Peaches C.", "ReviewID": "AH8vmGtfLzobqKcIL2kfcw", "Overall": "4.0", "Content": "I've been wanting to try this place since 2008. Someone had told me that they have the best steaks in town. Since I get emails from sites like living social all the time I was able to purchase a deal for Three Flames :)When we arrived the vibe was unique, we kind of felt out of place. But the hostess was welcoming and greeted/seated us right away with our menus. While looking over the menu we were able to observe the restaurant and noticed there was only one waitress taking care of the whole restaurant with the help of a busboy. Also, they had a private room where they had a live band playing. I guess this area is for diners to enjoy once they were finished with their meal.Our waitress came and took our order. I ordered the prime rib and my fiance ordered the new york steak. Once our order was placed my fiance googled Three Flames and found out that they have been owned and operated with the same family for over 30 years. Just a little fact for you reviewers. It was nice to know that Three Flames was a nice family owned steak house. Overall our dishes were a-ok. My prime rib had good flavor but was overcooked yet raw near the bone. My fiances New York strip was overcooked as well. I was glad to finally be able to try this place and check it off my list of places to try. I personally would not dine here regularly but it is definitely a nice place for those looking to try a new place.", "Date": "2011-11-03", "Author_Location": "Sunnyvale, CA"}, {"Author": "S W.", "ReviewID": "9uGlTDZ5sjGNwX3kIT0UrA", "Overall": "5.0", "Content": "Three Flames restaurant is AMAZING to say the least!The staff is so friendly, so attentive to detail, and the events here are planned exactly the way it should be. We have been blown away with the service we have received every time we have dealt with them!! :)If you are planning an event and looking for a venue, STOP LOOKING - Here is your place. I understand that their banquet hall can accommodate parties of 200 or more..Food: EXCELLENT - Lunch or dinner.Service: GREAT, the family who owns this place is soo sweet..Events: Always a breeze.. Ask for Christina - She knows what she's doing when it comes to events.Venue: Clean, Organized & usually works with any themed event.HIGHLY RECOMMEND!! :)", "Date": "2012-11-15", "Author_Location": "Campbell, CA"}, {"Author": "Connie L.", "ReviewID": "Xe410ufzqOJnXoV1MkApnQ", "Overall": "2.0", "Content": "This was my second time eating here. The food here is overpriced. Especially when you're expecting a nice salad to go with the filet mignon that you just ordered. But I really just ended up getting a Safeway-mix salad with ranch thrown on it. With one tomato slice. And one cucumber slice. The salad ended up just swimming in the ranch, too. So in the end, it was more like drinking ranch dressing than eating salad. I asked for the filet mignon to be cooked medium, as well. I expected to get something a little more on the rare side, (it is a cut of beef after all), but ended up getting an overcooked, under-seasoned piece of meat that I could've made and screwed up at home. Supposedly they had some sort of private party in the other room at the same time, which made the service extremely slow. It took 20 minutes for the salad to arrive, and an additional 30 minutes for our entrees. Other personal gripes included this guy sitting at another table who wouldn't stop staring at us. We also happened to be the only non-White Caucasian family in the restaurant. Not sure if there's a correlation there, but I'm hoping that there wasn't. My entree fork was also dirty.All in all, overpriced and service is slow.", "Date": "2012-03-29", "Author_Location": "San Jose, CA"}, {"Author": "Amanda H.", "ReviewID": "0x1qhX7jY_eLXvCOAH9v8Q", "Overall": "2.0", "Content": "The only reason I am giving this place 2 stars is because the waiter we had is one of my favorites from another establishment we go to and he was extremely attentive and tried to make sure everything was ok.The place has a cheap banquet hall feeling and I should have realised that meant trouble from the get go but I was craving a steak. They claim to be a Steak house so you think they would know how to prepare a good steak... I ordered the rib-eye with with the salad. Considering the price the salad was a standard for a road house, a handful of bagged lettuce with some overly dried grated carrot and a slice to tomato on top. Luckily I asked for the dressing on the side, others at my table ended up with a small amount of salad swimming in a heap of dressing. The steak was one of the worst bits of meat I have ever had in my life. I ordered Medium Rare and I am really firm on this. I ended up with an over done bit of soggy steamed meat. You may wonder why I use the world soggy? Well they cover the plates similar to that of room service in hotels. My guess is my steak had been sitting under the warming lights steaming and cooking away for a good 15 minutes before it reached our table. I guess these beaten up cheap covers are supposed to give the place an over all feel of fine dining... it doesn't help.The waiter I know look at the meat and knew I wasn't happy. I asked him what were the chances that if they re-fire it would come back better... he just shook his head. He also mentioned it would most likely take another 30+ minutes for a refire. Since we waited almost an hour for this meal I didn't think it was worth waiting another half hour for steamy over cooked meat. Considering they were representing them selves as a steak house and fine dining experience I was very bummed and would not recommend this place. There are better steaks out there at a cheaper prices at well at well know chain. Overall extremely disappointing but we had a really happy puppy when I got home- rib eye steak for her dinner!", "Date": "2012-10-09", "Author_Location": "San Jose, CA"}, {"Author": "Taylor S.", "ReviewID": "aCHpM8NM5rX3tC9zgjGiPA", "Overall": "4.0", "Content": "Very good food! I wasn't sure what to expect after reading the other reviews about it being 'old' but I think they were referring more to the other patrons than the decor. The table behind me was talking about embalming and how they'd like to be 'prepared' over dinner! Who does that???? The food was good. My 2.5 year old was all about the appetizer bread, and the steamed veggies that came with my steak were fresh and crispy. The steak itself was cooked well.  The only complaint i have is that my salad was DROWNING in dressing. They must have used a full half cup of dressing on a small salad. It was a little too much and I couldn't eat most of it.. It was good dressing, though, but wow.", "Date": "2011-01-30", "Author_Location": "Alexandria, VA"}, {"Author": "Vy N.", "ReviewID": "4ZmIIhxsnW2eH-fp8eQ1LQ", "Overall": "2.0", "Content": "Banquet hall type feel. We got seated at half-circle booth, which was comfortable. A nice place to chit chat while eating your meal. New England Clam Chowder: This was pretty good; it came with our entrée (or you can choose a salad instead). Creamy, perfectly seasoned, and the dices of potatoes were cooked to the bite. Veal Special W/ Mashed Potatoes and Sauteed Vegetables (Carrots, Onions, and Zucchini):The veal was not special one bit. It was drenched with a sauce that looked and tasted like hollandaise. The veal claimed to be tender, but the meat felt very chewy and stiff, almost like I was eating sliced beef that is used in vegetable sautes. Don't they know that veal is very lean?! They surely overcooked it, if I had known, I would have requested them to cook it medium-rare. Since the dish costed $18, I figured they would know what to do. I only ate one piece and finished my mashed potatoes, which were made chunky, and the perfectly cooked vegetables. The side dishes had more flavor and tasted significantly better.Tiramisu:Moist and not too sweet. Pretty decent. It needs more of a liquor kick to it though.Peach Cobbler W/ a scoop of Vanilla Ice Cream:The waitress asked us if we wanted the cobbler warmed up, so I am not sure if that meant the cobbler was sitting in the fridge or on standby in the kitchen at room temperature. Nonetheless, the dough tasted very rich and buttery, probably more than it should because I think they microwaved the cobbler so the butter got a chance to soak back into the dough. It's a heavy dessert, especially if you're eating a late dinner. Patrons: Primarily elderly folks. Very nice atmosphere though and no one stares at you when you walk to your table. Service: Very attentive and kind. My water never reached the half-way mark. Tips:Save money if you want to try Three Flames with a Restaurant.com certificate worth $25 for $50 worth of food. The site often has deals selling certificates for $2 a pop and once you purchase your certificate, they never expire (at least in California).Verdict: 2.2 out of 5.0", "Date": "2012-03-01", "Author_Location": "Santa Clara, CA"}, {"Author": "Ena T.", "ReviewID": "Ut_QcbJM-8x8K0CRpL1fSg", "Overall": "5.0", "Content": "Excellent food looved da prime rib & steak!! Delicious!! Veery good service! We celebrated my Moms 60th birthday there and she loved it! The servers took very good care of us! Thank you thank you!", "Date": "2013-09-16", "Author_Location": "Santa Clara, CA"}, {"Author": "Timothy R.", "ReviewID": "kDInfmCYjSZdFO2u2qlxfg", "Overall": "4.0", "Content": "Very nice...Has a classy atmosphere, the type that lasts for generations.  The food was great. Prepared just how it was ordered and nice portions. And the staff was top notch. All the fixing for a great night out.", "Date": "2011-08-11", "Author_Location": "Ballston Spa, NY"}, {"Author": "Hank B.", "ReviewID": "Su7yb0hp9elcBx6oVf2qCg", "Overall": "3.0", "Content": "Three Flames is what it is.* It's not bad and the food is decent. The thing is, this is the sort of restaurant that your grandparents take you to. Everyone eventually reaches a point in their life where they have a choice- you can go to some expensive trendy downtown restaurant, or you can approach life with a \"Screw it- Carrows' has Prime Rib too\" attitude. Three Flames caters toward those with the latter sensibility. The food even comes out with a cover on the plate, which to my knowledge only goes on at restaurants that opened during or before the Carter Administration. I'd like to reiterate that it's not bad if that's what you're expecting. It's like when you go to an old relative's house and they haven't decorated since 1965. The place isn't Brady Bunch ridiculous, but the decor is definitely \"dated\" as they say on those fucking home renovation shows my girlfriend likes to watch.If you're a fan on Anthony Bourdain, you know that he talks about old school American restaurants that we had before the concept of haute cuisine and being a \"foodie\" entered the American lexicon- places where you might find ham steak with pineapple ring on the banquet menu. That's the sort of place Three Flames is. And for that, I love it- right down to the sweet old couple who were clearly regulars.*I promise to never use this phrase in a review ever again, but it seemed so apropos for this place.", "Date": "2009-03-09", "Author_Location": "Newport Beach, CA"}, {"Author": "Michael C.", "ReviewID": "8fT4IjQfj8lhRDkjbFm0xg", "Overall": "3.0", "Content": "Wow, this place screams old school, with emphasis on old.  While I don't mind rubbing elbows with boomers, it's a bit annoying when the food is underwhelming.  I'd expect near perfection on basic fare if the restaurant has been serving the same thing before I came on this earth in the 70's.  The person who made the reservation was a decades old regular, so our party of 5 was given a table in separate room from the main dining room for lunch.  It felt a bit odd to be segregated and we all agreed that it would be even weirder to close the partitions.  Apparently, the whole place was divided into at least 4 different rooms.  Also, the restrooms were placed outside the main entrance, so you had to go past the hostess stand.  Odd, but a good solution.I ordered up the tri-tip sandwich with a Diet Coke.  The sandwich itself was rich and tasty.  The big chunks of tri-tip made for adventurous chewing.  The Diet Coke was deplorable.  It was flat and had a funky after taste.  Plus, it was served in a tiny 8 ounce glass that was more suitable for cordials.  I got two sips and it was gone.  Refills weren't readily forthcoming as service moved as slow as the regulars.   We tabbed out at about $100 with tax and tip.  I wouldn't consider going back, but for the regulars I could see the appeal of going where people know your name.", "Date": "2010-06-12", "Author_Location": "Milpitas, CA"}, {"Author": "Theresa N.", "ReviewID": "fIep1w7HOHJOCtzqMxY-9g", "Overall": "4.0", "Content": "This place is old school and has been here forever. The typical crowd is blue hair, but the food is pretty good and I've never had a bad experience here. My family and I have been patrons of this establishment for 15+ years. They have a great bar area that has plenty of seating and includes a number of regulars. The dining area is cozy, but they also have a few rooms off to the side that can be reserved for bigger parties and special events. Some of their options that my family and I enjoy are: Pepper Steak (my Dad absolutely loves it here), chicken tortellini soup (YUMMY! Something about the cream vs. tortellini combo is perfect), various steak options (one standout is the rib eye or NY with gorgonzola cheese. The wait staff is really nice. One particular server actually keeps track of the regular's orders. He has a great memory and it's a refreshing personal touch. The warm table bread is also a nice touch. The Three Flames is part of this area's history and it could improve on some things, but the fact that the food is still consistently good and the decor is out of the 80's makes me feel at home. Parking sometimes sucks, so good luck with that. Overall, I love the Three Flames. It has character, flair and great food.", "Date": "2010-06-13", "Author_Location": "Campbell, CA"}, {"Author": "Jesse S.", "ReviewID": "W59ZLwwwb5-9EY5088Gy6A", "Overall": "4.0", "Content": "Overall this restaurant is good. Parking was a problem but I was able to find a space when someone left. The food was very good for the price. The only complaint is that I asked our waitress for a refill on my drink and never got one, and then she gave me the check but never came back to take my credit card.This place does seem to cater to the over-60 crowd, so I felt a little out of place here.", "Date": "2011-01-24", "Author_Location": "Alexandria, VA"}, {"Author": "Golda R.", "ReviewID": "BWbIRTiQ5fTQdWYCUZ-7MA", "Overall": "3.0", "Content": "Came here because my church group organized a nice dinner for all married couples.  We had a small room toward the back of the main dining space and it sat about 50-70 people (not sure the count).My husband had a salmon plate and I had chicken.  My plate wasn't terrible.  It wasn't a kick in your mouth awesome either.  I did try my husband's salmon and it was a little bland.  It definitely could've been seasoned more.We had to park in the street because they share a parking lot with other stores and apparently parking in the plaza was full.The main dining area for the restaurant looks huge.  It looks like a bigger banquet facility.  And maybe the regular menu is much better.", "Date": "2012-01-14", "Author_Location": "Sunnyvale, CA"}, {"Author": "mike t.", "ReviewID": "pjiA912ZxAgNrvtpvMGCJg", "Overall": "4.0", "Content": "This is a san jose secret!   it mainly caters to the older crowd in sj... but where else can you go and get bread with butter olive oil and vinegar to start... and cloth table cloth.....   the lunches are the best and i mainly would advise to go for lunch only--- as dinner prices jump up --- and when the one time we went for dinner there were a few errors ---- mainly the sol  --- it was barely cooked and not browned at all... and had little flavor ------ oh well focus on the lunch--  always good,,, great service,,,, and very reasonable prices for such a nice sit down lunch... just be ready--- as i was warned --- you may be the youngest one in there....! ! really try it for lunch ---- i go at least twice a month and i'm always happy--- Oh--- they also have the best garlic fries that i have ever tasted!", "Date": "2014-02-26", "Author_Location": "San Jose, CA"}, {"Author": "Esti S.", "ReviewID": "28wq3ylDReQi2AF-2xb_xA", "Overall": "3.0", "Content": "I had the chicken dish my hubby had a steak and we shared a calamari every thing was OK more or less except, my chicken breast was very thick and it tasted so plain (something was missing)!!!I like cakes and especially tiramisu-this was a total disappointment- it came out of a Costco box or smart and final-- its not fresh baked and they charged $6.25 for that, if they had charged $4.00 I could accept, with a glass of one wine with the tip it came to 75.00(Thanks, God my boss-gift).", "Date": "2009-01-07", "Author_Location": "San Jose, CA"}, {"Author": "san jose g.", "ReviewID": "KkxLAikwD_6pk0HbiRu_Xg", "Overall": "5.0", "Content": "Finally Finally Finally they brought back Uncle Dougie. Only on Thursday nights but its a start. Great selection of songs for karaoke. The food and service is always great now if they would only give him more nights. Great songs great sound system and you can bring your own discs. Gonna be there every night he is there.", "Date": "2014-02-19", "Author_Location": "San Jose, CA"}, {"Author": "Sara S.", "ReviewID": "yds6H8h8BfqclXMz4_86cQ", "Overall": "3.0", "Content": "I got a Groupon for Three Flames almost a year ago. I thought it would be nice for Mr Man and I to have our Anniversary dinner here seeing that ever since he got with me, he barely gets a chance to eat red meat. (what! 220lbs with prehypertension...you shouldnt be eating red meat anyway!)  Upon entering, I once again realized how honest and trustworthy my fellow yelpers are.  Everything was as described - old (but nice) decor, a bunch of Caucasian folks in wheelchairs and walkers with their families, and empty. It didn't deter me, just made me feel like it was a \"homely\" place.  I got the 6oz lobster tail with garlic mash and veggies on the side. Mr Man got the Gilroy Tbone?Steak?...whatever. some cow part. also with garlic mash and veggies. Both of us had soup with our entrees - I had the something fusili and he had the New England clam chowder.  Mr Man cleaned his plate nicely; adding that it was \"very garlic-y.\" My lobster tail was perfect - not rubbery and overcooked like some other lobster I've had. Mr Man also had a couple of glasses of a Cab; I can't remember the name but it had a very good, bold taste with hints of cherry and spices in it. DElish! =)Because I had the Groupon (I paid 20 for 40 worth), we ended up paying 40ish including tip.  Not bad.  We'd probably return another time on another special occasion.", "Date": "2010-12-28", "Author_Location": "San Francisco, CA"}, {"Author": "Robert S.", "ReviewID": "IsZNFLpeG7ITXBn6tV9OzQ", "Overall": "1.0", "Content": "My friend and I agreed this is the most depressing bar/restaurant in the south bay. Never again. It's not nice eating on the patio while the staff all smoke next to you.", "Date": "2013-08-09", "Author_Location": "San Jose, CA"}, {"Author": "Thomas K.", "ReviewID": "1O28mEvxCk9peYhGPRIPeg", "Overall": "4.0", "Content": "Woohoo!   We had a dinner meeting here Tuesday evening, and the food was excellent as usual!   Service is normally really good too, but they were short staffed that night.  Otherwise, great prime rib, filet mignon, lobster, garlic mashed potatoes, calamari, and on and on.   Prices are a little steep.  For Gourmands only!!! ;-)", "Date": "2012-03-22", "Author_Location": "San Jose, CA"}, {"Author": "Oscar S.", "ReviewID": "lxyQpmbd7XsYLPUZLSeXvQ", "Overall": "3.0", "Content": "Overall, I give a C+ grade. I ordered Fried Calamari, Fried Oyster, New York Peppered Steak, and Angel Hair. Everything was no good except I would give an A grade just for the sauce (or, seasoning) of the NY Peppered Steak. For details, please visit: foodpicky.com/?p=229Oscar", "Date": "2011-09-06", "Author_Location": "Cupertino, CA"}, {"Author": "Daniel H.", "ReviewID": "Yh93Nyf4Az4HxS_Jofv46Q", "Overall": "3.0", "Content": "My grandfather has been coming here for lunch for several years and occasionally I take him.  I've had several meals here and it's mostly hit or miss.  None of the entree's are awful but sometimes they are lackluster.  Today for instance, I had a Shrimp Tempura salad.  The salad consisted of mostly mixed greens and some Chinese cabbage with some tempura on top.  The tempura wasn't as crunchy as I like but it wasn't bad.  Salad was also \"not bad\".  Over-all, I've had better luck when ordering their pastas which have been exceptional at times.The service is always good, and I like how the waitress whose been serving my grandfather for years always treats him kind and knows his mannerisms.Overall, 3-star for mostly service and the occasional good meal.", "Date": "2012-06-06", "Author_Location": "San Jose, CA"}, {"Author": "Todd t.", "ReviewID": "EzPryuCRSRQxcUEiRowFGQ", "Overall": "5.0", "Content": "We had a 40th anniversary party for my in-laws at the Flames.  I'd love for you to know why I chose them.  First, I called and immediately got an answer as to the availability and costs.  Second, super friendly service with a promise to make everything perfect.  Third, refferred me to a great bakery and they made a replica of the exact wedding cake.. really!?!  Everything went as planned, no hidden fees.  They had the place set up just right.  The food was everything you needed and then some.  Drinks were VERY reasonable.  Please know that I went to 8 different places.. the big named ones too and received lots of \"hold ons..\" and \"well that depends...\"  The service at the Flames was exactly the way it should be.  And you have to remember, noone cares about the environment as much as you.. your guests will love this place.  Comfortable with all of the amenities.  Alex, Jose and Eduardo? were catering to each of every needs.  Couldn't ask for more!  todd", "Date": "2012-10-15", "Author_Location": "San Jose, CA"}, {"Author": "Anna V.", "ReviewID": "wToqR_LFdPg84js6FsroRA", "Overall": "2.0", "Content": "Three Flames is a nice venue  but there was nothing special about the food.  I had ordered the swordfish and it came with a side of spaghetti and soup (I had ordered chili).  It wasn't too keen at all on the swordfish - it really tasted like chicken to me and the sauce they had on top of it (garlic butter) was pretty horrible.  The sides that went along weren't that great either.  My sister did like her cioppino though but we both agreed that it wasn't worth the price nor was it anything special.", "Date": "2011-02-17", "Author_Location": "Milpitas, CA"}, {"Author": "Wayne P.", "ReviewID": "nvjSmKvRp_MQfJVeGca1fA", "Overall": "2.0", "Content": "This is a place for old people that have lost their taste buds years ago. The food is bland, the menu selections are poor, the decor is drab. It really is a very unremarkable place, almost generic. The service is okay and some of the staff is friendly. The cocktail lounge is average, nothing special. This place reminds me of the restaurants that you'll find in motels in the midwest. It is popular with blue haired ladies and AARP members that's for sure....", "Date": "2008-06-24", "Author_Location": "San Jose, CA"}, {"Author": "Beth F.", "ReviewID": "-aTnVazlFADw2bqVNIZ1Xg", "Overall": "2.0", "Content": "I was here for my grandparents' 60th wedding anniversary celebration, so my family was seated in the banquet room. We had a choice of salmon, steak, or chicken parmesan, and our meals were served with a fresh green salad beforehand. Let's start with the decor: burgundy, green, brown...dimly lit, and with a carpet that screamed 70s Vegas casino. I wondered why the carpet had not been incorporated into \"Fear and Loathing,\" I really did. As for the food, I actually enjoyed my salad with its acidic creamy Italian vinaigrette and crisp veggies. I had ordered the salmon plate as my entree, and the fish was definitely moist and filling. The accompanying steamed veggies were somewhat bland, but improved by some salt and pepper. I'm not going to comment on the rice, because it bore far too close of a TV dinner resemblance for me to really eat it. In any case, I was there for my family, and I appreciated the family members who worked so hard organizing this. I just wondered why they made one poor server do drinks AND serve all 30 of us. It seemed like they could have given him some help. Ah well. At least my grandparents were happy:)", "Date": "2008-10-12", "Author_Location": "San Jose, CA"}, {"Author": "Jason M.", "ReviewID": "nCAvOaeOp4Tg5WFePeypXg", "Overall": "3.0", "Content": "This used to be one of my favorite places for dinner. Three Flames offers an absolutely delicious pepper steak - a fairly large piece of New York steak with a layer of bacon pieces and peppercorn on top. Maybe I came on an off night, but the accompanying garlic mashed potatoes tasted like instant mash. Very bland and disappointing. The other downside is that during dinner time, the bar has a cover band playing 70's & 80's music. Most of the time, I do not mind, but for whatever reason it became annoying to carry on a conversation with the music blasting throughout the restaurant. In summary, pepper steak is great but ambiance and sides are blah.", "Date": "2009-01-26", "Author_Location": "Mountain View, CA"}, {"Author": "Desiree S.", "ReviewID": "SJ8MqM6RCinb3akTjHRk1w", "Overall": "2.0", "Content": "Service was great but food was not :(", "Date": "2012-05-25", "Author_Location": "San Jose, CA"}, {"Author": "Rob S.", "ReviewID": "LYYBYDGq4kPg8ntX-wREhQ", "Overall": "1.0", "Content": "I can't believe the good reviews here, on which I unfortunately relied prior to going to this place last night.  My wife and I had no problem with the \"oldster\" vibe and general \"Republican\" feel of this throwback to the late 1950s.  We enjoy \"classic,\" \"old-timey\" places provided that the food is edible.  The food here was just barely so, starting with a very generic crab cake appetizer.  The soup wasn't bad, but my prime rib was 60% fat and the remaining 40% \"meat\" tasted like water.  Virtually tasteless.  Same goes for the ultra-lumpy mashed potatoes and ultra-mushy steamed vegetables.  The primary flavoring used throughout all preparations seems to be H2O, which is to say no flavor at all.  Now this morning both my wife and I are having stomach cramps and you-know-what.  Where's the Kayopectate?  The fact that the dining room was virtually empty on a Sunday night at 6:00 p.m. should have been a red flag.  Do yourself a big favor and avoid this place.  It's just not worth the money.", "Date": "2008-06-23", "Author_Location": "San Jose, CA"}, {"Author": "Ling A.", "ReviewID": "DJKksB-TK6F5tNaoRbGlRg", "Overall": "5.0", "Content": "My hubby and I ordered Gilroy Rib Eye steak ($23) and Prime Rib ($21).  The portions were HUGE.  Ribeye steak was cooked crispy outside and juicy inside. It was very tasty.  The price is reasonable and service is good too.  The only thing I dislike is the ambiance too old fashioned.Updated ---------------6/20/08Went again.  The quality of steaks are consistent.  Can't stop going there for ribeye steaks.  Yummi~~~Sure the steaks are comparable or even better than many fancy steak houses. Thinking to try something else besides ribeye steak next time.", "Date": "2008-04-19", "Author_Location": "Sunnyvale, CA"}, {"Author": "Kathee S.", "ReviewID": "eu5Xg5liaCSGPvXDhqmLaA", "Overall": "2.0", "Content": "I took my son here for here is 20th birthday and because he wanted a nice steak. I had bought a Groupon, so we went. We both had steak and it was good, so no complaints there. The service was a little slow and the employees seemed so humdrum. The ambiance was awkward for us too,  I felt like we were the youngest people in the whole restaurant. This place definitely has a fan base of senior citizen clientele. Everything just felt real drab and my son felt the same way as well. I probably won't go back because of that. Not a very warm & inviting place.", "Date": "2011-03-22", "Author_Location": "San Jose, CA"}, {"Author": "Lisa N.", "ReviewID": "3aIPCU2o-Oc5MTXuHXDTgQ", "Overall": "2.0", "Content": "The decor is nice but the food is just ok. It doesn't fancy my appetite and there is nothing special. The food was brought out at an okay temperature, not warm, not hot, but it wasn't cold. The chicken and steak was okay but I wouldn't come here to have dinner again.", "Date": "2010-08-03", "Author_Location": "San Jose, CA"}, {"Author": "Spencer T.", "ReviewID": "gwpStd4Ks8vSWzMXBopgzQ", "Overall": "1.0", "Content": "If you're not a regular here, expect to be ignored. The highchair they supplied for our 9-month old was some antique, metal, rickety thing with no belts to hold him in, aka useless. Maybe this was their way of saying \"don't bring your damn kids to our restaurant\". I ordered their \"famous\" pepper steak, medium rare, and it came out well done. Server had an attitude when I brought it to her attention, but she did bring me a new one. (Luckily I am ok eating practically raw steak) You would think in a place whose \"famous\" dish is steak, they'd know how to cook a piece of meat to temp. My wife ordered the sea bass special, which she claimed was ok, but bland. When I tried it, I noticed that the sauce on it wreaked of foul cheese (feet) or something, and I'm not sure how she didn't notice. Anyway, we came here to use a restaurant.com gift certificate, and will probably not return.", "Date": "2013-09-19", "Author_Location": "San Jose, CA"}, {"Author": "Susan B.", "ReviewID": "nK6NtNN12rLNrtuchfmMfA", "Overall": "3.0", "Content": "I've only ever been here for Karaoke, and I hate that it closes at like... midnight. Otherwise, I quite like the atmosphere.", "Date": "2011-04-24", "Author_Location": "Burlingame, CA"}, {"Author": "Anya F.", "ReviewID": "N_lBKZHAWyChw7dJgjXGiQ", "Overall": "4.0", "Content": "The service is good. The food is good but much too heavy on the butter. The atmosphere is nice. The booths are comfortable. There was jazz playing that night. It was the perfect volume in the dining area. I imagine it would have been too loud in the bar. The two rooms are separated by a door. If significant other wanted to come here again, I'd be okay with it. But I'd rather just go to five guys...haha.", "Date": "2010-09-08", "Author_Location": "Palo Alto, CA"}, {"Author": "dexter p.", "ReviewID": "psoscE4rLMqp9bWmBtO8eQ", "Overall": "3.0", "Content": "The decoration is a bit outdated, but it has good ambiance. You can see that the cook has placed a lot of thought into the dishes, but the result is unsatisfactory. The new York steak with shallot/merlot sauce is kind of disappointing, the sauce was broken and wad separating. I wouldn't mind coming again, but u certainly won't recommend it to my friends.", "Date": "2011-08-18", "Author_Location": "San Jose, CA"}, {"Author": "kino k.", "ReviewID": "bdlc75igWOUpfQnJxoobjw", "Overall": "3.0", "Content": "Been here twice. the first time the service was good and food was good. So we decided to go for Valentines day dinner. well service was bad my steak was cooked well done when I asked for med-rare, wifes steak had no taiste she wanted med well got med,  waiter came back to check on us when we were done. took for ever to get our check. well I guess we will stick to slow nights if we go back.", "Date": "2012-02-19", "Author_Location": "Santa Clara, CA"}, {"Author": "Charla B.", "ReviewID": "oWvBuG9GSZHsVliCzdRKyQ", "Overall": "4.0", "Content": "Food was good.  Ask for Arturo as your bus boy.  Martini is excellent.", "Date": "2012-05-20", "Author_Location": "San Jose, CA"}, {"Author": "David S.", "ReviewID": "e9IwyK-rF_5FAwRMkDXwlg", "Overall": "3.0", "Content": "What can I say? I was disappointed. I came here with my family, expecting a nice, quiet, high quality dinner. This place is not awful, but definitely not high class at all, even though they're pretending to be. I think for the prices, they need to offer more refined service and better food.", "Date": "2012-08-09", "Author_Location": "Cupertino, CA"}, {"Author": "Hank T.", "ReviewID": "TYuLFfFEGJxlWF9PoKkjsA", "Overall": "4.0", "Content": "If you have blue hair and a walker, you'll fit right in here. The decor, while tasteful and fairly new, is a visit to small town America in the early fifties. There was a small combo that started playing at 7:30. They played Swing. The food is excellent. Steaks are thick, juicy and prepared just as you like them. I love the Gilroy Special, a Rib Eye with garlic all over it and garlic mashed potatoes. Sheer heaven. My wife had the Three Flames Special and pronounced it magnificent. I've eaten there for over forty years, through three owners and this one is the best. For terrific food, pleasant and prompt service and a trip in the time machine, you won't go wrong here.", "Date": "2011-05-19", "Author_Location": "San Jose, CA"}, {"Author": "Cam C.", "ReviewID": "A5wUqilAavE-fXtCyFBKfQ", "Overall": "5.0", "Content": "My family and I love this place.  My boyfriend and I come here a lot.  The food is always great and the staff is always friendly and helpful.  I had the lobster with a side of pasta and was more than satisfied. I'm sure I will be back soon.", "Date": "2011-09-05", "Author_Location": "San Jose, CA"}, {"Author": "Anthony W.", "ReviewID": "yxoKZZO9GoZ_Zz5Wxqx6Cg", "Overall": "3.0", "Content": "Visited the restaurant again in late February. The group of four were generally happy with the food. I had a tri-tip steak which was not as good a a typical \"house\" sirloin steak - a bit tough. Service was good and the atmosphere is pleasant.", "Date": "2009-03-08", "Author_Location": "Los Altos, CA"}, {"Author": "Alicia S.", "ReviewID": "e8OWcjOpegFBDW4eggO39Q", "Overall": "4.0", "Content": "My friends and I went for the first time last Saturday night the food was good the nachos were great very crispy chips like I like them. We stayed for the dancing in the bar area. The DJ and the music were great we had so much fun we danced all night. It was a little older crowd but that didn't stop them from dancing.", "Date": "2011-10-03", "Author_Location": "Fremont, CA"}, {"Author": "Sue M.", "ReviewID": "5wrFpP8ESCZYwKqhP5vcOQ", "Overall": "4.0", "Content": "4 STARS?!  FOR 3 FLAMES?!  Yes.  Exactly.  This is a place to go when you don't feel like cooking and you want a good meal at a fair price with friendly service and no pretentiousness.  Yes, the steaks are good, seafood seems fresh and flavorful and I love the wedge salad.  The have a dimly light bar with nightly entertainment if that is something you are looking for.  Probably one of the few places you can go to hear live music and dance that is not designed for singles in their 20's.  I have also been to a few banquets here and found them to be very nice.  The staff certainly has banquet serving down to an art.The wine list is lacking but they usually have a few decent glass selections that work for us.I think Jose, the owner has been working here since he was a younger man and ended up buying the place many years ago from the previous owner.  He has a definite sense of pride in his business and this always makes a positive difference.Try it.  I think you will like it.", "Date": "2011-11-29", "Author_Location": "San Jose, CA"}, {"Author": "Wendy W.", "ReviewID": "ZsT6-bxMeZXwyoXZ8M4JZQ", "Overall": "5.0", "Content": "Lobster tail and Prime rib. what good dish it was!!!", "Date": "2012-02-12", "Author_Location": "San Jose, CA"}, {"Author": "Alex M.", "ReviewID": "jkzm9FM9bvtQaGDN5eCynw", "Overall": "5.0", "Content": "First, I wanted to give 4 stars because service was a bit slow. But the food was soo good... That's more important for me. Prices are way below what I used to see in Palo Alto or Saratoga.Thank you! I''ll be back!", "Date": "2012-08-23", "Author_Location": "Campbell, CA"}, {"Author": "AJ I.", "ReviewID": "a7EQ3_HyHhMYW7EUi47-zg", "Overall": "4.0", "Content": "We had dinner at the restaurant. Pleasant atmosphere, enjoyed music as we ate. Friendly server/staff. FOOD WAS GOOD...My Prime Rib was delicious. Husbands steak excellent. will return", "Date": "2012-08-09", "Author_Location": "Aledo, IL"}, {"Author": "B. M.", "ReviewID": "rJGdTwFK_snHJuZTN1PRKg", "Overall": "2.0", "Content": "Our church group had a going away party at the Three Flames this week.  I have had and been to many special celebrations at this restaurant in the past and I can't think of one that was disappointing.  This one was awful.   We had Ricco for a server.  He was the most rude, condescending individual.  One of the much older ladies in the group was not happy with her steak, so called him over. She told him it was tough and didn't look like the others. He tried to tell her it was just like the other ones that had been served.  Unfortunately for him, I got the same terrible piece of meat that she did.  After the way he talked to her, I didn't care how I talked to him.  I told him that I got the same overdone, tough piece of meat that she did.  He asked if I wanted another also.  Since it took forever for her to get hers changed, I told him to put it in a to go box.  This morning I opened the box to put the meat in a container and when I saw it I even got more upset.  I don't care what he said about all the steaks being the same, he is sadly mistaken.  This piece of meat looked like they had cut it off a piece of tri-tip.  One end of the meat was 1/4 inch thick and the other end was 1 1/2 inches thick.  I sliced into the thicker side and it was way overdone and tough, so you can imagine what the other side was like.  I tossed it is the garbage can and came right to my computer. Like I said up front, this is so unlike the Three Flames.  Everyone is always so pleasant and eager  to please.  I felt like this waiter had somewhere to go and rushed the heck out of us to get out of there.  We brought a cake in and he took it in the back.  Not even the guest of honor ever saw the cake whole.  He was so eager to cut it, he never even brought it out to the room we were in.  If I ever  book a special function here again (and I probably will) the first thing I will request is that Ricco NOT be involved in it in any way.", "Date": "2013-06-07", "Author_Location": "San Jose, CA"}, {"Author": "Sherri R.", "ReviewID": "mFW7J6j8dDz4Mx4Ud2nxhQ", "Overall": "5.0", "Content": "We  love this place! I always get the rack of lamb, and it is prepared perfectly to my liking. We always request Annie she is the best waitress, and she is always on her mark. We also always have to stop into the bar and see Dave for a drink. He is are favorite bartender. We always choose it for special occasions.", "Date": "2013-05-19", "Author_Location": "Angels Camp, CA"}, {"Author": "steve p.", "ReviewID": "bE023WT67vrCEAwvkbHk-w", "Overall": "5.0", "Content": "The meal my family and I had last night was absolutely amazing. The Pepper Steak was perfect. My dads Prime Rib was perfect the mashed potatoes where perfect. My Mom and my Wife's Salmon was perfect  The steamed vegetables were perfect. When we received the bill we all knew we received a great Meal at a very attractive value. The service Jerry and Arturo was also fantastic.", "Date": "2013-04-13", "Author_Location": "San Jose, CA"}, {"Author": "Grace J.", "ReviewID": "J8KPkkh68LR0CDZHDR8ekw", "Overall": "4.0", "Content": "I've been to Three Flames  about 3 times and so far my experience has been good. Not the best but good. Lets first talk about atmosphere. As a mid-twenties Asian, I felt pretty out of place in this restaurant. I am not kidding when I say two out of three times my boyfriend and I were the only Asians in the restaurant. We were also the youngest. But it didn't give us a negative feeling especially when the food came out. I love red meat. So every time I've been there I've ordered varieties of steaks. But my favorite one was the New York Peppercorn Steak. It was cooked right with great bacon toppings. My boyfriend had the Prime Rib and it also tasted pretty good. The service was great. They were very courteous and prompt. The price were not on the cheap side, but not overly expensive either. Average cost of steak or Prime rib was around $25. For all three times we've visited there, we used the coupon we purchased from restaurant.com which took off $25. So it was very affordable. Three flames isn't a restaurant I would visit every month but I would definitely eat there again.", "Date": "2006-05-08", "Author_Location": "San Jose, CA"}, {"Author": "Ernie G.", "ReviewID": "pZ2qQ_Md-8kOqc96LjbZqg", "Overall": "2.0", "Content": "A pretty good restaurant...ocassionally.  The decor is OK...comfortable enough.  I've been here about 7 times and have been quite satisfied with whatever I ordered.  This last time was a little disappointing as the escargot which was supposed to be served in drawn butter came in a mixture of water and butter...not too appetizing; however, the Pepper Steaks we both order were fine.  Didn't order the baked potato again as I learned my lesson from previous times.   Their veggies are always perfect but wish they could find A VENDOR WHO CAN PROVIDE THEM WITH DECENT FRENCH BREAD!  Tempted to bring my own next time.  All-in-all, compared to Maggiano's Little Italy, I think Maggiano's has the edge...especially considering their waiters.", "Date": "2013-02-15", "Author_Location": "San Jose, CA"}, {"Author": "Damaris S.", "ReviewID": "Eu2t6NGyOX3bbawVIv8Euw", "Overall": "1.0", "Content": "Went for brunch on Easter Sunday to Three Flames Restaurant; My Easter Day was ruined.  I ordered Quiche Florentine.  When I took the first bite I found the Quiche was ice cold.  Was never placed anywhere to be reheated.  I gagged.  My stomach became upset.  They did apologize and offered to get my second choice.  I declined the offer and just drank some hot tea.  When it was time to leave and I received my tab, I found I got charged for the hot water!  To summarize, the food was terrible, (including what my kids ordered) the staff is courteous in a cold way, and customer stisfaction does not exist in their menu.  We were the second table to be seated after they opened the restaurant on Easter Sunday, if they weren't able to heat up a piece of food when the restaurant was still empty, I hate to think of what they do when (and if) they get busy!", "Date": "2008-03-25", "Author_Location": "San Jose, CA"}, {"Author": "Melanie A.", "ReviewID": "JIJfalT8tr5tdBfud7guHA", "Overall": "1.0", "Content": "Special occasion I ordered the lobster tail. It was as hard and dried out as a hockey puck. If we hadn't been with guests I would have sent it back and I'm sorry I didn't.", "Date": "2013-01-04", "Author_Location": "Los Gatos, CA"}, {"Author": "Rick L.", "ReviewID": "8xD1-I573WuVWPbZ3HBReg", "Overall": "1.0", "Content": "Not my favorite - often the food, when with groups, has been cold.  Lately it is not too cold, but overcooked.  The happy hour is actually pretty great though - this is the bar though.", "Date": "2012-06-05", "Author_Location": "San Jose, CA"}, {"Author": "joyce h.", "ReviewID": "DtGZOIj2iEzbeE3dwRl_4w", "Overall": "3.0", "Content": "Mistake: Didn't yelp this place before going there with our Groupon discount (pd. $20 for $40 value), but we'd been to the Flames on Winchester a bunch of times for casual meals after movies, so thought these were related (they are no longer related, but share the casino decor; however, 3 Flames has white tablecloths & napkins). Had NO problems with the food at 3 Flames. They brought precisely what we ordered, were attentive without being intrusive, and let us sit for more than 3.5 hrs in total, includ. dinner.Having said that: The \"sing-a-long\" (server said it is not karaoke) with Sally's piano-playing was a bit much.  Sally did a good job on the piano, but the volume of this from the bar was pretty overwhelming. It reminded us of going to the bar in the National Hotel in Jackson, CA in the 70s & 80s. Choice of songs: Great. Execution: Well, they were having a very good time in there. Volume: Overwhelming...I had the Flames Fish Grill (18.95), which could not have been better: salmon, tilapia, prawns. Even the \"mixed vegetables\" [usu. a joke in places like this] were not overcooked & really were fresh, mixed vegetables.  Starter salad or soup & large baked potatoes were properly cooked, potato not 'waved, very large, were included. Another in our party had a steak, of which we received no complaints; the third ordered baby beef liver (14.95) with bacon & grilled onions (yeah, I know...), said it tasted just like the same dish at the Winchester Flames, in other words, as you would expect such a dish to taste ...  Well, the bakery items sounded good, but we bypassed the tiramisu (& glad we did after reading the review above).  The bakery items at Flames, Winchester are out in a case, first thing you see when you walk in the door -- & servings are huge.  Again, said not to be connected with 3 Flames. All in all, if this is the kind of dining you want and the sing-a-long is not a bother, it's worth a trip. Almost everyone I've spoken with about this place mentions the steak, so possibly that's the safest route for red-meat-eaters. Another tip: check the site 3flamesrestaurant.com for schedules & menus.", "Date": "2010-03-05", "Author_Location": "Santa Cruz, CA"}, {"Author": "Karen T.", "ReviewID": "Ar9lNv5oHAOPDqFjnimtmg", "Overall": "1.0", "Content": "worst easter brunch ever....to begin, they opened unprepared and even though they called us to confirm our reservation, they couldnt find it anywhere and we had to wait. they advertised an omelot station and it didnt exist. they ran out of eggs benedict. they put out cheese blinzes without anything to accompany and pointed to maple syrup when asked for jam. even though it was a buffet and the beverage service was minimal, they charged an automatic 18% gratuity and did so on the cost plus tax. when we complained the floor supervisor said it was policy. we will never return for any meal", "Date": "2012-04-13", "Author_Location": "San Jose, CA"}], "RestaurantInfo": {"RestaurantID": "5Sp73Dv8PB3Dkzf1bSYW3Q", "Name": "Three Flames Restaurant", "Price": "$$", "RestaurantURL": "/biz/three-flames-restaurant-san-jose", "Longitude": " -121.9135924999999", "Address": "1547 Meridian AveSan Jose, CA 95125", "Latitude": " 37.296345799999997", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/7YgTKPGqilVF-x-5LkZZQg/90s.jpg"}}