{"Reviews": [{"Author": "Jon K.", "ReviewID": "7SVfdUe-PH-KRg3fS2yLOA", "Overall": "4.0", "Content": "I have been to Las Vegas Cuban a few times, but not yet written a review.  Dinner last night was probably the best meal I have had there.Started with chicken empanadas, which were huge, hot and awesome.  Served with a sort of a chimichurri sauce that was really good as well.My meal was the lechon asado, which was just outstanding.  The pork was moist and warm, just how it should be.Other than the interior being a bit dated and dark, the meal was great.  Service was attentive and friendly.It might not be Calle Ocho, but it is really good Cuban food.", "Date": "2014-07-05", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Mike K.", "ReviewID": "7mz6KDpwtrYv5Z6XtNbzRg", "Overall": "4.0", "Content": "After a long day, this little hole in the wall really hit the spot. I tried Ropa Vieja for the first time in my life and immediately became addicted. The Ropa Vieja here is very tasty, flavored with garlic and bay leaves. The complementary garlic bread also hit the spot very well. The plantains were also a nice touch and a highlight to the meal. Ambiance leaves a little to desire, also was a bit dark inside. However, the food is really what counts and this place knocks that ball out of the park. I just wish they could expand to North/Central Florida!", "Date": "2014-06-29", "Author_Location": "Jacksonville, FL"}, {"Author": "Gris S.", "ReviewID": "twk0ATGPCyVNn_mCPyuXSQ", "Overall": "2.0", "Content": "Mediocre food.First time in Ft. Lauderdale looking for good Cuban food, came across this rest. While searching on Yelp. The place was empty when we got there @ 7:30 pm, few tables occupied. Our waiter was nice but kept insisting we try the steak. Had the Charola with a little bit of everything. The fried yucca no flavor and the empanadas and tamal not good, too greasy. The black beans were missing something and the  maduros were bland. Sangria was watered down & expensive. I will not return to this place. Not a good experience on your first night out craving Cuban food.", "Date": "2014-06-17", "Author_Location": "Benicia, CA"}, {"Author": "Antonio M.", "ReviewID": "EG4AfM0gEnnGi4x6Z5w1Ug", "Overall": "1.0", "Content": "Worse cuban food i ever had and expect so much more being so close to miami. I got food poisoning later that night and in the morning.", "Date": "2014-07-13", "Author_Location": "Orlando, FL"}, {"Author": "Charmie P.", "ReviewID": "riHgnUljb_oLcz17ikgQVw", "Overall": "4.0", "Content": "Excellent food, consistent quality.  I can't speak to the service because I have never eaten at this location but I get plenty of take out from them and it's always been very good.Their rice is amazing, fluffy, fresh and garlicky.  My favorites include Churrasco, Pork chunks and the roast pork.  Their Tamales are also delicious, I usually get them as a side item ($3) so it's just served with onions on top, not the appetizer tamale ($6) which is served with pork on top.  Pretty good value, good food.", "Date": "2014-06-04", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Tyler S.", "ReviewID": "gzX35si-ulSAVa6rjuXNNA", "Overall": "2.0", "Content": "I'm far from a Cuban food expert but after watching \"Chef\" last night I was seriously jonesing for a Cuban sandwich. This place is right over the bridge from me so I thought I'd like to walk over and give it a try. The food was edible , I didn't order anything fancy but I was so underwhelmed. The Cuban sandwich needed to be more aggressively grilled and the meat on the inside seemed bland. The other thing that I was so excited for was some yucca fritta. I love the creamy cilantro garlic sauce. They just have the basic garlic oily thing. Fail. I tried my friends tostones, kind of tough and same sauce. Waiting to hear back from my yelp talk on a good place to go near me. Till then I'll skip this place unless it's an emergency.", "Date": "2014-06-03", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Sam K.", "ReviewID": "Wmofh_c9k6LdXgbaor_2Yw", "Overall": "2.0", "Content": "My wife is Cuban so I'm not a typical tourist eating here. It just sucked. The portions were tiny, the food average at best. I had the fried pork chunks, all I got was 3 small pieces. My wife got the breaded steak. Just a tiny portion of onions on top and flavorless breading. I love Yelp, but reviewers got this one wrong. Too many options in sofla to go here", "Date": "2014-06-27", "Author_Location": "Alpharetta, GA"}, {"Author": "Brad K.", "ReviewID": "Cs7KtLDL8ou7nJxitOpeIg", "Overall": "5.0", "Content": "Stopping for Cuban food while in Miami area on vacation is a must, right?We decided that Las Vegas Cuban Cuisine would be the place, based on reviews.  Skeptical of the name we arrived at a small restaurant in a strip mall on a busy street.The layout of this place was similar to a small mom and pop lunch place.  The miral on the wall matched the logo on the menu.  I ordered the Cuban Sandwich and my friend ordered some pork dish.  The server was extremely polite and attentive.  The food was incredible.  The cuban sandwich was out of this world and they used a different sauce than mustard which I'm a huge fan of.The prices were cheap too only about $8 for an \"entree\".  We both agreed we'd have happily paid $20 each for our meal.  Glad I made this our Cuban food stop, and I would highly recommend you do the same.", "Date": "2014-04-30", "Author_Location": "Milwaukee, WI"}, {"Author": "Rose G.", "ReviewID": "pYgEDCVQnW-asYj5Xg9wBA", "Overall": "5.0", "Content": "So I was in town vacationing with family First I went to the Havana 19something on lincoln street and I didn't love it .... I was disappointed with service and all. Las Vegas Cuisine is a bit outdated in their looks like they could use a revamp of their logo, menu and overall restaurant decor but the food was PHENOMENAL! I feel like they will double sales if they had someone that is a good company identity erson like a graphic designer re-do their restaurant and that place would be packed it took me a few days to go in just because the signed looked outdated for me so i went there as a last resort i wish i had not wasted time driving all over the place looking for cuban food when my girlfriends apartment is literally walking distance from las vegas cuban cuisine. will go to the one in vegas next time I am in vegas.", "Date": "2014-04-30", "Author_Location": "Ontario, CA"}, {"Author": "Tina S.", "ReviewID": "clOoCoqVxDfwrFu-zh0xlQ", "Overall": "4.0", "Content": "We came here based on the yelp reviews.  Our bill was around $58 (after tax, before gratuity). What did we get for our money? Two orders of the Las Vegas combination which came with pork, chicken, beef, plantains, rice and black beans.  Cuban food isn't spicy but did taste very salty.  The pork was probably the best meat out of three we tried and our least favorite was the chicken- it tasted dry. The beef was a bit tough and dry as well.  I did like the addition of plantains, and the rice was light and fluffy.  What we liked best though were the ground beef empanadas- they tasted fresh and not out of the freezer.  The homemade lemonade was pretty good, but the bread served before your food was okay at best.  I don't know why one yelper was raving about it because it tasted pretty standard.  Flan was your average Latin restaurant flan but their cafe con leche was delicious and strong.  Service was prompt, and friendly.  Our waiter checked on us often, and our water glass was always refilled.Restaurant was clean and spacious on the inside, with huge painted murals of Cuba over their walls.  Overall, our experience was a good one and we didn't feel like we wasted our money coming here. We left very full and happy.", "Date": "2014-03-26", "Author_Location": "Rancho Cucamonga, CA"}, {"Author": "Danny D.", "ReviewID": "YZT99LrA218D39Qe1DN2_Q", "Overall": "4.0", "Content": "My girlfriend and I shared the Paella and Sandwich Cubano. It was good but not the best. I also had a cup of white bean soup very delicious.", "Date": "2014-05-18", "Author_Location": "Los Angeles, CA"}, {"Author": "Emma D.", "ReviewID": "yM-b_8l4ucNPNDqky6g9CQ", "Overall": "3.0", "Content": "Im not a critical person , i always try to see the positive in things . The FOOD  did not Impress me at all maybe because i Know How to Cook cuban (like) food & honestly i Gave it 3 stars because it was in a nice area of town (oakland after US-1 & they had overall good service. BUT their frijoles  , arroz , fish fillet was so dull in taste. I think they \"( dulled down the flavor because of their area) idk ... I really don't lol. Good prices ..(ish ) definite service & nice area but i could get better food at LA GRANJA . Cuban food should not be las vegas style it should be CUBANO' . Maybe you'll order something better then I .", "Date": "2014-05-01", "Author_Location": "Lauderhill, FL"}, {"Author": "Chavon W.", "ReviewID": "5iMsYJm084Q_4Gtcm2nm_w", "Overall": "4.0", "Content": "Great food! Ropa vieja is so on point. Empanadas and Papas Rellenas were amazing.Service wasn't the best, but the food made up for any little issues.Prices were great!Definitely check it out if you're in that area. I was on vacation and was not disappointed my first night in South FL.", "Date": "2014-01-18", "Author_Location": "West Orange, NJ"}, {"Author": "Jessica D.", "ReviewID": "ltOsN8V27LrMRFPPWmSAHQ", "Overall": "5.0", "Content": "We used to order lunch take out from here at their plantation location. This is how I was introduced to las vegas. Everyone ordered the same thing, chicken chunks with toastones. Omg, this is to die for, so good!!!! This is the only thing I have tried at this restaurant but it's so good I don't want to try anything else.I now live in the margate/coral springs area so there's no las vegas by me. (So sad!!) Maybe one day soon I'll venture out to the oakland park location for take out. If you haven't tried las vegas go NOW!!!!", "Date": "2014-02-07", "Author_Location": "Coral Springs, FL"}, {"Author": "Alicia P.", "ReviewID": "POSFgBd0bmu2hum3w8-p3g", "Overall": "4.0", "Content": "Good effing lord. The bread. If for no other reason, go for the bread. The BEST Cuban bread I have ever put in my mouth. And trust me when I say that I take every available opportunity to put Cuban bread in my mouth.So good. So. amazingly. awesomely, good.", "Date": "2013-12-02", "Author_Location": "Altamonte Springs, FL"}, {"Author": "Allen B.", "ReviewID": "fOOHCT-SeJTLOJI8jTThYQ", "Overall": "4.0", "Content": "Oh great!I have had both the beef and the pork chunks here they are both great. This is a great place to be in south FL the prices are great, the service is great and not having to speak spanish is great. I can speak spanish but refuse to while I am in the US I will while in PR, but this place is just great all the way around. I can't wait to try more.", "Date": "2013-12-10", "Author_Location": "Dania, FL"}, {"Author": "Guy M.", "ReviewID": "VsQ2JdNQKXOKVi4ZCJsN_w", "Overall": "5.0", "Content": "Food here is really good and the service is superb!  From the second I walked in I felt welcomed. The quality of the food is extremely high and for the price you pay it's not bad at all. The location is also perfect you can grab a bite to eat than hit up the beach (which is walking distance from the restaurant) and have a great time doing so.", "Date": "2013-11-24", "Author_Location": "Miami, FL"}, {"Author": "J D.", "ReviewID": "-G-Z750e8VL7DUP7x0fyzw", "Overall": "4.0", "Content": "The location is a little weird. I hate the plantain appetizer, which was ok. The cafe con leche and Cuban sandwich were out of this world. I will definitely come back for more.", "Date": "2014-05-25", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Kimberly H.", "ReviewID": "sf6KMIZmjDt4Le7eDGHJNw", "Overall": "4.0", "Content": "Came here with my family for lunch after looking at the specials on their website. We usually frequent this place when we come down to visit Florida. The restaurant was not that busy around 2pm and were seated immediately. Server was friendly and took our orders. I ordered the ropa vieja lunch special which includes rice, black beans, and fried plantains. Everyday there are different specials for lunch. I also  had a cafe con leche which was made perfectly. I think ordering an appetizer in addition to the main course would be too much food. They are very generous with their portions and leave you feeling stuffed. The ropa vieja was tasty and had a lot of flavor. The black beans did not taste as if they were just heated up from a can and the fried plantains had just enough sweetness to finish off your palate. Parking tip: if you park on the left hand side there are quarter meters but if you wait for a spot to open up on the right hand side there are none", "Date": "2013-08-07", "Author_Location": "Bayside, NY"}, {"Author": "Steve C.", "ReviewID": "UB0mbQHMgHnsEWn8aU4cSQ", "Overall": "5.0", "Content": "We had a party of nine on a busy Friday night and the restaurant managed to accommodate us. The place was very busy and yet we had excellent service and fantastic food. You can really tell that this is a family owned and operated establishment as everyone always had a smile and was quick to help out any overburdened waitstaff. We all agreed we would definitely return to this restaurant.", "Date": "2014-03-12", "Author_Location": "Houston, TX"}, {"Author": "Louis B.", "ReviewID": "g4kcDAlFltPo9QltI08Fbw", "Overall": "4.0", "Content": "Delightful place minutes from the beachfront.  Awesome ambiance despite the strip-mall location, but the service, the clientele, the decor and most importantly, the food...  Oooohhhh the food.  Not Cuban infusion but genuine Cuban.  The place serves both take out and sit-in customers with a smile.  Their portions are enough for a small platoon; we ordered the masitas de puerco and a zarzuela de mariscos al ajillo (mixed seafood in garlic sauce) that came with the ubiquitous rice and black beans and fried ripe plantains.  We did add a plate of tostones and a yuca frita.  We ate out of that for two solid days, quite amply.Great restaurant.  Period.", "Date": "2013-05-17", "Author_Location": "Rose Valley, PA"}, {"Author": "Rob T.", "ReviewID": "arumGaCs6HxW4gRbg_PNDQ", "Overall": "4.0", "Content": "Very nice Cuban menu. Very nice service, And not out of bounds pricings.I had the seafood 'special', wife had skirt steak smothered, I forgot what my Dad had because all I remember is his empty plate and step-mom had special request diet and they delivered.I'd go back and if I lived in the area would be a regular.", "Date": "2013-09-17", "Author_Location": "Cincinnati, OH"}, {"Author": "Danielle R.", "ReviewID": "8wH9cTHj1rRnhcdzwyyLGA", "Overall": "3.0", "Content": "Not bad....lunch menu is limited to like 5 items that rotate based on the day of the week.  Was greeted and sat promptly, got watered just as promptly, and got 3 pieces of buttered Cuban bread to start.  Keep in mind that I also lived in Vegas for 2 years, so Cuban (originally being from South Florida) and Las Vegas have a special place in my heart. I got the pollo ala plancha, and it doesn't even do justice to the one served at La Bamba.  Chicken was pounded out very flat and cooked just fine, but had no seasoning on it whatsoever.  It did have some cooked onions and then a couple rings of uncooked unions on top (figured they were all supposed to be cooked), black beans and rice were very good, and the 3 plantains they gave me were tasty but very dry. Meal was priced at $7.95 with tip and tax {just drinking water} you can do $10 even and call it a day.  I did take about 1/3 of my meal home to eat later.  Glanced over their dinner menu which was extensive BUT was seriously expensive for Cuban food, so I wouldn't go for dinner at all. It didn't knock my socks off and to be honest if I'm really craving chicken, black beans and rice, I think I might head to Pollo Tropical before I go back here. So will I go back-probably not Did this place scratch my itch- sort of", "Date": "2013-04-10", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Scott M.", "ReviewID": "G2ipBJCgisTisUua5CmqNg", "Overall": "1.0", "Content": "Maybe because it was a Thursday night, but my choice (a grilled pork sandwich)was bad, bad, bad.  It was burned, dried out and last night's leftover.Atmosphere        70       Clean and okay storefront.  It passes.Service                 70       Could not care less.Food                     65       Just about eatable.Value                    70       The price is always right, but is it worth it?Oh, forgot to say that the soup challenged Progresso. Go some where else.", "Date": "2013-05-22", "Author_Location": "Palm Harbor, FL"}, {"Author": "Jennifer C P.", "ReviewID": "JV4HUVFD7FEmfwFIa59mhw", "Overall": "2.0", "Content": "The Bay Area's very own Cha Cha Cha Cuba has spoiled me. I visited this mom and pop with high hopes of a wonderful Cuban meal just like I have at home. Wrong. The yellow rice was instant - like Uncle Bens, avoid ordering that. The pork and the beef were embarrassingly dry. Too dry to eat. The meat in the empanadas was way too salty. We ordered so much food...and really didn't eat it. We wound up leaving to have lunch poolside at our hotel. Hey, Ritz Carlton chefs know how to prepare food no matter what city you are in. We had to eat there because we didn't do it here. The highlights for this mom and pop that earned them two stars? The Tres Leches Cake was delicious! The cuban cafe con leche - MMMMM. The Sangria was delightful! Does that justfy the price we spent on food we didn't eat? No. I cannot in good conscience recommend. I've had better. . . in my hometown. . . the Bay Are . . .San Francisco, one of the culinary capitals of the world.", "Date": "2013-01-19", "Author_Location": "San Francisco, CA"}, {"Author": "Drew D.", "ReviewID": "quvL-H3q63j6b8tsVbUBdg", "Overall": "4.0", "Content": "I was pleasantly surprised by this place! There are several locations around South Florida so I never gave it much of a thought- I don't love to frequent \"chain\" restaurants. However, we dined with another couple who made the suggestion and I'm glad they did! Their Cuban food seemed pretty authentic, and it was full of flavor.I had the Ropa Vieja (A Cuban standard) and it was very tasty. Served with rice, beans and plantains, everything was very delicious. I nearly cleared my plate- and I thoroughly enjoyed the plantains, which is rare for me because they aren't usually my favorite. My husband ordered the full snapper, which came to $15 (a great price for an entire fish in my opinion). He enjoyed the snapper, although it was a tad bit salty for his liking. Overall, the food is very affordable and served up in huge portions. If you go hungry, you most definitely won't leave hungry!", "Date": "2013-04-28", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Homayra J.", "ReviewID": "vuWIqlxeZQj09mVhbU-mGg", "Overall": "4.0", "Content": "Food is great, staff are a little chilly but not everyone has a warm personality.  The restaurant is open and well laid out so you dont feel like you are on top of each other.  The prices are not low but the foodnis worth the cost.  We come here every time we are in the Ft. Lauderdale area and will continue to return.", "Date": "2014-02-02", "Author_Location": "Springfield, VA"}, {"Author": "Oneil W.", "ReviewID": "vFoDVf96tWpNVMBbWtyGYA", "Overall": "4.0", "Content": "Las Vegas Cuban Cuisine is a great restaurant for reasonably priced Cuban cuisine in a charming and intimate atmosphere. The wait staff is very attentive and service is quick. Entrees run around $10-$20 and come with white rice, black beans and plantains. Really enjoyed my 1st visit there.", "Date": "2014-01-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Charlie V.", "ReviewID": "SGtBVYIXt9qM7LAAjS0nRQ", "Overall": "4.0", "Content": "Delicious food, not too noisy, priced right and close to the action...tough to beat when you're in the mood for good Cuban.", "Date": "2013-12-13", "Author_Location": "Sunrise, FL"}, {"Author": "Tom M.", "ReviewID": "bPsRqVnDaRmXcgQoCQm4nQ", "Overall": "4.0", "Content": "Good food and friendly service, reasonable prices. Went because they had a free shuttle from the Fairfield Inn. Everything we had was freshly prepared and good. Not a fancy place. Black beans especially good. Fairly large menu. We had been traveling all day and were hungry. The waitress pointed out that the lunch specials were still available. We were there about 5pm.  Saved us about $10. Portions looked the same as those who were having dinner as we were finishing.", "Date": "2014-01-28", "Author_Location": "Livingston, NJ"}, {"Author": "Tiffany N.", "ReviewID": "WQBlIHqgyxrscvgO35kSww", "Overall": "4.0", "Content": "I chose to eat dinner here for two reasons.1. There's no place like South Florida for Cuban cuisine so when I'm home I have to eat at a Cuban restaurant at least once.2. It was close to my hotel and had good reviews.I guess technically that's three reasons, but my review, my rules.I really enjoyed my meal here - I had Steak Churrasco (skirt steak served with chimichurri sauce), white rice, black beans and sweet plantains. The plantains were my favorite part and as always I wished there were more than 3. I'm guessing I could've ordered a side of them, but I didn't. The steak was cooked perfectly and was quite tender. The black beans came on the side of the rice in a soup cup and were perfect. I was also quite a fan of the sangria they serve. And they were really quite nice about taking a large party in (10 of us) on short notice and serving a group well. The only downside is that I think it seemed a little pricier than many places you could get equal quality of food at. But, that could easily be because of ambiance and service style.Oh yes, and they were out of tres leches cake which was sad. But, our experience here did meet my needs for my Cuban food fix and that makes me a fan.", "Date": "2012-07-21", "Author_Location": "Denver, CO"}, {"Author": "Rick F.", "ReviewID": "woyI_2uQD5_eJvJbxhIzaA", "Overall": "4.0", "Content": "I need to get my Cuban food fix, looked up a few places on YELP! Sunday afternoon open at 2:00pm in the afternoon, looking for good reviews from fellow Elites. YELP and the ELITES did not let me down. The food was amazing!Family owned, many families in the place when we arrived! White Bean Soup and Tamale appetizers were amazing! I wanted to try a sampler of the best Cuba has to offer the server recommended the pork, chicken and beef with rice & bean and plantains. Everything was homemade and perfect!", "Date": "2011-07-04", "Author_Location": "Chicago, IL"}, {"Author": "Catherine H.", "ReviewID": "7VJJJTULlD1fEaXzOgWUUw", "Overall": "3.0", "Content": "Not bad, although I much prefer Havana in WPB (yelp.com/biz/havana-rest…).Chicken chunks-- really good (seriously, chicken chunks are always good, but these were particularly tasty)Cubano-- OK, but the bread was soggy and not pressed wellPicadillo-- decent, but seasoning could have been betterBlack beans-- dense and tastyMariquitas-- good, thankfully.Decor-- some lackluster mural scenes and some really great old family photosService-- a little hovering/pushy but otherwise reasonable.For some reason I just wasn't that in to Las Vegas. I can't put my finger on it-- the food was reasonable, as was the service. And I suppose that's the point-- it was reasonable, but didn't blow me away. And I love Cuban food way too much to spend my time eating places that don't blow me away.", "Date": "2009-06-17", "Author_Location": "Oakland, CA"}, {"Author": "Marqus R.", "ReviewID": "XfedmfJOCq_2QH5IlTOEFg", "Overall": "3.0", "Content": "First off, Las Vegas refers to the owner's family name, not a \"Las Vegas\" rendition or style of Cuban cooking. If it did, I can't even begin to image what a horrid combination of ingredients that would end up being.The family has several restaurants, all serving rather decent meals, with good service at very reasonable prices. There is nothing extra special about any Las Vegas Cuban Cuisine Restaurant, but they were created for any purpose other than to offer basic Cuban food, good polite service and at reasonable prices. So, what they do and what the restaurant is meant to be is exactly what you get. It's clean, well run, and has an extensive menu, but again there is nothing top end or exotic in their food line up. It's basic. There is generally ample parking out front but with some spaces metered and others not. You'll find it easy to use the unmetered places. They generally try to divide the seating into couples and singles with the larger group or families seated separately. If you are single or a couple, you might be wise to shy away from being anywhere near the family location as the typical family talk here, or for that matter in any Cuban restaurant may seem excessive if you don't know what it is all about. If you do, you'll love the ambiance of the family gossip....at least I get a kick out of it.", "Date": "2011-07-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "George N.", "ReviewID": "juFh1quKqxeBmP-jZE2XrQ", "Overall": "4.0", "Content": "What can be better than a platter of onion covered slow roasted pork, marinated chicken, and saucy beef accompanied by another platter of rice, plantains and beans?  Not much!  And Las Vegas Cuban is a place to enjoy just such a robust assemblage of feasty eats. \rI think there might be something about eating Cuban food with the accompanying humidity of the Atlantic seashore that just makes it tastier than in other parts of the country.  (I'm also beginning to wonder if I have a humidity/food fixation of some sort - see my last review of Country BBQ in NC, which also waxes philosophic on the merits of moist atmosphere and good BBQ.)  It's almost as if the enjoyment of the Cuban food is inversely proportional to the humidity outside.  Luckily, this restaurant was air conditioned so I got the best of all worlds: Great food, refuge from the waxy heat, and a friendly and attentive wait-dude.", "Date": "2006-08-30", "Author_Location": "San Francisco, CA"}, {"Author": "Paul F.", "ReviewID": "Cgm0dOMbSvFsjAJL1zdmCg", "Overall": "5.0", "Content": "I am a big fan of the Cubano sandwich but living on the west coast, I have little to no opportunity to enjoy one.  Yesterday I was in Ft. Lauderdale with my family at the end of a cruise vacation and had to visit a nearby UPS store to mail home some of the souveniers from our trip.  While there, I asked for a recommendation to a restaurant that could make a great Cubano sandwich and luckily a customer in the store pointed me to the Las Vegas at 95 & Stirling.The location is great and there was plenty of parking, some under shade trees.  The waitress on duty at about noon yesterday (alas, I did not get her name) was extremely friendly and attentive, which is a tall order after we just spent nearly 2 weeks being served hand and foot on a cruise ship.  My son and his wife had never had Cuban food and aren't adventurous diners but they enjoyed this tremendously.  We started with mariquitas with mojo sauce for an appetizer, which were fantastic.  My DIL ended up asking for more mojo sauce for her steak sandwich, she loved it that much.  The portion sizes were huge but dessert was a must so we split a piece of Tres Leches cake.  How many ways can I say YUMMMMMMMMMMMMM??!!!BTW, the prices are extremely reasonable!If you are in town, please stop and visit this place.  I may plan some random trips from San Francisco to Fort Lauderdale now and then because I am thoroughly hooked!", "Date": "2008-11-11", "Author_Location": "Oklahoma City, OK"}, {"Author": "Rocky S.", "ReviewID": "uNZCSO1qH76c45bw46Bqeg", "Overall": "4.0", "Content": "My favorite Cuban restaurant in Florida. That's a pretty big statement considering how many Cuban restaurants there are. Always had very friendly wait staff and the food was consistently awesome.Yum!", "Date": "2008-11-02", "Author_Location": "San Francisco, CA"}, {"Author": "Chris H.", "ReviewID": "eTy511cp181P0TgWZuUazA", "Overall": "4.0", "Content": "I love this place for lunch. Inexpensive, authentic, and good.They have lunch specials every day. Try the roast pork, and mix it up with the black beans and rice. Delicious!", "Date": "2009-10-21", "Author_Location": "Boca Raton, FL"}, {"Author": "Iris N.", "ReviewID": "pqg2KyBNjUJmURL3wiXt2g", "Overall": "2.0", "Content": "Really??? This can not be considered good cuban. I just can not believe it. We sampled a variety of things on the menu and found it to all taste anything but fresh. My BF remarked that the chips and salsa was the best part to the meal. Sad.Havana's Cuban Cuisine is good if you want a meal (and worth the extra money), or La Antioquenita Bakery and Restaurant for Sandwiches or Colombian Empanadas.", "Date": "2011-12-20", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Far I.", "ReviewID": "hITVBJy4V3wn9AJ3qBjtew", "Overall": "4.0", "Content": "Prior to today, I was never a fan of Cuban cuisine.  That changed when I tasted the food at Las Vegas Cuban Cuisine.  We had the fried plantains with garlic sauce, & beef empanadas for appetizers.  For the main course I had the shrimp cooked in a spicy creole sauce, which came with delicious plantains, rice & black beans.  Service was good & I'll definitely be going back there!", "Date": "2013-10-15", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Joseph W.", "ReviewID": "uuUsUTanA930Y9_qiiQlTw", "Overall": "4.0", "Content": "Super good Cuban food for lunch or dinner. I have been going to location closet to Miami airport, but found a 2nd location in Ft Lauderdale by beach. Def recommend if you enjoy Cuban food!", "Date": "2013-10-04", "Author_Location": "Manhattan, NY"}, {"Author": "Linh L.", "ReviewID": "kvyedq087gchj88CQTdOKw", "Overall": "5.0", "Content": "YUMMYYYY! I tried the different coffees, the shredded chicken, shredded beef, black beans over rice, fries, and my skirt steak... That was delicious. The portions are really big, so feel free to share. Everything was so good.  I would definitely come back here again.", "Date": "2013-08-17", "Author_Location": "Chicago, IL"}, {"Author": "Kene B.", "ReviewID": "7F3k20QZmnloe7LBRYY3IA", "Overall": "5.0", "Content": "I had the lechon asado and it was to die for. The flavor was great and it was served with white rice and black beans. I went with two friends who had the Cuban sandwich and where very pleased. The price was right on too. I would definitely go back.", "Date": "2013-11-25", "Author_Location": "New Orleans, LA"}, {"Author": "Lee F.", "ReviewID": "TkFU7CvmSP5UcxfY9weqbQ", "Overall": "4.0", "Content": "Order the #12 trio. The food was very good. Service was excellent. The place is Clean with a nice comfortable atmosphere.", "Date": "2013-10-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "G g.", "ReviewID": "Qlli8nAcaN_Pz0gl3J6ZwA", "Overall": "4.0", "Content": "Nice atmosphere with murals on the walls and a nice display half-wall with bottles of wine running down the center.Clean and well maintained. Service ranges from good to great depending on your server, but is always professional and friendly. They have large portions that are delicious and reasonably priced. The food is always fresh, well prepared and made correctly. Most importantly it tastes great.From the Empinadas to the Milanese to the Pollo and Lechon everything I have tried here has been delicious. The Frijoles Negros are great as it the rice.If you are hankering for some great Cuban cuisine this is the place to go in Fort Lauderdale.", "Date": "2012-06-23", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "ER S.", "ReviewID": "WXJ7sw-KL8jzPlV-9xbMuA", "Overall": "2.0", "Content": "The service knocks this place down two stars, I think.We ate here for lunch.  When we came in, the waiter cleared the extra place settings... including removing the plate for our daughter.  She's five, not two, sir, she won't break the plate.  I asked him to put it back.We ordered lunch and the kid's menu is a bit sad, and the waiter gave me a really hard time about the sides (certain sides were only available with certain entrees... not sure why?).  My husband and I shared a cuban and a medianoche sandwich.  They came with tostones (oh, sorry, mr. rude waiter, mariquitas) and a yummy onion mojo.  I thought the sandwiches were really good, although my husband thought they were a little too overmoist (kept sliding apart when you took a bite).So... the food was generally good, but given the service we received I would not go back.", "Date": "2009-03-11", "Author_Location": "Chicago, IL"}, {"Author": "Jason P.", "ReviewID": "3Iy4T_stZOd1kUBeQo0RrQ", "Overall": "4.0", "Content": "Best cuban we have had in Florida.The bannana chips were quite good as was the  we ate at at least a dozen of what we were told were the best Cuban places, but this was our fav.", "Date": "2010-09-25", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Nina C.", "ReviewID": "sxWklkeFQ9M0oJ-E0FtmAQ", "Overall": "3.0", "Content": "I was very pleasantly surprised the food was pretty good! The service it could be better! It was very clean and so was the restroom!! The owner was kinda snotty! BUT THE FRIED ICE CREAMS WAS OUTSTANDING!!! So basically my review is just for that! Lol! It was delish!! It came out seriously still frying on the skillet!!", "Date": "2013-05-03", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jennisa P.", "ReviewID": "IJcf3wjl3FsEbD7W9MKr6A", "Overall": "3.0", "Content": "I work down the street, so when I am in the rare mood of eating Cuban food  for lunch, I head here (i'm cuban so I rarely eat out for the stuff cause I can cook it at home). yesterday was one of those days! Service is always prompt and friendly. The food comes out very quickly. Especially considering we were a table of 7. They automatically ask if we want to split the checks (smart thinking). I usually have the baby churascco. Its a good deal. Tip included I spent only $14. The steak was flavorful, a bit tough cause the overcooked it but still yummy. The beans taste very good. And the white rice is simple but good. The madurros (sp?) were a bit overcooked also. Overall, its average considering the lack of restarants to chose from in the area. We go here often for a quick/satifying meal.", "Date": "2011-06-29", "Author_Location": "Silver Spring, MD"}, {"Author": "Daniel P.", "ReviewID": "XuRc_5vQl8XDuxzIr1P-zA", "Overall": "3.0", "Content": "I found this place pretty mediocre overall. We tried the sangria (super fruit juice-y) and ropa vieja (good, but not amazing), as well as sampling a few other dishes. Portions were definitely on the larger side. Service was mixed: staff were friendly and attentive, but kept forgetting parts of order. The place is inside a strip-mall, and decor/interior is very much no-frills. Super casual.", "Date": "2013-07-04", "Author_Location": "San Francisco, CA"}, {"Author": "Stacey G.", "ReviewID": "BTD7GkNQZjFCIDRpAnedDg", "Overall": "4.0", "Content": "I visit here every time I am in town. I now live out west & so far, haven't found Great Cuban.I had Cuban 3 x. Las Vegas is my go to every time. & yes, my meal is the same meal.Bistec de pollo con arroz, mas plantanos, mas onion, no frijoles. I add a bit of hot sauce to the rice & squeeze lime over everything. Sangria is a must & save room for dessert (even if you take 1/2 your meal home).Everything is just delicious. Period. Las Vegas & Vila's are owned by the same people Las Vegas has a few locations & Vila's is just off 441 N of 595.My only thing: the Tres Leches has to have the right frosting. It's a smooth, soft, marshmellowy style vs. whipped cream. I have got to either find a place out here or make the entire meal myself. I'm salivating just thinking about it.", "Date": "2011-09-16", "Author_Location": "Dublin, CA"}, {"Author": "Aliya Z.", "ReviewID": "2CTaaIvBNZiD2Shf2t9l7A", "Overall": "4.0", "Content": "My first time in Cuban restaurant and it was really good! Lots of meats, rice and black beans. I think it also clean the with a friendly stuff.", "Date": "2013-08-02", "Author_Location": "Penn Center, Philadelphia, PA"}, {"Author": "Lola Z.", "ReviewID": "X7hhHOQkkDKbhw8GVT_7Ew", "Overall": "4.0", "Content": "Always good. Nice ambiance, friendly, attentive service. I always get the baby churrasco. It comes with white rice, black beans and plantains. Plenty of parking and close to the beach.", "Date": "2013-06-03", "Author_Location": "San Diego, CA"}, {"Author": "Mitchell F.", "ReviewID": "H6tX0Yyqw8m3ayrmy7flZg", "Overall": "4.0", "Content": "Food was good (the steak was flavorful, but tough)Service was somewhat adequate. The atmosphere was ok. Nothing was wrong, but nothing was that special. I'd come here again.", "Date": "2011-06-02", "Author_Location": "Coral Springs, FL"}, {"Author": "Carrie D.", "ReviewID": "-8EURec6tyUFNkCTQc3E4A", "Overall": "4.0", "Content": "We had a great lunch!  We started with tostones and empanadas, they were very hot and tasted freshly made.Our entrees were a Skirt Steak special, Lechon Asado and Vaca Frita.  They were all delicious and cooked to our liking.  The sides of beans and rice were good too.We must have been there on a good day because unlike a lot of the other reviews, our waitstaff was not only accommodating, but super attentive with water and checking on us frequently.I am not sure about how authentically Cuban the food is because I've only been to a few Cuban places in Chicago and the food is so similar to Filipino food as long as it tastes good I don't care so much about authenticity.Actually, I guess I don't care about \"Authenticity\" at all.  Some authentically Filipino food is terrible and if they create a unauthentic version of it and it taste better I'll take the \"fake\" version any day!", "Date": "2012-05-14", "Author_Location": "Chicago, IL"}, {"Author": "Melody J.", "ReviewID": "IlcL1qV14FWF3Q216xiMLA", "Overall": "4.0", "Content": "Excellent food, very tasty and huge portions.  BBQ was the best.  Fried beef also very good.  Fried plantains were just right, sweet enough, not overcooked.  Service prompt and friendly.", "Date": "2013-03-18", "Author_Location": "Charlotte, NC"}, {"Author": "Athena H.", "ReviewID": "DQ70u45c_x4mi683QtHzRw", "Overall": "1.0", "Content": "Horrible service. Ordered the Paella asked the server what type of fish it was and he said it might be Grouper but wasn't sure. When we got it it sure wasn't grouper. Approached the manager and she said it might be catfish. $24 for catfish not worth it even if its paella. Anyway will not be going back.", "Date": "2013-08-26", "Author_Location": "Addison, TX"}, {"Author": "Chris S.", "ReviewID": "iRWglw1601piY1MK9jCxWg", "Overall": "4.0", "Content": "Yep, Love this joint.Legit Cuban with a cold Presidente.  No fuss, just great food at cheap prices.Went again over the weekend while in FLL.  This place is just incredible.", "Date": "2009-08-03", "Author_Location": "Newport Beach, CA"}, {"Author": "Rusty S.", "ReviewID": "o0nQSBpphlDodW4X33AxEQ", "Overall": "5.0", "Content": "I haven't been to this Las Vegas location in over four years.  The wife and I decided to stop in for lunch after a range session at the Delray Shooting Center.  The food is as good as it ever was.  The service was above average.  There was a bit of a wait, but that's to be expected during the lunch rush.I had the Lechon Asado.  It was tender and delicious.  I substituted tostones for the maduros.  They were so fresh and much better than the frozen ones they serve at some other Latin restaurants (I'm specifically thinking of Latin Bohemia).  If the black beans came from a can, they sure fooled me.The wife had Masas de Cerdo.  She rarely finishes more than half her meal when we go out, but it was so good that she almost got through the entire thing.  She also had a Tamal and was very pleased with it.  Her high marks are especially significant because she grew up in a Cuban household.We have some out-of-town friends coming in for Christmas who specifically asked to go out for authentic Cuban food, and we'll be bringing them to Las Vegas when they arrive.", "Date": "2010-11-19", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Gary S.", "ReviewID": "q0z60b0PN4lSee4TZAGNbQ", "Overall": "1.0", "Content": "The service here is far from pleasant and the food is marginal at best.I had pretty high expectations considering it had such high stars, but left very disappointed.  In my honest opinion save your money and goto Pollo Tropical.  You'ill find the exact same service and food quality, except in a nicer looking place.", "Date": "2011-03-06", "Author_Location": "San Leandro, CA"}, {"Author": "Kai N.", "ReviewID": "dFT4FM4gh0cAnpgH_WWV_Q", "Overall": "4.0", "Content": "Great food, big portions. Only been there twice so I haven't tried a lot on the menu but they've got the basics down, great roast pork, yucca, plantains etc.", "Date": "2013-01-18", "Author_Location": "Clearwater, FL"}, {"Author": "marc-paul l.", "ReviewID": "rCsXk4EOunJGXc5iJmQHiA", "Overall": "4.0", "Content": "what a wonderful discovery!  from the street las vegas looks like a pretty casual place but don't be fooled like i was.  i wore only shorts a tshirt in the balmy night but most everyone else was dressed in nicer clothes.  you don't need a tie but at least wear a shirt with a collar.  i felt out of place but they treated me no differently.  i couldn't make up my mind on which dish to get so i tried the combination plate that had beef, chicken and pork along with sides of white rice and black beans.  i loved the garlic sauteed onions.  i think they may have been even better than the meats.  mmm, good!  highly recommended (although i wasn't as fond of the beef as the chicken and pork).  i'd definitely go back when i have a chance.", "Date": "2008-06-03", "Author_Location": "Evanston, IL"}, {"Author": "Charlie B.", "ReviewID": "Jv8YRfEGo7oELP2zc0ofXQ", "Overall": "4.0", "Content": "We just love this place - great Cuban food, sweet staff, low prices. The ambiance feels like a Cuban restaurant out of the 50's which we like (but it's not intimate or trendy).  The avocado salad is simple and good. The pork tamales (I forget what the Cuban term is) are to die for. The plantains are great, so is the flan. You really can't go wrong here.", "Date": "2013-01-12", "Author_Location": "Peacham, VT"}, {"Author": "Sal G.", "ReviewID": "LhuAYqQdZPPBy4qzF7qMjg", "Overall": "4.0", "Content": "Las Vegas currently holds the top spot for Cuban in the Ft Lauderdale area.", "Date": "2009-05-25", "Author_Location": "Miami, FL"}, {"Author": "Oscar G.", "ReviewID": "xo5wmz8jNh8MSX0e2yqJ4A", "Overall": "5.0", "Content": "Great food, great prices and friendly service you really can't go wrong with this place. I recomend the Vaca Frita with a presidente. Enjoy!", "Date": "2008-12-28", "Author_Location": "Montebello, CA"}, {"Author": "Victoria B.", "ReviewID": "nfrxFgZAnUkBCnVgdEcYZg", "Overall": "5.0", "Content": "It was great to find this place on Yelp, and the food was every bit as good as expected! The sangria was excellent as well!", "Date": "2008-08-27", "Author_Location": "Jackson, MS"}, {"Author": "K D.", "ReviewID": "wbPZNxjUlIaRm-p6HSyRTw", "Overall": "5.0", "Content": "I have been coming to this place for over 10 years now and I have never found better Cuban food (even in Miami).  For starters, the bread they serve is amazinggg-- I'd say skip the apps and just stick to the bread.  The sangria is also very good-- it's very sweet & comes with a hearty serving of fruit at the bottom.My usual is the palomilla steak (drenched w/ lime juice), black beans & rice, and plantains (I think it's the #11?).  The meat has a great flavor to it, but if you top it w/ the chopped onions and some lime juice it is out of this world.  The black beans & rice also have a great flavor to them, as do the plantains.My dad usually always orders the combination platter, which is also amazing.  It comes w/ a serving of chicken chunks, shredded pork, and ropa vieja.  It also comes w/ black beans & rice, and either plantains or yucca.Anyways, I've never had a disappointing experience w/ the food here.  My only qualm is that I've seen the prices steadily rise since I started going here over 10 years ago, but I guess that's to be expected.  Overall, everything is always great, you get huge portions, and the service is also usually always great.**Tip:  When you turn right into the lot, park on the right-hand side.  The left-hand side of the parking lot is metered, but for some reason the right-side isn't.", "Date": "2010-01-06", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Richard J.", "ReviewID": "CUOIS1kB6kirENDTu4AdRQ", "Overall": "4.0", "Content": "Marquita's all day!  Casual dining but so good!  Of all the Las Vegas Cuban restaurants, this is by far my favorite!  Bien provecho!", "Date": "2013-04-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Danielle K.", "ReviewID": "ucwVjhsdB_yITV986PYxzg", "Overall": "5.0", "Content": "You have to get the Mariquitas they are amazing! I come here once a week for them and the pollo a la plancha! To die for.", "Date": "2013-04-09", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jason B.", "ReviewID": "En6QfcR7Wj_aIU16SQg2LA", "Overall": "4.0", "Content": "The food is delucious and reasonably priced. And, to top it off, service is always a with a smile.  By far one of my favorite places!", "Date": "2012-03-30", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Maryann C.", "ReviewID": "DBBZkIJL4_PbfQQb5Ceedg", "Overall": "1.0", "Content": "Very average food...not on my list again", "Date": "2013-04-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Maria C.", "ReviewID": "2WaNKC0d6jEWblFUveOQ8Q", "Overall": "3.0", "Content": "note: they have a drive-thru, it's walking distance from a lot of the hotels (go here over taco bell, PLEASE!)i liked their story of how the family started with the ft lauderdale restaurant!3 stars is an average of my bf and my reviews in this case (since i am a vegetarian).  obviously, not vegetarian-friendly (though i've been to a cuban restaurant in sf that was, but it is sf after all).the yuca was great!  their garlic sauce - also great!  white rice was good too (recommend it over the other rice, mixed?).  french fries, good.  fried green plantains -- did not like.  do not recommend sangria (i think it was canned fruit?).my bf LOVED the pork though.  he even openly wondered how they got the meat like that (he rarely says anything obviously positive about food, if anything).so if you go, PORK is a MUST!server didn't look happy/nice, but maybe she was having a bad day.", "Date": "2012-01-17", "Author_Location": "Los Angeles, CA"}, {"Author": "Kevin J.", "ReviewID": "fLl9Zk9dE2pVGtuk_Z3RtA", "Overall": "5.0", "Content": "Great food and service. Cheap eat. Very tasty. neighborhood joint!", "Date": "2010-02-19", "Author_Location": "New York, NY"}, {"Author": "Matt D.", "ReviewID": "_pAIwFHVVvQ65zjnp8Q1mQ", "Overall": "2.0", "Content": "We went after reading the reviews here and were excited that our young daughters were excited about trying something new for them.  The food was OK, nothing to write home about.  My wife's sangria had canned peaches in it.  That's a bit tacky.", "Date": "2010-06-30", "Author_Location": "Loudoun, VA"}, {"Author": "Amir S.", "ReviewID": "zCRaEuvBKdpv-777mfxlJA", "Overall": "3.0", "Content": "Pretty decent food.  Had better plantains elsewhere but the skirt steak was nicely cooked.  I thought it was a tad overpriced ($17.95) and tasted like a regular steak.  Thought I would have a Cuban flavored dish, although, since I've never had Cuban food, I cannot say if it was Cuban flavored or not.  3.25 stars.", "Date": "2010-04-21", "Author_Location": "Waukegan, IL"}, {"Author": "Grace C.", "ReviewID": "BejEk3iFVPsuiE9Lto-zrQ", "Overall": "5.0", "Content": "GREAT CUBAN. Thought I had pretty good Cuban food in LA, but this place is off the hook. The Trio was perfectly cooked! (Beef, Pork and Chicken). YUM!!! Rice was good, Bread was good, Sangria was good... everything was good. Oh yes, the Shrimp was oh so yummy in my tummy as well. I love food, but I love eating delicious food. It brings smile to my face. I was just visiting the area, was actually searching for a good place to enjoy dinner, then happen to stumble on this joint, after yelping and a friend of mine said this place was rated pretty high. I said WHY NOT have some Cuban since I am in Eastcoast visiting from the west? A good choice indeed. The food was delicious!!!", "Date": "2010-12-06", "Author_Location": "Los Angeles, CA"}, {"Author": "Katie S.", "ReviewID": "VBIrMPfJsJdyy7qsM4F-wA", "Overall": "3.0", "Content": "i gotta say i wasn't all that impressed with this place.  it seems like people love it but i just wasn't feeling it.  i had the cuban sandwich and it was decen, plantains were blah - just didn't knock my socks off.  good for a cuban food fix. but i have had way better.", "Date": "2010-12-07", "Author_Location": "Jersey City, NJ"}, {"Author": "Jim S.", "ReviewID": "KAarnVMozAIyvEum6SSymA", "Overall": "5.0", "Content": "Fresh really great food here", "Date": "2011-01-15", "Author_Location": "Henderson, NV"}, {"Author": "Lynh N.", "ReviewID": "sNKV7ubBUOiLtR3c5teK1g", "Overall": "5.0", "Content": "Their bread to start was so good that I can eat the whole basket myself! I ordered the sangria and that was addicting..I wanted more. For the first entree, we ordered the ropa vieja which was good. The second entree was the bistec de palomilla which was good as well. All entrees come with rice, beans and fried plantains. Their plantains are good! Nicely fried and sweet. Lastly, we ordered the tres leche cake. This was SOO good. The best tres leche I've ever had!", "Date": "2010-09-26", "Author_Location": "Anaheim, CA"}, {"Author": "GhostFish Z.", "ReviewID": "it_RHtDUV2eJ18ZNCsBwjA", "Overall": "5.0", "Content": "¡¡¡ MADRE SANTISIMA!!!  When you visit Florida one should eat seafood (hey its fresher than up north) and these guys got the best Grouper (cherna en español) anywhere. Dont come for decor or artwork...cant eat those. Dont come for sangria...anyone can make it at home c'mon. BUT do come for the FISH dishes. So go buy a Guayabera shirt somewhere, put it on, and go to Las Vegas! (PS: it is NOT named for the casino town in Nevada..Las Vegas are actual Spanish words for the Flatlands or the Plains..thats how casino town got its name...remember Spanish explorers and all?)", "Date": "2010-09-29", "Author_Location": "New York, NY"}, {"Author": "A C.", "ReviewID": "r-jVZsCMRtpvLrixZD1q8A", "Overall": "3.0", "Content": "Had a craving for Cuban food as soon as I got into town.  LV did the job however I have had better.  The restaurant itself was nice and chill and the service was very good.  I would attempt again next time I'm in the area just to see if I came on an off night.", "Date": "2011-01-02", "Author_Location": "San Pedro, CA"}, {"Author": "Ryan H.", "ReviewID": "AV8BVHTJvFYO2FLIOyckkw", "Overall": "2.0", "Content": "Average is how I'd rate this place. Having the word \"Cuban\" in your name... well I expect awesome Yuca Frita... this place, unfortunately fell short.", "Date": "2011-04-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "K D.", "ReviewID": "AumC4xK2tv49uSEDLKMxcw", "Overall": "5.0", "Content": "Delicioso!!! OMG this food was fantastic! The workers there were super nice and even gave us extra black beans to go without asking.  The plantains are by far the best I have tasted in a while, it is so easy to mess those up.  Everything is so good there, so whatever you order you will not be disappointed. Viva Las Vegas!!!!", "Date": "2012-02-20", "Author_Location": "Seattle, WA"}, {"Author": "Tim N.", "ReviewID": "nGKrfn1_g3HbS7-ixtxV7A", "Overall": "4.0", "Content": "Yup, still good!", "Date": "2010-11-28", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Kevin L.", "ReviewID": "EYzccx-qSMenSYtgjof2Iw", "Overall": "2.0", "Content": "I was not impressed with the food at this location.  Barrio Latino in aventura is soooo much better.", "Date": "2011-04-01", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Astrid S.", "ReviewID": "wWrth78hxZ6XTHYT8TTL3A", "Overall": "4.0", "Content": "I have the same thing every time I come here (the fish filet with rice, black beans and plantains) and it always tastes great. This is the first and only Cuban restaurant I've been to, and before I never thought that fish, beans and sweet plantains would go together but they do, it's so good. The lunch specials are a lot of food for small prices. The staff is friendly and the food comes out fast.", "Date": "2011-08-11", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "CUNIT T.", "ReviewID": "HRb8yU1HfO6D5jokXQPXBg", "Overall": "5.0", "Content": "I've had a lot of \"Cuban\" food and I've got to say that this is one of the best! Cuban sandwich is a favorite, but would also recommend the fish filet, roast pork, chicken empanadas...You know, everything I've had has been fantastic!", "Date": "2011-08-10", "Author_Location": "Detroit, MI"}, {"Author": "Juan N.", "ReviewID": "t5llLCiWrKlmVH1eeVrw8g", "Overall": "4.0", "Content": "Excellent food, fast service, never a wait, very reasonable prices, while the place might not be fancy it is very clean and the staff is always friendly.", "Date": "2010-03-17", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "J T.", "ReviewID": "gpxu3MxugTwznkEPd8I3ow", "Overall": "3.0", "Content": "Service and prices are very good. The food was not bad, although i have had better Cuban food.", "Date": "2011-08-14", "Author_Location": "Harrisburg, PA"}, {"Author": "J P.", "ReviewID": "LGiyaX7p4pCNVibSzzsQXw", "Overall": "5.0", "Content": "Love this place.  It is priced right and they give you plenty.  Dishes are so flavorful and as good as it gets.", "Date": "2011-09-08", "Author_Location": "Brook Park, OH"}, {"Author": "Dria S.", "ReviewID": "MrQ2EWd6-r5HWQnLJYHEHg", "Overall": "1.0", "Content": "Highly Disappointed with food and service at this location. We love Las Vegas and this was our worst experience. The location in Plantation is 100 times better quality food and service. Here is a list of what we experienced at Fort Lauderdale location near the beach 1) the bread was stale with Barely any butter 2)Waitress had attitude from the minute we just wanted water with lime to drink. She made a rude comment \"oh you made your own lemonade\" when we did not even touch a single sugar packet, 3)chicken was skimpy and not fresh but plenty of rice I guess to compensate 4) when we order a piece of $4 cake it was barely even a slice. Out of what we had the best things were the plantains and the Coffee con leche. This was our first time dinning at this location and will be our last.", "Date": "2013-07-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Monika K.", "ReviewID": "YO0hF-NhcKNR4VHDpG6iFQ", "Overall": "3.0", "Content": "ahhh is ok!  this is place is pretty decent, I wouldn't say I'd rave about the food, but it was tasty and service was quick and friendly, had the yuca frita which is always deliciouso pero how can something not be that is frita? ropa vieja was good and tasty, but wasn't as hot as I'd like my food to come out. BF liked his empaniazado bistec. Good for your cuban fix but not the best that sofla has to offer thats for sure.", "Date": "2010-09-30", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Ashley S.", "ReviewID": "xHicw0SLr47BHfm4I24Z8w", "Overall": "5.0", "Content": "Food is great, real cuban food! I LOVE this place!! Have been eating at this 1 and the 1 in hollywood for about 10 years and I will continue to! I also get take-out, great quick service. :-)", "Date": "2013-01-22", "Author_Location": "Oakland Park, FL"}, {"Author": "Fort Lauderdale C.", "ReviewID": "fiy5la8T2fiqENINk6W23w", "Overall": "5.0", "Content": "Excellent food. Loved their fried beef dish", "Date": "2011-04-20", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Randy S.", "ReviewID": "ZW6bQSnv5VMJQs_0s6t-OA", "Overall": "5.0", "Content": "still the best Cuban food in the area by far!", "Date": "2011-10-30", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Tina M.", "ReviewID": "yVLYjlSJiob1wSO6p6I9bQ", "Overall": "4.0", "Content": "This place is awesome. I ordered the pulled pork dinner plate. It was HUGE. The meal includes rice, beans, and fried plantains... all for $10. What a deal! The flavor of the pork was wonderful. Everything = tasty!", "Date": "2012-05-31", "Author_Location": "Mobile, AL"}, {"Author": "Scott S.", "ReviewID": "EkZYkrDM4K19yJeW-i4jxg", "Overall": "3.0", "Content": "Simple Cuban food nothing special but friendly staff and quick service", "Date": "2012-02-26", "Author_Location": "Colonial Beach, VA"}, {"Author": "kevin m.", "ReviewID": "D4U_VzzgeX6wuNc8Ub1fkw", "Overall": "4.0", "Content": "roast pork is really good as is the desserts reasonably priced", "Date": "2011-07-21", "Author_Location": "Fort Lauderdale, FL"}], "RestaurantInfo": {"RestaurantID": "_h7lsUphOc7uiScsv7wgKg", "Name": "Las Vegas Cuban Cuisine", "Price": "$$", "RestaurantURL": "/biz/las-vegas-cuban-cuisine-fort-lauderdale", "Longitude": " -80.10826260000000", "Address": "2807 E Oakland Park BlvdFort Lauderdale, FL 33306", "Latitude": " 26.167697", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/xeyekNZwKCWIOphhKTMEag/90s.jpg"}}