{"Reviews": [{"Author": "Fei-Fei K.", "ReviewID": "ZAluz-IH_o0y9ghAWqkGIQ", "Overall": "4.0", "Content": "This place...I have never even seen it before! Crazy! I am always in the loop, and the farthest I've ever gone is to Puzzles on the other side of Skinker. Actually, one of my good friends started working here and I was interested in trying it. So lo and behold, one of my close friends came back home from her study abroad and wanted to meet me up for some dinner and I suggested we both try Tavolo V! I felt super bad because I was late getting here first, and thennnn I had trouble finding it, but I am a little blind so I didn't realize it was right in front of me after I drove around a bit. My boyfriend had to point it out to me...haha. Oops! So finally getting in, we were sat down, and our server was very kind and gave us time to look at the menu (and for me to munch on the complimentary bread, olive oil, and parmesan! Nom nom nom!!)  My friend had ordered some bruschetta and I'm normally not a fan of tomatoes, but yum! It was very good. My boyfriend and I weren't really sure of what to eat, so we ended up ordering a pizza. I wasn't entirely starving, so I thought sharing would be better. Lame, I know, but maybe next time, some pasta! We picked the Babbo's pizza which had sausage, caramelized onions, balsamic vinegar, fresh oregano, and mozzarella cheese. I've been craving artichokes lately, and when I saw that some of the other pizzas had artichoke hearts as a topping, I was hoping that my server would allow us to add on some artichoke hearts on it. Thankfully the Babbo's pizza had a few toppings because he let us and I was ecstatic!   When our food came out I was so surprised! It was such a large pizza, I was thankful that I was sharing with my boyfriend, I definitely(!!!) could not have eaten all that myself. It was amazing. I can't even begin to explain it! I wish I had more of it cuz I was in love. It was a thin crust pizza (my favorite) and everything was perfect to me. To top it off, the bill was about $13 with tax (before the tip) and I only wish I didn't get to order more. Definitely will come back!", "Date": "2014-06-13", "Author_Location": "Saint Louis, MO"}, {"Author": "Andrew N.", "ReviewID": "fKz-VxBvxd99hDWUEsc2ig", "Overall": "4.0", "Content": "After hearing good things about it since it opened, I finally made it! We started with the bruschetta appetizer ($5), which was good, but could have been more flavorful. The del Pietro salad ($6, iceberg, romaine, Parmesan, red onion, tomato with a vinaigrette dressing) was good, but nothing to write home about. The Babbo's pizza (tomato sauce, sausage, mozzarella, caramelized onions for $12) however, did live up to the hype -- crust was thin and crispy, sauce tasted fresh, and they drizzled some balsamic vinegar over the top. Delicious. We opted for a bottle of the Toscolo Chianti ($26), which was fine. They don't have many full bottles under the $35 price point, but the Chianti was a nice option. Our service was excellent, and the space is really cool -- modern feel, brick walls, and they have garage doors on the front that they can open up on nice nights. Pros: good pizza, great service, cool atmosphereCons: The menu is a little limited -- not much besides pizza and pasta", "Date": "2014-05-31", "Author_Location": "Saint Louis, MO"}, {"Author": "Diane M.", "ReviewID": "VL7rhoqFloZv5Va3UGcckQ", "Overall": "5.0", "Content": "I came here on a beautiful Friday night with a group of seven. Though they don't take reservations, we were seated within 20 minutes which was surprisingly quick considering how packed the restaurant was. Loved the openness of the space and dim lighting - the inside seating area is not completely enclosed, so there was a nice breeze blowing from the outdoor patio. Service was amazing - we were promptly greeted by the server after we sat down, and he was very attentive and helpful throughout the course of our meal. As for the food, the majority of my friends ordered the Tutto Mare pasta, which they all loved. I got the Funghi pasta which was amazing. It was creamy, fragrant, and seasoned very well. The bread that they served was also warm and amazing. Overall, I was very glad to have found this cute spot nestled in the Loop, and I'll definitely be back in the near future!", "Date": "2014-04-26", "Author_Location": "Saint Louis, MO"}, {"Author": "Andrea R.", "ReviewID": "d7UQm0ccO-lFx2yC3442Hg", "Overall": "4.0", "Content": "I recently visited St. Louis and stopped into tavolo for appetizers and dessert. The desserts were honestly not very good. $6 for 4 super super thin slices of zucchini was ridiculous. However, the dessert stole the show. The tiramisu was outstanding as were the cannolis. So so good. Go here for dessert and you will not regret it.", "Date": "2014-06-30", "Author_Location": "Nashville, TN"}, {"Author": "Alan C.", "ReviewID": "F8-qYrn30PakiA_iycb1mQ", "Overall": "4.0", "Content": "I usually do not review restaurants I will only visit once, but I decided to make an exception here. My wife and I are from Oregon and were at a conference in St Louis. We were staying at the Moonrise hotel just down the street. We walked down and put our order in. Our appetizer was the roasted cauliflower. Deeeeelicious!!!  Perfectly cooked!! If you don't order it, you are missing something special (and I don't even like cauliflower!) I had the lasagna and my wife had the spaghetti. I expected the same sauce for the different entrees but was surprised they were very different. Each sauce was spiced nicely and unique to each dish. The server was pleasant and very patient.  I felt the price was a tad high but my wife felt it was appropriate for the food and service. She thought I was being an Ebeneezer Scrooge.", "Date": "2014-06-26", "Author_Location": "Newberg, OR"}, {"Author": "Adrienne L.", "ReviewID": "1edKXLyv-RxK3CEgG3QKAA", "Overall": "5.0", "Content": "Location and atmosphere are great! I love the open feel of the place! Their service is pretty good, not awesome, but better than a lot of places. I had the organci salad, which is amazing! It's fresh and perfect for a beautiful day! The tavolo v pizza is fantastic too, the goat cheese on it is perfection. My hubby enjoyed his carbonora pasta & Caesar salad. We'll be back!", "Date": "2014-06-13", "Author_Location": "Shaw, Saint Louis, MO"}, {"Author": "Ana S.", "ReviewID": "PHTLBJfLo1mIGWGXrcAK1A", "Overall": "2.0", "Content": "Con: The pizza is absolutely awful!!!!! The meats weren't fresh and the cheese tastes like a cheap stripper off Broadway. We tried 2 different ones hoping we were wrong....Fool me once......Pros: They have designated parking spaces and the Shrimp appetizer along with the organic greens is superb. The outside patio is also a plus. For a \"pizza\" place I give it 3 thumbs down as even my dog didn't attempt at the leftovers. As an appetizer/drink place then def 2 thumbs up.", "Date": "2014-04-22", "Author_Location": "Saint Louis, MO"}, {"Author": "Harper Z.", "ReviewID": "ml5ewmMQJt7l6V4dld9yXQ", "Overall": "4.0", "Content": "Had a friend in from out of town who wanted Italian but had already frequented the Hill and wanted something a little more modern so we headed over to Tavolo V. At 6:00pm on a weeknight we were immediately seated but the restaurant filled up quickly around us. Decor: Big(ish) open space with gorgeous exposed brick and high ceilings. I love places who consider their spaces and make the best of it. Big and small tables for all group sizes. Food: Modern takes on classic and authentic Italian dishes. Thankfully inventive since Americanized Italian can quickly feel boring. My dining companion and I ordered the Tavolo V pizza, the Alfredo Pasta with Chicken, and a special appetizer with shrimp and polenta. Dining companion loved her pizza. I thought my Alfredo was a little under seasoned but the pasta was cooked perfectly. The star of the show was the shrimp polenta appetizer. Put that baby on the regular menu and I will be here all the time. I'm even trying to replicate it in my own kitchen (and failing), so please serve it again. Waitstaff: Very helpful and obviously knew the menu and had sampled the specials. It drives me crazy when restaurants push specials the staff hasn't tried. Reasonably priced for a nice meal with good portions. We both had leftovers. I'll be back for more!", "Date": "2014-04-11", "Author_Location": "Saint Louis, MO"}, {"Author": "Steven B.", "ReviewID": "RHEYu4vc6IDMZ_--qk4KAQ", "Overall": "4.0", "Content": "I've got to start rereading my previous reviews before dining at restaurants. When you dine out as much as I do, you forget small details about your earlier meals. I forgot how they present their Calamari, here at Tavolo V and didn't request my spicy tomato sauce to be served on the side. I do not always dip my Calamari, I like it plain with just a squeeze of lemon.Our last visit we did not enjoy any of their amazing salads, but this time we enjoyed two of their most popular. My dining partner ordered the Beet Salad. It had a HUGE Fried Goat Cheese ball in the center of Frisee, which was surrounded by cubes of red and golden beets. It was all tossed with a white wine vinaigrette, which added a simple burst of flavor. My salad was the Del Pietro, a simple house salad that could rival those at Rich & Charlie's. I'm not a fan of Iceberg lettuce, but Tavolo V mixes it with Romaine, Parmigiano Cheese, red onion, tomato and then tosses it with a house vinaigrette. A glass of wine, with their fresh bread would make this salad a perfect lunch. Seeing their Lasagna being served to the table next to us on our last visit, my dining partner knew what he wanted. The portion is so huge, two adults could actually share it as an entree.  It is a mixture of beef and pork with ricotta and parmigiano cheeses in a rich thick tomato sauce. He could only eat half of it and enjoyed the remainder the next day for lunch. Our server commented, he has never seen anyone eat it all in one sitting. For my pasta dish, I enjoyed the Pomodoro. It was a spaghetti dish with olive oil, garlic, diced fresh tomatoes, basil and goat cheese. I am a goat cheese addict, so this was the perfect entree for me. I found this dish to be light and refreshing for a pasta entree. I've always had excellent customer service here and look forward to my next visit. Before ordering next time, I will be sure to reread my reviews so I know to order the Brussels Sprouts and the Spaghetti with Meatballs. When: 3 MAR 2014Why: Dinner", "Date": "2014-03-12", "Author_Location": "St Louis, MO"}, {"Author": "Abner L.", "ReviewID": "TAyjRqe6Mzjzrpxk_2g4Cw", "Overall": "3.0", "Content": "Great summer dinner spot. Come for the atmosphere and sit outside. The food is hit or miss. I've had several pasta dishes and none of them are better than anything I can make at home. The service is bad. One time we had a young kid who really wasn't concerned with our having water or wanting to order another drink. I can't say I've ever been impressed with the service. I go here because it's a great spot to have a drink or an appetizer, but avoid it if I am really  hungry, because you just don't know what you'll get.", "Date": "2014-05-18", "Author_Location": "Saint Louis, MO"}, {"Author": "Fred M.", "ReviewID": "0X71L4E3oPThSDrbHOBRcA", "Overall": "4.0", "Content": "Went here with friends for the first time last night.They don't (but SHOULD) take reservations. We arrived at 6:30 and were promptly seated. Arrive later and you'll wait.We shared five antipastis. Food and service was excellent!We'll be back.", "Date": "2014-03-29", "Author_Location": "Saint Louis, MO"}, {"Author": "Aaron B.", "ReviewID": "WlARCmKyE5Ws3dYBM7ai7w", "Overall": "5.0", "Content": "Tavolo V is an AWESOME trendy Italian restaurant in The Loop. They have great food all around and it's an awesome space. It's a very open \"raw\" space. It has a pretty cool bar, too. I would love to come here and eat at the bar sometime! Anyways, onto the food.I've been to Tavolo V twice so far and each time I got a pizza? What's wrong with me??I think Tavolo V has helped me figure out that I really dig fancy pizza. I'M NOT BORING. I PROMISE. The first time I got the \"Pazzo's\" and it comes with \"Olive oil, shrimp, pancetta, mozzarella and goat cheese.\" I am huge fan of pancetta and shrimp so I had to try it. While it was delicious, it was a little too salty for me. But yes, I did eat the whole thing.Pizza round 2 was the \"Babbo's\" and it comes with \"Tomato sauce, sausage, caramelized onions, fresh oregano, and mozzarella cheese,\" This pie was super good. While the sausage and caramelized onions were delicious, what really made this was the unlisted balsamic vinegar they put on top. This pizza was the perfect combination of flavors and I highly recommend it. I also tried some of their appetizers. They are a little pricey for how much you get but are still packed with flavor. The ravioli and zucchini were great but their best was the calamari. Oh myyyy laawwwwwdd. The spicy tomato sauce they put on top of these puppies has so much flavor.  I used to think tomato sauce was boring and predictable but this stuff was magic.I hope to be back and explore some other dishes....or more pizzas.", "Date": "2014-01-06", "Author_Location": "Saint Louis, MO"}, {"Author": "Aaron P.", "ReviewID": "_k08Hx0-qNO2KkeAfxFOhA", "Overall": "3.0", "Content": "The food here is decent but boy is it pricey.I came here for lunch with a couple of friends and did not mean to drop $20, on pasta and a beer but I did so thats that. Overall the pasta was fine. I had the chicken alfredo, and the best way to describe it was that the chicken alfredo was...just chicken alfredo. My friend got a piece of salmon which looked and tasted pretty good, again nothing spectacular. I would come back here again though it is on the fringes of the loop. The problem with this place is that the combination between location, food quality and price is just not perfect. If I wanted the same quality of italian pasta I could very well go elsewhere and pay less. Overall meh.", "Date": "2014-02-22", "Author_Location": "North Oakland, Oakland, CA"}, {"Author": "Paul K.", "ReviewID": "CpJWSCwU7JaVjZTmnybxCg", "Overall": "5.0", "Content": "A 5 star review and an International Supper Club event.  Life is good.  I had a wonderful time meeting and talking to fellow Yelper's and our new CM.  It is good to know that we have had 3 CM's here in St. Louis and they all have been skinny. :)  Aaron is going to do a fine job.Seeing the food around the table it looks to me like everyone had a good solid dish.  In my little area there were two pizza's, fish, short ribs, and my spaghetti and meatballs. I also had  a side salad which was also top notch.As far as plate jealousy I really liked the short ribs.  But my pasta was also an envy plate.  Two huge meatballs with a wonderful light red pasta. Very filling and I had leftovers.  We had one server for 13 people with 13 separate checks.  The service was as good as it could possibly get.  Way to go Tavolo V!!!", "Date": "2013-11-12", "Author_Location": "Ballwin, MO"}, {"Author": "Picha M.", "ReviewID": "fcbhlfmvaz8s7W6XRF90hw", "Overall": "4.0", "Content": "An ISC stop and overall a very good place!  First of all they have great parking which is huge for U City.  The building has a garage door/wall that can be opened when the weather is nice for outdoor seating.  On this evening they were able to accommodate 13 of us.  When I first came across this restaurant I wasn't sure what to make of it.  I initially thought it was just a pizza place but it is actually a rustic style Italian themed restaurant with a loft like feel.  There is a bar with flat screen TVs to satisfy the sports fan.  The specials this evening were a Lobster Risotto, Short Ribs, and a Trout dish.  We started with the Beet Salad and the Cauliflower soup.  Both were wonderful.  There was actually more beets than salad but the catcher was the fried goat cheese on top that added the perfect savory touch.  The cauliflower soup was very smooth and hit the spot on this rainy cold night.  I ordered the short ribs because I couldn't resist.  The short ribs were overall tender but parts were a little tough.  Not bad though and with a good red wine taste.  They were served on a bed of garlic mashed potatoes and a handful of asparagus. Overall a nice restaurant with a good variety of food not just pasta or pizza.  My only regret is that I didn't have enough room for dessert!  Great choice for ISC Sarah!", "Date": "2013-11-11", "Author_Location": "Saint Louis, MO"}, {"Author": "Charleen S.", "ReviewID": "j1NOsVii6gcfsr1iCoOL5A", "Overall": "4.0", "Content": "Sarah S knocked it out of the park again this month with the ISC!  Met a group of 12 Yelpers here for dinner.  When we arrived it was clear that they were not prepared for us, but they set us up with a table lickety-split.  I started off with the beet salad.  I like a beet salad and it was the best I've had so far.  Three different kinds of beets with a frisee and...a battered fried round of goat cheese!  The creaminess of the goat cheese went so well with the different beets and the frisee; this really was a great salad and I highly recommend it.For dinner I had the margherita pizza - I usually try the margherita pizza if a place has one because there was a restaurant in my last city that made a great one and I'm trying to find a replacement here.  It might have been the closest I have come so far in STL - could have used a touch more basil but otherwise it was just how I like it.  Crispy, salty crust, plentiful tomatoes, just enough cheese.  And very reasonably priced at $12. We've all been places where the presence of a large group killed the experience of the other diners; well not at Tavolo V!  There was a much larger group seated already when we arrived - in fact, thanks to Aaron B for snagging me before I went over and sat down with them thinking they were our group.  The restaurant handled the situation like a champ!  The pace of our dinner and the quality of service made us feel like we were the only ones there and I had the feeling that the other group felt the same way.  That says a lot about the quality of the management.Overall, it was a really enjoyable experience and I would definitely return to try more of their offerings.", "Date": "2013-11-13", "Author_Location": "Chesterfield, MO"}, {"Author": "Elizabeth M.", "ReviewID": "kQFEUbA9MmfnasKEEnOAyg", "Overall": "2.0", "Content": "Went here before a concert at the pageant one night. I had the spaghetti pomodoro. It was quite delicious. In fact the food in general was very good. The reason for the low rating is the service. We were ignored for a lot of the visit. I didn't understand, because the place was not crowded at all, but my water glass was empty most of the time.", "Date": "2014-02-23", "Author_Location": "Saint Louis, MO"}, {"Author": "Sarah S.", "ReviewID": "cP-dTUD8nh_79Fr0pTAbQw", "Overall": "5.0", "Content": "I came here for this month's edition of International Supper Club and WOW!! I was blown away by how good it was, both food and service! This is my new favorite Italian restaurant in STL, and a definite add to my \"Hidden Gems\" list. Hill, schmill, this is where it's at. Oh and that other Italian place down the street in Clayton can cry because they wouldn't accommodate our group without a $750 food and beverage minimum so our business went elsewhere, to a place that takes reservations, loves groups and split checks happily. Soapbox rant over. Tavolo V deserves your full attention! I chose this place for ISC because I had bookmarked it as a \"to try\" restaurant and I noticed that all of my Yelp friends rated it highly. Usually I try to vet places before I bring ISC to them but I felt fairly confident that we'd like the food based on friends' reviews. They get bonus points for having their own parking lot in a long line of street parking only eateries in the Loop. We were a group of 13 and service was flawless all night. We had one waitress, Ryan, and she took great care of us throughout. She gave a lot of recommendations and helped us make decisions along the way. There was another large group (probably double the size of ours) that was there before us and it didn't affect our service at all. I started with the roasted cauliflower, which received accolades in reviews. It was a pretty big plate! I should've shared it with someone but I did manage to eat it all. It had orange and purple cauliflower along with the traditional white. I prefer a little color to my cauliflower and so I enjoyed these varieties. They were flavored and cooked perfectly. I managed to snag a bite of the special soup of the day, cauliflower soup. It was delicious. I would order it in the future. They brought fresh bread to our table along with separate bowls of Parmesan cheese and olive oil. Perfect combination. I wavered on what to order for my entree and decided on the alfredo pasta. It usually comes with chicken and spinach but I got it with just spinach. It was THE BEST alfredo pasta I've had in memory. Usually it's heavy and can be fairly bland but this was so flavorful and the pasta was perfectly cooked. I loved it. My husband got calamari, and they accommodated him with giving him a larger portion than the appetizer size so he could have it as his entree. He said it was really good, some of the best he's had. I got to steal a bite of tiramisu for dessert. I've never thought I was a fan... but I was this time! Save room for dessert - I will next time. Everything about this night was awesome. Everyone had a great time and really enjoyed the food. I know that we will all be back in the future and I would highly recommend it to anyone else.", "Date": "2013-11-11", "Author_Location": "Saint Louis, MO"}, {"Author": "Bobbie J.", "ReviewID": "V8aD0J5lN1sENTzRmbTcmA", "Overall": "5.0", "Content": "Had a wonderful dinner here last night, LOVED it!  I now know I like St. louis style pizza!  So good, friendly people, and a place to park.  All good!", "Date": "2014-04-19", "Author_Location": "New York, NY"}, {"Author": "Chris X M.", "ReviewID": "qX0O66_kdjy3OrFaptjBcQ", "Overall": "4.0", "Content": "We eat here often and enjoy the open and lively space, the consistently flavorful food (pizzas and red sauces top list) and reasonable Wine by the Glass. Another Del Pietro hit, this one make it easy to eat before a show at the Pageant or a night out on the loop.  Thumbs up. On weekends a guard will allow you to park on large side lot to convenience. Good place to sit at bar for drinks/pizza too. Good Prices.", "Date": "2014-01-04", "Author_Location": "Saint Louis, MO"}, {"Author": "Patt C.", "ReviewID": "VV-vR0fuglg4BfN1DvIJFA", "Overall": "4.0", "Content": "Went for lunch with my girlfriend who is a \"frequent diner.\" As we walked in, the guy behind the bar said, \"Good to see you again!\" Man, do they know to make a guest feel welcomed.We were offered to sit anywhere we wanted and selected a table near the garage doors.Water was served promptly, and we both ordered a beverage and heard about the day's specials.We got everything on the specials menu:We shared a tomato salad: red and orange tomatoes on a bed of greens, red onion strips, freshly shaved parm shards and balsamic. It's an amazingly simple salad, but tastes so wonderful and fresh. Everything is in proper proportion with the tomato as the star.She got the shrimp risotto -- which included cherry tomatoes, zucchini and asparagus. She liked it a lot and offered me a taste. It was fine.I got the white trout -- which had a nice, crispy skin and was perfectly cooked. It came with brussels sprouts, onion, garlic and red pepper strips. And there was some kind of nice little sauce.The brussels sprouts were a little crunchy (a good thing) and with each half, I got some sauce, onion and garlic. It all paired so well. The trout was mild and moist, and tasted fabulous.Service was attentive and friendly.We both had a nice recyclable to-go vessel for another meal.", "Date": "2013-08-30", "Author_Location": "Chesterfield, MO"}, {"Author": "Shanti N.", "ReviewID": "CqD4H7VdZA12o-9OapGf8Q", "Overall": "4.0", "Content": "It was just by happenstance that we stumbled upon Tavolo V after we got to the Delmar Loop Metro Station and in search of libations/sustenance before Saturday evening's showing at the Pageant. I recalled reading an article about Tavolo's opening about a year ago, perhaps that is why the name stuck with me. It is owned by the same owners of Sugo's and Babbo, which boded well for quality right off the bat.Drinks were a good place to start. Since I was already breaking out of my comfort zone, I decided to go with the Blood and Sand, a martini featuring Oban 14-year-old scotch, vermouth, and orange juice, along with another ingredient that I can't recall. The drink was not sickly sweet, in spite of this lineup of ingredients, but I don't think whiskey purists would go for it. One drink was definitely enough, to savor and take the edge off, and I appreciated the inventiveness of the drinks menu. The salads are crisp and fresh though HUGE and probably worth splitting if you are ordering a main course. The pizzas were inventive and I went with an artichoke, lemon, and basil special. I am a sucker for artichokes, and would have demolished more had I not filled up on the salad beforehand. I wished that I could have packed up the rest; maybe Tavolo should think about keeping 'to go' boxes ready for customers who are headed to a show at the Pageant, to pick up after the performance. Just a suggestion.The décor had a clear European vibe, including  a roll-up garage door setup leading to the outside, which featured additional seating, all the better to people watch. The interior, with its rough hewn walls and exposed ceiling was also in keeping with the restaurant's rustic Italian character. There was no problem being seated, but that would have been a different story if we'd come in even a half-hour later. By the time we were finished with salads and pizza, dessert was out of the question, though reading some of the other reviews makes me want to return to sample the tiramisu.", "Date": "2013-08-23", "Author_Location": "Chicago, IL"}, {"Author": "Susan T.", "ReviewID": "hdr58z0W6jf-P5eEupAaqQ", "Overall": "3.0", "Content": "First the good; the space was great, very open and warm. I love the garage door for good weather. The service was fine albeit our waitress read the specials to us. The food was fine, the Del Pietro salad was exactly was it suppose to be. The Brussels Sprouts were excellent, flavorful and not over cooked. My major complaint was the wine list, not a single glass under $8.50, that's ridiculous. The 300% markup on wine is crazy. I bought a bottle at the grocery for less than the cost of the glass....for the same wine!I am so tired of value wines at premium prices.", "Date": "2013-10-24", "Author_Location": "Saint Louis, MO"}, {"Author": "Jessica D.", "ReviewID": "hyRXbTj_WsRyeIRlB3aDrw", "Overall": "4.0", "Content": "Met friends for lunch here on Monday. I had the salad of the day, which was a pear salad, and the pomodoro pasta.  The pasta was okay, but the salad was fantastic! Value- Pasta and salad with a tip was about $20.Parking- The restaurant has their own (albeit smallish) parking lot, so that earns them at least a star on its own.  Service- Excellent; the server was very attentive.", "Date": "2013-11-15", "Author_Location": "Atlanta, GA"}, {"Author": "Allan C.", "ReviewID": "DjRaW5XA6tTCWeIY7EhHPw", "Overall": "4.0", "Content": "More relaxed and well lit atmosphere than Sugo's and far less crowded.They have a bar to hang out at.They have a garage door thing to open in nice weather and you can feel all cool and hip by sitting juuuust inside it.To be honest, the food is practically exactly the same as Sugo's with some added nice dishes such as the cauliflower and brussel sprouts.  My visits here are mainly takeout but I really like this nice addition to the loop.", "Date": "2013-09-23", "Author_Location": "Chicago, IL"}, {"Author": "Brian B.", "ReviewID": "97KXnGIUP6QE0anFJp_vNw", "Overall": "4.0", "Content": "Went here with a large group recently and had a very good experience.  The Pomodoro pasta was above average.  The Del Pietro salad was also above average.   The atmosphere and service were great, went on a Saturday night and it was busy but the service was speedy.  Even though it is in the Loop parking was not a problem, there is a reserved attended (free) lot next to the restaurant.  Although it was full when we got there we found a spot on the street in front.  Glad to see the continued revitalization of the eastern end of the Loop.", "Date": "2013-10-26", "Author_Location": "Saint Louis, MO"}, {"Author": "Chris Z.", "ReviewID": "08ckyeXjI38knPfbeeyYDQ", "Overall": "4.0", "Content": "First and foremost... if you get a chance to try this place out ask for the waitress Lindsey... cute, friendly, and attentive.This is one of the better places I've tried recently.  They offer really good Italian dishes.  I had the Pork Oso Bucco... it was really, really good.  The shank is served upright so everyone in the whole place is looking at you when it's served.  Yeah... see that tower of pork... that's all mine.  I have to digress a bit... my dining experience was muddled by a barking dog at the next table over.  Yeah... one of those little lap dogs.  The family on the patio thought it was appropriate to bring it to dinner.  And sit it on a chair.  And feed it stuff off their plates every time it yipped.  My rules for dogs and kids in restaurants are the same. If your little creatures can't behave themselves then take them to the park, not a restaurant.  I don't want to hear your dog yipping any more than I want to hear your kid screaming.  What are you thinking.Now if your youngins or pets keep to themselves and act respectable, I'm all good.The table with the pup ran out of scraps.  I swear it was eyeing up my pork shank.  I really wanted to drop kick it like Jack Black does to Baxter in Anchorman.The food is really good here.  Service was great.  And the ambiance minus yippie skippy was open and relaxing.Oh... and they have a lot reserved for dining patrons... a great thing for those of you that hate parking in the Loop.", "Date": "2013-06-11", "Author_Location": "Kirkwood, MO"}, {"Author": "Jim F.", "ReviewID": "Afob_foSL5T_hw4uDkczSA", "Overall": "1.0", "Content": "First visit last night.  Not crowded but service was slow and all food was cold or mildly warm when arrived at table.  Nothing special.  Won't return.  Should have gone to one of the many other good places in the Loop.", "Date": "2014-05-26", "Author_Location": "Glencoe, MO"}, {"Author": "Dani G.", "ReviewID": "-qmcacXV4PFH3QX2ywmIcg", "Overall": "5.0", "Content": "Pretty much everything is awesome. Loved the bruschetta and roasted cauliflower, and the outdoor seating is fantastic. The parking lot is an added bonus since parking on delmar can be a bit iffy.", "Date": "2014-05-04", "Author_Location": "Saint Louis, MO"}, {"Author": "David W.", "ReviewID": "sClh7iGiA8qArNZaAeXopA", "Overall": "2.0", "Content": "My friend hyped this place up saying something along the lines of, \"best italian place\" so I guess there was quite the expectation to live up to. Server was nice and told us what the specials were, and I decided to order the beef tenderloin, cooked rare.Came out as 2 pieces around 4-6 ounces each, with a cool red center on both cuts. However for some reason they were burnt, the outside of the steak was had a really bitter taste, but the rest of the steak was good. Not sure if it was a special bitter seasoning they put on it, or they really did burn the steak and served itmy friends ordered pizza and pasta and I tried some of that, and well, it was pretty good, so if you do come avoid the steak! I would recommend the other dishes!", "Date": "2013-07-08", "Author_Location": "Saint Louis, MO"}, {"Author": "Jack C.", "ReviewID": "BrLWKD6lB3UOXIlfUEQ7oQ", "Overall": "4.0", "Content": "This place has great service, and the pizza I got \"babbos\" was the best on the menu in my opinion.  I would come back here for a pizza again.  A bunch of my buddies got the special of the night shrimp rissoto, and I give it a 9/10 and would get it next time.But please stay away from their steak special because my buddy got it and they burnt it and had the nerve to serve it. I like the environment which is more romantic than anything else.  Enjoy", "Date": "2013-07-06", "Author_Location": "Saddle River, NJ"}, {"Author": "Mark P.", "ReviewID": "VH_eP7AWnRBRKYAtshhGOQ", "Overall": "4.0", "Content": "I probably wouldn't have discovered Tavolo if it wasn't for the Yelp International Supper Club.  Sarah made an excellent choice with this one! The atmosphere was perfect for our group of 12 to 14 people and the staff was at the top of their game for our group.  I sometimes feel bad for a restaurant when a large group of Yelpers enter their place, but once they got us seated, there were no problems.  I chose one of the specials of the day, which was a cauliflower soup.  Topped with a crispy thin bread stick, this smooth and creamy soup was nice.  It's probably not something I'd order again, but I'm not usually a cauliflower soup kind of guy.  For my main course, I tried the Pomodoro Pasta with tomatoes, basil, goat cheese, olive oil and garlic.  I usually prefer more of a thick sauce on my pasta, the simple ingredients were very flavorful and light.  One of the perks of the supper club is that people are usually willing to share their plates, so I was also able to sample the Griglia Entree which consisted of grilled chicken and vegetables.  If you are looking for healthy and flavorful, then this is the dish for you.  The chicken was grilled to perfection and the vegetables are seasoned and grilled perfectly.  I also had a bite of spaghetti and meatballs which was delicious.  The portion was so large that you could easily take leftovers of this one.Overall, I really enjoyed my visit and loved the dimly lit atmosphere with the wood and brick feel of this place. I'll be sure to return and sample more of the wonderful looking dishes.", "Date": "2013-12-06", "Author_Location": "Saint Louis, MO"}, {"Author": "Cheryl K.", "ReviewID": "BZFE6-nKtfw2UUW6g4dqLA", "Overall": "5.0", "Content": "Love Tavolo V - True it was beautiful afternoon with blue skies, stratus clouds, and a slight breeze so I was in a very good mood and able to sit outside for lunch. This was my 1st visit and we ordered a Sugo Pizza - lots of meat basically (my dining companion was my Dad)  Pizza was truly good! Crisp crust - seasoned well very generous size.  Fed both of us and had 4 slices to take home.  All for $12.00 bucks.I will definitely go back and try the pastas and other pizzas.", "Date": "2013-09-05", "Author_Location": "Saint Louis, MO"}, {"Author": "Laurie S.", "ReviewID": "1VXw939THD3uPlEMs28jDg", "Overall": "5.0", "Content": "Yummy .. have dined here twice and very impressed!  Great atmosphere, great menu, lots of options for vegetarian and good prices.  One of our current favorites!!", "Date": "2014-01-06", "Author_Location": "St Louis, MO"}, {"Author": "Tricia R.", "ReviewID": "IVnZOYxOD_u4ZpLR7W1dvQ", "Overall": "4.0", "Content": "My in-laws have been raving about this place and recommended it one night for dinner since they knew I am sucha big fan of Sugos.Del Pietro salad - nothing particularly special.  The hubby said it reminded him of the Pasta House...lol.Alfredo - good but not as good as Sugos.  In my opinion, it wasn't as garlic-y, even though I found about 10 cloves in my pasta!Funghi - MiL says she always orders this.  I would be more likely to order it if it didn't have button mushrooms.Chicken scaloppini - pretty good.  Hubby said he liked it.Scallops with risotto (special) - scallops were well cooked. FiL said the risotto was just OK.The bread was delicious and I prob overate due to that.  Be forewarned that this place doesn't take reservations - we arrived around 6pm on a Saturday and were seated immediately, but the place filled up about 30 min later.", "Date": "2013-05-06", "Author_Location": "Saint Louis, MO"}, {"Author": "Stewart P.", "ReviewID": "WukOatbfOBwK7oQBGE9idA", "Overall": "5.0", "Content": "This place is in my top 10 favorites, easily.  I've always had great service, great food (one dish not so great) and I like the decor.  It is my 1st choice when going to a Pageant event.   Ordered this night was the Portabella dish with asparagus, the Field Greens salad and the Babbo Pizza.  The salad was very fresh and tossed very evenly with the dressing.  The portabella was char grilled as was the asparagus spears.  The pizza here is exactly the way I like it ... thin and crispy and service has always been attentive, although this night a butter request needed a reminder.  Excellent bread also, easy to want to eat it all.  Well worth going here at least once.", "Date": "2013-01-11", "Author_Location": "Ballwin, MO"}, {"Author": "Brian R.", "ReviewID": "SCu3ZByAS3MnSsdZol8QAA", "Overall": "5.0", "Content": "Perfect pre concert meal. Shared a delicious tenderloin special with some tasty apps. Service and ambience were great.", "Date": "2014-01-24", "Author_Location": "Capitol, Madison, WI"}, {"Author": "Crystal R.", "ReviewID": "eGEqKHOj9Rp-l6PBFEGcpQ", "Overall": "5.0", "Content": "Well, I had such a fantastic time the last time I went here that I decided to plan a birthday dinner here.  I ended up with 32 friends showing up for dinner....we came on a Sunday at 6pm and took over the place. :)  More and more people started showing up (from my original 25 people) and they didn't get upset....just kept adding more chairs and more tables. It was pure craziness. I took a lot of photos of what everyone ordered and there were no complaints.  This place really has their act together when it comes to large groups.....all 32 of our entrees came out ALL AT THE SAME TIME!!! Our server Christy (I hope that's what her name was) really had it on the ball. Hats off to her and all of her helpers and the kitchen staff.  I ordered the Tutto Marre Shrimp, clams, crab, garlic, tomatoes, shrimp broth, touch of cream, and also the Portobello mushrooms with asparagus and a balsamic glaze. My friend across from me got the Lobster Tail Risotto which was wonderful and my daughter got a mushroom pizza and spinach cakes.....all very yummy.  Everyone got entrees and they were all fantastic.  Check out the album for photos.I had the best birthday here!  HIGHLY RECOMMEND!!!", "Date": "2013-09-10", "Author_Location": "Saint Louis, MO"}, {"Author": "Marlo S.", "ReviewID": "Zfl5BRaKo9Z-7ha9DzJ0ow", "Overall": "4.0", "Content": "Tavalo is a very solid, likable, comfortable kinda place. Nice variety of dishes, most of them thoughtfully prepared. Nothing spectacular or out there, but everything fresh and intelligently spiced. Portions are a bit excessive, but I guess it comes with the territory. (Couldn't you reduce the portion and make it a little cheaper too, guys?) Always go with the family (they're nice to kids and very accommodating), usually leave with the whole clan contented.", "Date": "2013-01-19", "Author_Location": "Saint Louis, MO"}, {"Author": "Hao X.", "ReviewID": "JtH7N-PVDtzXTBfRtkvE4A", "Overall": "4.0", "Content": "My bf's bday is on Wed so his parents took us to Tavolo V for dinner. It had just opened the night before so I was expecting the service to be meh and the food to be decent at best. I was pretty excited when the service was really nice and friendly and the food was scrumptious. Unlike other places with outdoor seating, the flow between indoor and outdoor felt natural due to the garage-like doors that could be pulled open. I could feel both the warm breeze and chilly AC from where I was sitting. Not great for the electricity bill but definitely great for my happiness!We started off with the funghi and calamari appetizers. The mushrooms were tasty and the baby arugula made is nice and bright. I thought there was a tad more oil than I would like in the dish and I wanted more varieties of mushrooms. It was good though. As for the calamari, delicious. Lightly battered rings of squid sat on top of delicious tomato sauce. I loved how they even gave us the tentacles. I really enjoy eating calamari with tentacles. :P We then got some salad (good but not amazing) and some bruschetta. The bread was firm but good and the tomatoes on top were flavorful. There were real slivers of basil and that made the entire dish perfect for me. As for an entre, the bf's dad and I got the risotto of the day (crab and shrimp with asparagus), my bf got the lasagna, and the boyfriend's dad's wife got the cannelloni. I enjoyed my risotto but it was a bit more brothy than I'm used to. I thought the crab flavor could be a tiny bit stronger. The asparagus was perfect. I had some leftovers, so I took it with me and ate it for lunch the next day. Wow. It was so good when I reheated it, I gobbled it all up. My guess was that it was good but I was just too stuffed on appetizers to realize it the night before. As for the lasagna, I had a bite and really enjoyed it. My bf loved it and dug in with so much gusto. He had some leftover too -- which is a pretty good indication of how much food we had. The cannelloni looked really tasty and the bf's dad and dad's wife were trying to identify the filling. I think they decided it was spinach and ricotta. They were pretty blown away by the flavors. It ended up being about $125 for four of us including tax and tip. That's 5 appetizers and 4 entres. not bad.", "Date": "2012-04-02", "Author_Location": "Saint Louis, MO"}, {"Author": "Chip K.", "ReviewID": "smqN6IW751m_2mtMOwwdMw", "Overall": "5.0", "Content": "Tavolo V is owned by the Michael Del Pietro Restaurant group, which owned Del Pietro's (RIP), and now owns Sugo's Spaghetteria and some other restaurants.  Of the restaurants they currently own, I had only been to Sugo's, which I thought was just all right.  So I didn't have the highest hopes for Tavolo V.Fortunately, I was proven wrong.Their beer list wasn't particularly large, but it had a couple of interesting choices.  I got a 750 ml bottle of Perennial's Saison de Lis beer, something I had never tried before.  I'm really not a beer connoisseur, so I had to ask the waiter what a Saison Ale was like.  I don't recall the description, but it intrigued me and I ordered it; it matched Wikipedia's description of a \"refreshing summer ale.\"My wife and I split an order of calamari, which was interestingly served on a bed of extremely chunky tomato sauce... so chunky it would barely be called a sauce, really.  I thought the calamari was quite good and the sauce, which had a definite kick, was excellent.  Even my anti-tomato wife was a fan.We also split a Caesar salad, which was $6, really huge, and really quite good.  One of the better Caesar salads I've had in recent memory.For her entree, my wife ordered the Tavalo V Pizza (olive oil, spinach, artichokes, tomatoes, mushrooms, mozzarella and goat cheese) which for $12 was a surprisingly large pizza.  I didn't get a bite, but she really liked it.For my part, I ordered an off-menu special (there were several) of lemony risotto with gulf shrimp.  I'm a sucker for risotto, and this didn't disappoint; the shrimp on top were quite big and tasty.There was a kitchen mishap and my entree ended up coming out later than everyone else's; to compensate, they brought me some complementary bruschetta which was a nice touch and also quite tasty. All in all, I found Tavolo V to be a welcome addition to the loop and a great member of its restaurant family.", "Date": "2012-05-19", "Author_Location": "Saint Louis, MO"}, {"Author": "Travis W.", "ReviewID": "_k7b6AhToQ8_d3wpaTF59w", "Overall": "4.0", "Content": "Stopped in here while traveling and really liked the feel of the place initially.  It had that shabby chic feel to it with repurposed barn wood interiors and raw materials on the walls like corrugated metal paneling.I had the Alaskan halibut special that was served on a mound of sweet corn couscous.  It was delicious!  Service was prompt to the table and kept checking on our party to make sure the wine was restoked and needs taken care of.I would highly recommend this to those in the area looking for a relaxing yet not to up-itty style place.  You can come in, in jeans or business attire.  They really cater to both and all crowds.", "Date": "2012-07-24", "Author_Location": "Charlotte, NC"}, {"Author": "Alex H.", "ReviewID": "U4SsT9SlNx5gqA6PP97NoQ", "Overall": "5.0", "Content": "All I can say is wow. I wish there were more stars to give. I went here with my dad and his girlfriend for my 19th birthday on Saturday night and everything was amazing. Our waiter was excellent (I wish I could remember his name), very helpful and knowledgeable about the menu and specials, and the pace of the meal was perfect for us. I am a server myself and I was truly amazed at how effortlessly and seamlessly all of the servers seemed to handle 5-6 tables at a time, including large parties. All of this by itself would have kept me coming back for more, but let me tell you about the food!Everything was absolutely excellent. Cold foods served extremely cold and hot foods served extra hot. Each dish was a perfect blend of ingredients and flavor. The bruschetta is an excellent appetizer or salad choice. I ordered the clam chowder, which was a special for the night. I was reluctant to order it because I'm not really a fan of clams or seafood, but the way the waiter described it made it irresistible. It was AMAZING. It was garnished beautifully when it came to the table, piping hot and full of flavor, and to my surprise the clams were tender and juicy, not dry and chewy like I've had before. My dad got the chicken alfredo, which was simple yet very delicious. His girlfriend got the spaghetti and meatballs. The \"meatballs\" are actually like 2 big baseballs on top of spaghetti. That was also an excellent, classic dish. For dessert, we were offered a free piece of tiramisu for my birthday. I had to accept even though I was full because I knew it was going to be good. Tiramisu is always my dessert of choice, and this was the best I've ever had. It was served unusually cold, and this seemed to make it 20x better than anything else I've had. It was so creamy and delicious, the perfect combination of flavors and textures. I was so impressed.I think my favorite thing about this restaurant (besides everything I've already mentioned) is how they manage to create such an excellent experience while maintaining such simplicity in everything from the unique, understated decor to the amazingly flavorful entrees. Like someone before me said, Tavolo knows how to do it. This place has become my new favorite restaurant, and I will be coming here every chance I get.", "Date": "2012-12-12", "Author_Location": "Saint Louis, MO"}, {"Author": "Lesley B.", "ReviewID": "SLpwvao9RnH9XQ0pEwFrVA", "Overall": "2.0", "Content": "Tavolo V was like going on a first date with someone who vaguely reminded me of someone I used to really like, but then being totally over it by the second date. I tried Tavolo V a month or so ago, and it was ok, but I was inspired to give it another go and try the pizza. Meh, not really impressed. There are lots and lots of better pizza (and Italian) places in the city. The beer list is also really lackluster, so don't expect any good, local microbrews.I will say that I liked our waitress, she was really nice. There was an awkward moment where she got the cold shoulder from what I'm assuming was the manager. It happened behind the scenes, but I think he was upset with her because she didn't bring us a box for leftovers for awhile. We were really happy just hanging out, so I was a little miffed by his coldness to her.Either way, I don't think it's really going to work out between us. Gave it a fair shot, but just didn't click.", "Date": "2012-05-23", "Author_Location": "Saint Louis, MO"}, {"Author": "Jeff F.", "ReviewID": "eoRwXj2aHDVIoQn7LpPtwQ", "Overall": "5.0", "Content": "Well I have dined here over seven times in the last 4 months, for lunch and dinner. Tavolo has it down. The lunches are served promptly and the chicken main dish is consistently perfect. The pizzas are more the flatbread type, and quite large, maybe enough for two with side salads. On one evening visit, several likely musicians and rock stars were at the bar, before a concert at the nearby Pageant. There is outdoor dining with decent shade from the umbrellas. The parking is fairly easy on the street unless the concert crowd is in full force. They offer a private lot, immediately to the east of the building. Overall, the service is prompt, you don't have to ask for drink refills or search for the server. I am told they do not even have a large freezer, since the chef only purchases fresh seafood daily and they chose not to do the typical frozen fare. The menus not huge, but overall one can have a lot of fun, they are not fazed by large tables of kids, and if it's a romantic date , one can opt for a table to the sides or front.", "Date": "2012-07-24", "Author_Location": "Saint Louis, MO"}, {"Author": "Curtis H.", "ReviewID": "-6LIf8n8MhcE_x-Kk2mo7w", "Overall": "3.0", "Content": "A couple of us ate here last night and had a decent dining experience. The roasted cauliflower is very yummy (as previous reviews had mentioned). The spaghetti and homemade meatballs (which are massive) are a delight. My dining companion ordered a chicken dish that was average tasting. Their wine list is decent, and my friend's cocktail was delicious. Unfortunately the dessert (a fried Italian doughnut that was supposed to be filled with a chocolate cream) was an epic failure. The server asked if we liked it and we made it clear that we didn't. She very kindly had it removed from our bill and said that she had spoken to the chef about its quality. I would come back and try some other dishes. I think this place is worth a visit especially based on their customer service.", "Date": "2012-12-28", "Author_Location": "Chicago, IL"}, {"Author": "Alicia O.", "ReviewID": "oOhsaqlMWCKzPCr774Fv_g", "Overall": "5.0", "Content": "The food was good, but the service was even better thanks to our waiter, Tobin.", "Date": "2013-09-05", "Author_Location": "Chicago, IL"}, {"Author": "Jody G.", "ReviewID": "a7xLki4cFYpbi83h5-nqkg", "Overall": "5.0", "Content": "Massive portions for a great price!! This place has several specials per night, including a risotto special offering. This is a great place to meet friends for dinner because of the open atmosphere. The pizza is also phenomenal.  I highly recommend this upscale casual Italian eatery!", "Date": "2013-11-10", "Author_Location": "Saint Louis, MO"}, {"Author": "Erin M.", "ReviewID": "oanxEdbXXZt_wX9IW_cG0w", "Overall": "5.0", "Content": "Went to Tavolo V directly before a show at the Pageant - perfectly convenient spot for a pre-show dinner. Service was speedy, attentive and friendly. The place has only been open a month or two and the server knew how to describe each menu item well, made great recommendations and knew a lot about each item on the beer and wines list. The canneloni bites appetizers were over the top amazing - something about the tomatoes on top really add a punch of flavor. We all enjoyed our extra large servings of pastas. Each dish was full of flavor and resulted in \"Mmmmms\" around the table. No complaints at all.Best part about this spot -- the ambiance. It's a super-hip warehouse-esque interior. Must have been a former fire house or garage because they had the remodeled garage door open to the dining room. When I walked up, I worried it would let in too much of the summer heat, but seated indoors, somehow the A/C kept us totally comfortable while still enjoying the breeze from outside. Well done, Mike Del Pietro!", "Date": "2012-06-11", "Author_Location": "Saint Louis, MO"}, {"Author": "Ryan S.", "ReviewID": "NcbbeRgJwoxl9SoSmDJ62g", "Overall": "5.0", "Content": "Excellent quality Italian food - especially their risottos. Very reasonable price matched with an excellent ambiance earns this 5 stars. A great spot for dates.", "Date": "2014-03-17", "Author_Location": "Saint Louis, MO"}, {"Author": "Paul B.", "ReviewID": "pfXUIDeaP-DaytRCwppGxw", "Overall": "4.0", "Content": "As we were leaving, my mom asked how long Tavolo had been open; they said April. I had no idea! I wish we had found out sooner, because this is a totally solid place for dinner.I liked the decor right when we came in. It was cold today, but I could see how the garage door would be a great fourth wall-breaker in the spring/fall/part of the summer. But it had a great atmosphere.The food won me over right away, with the really good bread that they serve as an appetizer, with olive oil and parmesan cheese. I've been at a few places that offer olive oil in place of butter, and I always think its a great idea, but the parmesan makes the flavor something really special.I'm sorry to say I ate far too much tonight; it was my first time in there, and I wanted to try as many things as I could. I had the potato soup, and a pizza, where the potato soup is a meal in itself, and the pizza is a meal for two! (No problem; cold pizza works fine by me.) The soup was excellent. It was only a soup of the day, but I really enjoyed the Italian bacon and the touch of pesto. It was a really great way to sort of give a little surprise to an old favorite.The pizza was also really good. I'm going to try the pasta next time I can come in (the meatballs sound very nice) but the Sugo's, or meat pizza, was just fine for tonight. Its a nice, crispy dough, with a bit of chewier crust, and good sauce to balance out the meat and cheese.And, of course, the dealbreaker for me is always the service, which was great. There's nothing that can improve a good meal than friendly, fast service; of course the opposite is also. The waiters here were cheerful and attentive.I'd probably end up giving Tavolo V \"V\" stars (Heh heh), but this was only the first time, and I want to sample more of their wares before making a final decision. I look forward to the next visit!", "Date": "2012-11-26", "Author_Location": "University City, Saint Louis, MO"}, {"Author": "Kerry B.", "ReviewID": "B8zBuAHCd1U_L2cMeBFWLg", "Overall": "4.0", "Content": "Living nearby, I can't believe we haven't gone here earlier. What a treat! They have a rotating tomato dish of the day which was fresh and delicious. My boyfriend ordered the fish of the day and was extraordinarily pleased. I had the fra diavolo pasta dish (after being completely torn between it and Babbo's pizza! oh decisions!) and it was great. I only wish that they made their own pasta, it was the only thing that would have made it better - it would definitely have 5 stars then. The service was also great, add that to the fresh food, and nice ambiance - a great date place or dinner with friends. Enjoy!", "Date": "2012-07-15", "Author_Location": "Saint Louis, MO"}, {"Author": "Lydia L.", "ReviewID": "q3ToFkr_H73I9CPwzxJ4IA", "Overall": "3.0", "Content": "3.5 stars. Greeted and seated promptly. Service was fine. My wine pour was weak...more like a 2-3oz. pour. It was probably the bottom of the bottle.I love neopolitan-style pizzas, and Tavolo did not disappoint with the Babbo's.  Plenty for a single entree or to share with somebody + salad/appetizer.Also had the tutto mare pasta, which was generously portioned and great for sharing.  Good entree.  Food deserves a 4, and I would return, but the servers seemed apathetic and slow.", "Date": "2012-10-01", "Author_Location": "Saint Louis, MO"}, {"Author": "Benjamin S.", "ReviewID": "fs2egy7f_sCRiwFDyp8OYA", "Overall": "4.0", "Content": "Tavolo is a very nice addition to the Loop.We're regular patrons of the area, and it's great to have a new spot extending eastward in the district.  Much as with Nico recently opening on the West end of the Loop, both are a little pricier and a little classier \"bookends\" than the dining options which reside in-between them.The two dishes we tried were the lasagna and the risotto of the day, which was shrimp/tomato/parmesan.  The lasagna was a large portion, and tasted fresh without being overly decadent.  The risotto was nearly perfect; al dente with great flavors coming from each ingredient.Service is pretty friendly and fast.  I saw plates arriving at other tables steaming hot, which is crucially important to me as too many restaurants let good food wither-away in the kitchen windows.  They operate as if they know what they're doing here.My only \"minus\" would be that the prices are a bit on the higher end.  Two people, two entrees (no salads), and two drinks will run you $50, which is not outrageous, but definitely not cheap.That said, I'm sure I'll return again to Tavolo.", "Date": "2012-09-22", "Author_Location": "Saint Louis, MO"}, {"Author": "Lee a.", "ReviewID": "Zh3i2bnG4mkm-Mw6EpOHzw", "Overall": "5.0", "Content": "Best restaurant on the Loop along with Ranoushe. Casual but nice. Never had a bad item from the menu.", "Date": "2013-09-29", "Author_Location": "Saint Louis, MO"}, {"Author": "Sergi T.", "ReviewID": "j2ZBc267lpssIiFDXSRr9w", "Overall": "4.0", "Content": "The roasted cauliflower appetizer was terrific...even the kids liked it. The pizzas are huge and delicious also. Make sure to bring a hungry appetite.", "Date": "2013-09-07", "Author_Location": "Saint Louis, MO"}, {"Author": "Anita K.", "ReviewID": "Zj0_-MFE9gUJvYj5ZwJsUw", "Overall": "4.0", "Content": "Tavolo is a newer, inviting, rustic Italian place at the very east side of where the Loop ends...for now.  Props for taking that chance to keep extending eastward and improving our city! Walking in the door you are greeted by those delicious and comforting Italian aromas of herbs, baking bread & pizza, and lots of garlic.  It manages to be warm and cozy even though it is quite spacious, by using lots of wood and warm colors like oranges and browns.  The bar area is plenty spacious for a meal, so that is where we headed.  Water and bread service appeared promptly.  The bread was outstanding- warm and soft on the inside, crispy crust on the outside.  Very high quality olive oil and parm accompanied.  I had to stop myself after two pieces, but I really wanted to keep going!  We had several delicious starters- roasted cauliflower, grilled asparagus & portobella, and lightly sauteed artichoke.  All delicious, but the cauliflower was a standout being perfectly roasted with lemon and parmesan to balance the earthy flavor.We each tried one of their neapolitan style pizzas for dinner.  This style is served on a flat, crispy crust that is almost cracker-like and full of flavor from the simple yet superb quality oil and flour.  Mine was the Babbo- tomato sauce, sausage, caramelized onions, mozzarella, fresh oregano, and a balsamic glaze.  Wow- what a stunning flavor combo!  We also got the funghi- olive oil, a mix of mushrooms, mozzarella, and truffle oil.  Pretty much anything with truffle oil is outstanding, and this was no exception!  We washed all of this down with an excellent, reasonably priced Oregon Pinot Noir.  I noticed they also had a great beer selection, bottle and tap, plus all of the prerequisite liquor for all types of cocktails.  Our bartender was friendly and attentive throughout the meal.  Looking forward to a return trip!  I hope they have outdoor seating for the warmer weather.", "Date": "2013-03-18", "Author_Location": "Saint Louis, MO"}, {"Author": "Shawn P.", "ReviewID": "SVBZkCFXvU2Ei_DMbh5rCw", "Overall": "4.0", "Content": "Had the mushroom pizza and it was superb!  Got the fried artichoke app, it was really tasty with the sauce/dip, only problem was it was 5 tiny little pieces, overpriced for what you get.  I would go back.", "Date": "2013-07-19", "Author_Location": "Saint Louis, MO"}, {"Author": "Stan S.", "ReviewID": "70C74_vCFhI7FrICvmo0OQ", "Overall": "4.0", "Content": "Even though I live in U City and pass by it all the time, I somehow have not gotten around to visiting this place. It's a real gem in the Loop choices of places to eat. My group had a range of starters, from the steamed mussels to the cauliflower to the calimari. The mussels and the cauliflower were excellent, the calimari needs some work, but was not terrible, just ok. In terms of the mains, I has the mushroom pizza, its Neopolitan style, very thin crush and the cheese and wild mushrooms were super yummy. In our group the pork chop was large and very moist and everyone seemed to enjoy the evening. The lassagna was this large brick of goodness. The service, I thought was top rate, excellent job and they know their wine here too. If your in the Loop, this is a great choice for Italian.", "Date": "2012-11-17", "Author_Location": "St Louis, MO"}, {"Author": "Melissa M.", "ReviewID": "Ikqg-HZZ0W6COWC4R_G0Vg", "Overall": "4.0", "Content": "Oh boy, that was good. Lunch special is half salad and half pizza or pasta. The field greens salad was simple but flavorful. 4 pieces of Tavolo pizza made for full meal.  I like the atmosphere here, especially on a nice day when they open the floor-to-ceiling doors to the outdoor seating area.  Delmar Ave. makes for good people watching.", "Date": "2013-02-14", "Author_Location": "Maryland Heights, Saint Louis, MO"}, {"Author": "Robyn A.", "ReviewID": "GM9xF4qpm8-yiyq1h8_-nQ", "Overall": "2.0", "Content": "Italian in the Loop with its own parking lot!!  how can it go wrong...well it can.  nothing, major i think i just ordered incorrectly- i saw a pizza and it looked great.  should have went that route.  i got the del pietro salad and its big chunks of iceberg (a lot of \"core\") and the dressing is lackluster...not enough vinegar?? not sure its just okay.   i got the special Beef Tenderloin and nothing special about it.  not bad not great.  My friend said her chicken picatta was good.  the pomodoro was a little watery.  all is well enough until we got to dessert.  DO NOT order the banana bread with chocolate chips.   its cold, dry and under 3 heaping tablespoons of dry cinnamon.  ??? bad.  we all had one small bite and quit on it.  the waitress didn't really seem to notice.  one of those who goes by your table \"is everything okaaaay?\"   and is not really asking but already 3 steps past your table having assumed you said yes.   she eventually comp'd the dessert though we told her it wasn't necessary, so that was nice.   all the other staff coming to our table were very nice.  i think she was just in the weeds or something.     i like the place,  i'll try it again but stick to the pizza and skip dessert.   its loud in there.  which i normally like but in this case i felt like i was on an airplane where everything is muffled and you end up kinda yelling.     but hey, free secure parking thats a big plus!", "Date": "2014-04-10", "Author_Location": "Saint Louis, MO"}, {"Author": "Hulya K.", "ReviewID": "RrEkYG8M8InyDWMYzDfyNg", "Overall": "2.0", "Content": "Yesterday night, right when we were on our way to Pi, we saw this new place and decided to give it a shot. We ordered calamari and salad to share. Salad was okay, but nothing special to it... But calamari was a total failure, the worst calamari I had in St Louis. It was very very chewy... The place did not strike me as a place for young people, it was full of people well over 45 years old. Which was surprising to me. I do not plan to go back.", "Date": "2012-04-08", "Author_Location": "Chesterfield, MO"}, {"Author": "Katie K.", "ReviewID": "-3hjCVuLQuQitbyBrdd1_A", "Overall": "5.0", "Content": "We came here with a larger group for ISC and still managed to have good service. Our drinks were always filled, the bread came out warm, and there was no awkward pause in between courses.  The mood was friendly and light throughout the entire restaurant.  I had the risotto with lobster and prawns. The risotto included corn, spinach, and tomatoes. It was cooked perfectly. Great flavor, great texture. My only complaint would be about the awkwardness in regards to removing the shells. I wish they would have done it for me in the kitchen and added back into the shell (for presentation of course). Their menu is very decently priced unless you get a special...mine was $25 but my boyfriend's lasagna was only $12. My wine was $9 and it was one of the lower priced options. All in all I would recommend this place to anyone to loves Italian or just looking for a new spot for old friends. We will be going back and bringing company with us as well!", "Date": "2013-11-11", "Author_Location": "Market East, Philadelphia, PA"}, {"Author": "Dotty R.", "ReviewID": "tXlFb7_JYTH66oeU6fBzKA", "Overall": "2.0", "Content": "Humm, tip is do not come here hungry, thirsty and ready to eat. The wait for service is unacceptable. Vince and I went inside, we were seated and given menues. However, no one came over to our table to ask us for our orders until 10 mins, which at this time I was a little teed off and ready to go. What gives, this a FRIDAY NIGHT! People are ready have a drink and relax after a hard work week, LOL. Anyhoo, a guy finally comes over and take our order. Vince order a dirty martini (bad, bad, bad) that wasn't even dirty and I order a GG and vodka. The guy didn't ask Vince what type of vodka he wanted either, LOL. That's always a sign of bad bartending. But when the guy came back to tell me they did have GG, but only carried two vodka's, one which was Ketel One, I told him \"okay, but make his martini with Ketel one as well\". We also order calamari, which wasn't nothing to write home about; bit overcooked in some areas. Nevertheless, I was not happy with their service or food, so we left and heading down towards the other end of the loop to eat. I heard this place was good, but I wasn't sold on it.", "Date": "2013-07-23", "Author_Location": "Saint Louis, MO"}, {"Author": "Amy V.", "ReviewID": "6eHy5W64xMMpwE_dZfspQg", "Overall": "5.0", "Content": "5 Stars for going above and beyond to ensure we were happy with our experience.OK. So, I think the reviews are so mixed on this place because it really depends on what you're looking for. This is updated, lighter Italian, and very vegetable based, which for me is perfect, especially in the summer. I honestly don't like old school St. Louis style Italian (I'm from New York) and there is no way I really want to eat lasagna in June, so Tavolo V turned out to be a perfect choice last Saturday.The interior is cool, very rustic industrial. They don't take reservations, and the place was bustling, but we were seated in about 15 minutes on a Saturday evening at 7:30. So, perfect. Our server was... fine, nice... but sort of... rough. Haha. I don't know how to describe it. For example, I don't ask for a lot of fuss with my wine service, but the way he slammed open the bottle, splashed the entire thing into four glasses, and then whisked it away had us laughing. It didn't really bother me though. Overall, the service was good down to the little things, like empty plates removed promptly, etc.The food... I really liked it. For appetizers, we ordered the bruschetta (perfect,) the tomato salad of the day (delicious,) and the spinach pancake, which was interesting and had a homemade vibe I like, but was also rather dense and heavy, and could have used some sort of sauce or accompaniment, in my open. I had a really hard time deciding what to order for an entree, but opted to try a pizza since my boyfriend was getting a pasta. I tried the Mars, because I wanted something with artichoke hearts, and it was delicious. Again, I think this depends on the style you like. This pizza is thin, wood fired, light on sauce, delightfully crispy/chewy, and I love that. I preferred it to The Good Pie. Compared with Pi, it's simply different, that's all. I love a lot of different sorts of pizzas. The pastas I tried were also good. Very simple, highlighting the vegetables, with light broths for sauces. Nice, but could be a bit boring for some. I was more impressed with the apps, salads, entrees, and pizzas, but I will try more pastas if (when) I go back. Now... the reason Tavolo almost lost a star, then earned it back. Our appetizers came out promptly, but the entrees took far too long. We were chatting with another couple, enjoying our wine, so it honestly wasn't a huge deal, and we didn't complain or anything, but the wait was becoming excessive. However, when our food arrived, we were told that our bill was being discounted by 50% because of our wait time. Even when we said that wasn't necessary, our check arrived with the 50% discount... on everything. Everything. Not just the late items, or just the food. Our drinks, wine, appetizers, and entrees were all discounted. I was truly impressed. Good job Tavolo for recognizing a problem BEFORE a customer complaint and making it more than right. I will definitely be back!", "Date": "2012-06-20", "Author_Location": "Gravois Park, Saint Louis, MO"}, {"Author": "Katie L.", "ReviewID": "VnPjA46jEY46UUyFXM7reQ", "Overall": "5.0", "Content": "My whole family (9 of us) went here for my little sisters birthday last night. She lives in University City and had been there before. The rest of us had never even heard of the place. At first there was nobody in the restaurant and I was not getting a good feeling about it. But we did get there at 6, which is kind of early. Plus, it was a Monday night.  We were there for about 2.5 hours and by then place started to pick up a little bit.Plain and simple, I can't wait to go back to this place! I really wish that I had leftovers for lunch today. One of my sisters and I got the pizzas and everyone else at the table got pasta. We only walked away with one pizza togo box and one tiny little pasta togo box. Everyone scarfed everything down! We got the cannelloni, the Alfredo, pomodoro, lasagna, a seafood entree and 2 other dishes. All came out beautiful and all went down the hatch with delight. The wine and beer list was good. I would have maybe liked 1 or 2 more house wine options that didn't cost $8-10. All of the cheaper wines ($7) were sweet wines. There are a few brewers in my family and they can be snobs about what they drink. They had no issues finding a drink to their liking and then ordering a second. The service was great. Our bread (so yummy!!!) and drinks came out immediately. The salads were soon to follow and I was impressed with the pasta and pizza delivery. The deserts were pre made so they came out within seconds of us ordering them. All dirty plates were removed literally immediately after getting down that last bite. I will be returning to this restaurant!", "Date": "2012-10-09", "Author_Location": "Bridgeton, MO"}, {"Author": "Amanda C.", "ReviewID": "5JuPFL8Y1iRHO5NrYvzKkQ", "Overall": "5.0", "Content": "My husband and I tried Tavolo V for the first time, and we were beyond impressed with everything. It has officially become my new favorite restaurant! Our waiter, Toby, was fantastic. The food came out extremely quick and everything was unbelievably delicious. It was so refreshing to go to a restaurant with so many vegetarian options listed. We had three different appetizers, cheese ravioli, brussel sprouts and baby artichokes, and each one was amazing. My husband is a vegetarian, and craves for fried chicken, and the artichokes were a spot on replacement. The coating tastes just like the best fried chicken coating you've ever had. We also took in a few of their signature cocktails, and each one was better than the next - beware they are strong! Overall, I couldn't have asked for a better experience. From the food and drink, service, décor and even the music selection, it was tops across the board.", "Date": "2013-05-18", "Author_Location": "Saint Louis, MO"}, {"Author": "Kim C.", "ReviewID": "5RrkHLI47Ng8xcbI5sVz-g", "Overall": "2.0", "Content": "We went last night very excited to try a new place in the Loop.  The space is great and they have a rare parking lot!  Unfortunatley, the food was not good.  I had roasted cauliflower pasta that had virtually NO flavor.  The broth was watery and tasteless.  I asked for some cheese and added that along with salt - barely edible.  My daughter's (13 yo) alfredo was also watery with little flavor.  She ate the chicken out of it.  My son (19 yo) had the Sugo pizza.  While it looked good, it was not very good.  He was less than impressed.  I also found it interesting that no one asked us if our food was good.  As much as we wanted to like the place, we will not go back.  That was a $50 mistake!", "Date": "2012-06-11", "Author_Location": "Saint Louis, MO"}, {"Author": "Michael L.", "ReviewID": "IZ5rTNQNZDRb7oU7U_I9OA", "Overall": "2.0", "Content": "Liked the atmosphere and service....our food was very average at best - chef needs a few lessons", "Date": "2013-04-27", "Author_Location": "Saint Louis, MO"}, {"Author": "Hilary P.", "ReviewID": "QEpGXg8ZxFRNdVtgl5eJHw", "Overall": "4.0", "Content": "Great new restaurant in the loop!  We sat at the bar and ate a delicious pizza.  The bartender was extremely friendly and entertaining.", "Date": "2012-05-21", "Author_Location": "Saint Louis, MO"}, {"Author": "Caroljeanne Y.", "ReviewID": "qbOb5jPju2JuPTLNrWojdg", "Overall": "4.0", "Content": "Very pleased with our dinners.  I ordered two classics.....Caesar salad and spaghetti with meatballs.  Salad was EXCELLENT; fresh lettuce, home made croutons, home made dressing.  Huge and tasty meatballs.  Overall great execution of two dishes that can be trite.  Good service, nice setting, noise level not too obnoxious. I will go here again.  Maybe pizza next time...it looked good.", "Date": "2013-01-27", "Author_Location": "Saint Louis, MO"}, {"Author": "Jennifer F.", "ReviewID": "1pHO1k-vDI8MSouN22zgDg", "Overall": "4.0", "Content": "I went here last week with a friend, and was very happy with the atmosphere and the meal.  The server was friendly, knowledgable and fast.  They serve bread and olive oil while you are waiting for your meal, and both were delicious.  The olive oil was some of the best I've ever tasted.  We got the roasted cauliflower for an appetizer, very good.  I had the mushroom pasta for my meal and a glass of wine, both were great. They also have a big glass garage door that can be raised when the weather is nice and patio seating.   I'm thrilled to have another nice restaurant in the Loop since I live nearby.  The only thing that might bother some people was the noise level, the restaurant has concrete floors and walls and an open kitchen, so it was fairly loud.", "Date": "2012-07-17", "Author_Location": "Saint Louis, MO"}, {"Author": "Eric S.", "ReviewID": "YPA5OvhmA9S_AGO_GTsjdA", "Overall": "5.0", "Content": "Tavolo V is my one of my favorite places in St. Louis! The staff is the most friendly and great looking people in the area and you cant get a better deal on specials than they have here. Whether it is lunch or a nice dinner, this place can offer you everything! The Pazzo's pizza is amazing! Ryan is one of the best managers I've met in the area and couldn't have had a better experience!", "Date": "2012-12-20", "Author_Location": "Tempe, AZ"}, {"Author": "David S.", "ReviewID": "r_lSeHePlgC1HPJ2eLHEvg", "Overall": "4.0", "Content": "Party of 8.  Great server, mary, kept our glasses filled and served our food quickly.  Apps and dinners were presented nicely and, more importantly, tasted great.  The bartender was a great guy also.", "Date": "2012-08-26", "Author_Location": "Saint Louis, MO"}], "RestaurantInfo": {"RestaurantID": "_h9jkew01iNs-KAbkVDgaQ", "Name": "Tavolo V", "Price": "$$", "RestaurantURL": "/biz/tavolo-v-saint-louis", "Longitude": " -90.29683509999999", "Address": "6118 Delmar BlvdSaint Louis, MO 63112", "Latitude": " 38.655157799999998", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/tX7Gu1o1lOBIP8Hv24cuPQ/90s.jpg"}}