{"Reviews": [{"Author": "Mike B.", "ReviewID": "HPeKS3J8CMcqZneRFBvuZw", "Overall": "5.0", "Content": "Hands down my favorite lunch joint on the Twin Cities. Being a vegetarian, the only frustrating thing is trying to decide which delicious entree to order--they all look so good. I would recommend the tempeh sandwich (comes topped with lettuce, tomato, peppers, and veganaise). Also, for breakfast, their breakfast burrito is the best breakfast burrito I've ever had. And I tell them that every time I'm in there to get it.They've also got a modest yet tasty beer and wine selection. Also, in back, they have all-natural products that range from soap to essential oils and everything in between. This place is serene and calm and perfect. If you're a hippie or lover of the earth or care about hand-crafted products from people and brands that care, or just want some good food, go here. NOW. :)", "Date": "2014-06-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Cassandra B.", "ReviewID": "LaqV62p5ZwZaZVA_AuFdlA", "Overall": "3.0", "Content": "I'm a little torn on this rating, but my table's food experience was so uneven it'll have to land in the middle.  The good:-A new place to take my food fascist mom!  She was excited about the whole organic, natural thing and gluten free options.  -I loved my turkey avocado sandwich!  The turkey was local from Kadejan Farms and was thick-cut rather than shaved.  I chose a mixed green salad with it that was pretty standard.  However, I will say that $11.50 is a bit too expensive for a sandwich and side for me.  I guess it includes the premium of eating a turkey that lived on a happy little farm before getting the ax.-Great options for vegetarians/vegans.-Adorable space!  The patio, the cafe, just precious.The not good:-Everyone else at my table got the cup of soup and half sandwich deal.  They all got the soup de jour, tomato basil, with grilled cheese (each choosing a different kind of cheese).  This was not nearly enough food.  The half sandwiches were very small and quite thin and the tomato basil was just bland.  I tried it.  Bland.  -The half sandwich you can get with the soup seems pretty limited, like you can only get cheese or avocado or hummus or something, not any specialty sandwiches, just one-ingredient sandwiches.-Very limited meat offerings, if that's your thing.", "Date": "2014-06-30", "Author_Location": "Minneapolis, MN"}, {"Author": "Andrew C.", "ReviewID": "dn22Z5LfoydhpKAsX7lr0Q", "Overall": "4.0", "Content": "Black bean & brown rice Quesadilla and open faced breakfast sandwich were both excellent. The salsa that accompanied the quesadilla was especially fresh and flavorful ( it was also thankfully, not too spicy, as I am mostly Norwegian).Free radical smoothie was also very refreshing and I highly recommend them. Excited to check out the date night special next time !", "Date": "2014-03-30", "Author_Location": "Plymouth, MN"}, {"Author": "Britty G.", "ReviewID": "jK0Og_ZFoQ5KCbu84A3UyA", "Overall": "2.0", "Content": "My friend and I really wanted to like this place, but our experience nipped our \"regular\" status in the bud. We waited at the counter for several minutes before being acknowledged, despite 3-5 people working behind the counter at 3:30 in the afternoon. My Gal Pal ordered first and after taking her order the man was nowhere to be found and I stood there for another couple minutes before being asked if I was ready. (Note, I was standing there with cash in my hand right behind her in line the entire time). Gal Pal ordered:  - Half avocado sandwich and a cup of soup.- The ACME juice (Carrot, beet, apple, ginger) I ordered: -  The 1/2 Doozie salad - The Lean Mean Green Machine juice  (Cucumber, kale, celery, parsley) The place was pretty empty and quiet, again 3:30pm. We sat at a table and after about 10 minutes my juice came out. The glass must have been freshly out of the dishwasher (good, I guess) but that meant I was drinking a lukewarm juice out of a HOT glass. Pretty gross. Maybe I just can't keep up with the hipsters, but I felt like I was drinking a warm glass of grass. Another 10 minutes goes by and our food finally comes out. Again, soup/salad/sandwhich at off-peak hours taking 20 minutes? Wth? Gal Pal kindly reminds the Server Man she never received her juice at all. Server Man blames it on the Juice Guy. Once delivered, Juice Guy blames it on the Server Man. Whatever. Gal Pal also points out her avocado sandwich is actually what appears to be a Tuna Sandwich. Server Man corrects her and says it is actually a Turkey Sandwich. OK.....? She just requests an avocado on the side because at this point we're OVER this place. She sips on her overly gingered juice that tastes like soap.PROS: - The hummus that came with my salad was delicious. - At my next hipster party I can say I once drank a warm $6 juice cause I'm so healthy.", "Date": "2014-03-13", "Author_Location": "Minneapolis, MN"}, {"Author": "Jessica S.", "ReviewID": "woVBJYRDuC1xqhNtZYAegQ", "Overall": "3.0", "Content": "I love me some good-for-you food. But, at a certain point, healthy just does not cut it. Case in point, my nearly $11 salad (The Doozie) was uninspired and merely an assembly of simple ingredients (mounds of lightly dressed lettuce, raw white onions, a blob of guac, a scoop of hummus, a small pile of brown rice, and a handful of plain black beans) whose organicness just did not justify the price. I am highly incompetent in the kitchen, but could have thrown together something identical for a fraction of the price.  The Doozie is really a Doo\"not\"zie. Some other items I've tried are more flavorful, but still not much of a departure from mediocrity.", "Date": "2014-04-22", "Author_Location": "Minneapolis, MN"}, {"Author": "julie ann s.", "ReviewID": "t5qoYwKrTiwv9P4D91SMdg", "Overall": "4.0", "Content": "great food. fun ambience. just slower service.  Patience.  It's worth it.", "Date": "2014-07-15", "Author_Location": "Minneapolis, MN"}, {"Author": "R. J.", "ReviewID": "0Zt2Nh7e5BMvloSMyMwy7Q", "Overall": "4.0", "Content": "A nice little spot with delicious healthy food at their cafe and a very small health food store attached. I went here twice - had the macrobiotic avocado plate which was predictably bland but healthy and good. I also tried the sweet potato burrito which was amazing. I would really recommend getting that. The burrito was perfect in size (not too big) and you get to pick a side dish - anything that is fresh and made that day at the counter. The seating isn't ample, but it's a cozy and friendly place to grab a bite.", "Date": "2014-05-11", "Author_Location": "Los Angeles, CA"}, {"Author": "Kiki M.", "ReviewID": "9C2S8dkb6yrD_vkiHa-Veg", "Overall": "5.0", "Content": "Awesome food. Cute little store in the back.", "Date": "2014-05-12", "Author_Location": "Seattle, WA"}, {"Author": "Keith M.", "ReviewID": "D7Xpod8_u4uMAmeYqdgpgA", "Overall": "3.0", "Content": "This place is alright and it's cute to boot. Go here expecting sprouts-style vegetarian/vegan food. It's all organic, portions are just enough, and it's expensive. The menu is quite limited, so really unless I'm in the area looking for a healthy bite I can think of other places that do organic vegetarian/vegan well with large portions if I'm really hungry and at a lower cost.", "Date": "2014-05-03", "Author_Location": "Minneapolis, MN"}, {"Author": "Emily K.", "ReviewID": "EydAJM6thSujtCc7I3R8aA", "Overall": "5.0", "Content": "If you haven't been, you seriously need to go. So good. Ive been several times and it's always been above par. I had their multigrain waffles this morning and they about knocked my socks off. My date had the breakfast burrito and it was easily just as good. Reasons to go: Their food is to die for. The juices are a must (I get one every time I'm there). The atmosphere is comfortable. The service is super. And it's all very reasonably priced.  And it's all natural!", "Date": "2014-03-01", "Author_Location": "Como, St. Paul, MN"}, {"Author": "Compassionate E.", "ReviewID": "s_npimMoKWw8TmqckvgWtw", "Overall": "4.0", "Content": "While visiting Minneapolis for work for the first time, I dropped by this little establishment to grab a bite to eat and get extra takeout for the hotel mini fridge. What can I say... It's a wanna-be health food cafe/store in the midwest. The food is quite bland and boring. Tofu and tempeh come out in large rectangular squares, coincidentally the same exact shape as their pre-packaged counterparts. The sauce seems just like a soy-based marinade -- super, super salty. I got The Royale entree and the Doozie salad. Both were just alright, nothing to write home about. Why 4 stars? I support vegan restaurants and would rather see this place improve than shut down. I browsed through the store section of the business and although it's very pretty, it contained the typical products you would find in the health & wellness section of your local Whole Foods. Same brands, etc. Nothing original.", "Date": "2014-05-14", "Author_Location": "Las Vegas, NV"}, {"Author": "Daniel J.", "ReviewID": "jyHQ1n8lw4W8_-RxmsPabA", "Overall": "5.0", "Content": "I love love love this spot LOVE. You do everything right every time. Clean, fresh forward cuisine. Absolutely a great team from A to A. Plus all the natural supplements its like being in a candy store without all the process shenanigans.", "Date": "2014-04-17", "Author_Location": "Minneapolis, MN"}, {"Author": "Liz G.", "ReviewID": "XYpa0vsZ3O3rllzSp0F6LA", "Overall": "4.0", "Content": "I really like Tao. I go a few times a month for lunch, and am always super happy with what I get. I'm a recovered vegan, from San Francisco, so something about this place just feels like home to me. They also have a lot of gluten-free options, including a GF wrap for the sweet potato burrito which is just about the most satisfying thing that you can eat on a gluten-free diet. I've always found people to be nice and friendly here, it's got a relaxed, quiet, but appropriate vibe.", "Date": "2014-04-09", "Author_Location": "Minneapolis, MN"}, {"Author": "Dan S.", "ReviewID": "X_mSaebuIq4uMWpic3P1BA", "Overall": "5.0", "Content": "I walked over in between shifts at work, and I was in need of some sustenance and relaxation. Luckily for me, Tao was able to provide both of these. This was my second Tao experience. Last time, I got the sweet potato burrito, which was delicious. This time, driven by hunger and slight work-induced delirium, scanned the menu for the first thing I saw that sounded good. The end result was a tasty black bean burger with a mixed green salad. The beauty of Tao's food (at least from my two experiences) is that it is delicious but does not leave you feeling sluggish or guilty. When I finished my burger, I was the perfect amount of full and felt healthy and energized.In addition to my love of the food, I am also a big fan of the atmosphere. This place has good vibes all around, from the employees to the other customers. While sitting by myself eating dinner at a restaurant for the first time (the lyrics to that song \"I go out and I sit down at a table set for two...\" repeating in my head), I had some nice interactions with some friendly people around me. With a full belly and that pleasant experience, going back to work didn't seem so bad after all.", "Date": "2013-05-22", "Author_Location": "Minneapolis, MN"}, {"Author": "Emily B.", "ReviewID": "o-Pr6fM6yYowqIAqbYs-sA", "Overall": "3.0", "Content": "I have really mixed feelings about Tao. On one hand, I love the food every time I go (which is important). But on the other hand, I have had a less than stellar experience nearly every time I've gone to Tao over the last three years (which is pretty often... I just keep going back for the food!). Most of the staff is pretty friendly, but the service is always really slow and unorganized. I've seen a handful of customers get really angry that their meal has taken over 20-30 minutes to get to their table, or that their order was switched with someone else's that arrived after them. As other reviewers have noted, sometimes the staff fails to even acknowledge you as a customer at the counter, or they seem annoyed to take your order. It makes for a really uncomfortable and awkward dining experience at times. One time we were even given attitude for coming into the place 10 minutes before they closed and ordering 2 smoothies. HELLO- you are still open so I have a right to order something! (let alone a smoothie, which should take all of 1 minute to make). The pros: The food is tasty and fresh, and there are a variety of gluten-free, dairy-free, vegan, etc. options on the menu, including specials that are offered each day. If you have a serious allergy/intolerance, though, I would caution you because cross-contamination may occur. I especially like the sweet potato burrito/bowl, the Doozie, the Royale, and the GF waffles on the weekends. The smoothies and juices are good too, they just take forever to make. Also, the store attached is really great and has MUCH better service than the cafe. The staff is knowledgeable, experienced, friendly, and excited to help and to explain their many different natural products. And they even have a discount on the first Saturday of every month! I love buying my essential oils here. Overall- I will keep coming back for the food, but will probably silently complain to myself...", "Date": "2014-03-17", "Author_Location": "Minneapolis, MN"}, {"Author": "Jesse H.", "ReviewID": "Ip4B-ocM3BYSJE5LhpFCGA", "Overall": "4.0", "Content": "My veggie friend pointed me to this spot as one of her favorites. I'm not vegetarian, but I can eat a plateful of vegetables and be completely satisfied. Another reviewer noted 16 mentions of avocado or guacamole. One of my favorite foods, I made sure to order a dish with this tasty item. The avocado sandwich or the avocado rice plate? As I debated, my friend pointed out The Royale. Knowing I may not have time for dinner, I ordered this $12 dish with plans to save half for later. The plate comes with steamed veggies, black beans, avocado, sauerkraut, and flax oil with brown rice. I was much looking forward to the veggies, but they were pretty plain. Almost like frozen veggies. Surprisingly, the sauerkraut was one of my favorite elements. And the avocado, of course. If I were to return I would definitely try the sweet potato burrito. Two people in my group ordered it and were quite satisfied. The smoothies also intrigued me but at $6+ I couldn't convince myself. Another person in my group ordered the Breakfast Bounce and said it was just OK. For $6.50? That should be a damn good smoothie.", "Date": "2013-05-15", "Author_Location": "Denver, CO"}, {"Author": "Anita F.", "ReviewID": "2SNGKC3oYHcIIyZPyrjHxQ", "Overall": "5.0", "Content": "What happens when you eat really clean food? Well, it's actually uplifting. I've had the Tempeh Reuben, the Doozie Salad, and the Breakfast Bounce smoothie (a satjsfying meal in itself). Everything tasted so pure--a lovely experience of flavorful \"real\" food. Perfect whether it's just a detox or a lifestyle. Service is a tad slow (it's not awful, but it's not Jimmy Johns speedy) and I'm not into the hipster vibe, but I won't deduct a star. Note: street parking (scratches/dings) can be a beast! I wish there were more places like Tao, but with parking.", "Date": "2013-03-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Nancee N.", "ReviewID": "VVY4PAwu8Mvvb1BDJ7yFAg", "Overall": "2.0", "Content": "This was my third visit at Tao Foods and possibly my last.  I took my Aunts out for lunch and was quite embarrassed.  First, our order was messed up so we did not receive everything we ordered. After waiting almost an hour for soup and half a sandwich our food was cold.  The grilled Rachel my aunt ordered was not grilled at all nor was the sandwich edible.  The split pea soup was lukewarm and the grilled cheese I ordered with tomato was lacking the tomato.  I mean the sandwich came without tomato.  After the long wait and disappointing food for a pretty spendy price I probably wont return.", "Date": "2013-10-03", "Author_Location": "Minneapolis, MN"}, {"Author": "Tomahawk R.", "ReviewID": "y4AliNf9JhNARdB-tgdK8w", "Overall": "5.0", "Content": "The sweet potato burrito is fantastic! I shared it with my girlfriend, along with the special of the day, which was a soba noodles & vegetables stirfry. We had also both ordered fresh juices and a coffee, which we had to wait awhile for. Turns out, the ticket never got printed, so they didn't see our order. As soon as they caught the mistake, they got us our juices and coffee right away, along with a complimentary appetizer of deviled eggs. The staff is so sweet and genuine,  and it was a simple,  common mistake, so we were not upset at all. Tao has a pleasant,  cozy environment and the vibe from both guests and staff is charming and feel good too. Our dinner left us feeling refreshed, rejuvenated,  and healthy. I will definitely be back soon to try more menu items!", "Date": "2014-01-22", "Author_Location": "Saint Paul, MN"}, {"Author": "Carolyn B.", "ReviewID": "71y5Woxp9UM53NgDJmWyKw", "Overall": "3.0", "Content": "After seeing their menu through Bite Squad, I made my way in for lunch last weekend when I found myself in the area. I love when my problem is having too many delicious-sounding veggie items to choose from.  In what was a negotiation between my husband and I, he ordered the goat cheese quesadilla and I had the tempeh reuben.  The reuben was a little different from what I expected (red cabbage kraut instead of the standard sauerkraut for one), but that was nice. I can think of at least two other places that offer tempeh reubens, so nice to to have a little differentiation. Their bread was fantastic and helped bump up the otherwise slightly underflavored sandwich. I also really enjoyed the quesadilla--ample portion (including guac!) and good flavor combos. The only thing that was a little disappointing was the speed of service. It took a while at the counter and then it was at least 20 minutes to get our food. With the open kitchen, I could watch them work and it was painfully slow to watch. They weren't terribly busy, but each order seemed to take a really long time.  The table set up isn't great either, but it wasn't long before we got a table.  I'll definitely consider coming back, but only when time is not an issue.", "Date": "2013-02-11", "Author_Location": "Minneapolis, MN"}, {"Author": "Jessica L.", "ReviewID": "Yl5k3smrnu4nSnCnqZPxRQ", "Overall": "4.0", "Content": "I don't go to many places twice and this is a place that I've come back a few times because of it's feel-good yummy food and welcoming atmosphere.Décor: Small place, so don't come with a big group (it's not the right place for a big group hangout anyway), but the tables are still placed at a distance where you aren't sitting on top of each other. In the back is a natural foods store to buy things good for you and the earth.Service: You order at the cashier and they bring it to you, never had anything but smiles, thanks!Food: Every dish I've had here is made with good-for-you ingredients and tastes great! Portion sizes are decent and everything is made fresh to order (you can watch them make it, if you so desire). I usually go for their sandwiches and I really enjoy their tempeh and turkey one. The only callout that I have is that one of their 'homemade milks' (either soy or hemp?) is not for the faint-of-heart; I wasn't prepared for what it would do to my latte (lots of 'pulp'/'grounds')Overall: Prices are a bit more than you'd expect, but pull out your laptop, enjoy a little shopping in the back and I think it more or less pays for itself.", "Date": "2013-04-07", "Author_Location": "Minneapolis, MN"}, {"Author": "Lillie T.", "ReviewID": "IKeSPvUn8KVqu41Cx-LbpA", "Overall": "5.0", "Content": "A few tables with bench seating around the periphery and a few outdoors on a quiet-ish corner of Hennepin.  Warm lighting glowing down from tall ceilings. A fun, big menu chock-full of vegetable-full, umami-full dishes.  Customers that care about how they're treating their bodies and are only slightly cocky about it and not enough so to be a deterrent.  Friendly servers and owners.I love the sweet potato burrito so much.  So very very much.  And their kale salads are always spot on.  The rotating soups and couple of cool baked goods make for just enough change to the offerings.  Everything is healthy but not boringly so; flavor-punch sauces color up what would be otherwise just good food and make it a rainbow of yum!I think Tao rocks and I can't wait to get a smoothie there as soon as I'm back in Minneapolis.", "Date": "2012-09-19", "Author_Location": "St Paul, MN"}, {"Author": "Annie D.", "ReviewID": "RpZs1QhoGL0h-OPc1oYQ3Q", "Overall": "4.0", "Content": "Tao is liberal with avocado. VERY liberal. And I approve of it.The second coming of Tao is a good one and an excellent place to take the vegetarians in your life. And people who love vegetables and avocados, like me. There's some turkey and tuna on the menu, but it is mainly stocked with vegetarian and vegan items like salads, sandwiches, rice bowls and breakfast. Also chevre quesadilla. That's what I want next. I counted and found 16 instances on the menu where it says \"avocado\" or \"guacamole.\" Niiiiiiice.I ordered the black bean burger (added cheese), which is enormous and comes with a side salad. The burger is topped with tomato, lettuce and house guacamole (spread thickly on BOTH sides). It was good, but ask for a side of hot sauce if you want it to be great. Even the hot sauce seemed homemade---so tasty that I'll probably ask for that no matter what I order in the future! Fair warning that this meal is difficult to eat because the burger is quite soft. I ended up just forgetting the bun and eating it with a fork so that I didn't fill up on bread or end up with half the burger in my lap. Win-win.If fresh juice is your thing, they have what looks to me like a very well-appointed juice bar. Most of the juices and smoothies are over $6, which is cost prohibitive for me. I'd rather spend $6 on a Crispin or more food, personally. Oh yeah, and after the remodel they now serve wine and beer and cider. They also have full coffee service and Wi-Fi, which I can't believe I've never taken advantage of before. All good things.A couple of the weekly specials stand out too. Date night on Monday includes  two entrees, two glasses of wine and one dessert for $28. And Tuesday is 1/2 price wine night.The back of Tao is a natural health shop, which is great if you're looking for herbal supplements, organic gift ideas and holistic health resources. They also offer Reiki, acupuncture, Thai massage and more at reasonable rates.And the atmosphere has changed quite a bit after the recent remodel. They've always had a very relaxing sidewalk patio (nicer than you'd think sitting right on Hennepin, but it's tucked behind some trees), but now the inside is classy and charming too. Nicely done, Tao!", "Date": "2012-08-09", "Author_Location": "San Diego, CA"}, {"Author": "Kedar D.", "ReviewID": "vDZxrMdDdT3TUUxvFQWUsw", "Overall": "3.0", "Content": "UPDATE: Tao, while still tasty and good, increased its prices in 2008 as well as reducing its portion sizes. So, you pay more, but get less food. I still like the food here---they have delicious vegan milkshakes (12 oz. for $7 ??) and a great black bean burger ($8)---but I've cut back on going here as the place is so expensive and the portion sizes are so tiny.Tao also nickle and dimes you for everything. Add avocado to a sandwich? $2.50. Extra bread? $2.50. Before you know it, your $8 meal turns out to be $13 or more with these add-ons and you leave still feeling hungry.Also, they got rid of their vegan waffle (why???) and their veggie burger is not vegan either (it has cheese in it). What a disappointment. At least they added the black bean burger, which makes up for the loss of the cheese-filled veggie burger. Also, their macrobiotic rice plates pack more of a kick than you might guess, especially with toasted sesame oil.All that said, Tao has great atmosphere. It's a cozy little corner joint with the feel of an old-time diner. The wait for food can be long, but that's only because each dish is lovingly prepared and hand-made; no short-cuts here. The food still is healthy, fresh and nicely prepared. They also feature at least one or two vegan desserts. Tao also has a large selection of health food and body-care items, as well as a small book section, in case you need more than just food.", "Date": "2008-12-31", "Author_Location": "Los Angeles, CA"}, {"Author": "Melissa L.", "ReviewID": "JxyFktOtL6Hj5U4LSV7PZw", "Overall": "3.0", "Content": "Pull on your  wool socks and Tevas, friends; we're going to Tao Natural Foods! If there ever was a bastion for hippydom in Minneapolis, Tao fits the bill. Quaint wooden interior design, more jars of herbal remedies and spices you can shake your shaka at, and humble food that tastes good but whose prices have a steely yuppy glint to them, this is the essence of Tao.You order at the counter when you come in; there is a hand-drawn menu on the chalkboard, but aside from the smoothies you won't find any other description. Look to the menus on a rack to your left. The staff is none too helpful or at least they don't look willing to help. In fact, since you neglected to change into your hemp sweater and patchwork pants, you will feel guilty and out of place. But brush it aside and order as you will.All the food is cooked on a series of electric griddles and hot plates. Fried goodness you will not find here. Your food will not come lightning quick. Bring your iPad, or maybe even a real book.Smoothies and juice blends are tasty, but as others have said, a bit pricey. Smoothies tend to have a chalky mouth feel due to some hoodoo powder thrown in, but since food here is both sustenance and medicinal, deal with it. The Island Buzz is pretty good, faintly reminiscent of a hippy version of pina colada. For breaky the egg sandwich is good. So are the waffles. The black bean burger was good for lunch although I hated the raw red onion in the guac. Also, what the fuck do restaurants think when they give you tortilla chips as a side but no salsa? It's like eating cardboard, no matter how good the chips are. Most savory items will have sprouts in them, it's the law.Happy hour on Monday through Friday, 5-7pm. Indulge in some 2-4-1 wheatgrass shots and rice half-plates for $5 before you go out and destroy your liver on Friday nights.", "Date": "2010-12-22", "Author_Location": "Minneapolis, MN"}, {"Author": "Jim C.", "ReviewID": "by_NO8Xg5MzwnfdswsJRPQ", "Overall": "4.0", "Content": "Went to Tao for the first time last night.  Kitchen remodel has us eating out all to frequently and thought it might be good to repent for recent gastronomic sins by checking out Tao.  Was hoping to try the much-lauded black bean burger only to learn they had run out.  As it turned out, this may have been fortuitous as it forced us to try a couple other things: 1) the Sweet Potato Burrito--this may not sound that appealing, but was awesome--just the right combination of sweet, tangy, spicy along w/ some texture 2) Mediterranean Mild Wrap--good, but suffered from a surfeit of sprouts which served to reduce the flavor of the other ingredients.  Despite that, the hummus was intense enough that I was still blowing hella garlic breath as I awoke this morning.We ate on the patio, which was quite pleasant.  Although the address is on Hennepin, there is a larger than usual buffer and some small shade trees that make it feel apart from the traffic.  I'm sure there is some Taoist expression to describe this oasis of calm amidst a fast paced world but it eludes me.  Perhaps another Sweet Potato Burrito would lead me to enlightenment?", "Date": "2012-06-17", "Author_Location": "Minneapolis, MN"}, {"Author": "Alexandra H.", "ReviewID": "jb9E8k5ODX6O0fYfAvzN4A", "Overall": "5.0", "Content": "Head's up:  One of the best things you can order on the menu is the chevre quesadilla with a blend of local cheeses, spinach, rice, tomato, onions, black beans, guacamole & salsa. Seriously, your mouth will be happy.Also, if you can make it between 3-6 p.m., the half quesadilla is only $6.25 (and filling enough to count as a meal).", "Date": "2012-06-26", "Author_Location": "Twin Cities, MN"}, {"Author": "Sven T.", "ReviewID": "Mb6qHzL60spDBbYpaPNi2w", "Overall": "5.0", "Content": "It really is an awesome place.  At times things (like ticket times that is) can get a tad bit slow.  But then again the non, almost ANTI corporate atmosphere lends itslef to such circumstances.  The decor is cool, so are the staff and food choices.   Not to be missed and highly underrated.  A well kept secret that shouldn't be quite so secret.  It's probably tough with a damico and lyles almost right next door, but hey.  This beautiful establishment fills an Isles niche and then some.", "Date": "2007-12-09", "Author_Location": "Minneapolis, MN"}, {"Author": "Ryan P.", "ReviewID": "k8liH5ftRnSs-ezCrEG40g", "Overall": "4.0", "Content": "This place has everything you would ever want for new age living.  Fancy smoothies?  Check.  Wide variety of Chinese Tiger Balms?  Check.  Delicious food?  Check.The prices are not exactly cheap, but then that goes for just about everything in Lowry Hill.  Still, they aren't gouging you either.  My favorite part of the store is the crazy incense stuff they have.  Especially the sweet grass and white sage.  Check that out if you haven't.  They also have a ton of various cures for colds and other diseases.  Lastly, they always have interesting food specials, so everything you come here, there's something different to try.  Very nice.", "Date": "2012-03-22", "Author_Location": "Minneapolis, MN"}, {"Author": "Hina K.", "ReviewID": "34tNCQs33X7AgiwIQRqwFg", "Overall": "5.0", "Content": "I love eating at the restaurant itself or taking something to go! I come here whenever I am craving a healthy, guilt-free meal. There is so much to try, and quite frankly, I can't think of anything that I haven't enjoyed.My favorite meal to at Tao Foods is the avocado sandwich; it comes with delicious, honey accented (not sure about this but that is what I can taste/smell) wheat bread, a mayo-like spread, sprouts, and avocado cut in thin slices. It is soooo delicious, and a perfect meal before or after a yoga or pilates session. I also love the juices. I believe they have a carrot and spinach juice which I find to be absolutely delicious. Finally - they almost always have a tempting dessert on hand, and it always looks freshly baked so I find it very hard to resist. I would recommend taking it to go.My one aversion to this place is that it is rather costly for what the restaurant is offering. I justify the cost by thinking that each of the ingredients is locally sourced and sans ingredients that are harmful (corn fructose, bleached flour, etc.) Also, if you don't enjoy vegetarian food, then I would not recommend coming here. Having said that - I just love Tao!", "Date": "2010-07-04", "Author_Location": "Santa Monica, CA"}, {"Author": "Jonathan K.", "ReviewID": "UOpnIwV9urIynlLdf5Dedg", "Overall": "5.0", "Content": "Great juice, great food, great service, great theme.What Tao lacks in size it definitely makes up in impression. They have a well put together menu that should offer something for everyone. Seating is set up around the periphery of the building and a bar, where you order, is in the middle. There are also seats located just outside for those warm Minnesota summer days.My item of choice is the black bean burger which has yet to disappointed. The juices are just as great and are well explained on the menu. Not only does the food taste great, it looks great. Most entrees are prepared with attention to aesthetic details.Unless I'm mistaken, everything at Tao is organic, which makes it that much more awesome. My family and I run a very strict organic diet and often have a hard time finding places to eat. The Twin Cities provide a healthy dose of options and Tao has become one of our favorites.", "Date": "2012-11-05", "Author_Location": "Springfield, MN"}, {"Author": "Zoe L.", "ReviewID": "lGQ3O6h_cyHPTgqBgBPNPA", "Overall": "4.0", "Content": "This one is an oldie but goody.  Been coming to Tao for over 15 years...and yet, their endless supply of supplements, hippies, and delicious foods never disappoint (with exception to one smoothie that was just a little too \"healthy\" for me).  Be prepared to walk into a world of \"health\".  Fair amount of gluten-free options, but beware- no good gluten free substitutions...so you can forget about getting a bite of the DELICIOUS tempeh reuben (you have not stepped into the realm of unreal scrumptiousness till you have tried this!).  If you care about what you put into your mouth, this makes a great lunch joint with local, organic, and sustainable choices.  Mind you, these come at a hefty price point, be prepared to spend an easy $15.And you can't beat the location.  Uptown makes this an easy jaunt from the lakes after your morning workout to grab a smoothie and some toast with a buddy.Fab find.  Keep coming back.  Give it a go!", "Date": "2011-06-16", "Author_Location": "Los Angeles, CA"}, {"Author": "Brian N.", "ReviewID": "cAYUGQHWtGmM6-6Q6w6xlg", "Overall": "5.0", "Content": "I love Tao. The food is great, the atmosphere is warm and inviting, and they have a nice little, surprisingly quiet patio area for being on Hennepin. It is across the street from my house so I am a little biased towards them, but their breakfast foods are great. I am a burrito lover, and their Breakfast Burrito and Sweet Potato Burrito are the only two things I get from there. I'm sure the other choices are good, but why take a chance when the others are too good to pass up? Smoothies are phenomenal, and the store inside has a lot of great products. I love this place.", "Date": "2013-10-27", "Author_Location": "Minneapolis, MN"}, {"Author": "Jason K.", "ReviewID": "Fs7uio_SChPU_jK2wM-7cA", "Overall": "3.0", "Content": "It's a hipster paradise.My wife and I had a $20 Star Tribune Steal. For $20 we got a cup of veggie black bean chili, a tempeh Reuben and a Bell's Two Hearted beer.I think I would give it 4 stars, but the place is way too cramped to eat in, but they also have half the place as a natural food store.The tempeh Reuben was good, no real taste from the temepeh patty, but the bread and sauerkraut was awesome. They said the dressing was on the side, but they put it on the sandwich. A little too much butter on the bread though.  Big sandwich, I brought home half of it.Now tempeh is a soy patty, which was cool. It looked really good, but no flavor.The place was full of hipsters. 20 or so Uptown kids that think it is cool to eat natural foods. It made me feel old, but it was fun to be around these idealistic kids. They spoke about progressive issues that just made me laugh. Such naive idealism, but it was good comedy.The salad that came on the side was awesome. Lots of sprouts, not too much dressing, very fresh!My wife's chili was fantastic! She gave me her chips, which were very crispy. Perfect for dipping into the perfectly spiced chili.The Bells was a perfect complement to the meal. We were in and out in about 30 minutes and had some great conversation.Overall, a unique experience.", "Date": "2012-11-10", "Author_Location": "Edina, MN"}, {"Author": "Mariah H.", "ReviewID": "qOIf2AqTrSErQWPcukZbkg", "Overall": "2.0", "Content": "The food was delicious.  Prices were ok considering everything is  (mostly?) organic.  The downside - no one explained that you order at the register.  No one explained that you should help yourself to water.  I have no problems doing these things, but it's really helpful if someone tells you or there is a sign present.", "Date": "2010-07-06", "Author_Location": "Chicago, IL"}, {"Author": "Yvonne W.", "ReviewID": "ECEY-f0Pym3eV_8zukRhIQ", "Overall": "5.0", "Content": "Why isn't this place open later? I could avoid all my bad food cravings if I could waltz in at 11PM, or even just 9! Like I've said before, I've got crushes on all the TC restaurants that serve tempeh. Tao is no exception. I don't crave anything like I crave the tempeh sandwich with avocado and sprouts. With my avocado allergy, it's quite the love/hate relationship, but I'll gladly sacrifice myself for a bite.I love that they cook everything right in front of you, so you can pipe up and ask for veganaise when you forgot in the first place. The open set-up with the store is also nice for perusing while waiting for your tasty treats.The people working there couldn't be nicer. They like to chat while making your food and are extremely helpful when you're torn between two options. Never fear, this is no Hard Times where you're sneered at My favorite part of this place is the availability of hemp & almond milk for drinks! I don't think there are many, if any, places in the Cities that offer that, leaving me high and dry when I'm thirsty for a chai latte. All of these factors combine for me to long to living closer, preferably just upstairs.", "Date": "2012-01-12", "Author_Location": "Raleigh, NC"}, {"Author": "Alycia M.", "ReviewID": "IuLwQdhfvtyR-MgCkPKtaw", "Overall": "4.0", "Content": "The food is delicious and the people are extremely nice and helpful!  I would eat here everyday and I wouldn't feel bad about it since everything is all organic. They have a good people watching location, so if it is a nice day I recommend sitting outside.Everything on the menu sounds scrumptious. From what I have tried, I love the black bean burger and the avocado sandwich. Yum!They also have happy hour Monday - Friday with $1 off wine, beer, juice blends and smoothies. I like that their happy hour is not just for alcoholic beverages.", "Date": "2012-09-15", "Author_Location": "Minneapolis, MN"}, {"Author": "Kelsey K.", "ReviewID": "fN3z7mIxBY-Go9EZwOuRhQ", "Overall": "3.0", "Content": "If it was far away it might be totally missed by me but is close to my house so I have given it a few tries. Bought a friend hair dye here and she is now addicted. Thanks Tao!They have this crazy good pineapple, ginger, orange and more juiced fruit drink. LOVE it. Expensive but a great splurge. Makes my tastebuds quite happy. Great soup. Yogurt and fruit is good. Otherwise the food is ok but often tastes a bit too healthy if you ask me. Cute place and nice people.", "Date": "2009-12-26", "Author_Location": "Grand Marais, MN"}, {"Author": "Karla S.", "ReviewID": "W5PBd5qsebQZlSYJy3SasA", "Overall": "5.0", "Content": "If you want a feel good lunch that won't leave you regretfully stuffed and you're ok with seriously healthful eating you would love Tao Natural Foods.  The prices are in line with the rest of the casual lunchtime restaurant fare but the quality of the food is palpable.  After eating flavor enhanced foods day in and day out it's nice to get back to simple food that tastes like nature intended.I had a delicious Quesadilla with chevre (10.25).  It was packed with an organic and local cheese blend, tomato, onion, spinach, black beans, rice, guacamole and salsa.  Pure and simple goodness.Mr. S ordered the Avocado Rice Plate (8.25).  Sliced avocado, tomato, onion and black beans all served on a bed of their signature brown rice and topped with spicy or toasted sesame oil.  I didn't even bother trying his dish.  What?!  I was too busy enjoying evey last bite of my quesadilla!After feeding my tummy one of Tao's meals I feel like I just filled up on super fuel. Eating good stuff is something I think I could get used to.", "Date": "2011-10-29", "Author_Location": "Minneapolis, MN"}, {"Author": "Rachel M.", "ReviewID": "RBzsAilC4hKtEnrV0pK5aQ", "Overall": "4.0", "Content": "Dear Yelp-gods on High,  Please let your followers have half-stars that we may properly capture the ambivalence of our feelings toward many establishments, one of which is Tao Natural Foods.  Thank you, and may yours be the good taste and discretion and egalitarianism forever and ever amen.I haven't been to Tao in a couple of years.  My memory has hazy recollections of a general hippie scent, cute bar stools, and a really delicious okara sandwich, which has apparently gone away to soy heaven.  So the following is based upon today and only today.Why Three Stars?:- The smoothies seemed overpriced and I've been living in SoCal where anything containing spirulina is automatically $$$, so that's saying something.- A little hand-washing goes a long way.- Apparently all the hot guys had the day off today.- Sort of distractedly uninterested service, which was generally annoying and led to the worst sin:- Giving me honey wheat instead of pumpernickel, even though I specifically mentioned that I don't eat honey.  Not cool, man, as they say in SoCal.Why Four Stars?- Well, the honey wheat was pretty delicious (sorry, bee-friends!) and so the avocado sandwich was tasty overall.  - Cute location, still fun barstools.- The restroom has been recently built (at the end of a basement labyrinth), so it smelled like recently cut lumber, which is my third-favorite smell ever.  Um, results may vary for other patrons.- Yum yum yum vegan lentil soup du jour!  It tasted warm and autumnal and so good (garam masala, is that you?).  Needed salt, if you ask me, since I have iron kidneys, but once salted, so so good.  And so, in summary, it was a really tasty and oddly filling meal (and I am a good eater).  Wish there had been vegan bread and cute vegan guys, but I wish that all the time, now don't I?", "Date": "2008-09-12", "Author_Location": "Irvine, CA"}, {"Author": "sallie w.", "ReviewID": "3tNMJ9FQm0fkx2oogZ-XvQ", "Overall": "4.0", "Content": "I'm somewhat embarrassed and ashamed to admit I've never stepped foot into Tao Foods even though I have lived in the neighborhood for longer than I care to share.  I've always been Tao curious but just never veered off Hennepin to check out the 40+ year old store where you can buy products that will do everything from helping you to align your chakras to getting your digestive track in order (naturally, of course) and everything in between.It took Mr. B's Mom reading an article about the recently overhauled cafe to get me in the door.  At her request we ventured out on a Sunday morning for brunch.  The prices are a teensy bit spendy but you get what you pay for in terms of quality, organic ingredients.  Go here for clean, healthy food and if you want to wash it down with a milkshake (or better a yet a beer or glass of wine) that's your prerogative.  I had the breakfast sandwich which was simple and delicious.  I say teensy spendy on the prices because my sandwich was literally a slice of bread, egg, cheese sprouts, tomato and avocado no sides for $6.50.  So depending on your priorities, you might find this a little steep.  Mr. B had the breakfast burrito.  I caught him dousing it in salt a couple of times...  but that's another story entirely.Loved it - go often for healthy food options in a super cute environment.  And if you want, there's a 1/2 price bottle of wine night on Tuesdays and a Monday night date deal ($28 for 2 entrees + 2 glasses of wine + 1 dessert!).", "Date": "2012-06-21", "Author_Location": "Minneapolis, MN"}, {"Author": "Sonja B.", "ReviewID": "Y_OGm6nb8aZnsd-_WaR7BA", "Overall": "5.0", "Content": "Recently Tao had a make-over so I thought it only fitting to update my past review. In the meantime I have become gluten free, and Tao caught up with me! When I was last there they offered gluten-free bread, had everything labelled if it was Vegan and/or Gluten free, and worked with me on the menu to make sure that what I was getting wouldn't make me sick. They say it right on their menu \"Nearly our whole menu can be prepared gluten-free.\"My absolute favorite thing is that they use almond milk in all of their smoothies! In a vegan/vegetarian's world nearly everything is soy, so having a place that uses almond milk as a base gives us a little soy-cation. Plus almond milk is absolutely delicious. They also offer ALL OF THEIR MILKSHAKES in a vegan variety. VEGAN MILKSHAKES. I just thought I'd emphasize that.In my first review I mentioned that the waitstaff were a bit stand-offish. This is not the case anymore. People aren't on their knees catering to your every whim, but they assist you with questions and offer up suggestions with a comfortable friendliness.  If you went to Tao before the redo, or have never been, I highly recommend going. All in all, Tao's upgrade is absolutely the best.", "Date": "2012-09-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Mark R.", "ReviewID": "BuDalmTGQIQ_IbKBGr4Edg", "Overall": "4.0", "Content": "My wife and I stopped in yesterday with a Groupon.  We were both looking forward to this place and we weren't let down.  I had the very tasty tuna sandwich and The Defender, a juice drink recommended by the counter dude.  It's got beets in it and WHOO its got a bite to it at first. Very good!! If you don't dig beets, you probably will after drinking this.My wife had the black bean burger on gluten free bread.  My wife, who loves to share and is probably tired of my begging dog look, let me have a bit of her burger.  It was really good. The gf bread was awesome but we were trying to figure out how to keep the burger from falling apart so that its not just a squished patty of bean stuff and more like a burger. Both our orders came with a side dish so we were plenty full.  We could have came well under what the Groupon allowed dollar figure but we had to try the GF desserts.  The pear and (ginger?) muffin was good; tasted like it came from the Wedge Coop. My wife had a macaroon-like item which was pretty good too.I'll definitely be back.  I think my wife will likely join me, too.", "Date": "2013-04-10", "Author_Location": "Lakeville, MN"}, {"Author": "Cynthia D.", "ReviewID": "4hqfv0xBj_aXrrjovYewCA", "Overall": "4.0", "Content": "This is a casual place where you order at the counter and then go find your own Place to sit. So making an Open Table reservation doesn't really work here...and you probably don't need it.  Service is OK but slow. However, it was delightful to sit outside and people watch while we had some really lovely vegan food. Their sauerkraut is wonderful. I recommend the Royale!", "Date": "2013-08-26", "Author_Location": "Van Nuys, CA"}, {"Author": "B V.", "ReviewID": "WJcEHd_uG427jT165EhHvA", "Overall": "4.0", "Content": "We came here for breakfast yesterday as we were woo'd with a Yelp Deal. Glad we bought it, because the food was great and this will not be our last visit. I love places where you can eat and not feel like you are so full/full of grease. The food here tastes clean, is organic and healthy. One of us had the breakfast burrito, which was delicious but did not come with any side items--- just a burrito. BUT at the end, you realize you don't need a side. It was enough food to be pleasantly full. The other had a Doozie Salad--awesome concept. Greens, sprouts, tomato, red onion, black beans, brown rice, guac, hummus... delicious. We also got a Breakfast Boost smoothie-- banana, peanut butter, iced coffee, wheat germ, almond milk. It was good--but the peanut butter flavor was over powering.They happened to run out of oranges (they were getting a delivery within an hour) so I didn't get to try the juice I had picked out, but all the more reason to go back!This place is right on Hennepin, but really and truly you cannot tell. The patio is kind of tucked away. I'm excited to go back for Happy Hour and brunch again!", "Date": "2012-06-03", "Author_Location": "Minneapolis, MN"}, {"Author": "Amee K.", "ReviewID": "058g4Cjwi6wkxPJtgXB9Tg", "Overall": "4.0", "Content": "Great place for vegetarians! Love their fruit juice too! Will be coming back!", "Date": "2013-07-12", "Author_Location": "Minneapolis, MN"}, {"Author": "DeAnna J.", "ReviewID": "JStCDdPRMzQSDaswI5ib5Q", "Overall": "4.0", "Content": "So, this is definitely not my first nor my last time going here. Haven't had a chance to review this spot yet. Delicious as always. Sweet Potato Burrito. Free Radical Raider. Tempeh Reuben. Quesadilla with Chèvre. Avocado Rice Plate. OMGY! Fair trade coffee? Extra love. It's the perfect spot to do some grocery shopping then grab a nice lunch! I can't help but get a Root Beer Float every time I stop in. Like seriously. Vanilla bean ice cream. So good.", "Date": "2013-02-18", "Author_Location": "Stillwater, MN"}, {"Author": "Anonymous N.", "ReviewID": "FvVj_bThSVngN4jY_zobZg", "Overall": "4.0", "Content": "Wait a minute, aren't natural food stores just for d-bags, hippies and lesbians? Not if it's Tao Natural Food and Books! I live three blocks away and went there for the first time today. Here's a play by play of my first impression: Wow, it's a cute little cafe in here. That menu on looks pretty good. And what a nicely equipped kitchen. Thank god they have coffee. Dang this coffee is delicious. Mmm, real delicious. Three cups? I've never had three cups of coffee in a row in my life. I didn't have any food, but I'll definitely be back to give the avocado cheese sandwich a try.", "Date": "2009-04-25", "Author_Location": "Minneapolis, MN"}, {"Author": "Hillary R.", "ReviewID": "JtjMvNqTW6TPok4LgkbEpA", "Overall": "3.0", "Content": "im a bit hesitant about spending 6.25 on a smoothie, but its a health/organic shit store and ive heard good things. when i saw how close it was to sebastian joes i started to play the \"maybe we should get ice cream\" game, cause i missed the ice cream social but mostly cause ice cream is always tastier than non ice cream. luckily i was reminded by my brother that while he appreciates me eating shitty foods while he is visiting that i shouldnt use his visit as an excuse to get as fat as physically possible before getting my bridesmaid dress altered. i reminded him that i got the dress extra big just for the purpose of getting fat and he reminded me that its a health organic store that supports local businesses and local people and that local is good so we settled on the smoothies. his was much better than mine but they give them all dumbass names so i cant remember what it was called, but the only one with spirulina. i got the third one down, only one with kiwi, wasnt great. they had two with peanut butter and bananas which is genius-ericka will have to check those out.would give an extra star for how good looking the two guys are who work there- think abercrombie meets vegan. and then i would take a star away for the excessive amount of time it took one of them to make the smoothies, and with only two other people at the diner stools already with food i didnt really get it. breakfast stuff looks good, salads and a good variety of veggie drinks (which i think all taste like liquid bland blended garden). huge variety of vitamins, healthy people things and pills and lotions- cute place, nothing is cheap", "Date": "2008-08-23", "Author_Location": "Portland, OR"}, {"Author": "chaiya i.", "ReviewID": "v0SGFv5e-zKZPnK82VnGMg", "Overall": "1.0", "Content": "I was truley disappointed in my experience. I'm a vegan and called first to make sure they had breakfast available. I should have questioned deeper because oatmeal or fruit was not what I was expecting. So, there I am hungry and ordered their Avocado &Rice with tofu. When I recieved it, the only thing cooked was greasy tofu. Onions, maybe 1/2 tomato and 1/4 avocado  which were raw with maybe 1/2 cup of rice which was cold.By the way, nowhere does it mention that the veggies are uncooked. This rang up to $14.00.  OOOOCHI will not return. There are too many other places to get a good hot Veagn meal.", "Date": "2009-07-23", "Author_Location": "Saint Louis Park, MN"}, {"Author": "Sal K.", "ReviewID": "tPc68EmRVUAgUowx4fVSpA", "Overall": "5.0", "Content": "Simple, healthy food always tastes better when someone else makes it for you.", "Date": "2010-04-23", "Author_Location": "St Paul, MN"}, {"Author": "Cate M.", "ReviewID": "3x0qGiWYJQZI09tuDXyitw", "Overall": "1.0", "Content": "Pros: the drinks most of my friends and I had were pretty tasty.Cons: the one drink that wasn't really tasty was actually REALLY AWFUL. The staff was snotty and rude to my friend when she very politely tried to explain to them that it tasted wrong. Instead of approaching her as a customer they would like to make happy and see back, they talked down to her as if she didn't know what she was talking about. To be fair, the drink she purchased was a green juice with kale, celery, cucumber, and it was called something reminiscent of Naked Juice's \"Green Machine\". I could see where someone may have ordered it thinking it would be sweet and then find out they were wrong---but that isn't at all the case with this particular friend of mine. She knew what was in the juice and that it wouldn't be sweet. That wasn't the problem, but the staff operating the register wouldn't hear it and made comments to the gist of 'you obviously don't understand because you don't know what organic juice tastes like, you idiot' in not quite so many words. The intent was very clear through the tone. I was pretty amazed by how rude they were. Then, because one of my other friends got involved and tried to assist her, they decided they would 'fix' her juice by adding apple juice. Not hearing the problem, not caring, and doing something completely useless that didn't solve anything = what outsiders will tell you is wrong with Uptown as an overall. Shame on Tao's workers for perpetuating this negative view of a lovely part of our city.Thankfully the guy who actually made the juice was a complete sweetheart and actually gave us the time of day long enough to hear \"honestly I think the cucumber is off\" and immediately made something else for my friend, while easing her uncomfortableness. He was a nice bright spot in a really sorry situation.I might come back to see if things have improved, but really I can't say that I want to. It's a shame because upon first entry I was excited to see they have gluten free options. Hard to enjoy your food when you have a staff with a major stank face on staring at you from behind the counter the entire time, as one of their staff chose to do (which was before my friend even asked for assistance).Writing this review and reliving the experience in my head, I actually got really infuriated all over again and this incident was in August. I tried to just let it mellow but this kind of interaction makes me see red. It's not like it's remotely hard to just be polite to your customers.", "Date": "2012-12-04", "Author_Location": "Minneapolis, MN"}, {"Author": "Jenny K.", "ReviewID": "k-RRbT0knl-BWnSilSmaEg", "Overall": "4.0", "Content": "I was excited to stop on in on this adorable little shop and cafe. I had a hankerin' for a  smoothie and was not disappointed in choosing one of the many drink Toa makes. I had the Muscle Mania with banana and peanut butter. Yum! My only suggestion is to share the smoothie with a friend. 24 oz is just too much", "Date": "2013-02-27", "Author_Location": "Downtown, Los Angeles, CA"}, {"Author": "mike s.", "ReviewID": "0ktBPlj0LWIkh5nWq4HOgA", "Overall": "1.0", "Content": "My wife and I stopped by for dinner. I had the tempeh reuben with one of the juice blends, she had the black bean burger with a shot of wheat grass. The food was good--not great (you'll find a better veggie reuben at the Lowbrow and better veggie burgers at Town Hall, Bulldog, etc.) but the drinks were quite good.  The atmosphere is nice and the restaurant section of the store is certainly a nice alternative to some of the less healthy neighborhood joints.  Counter service is often irritating, but the employees at Tao handled everything perfectly. So why one star?  Because throughout the dinner, a young boy (2-3 years old) was running around the restaurant without any pants.  He was wearing a cloth diaper, which was probably awesome for the environment but--I have to admit--the hyperactive pantsless kid pretty much ruined the meal for us.  First of all, small children shouldn't be running all around a typical restaurant.  Second of all, if you bring your family to a restaurant, each member of your group should make an effort to wear trousers, kilts, skirts, jorts, etc.  This wasn't a little baby and it wasn't a few minutes, it was a pre-school kid racing around without pants for an extended period of time.  Also, I should note that this didn't seem to be any pantsless kid off the street.  Judging by his caregiver's behavior (walking behind the counter, helping himself to wine, etc.) I assume the owner or manager of the restaurant facilitated the debacle.  Hence, ONE STAR.", "Date": "2012-02-28", "Author_Location": "Minneapolis, MN"}, {"Author": "Peter S.", "ReviewID": "vRHcBMiL7ikmTfVI-3fbSA", "Overall": "4.0", "Content": "An interesting find in Minneapolis. It certainly has some of the most healthy food that I've ever encountered, and I recommend the shakes and oatmeal in the morning if you are looking for an alternative to Whole Foods. This tends to be somewhat of a mixture of a \"New Age\" store, a vitamin shoppe, and an organic food counter. They have a lot of vegan choices and although I don't always know what I'm eating, I know I feel much healthier every time I leave this place.", "Date": "2011-08-19", "Author_Location": "Suffern, NY"}, {"Author": "Zac S.", "ReviewID": "MXSClnBwSnsDcSxvG4Sg2A", "Overall": "3.0", "Content": "Service = meh. food = 3 stars. new remodel concerned me as it was really charming in there before, but they did a great job keeping the character of the place. But yeah. They tend to be a little understaffed, which results in a long wait for food. Great smoothies, great vibe.", "Date": "2012-10-08", "Author_Location": "Minneapolis, MN"}, {"Author": "Jennie B.", "ReviewID": "dR909vgSydbtTymdkkaz-A", "Overall": "5.0", "Content": "Awesome. I got the quesadilla and could have eaten three they were so good. The food is real, organic, and hearty. If you want salt in your food, add it yourself! Love that dishes aren't over salted or full of greasy fats!", "Date": "2012-11-28", "Author_Location": "Minneapolis, MN"}, {"Author": "Anna B.", "ReviewID": "IN5fTAmCwT36Ed1KNy6KGA", "Overall": "4.0", "Content": "Go in there just to meet the owner's adorable baby River. The people who own this place are really wonderful. The food isn't fantastic and it's pricier than I remembered, but you should definitely get the quesadillas (goat cheese!) and a smoothie or a wheatgrass shot. During happy hour the shots are 2 for 1 and I hear they are the best in town. I mean, it's pretty cool this place has a happy hour.", "Date": "2009-07-24", "Author_Location": "Minneapolis, MN"}, {"Author": "Liz A.", "ReviewID": "kJ9aSwmaHKoeciC7JTCiWA", "Overall": "5.0", "Content": "This is one of my favorite little cafes in Minneapolis. First of all, It's quaint, warm, cozy, and has awesome diner seats! The food is also outstanding. There are many options for vegetarians and many things can be made vegan. Also it is one of the only places in the city you can get a vegan milkshake. Also they make some of the best oatmeal I've ever tasted. It may seem like it's a little pricey but everything is fresh, and made right in front of you so it's definitely worth it!", "Date": "2011-09-25", "Author_Location": "Minneapolis, MN"}, {"Author": "Melissa C.", "ReviewID": "wxVg3qn2Xjrm6EKh0kPayQ", "Overall": "4.0", "Content": "yummy, healthy food! I'm especially a fan of their healthy happy hour.", "Date": "2012-12-10", "Author_Location": "Minneapolis, MN"}, {"Author": "John R.", "ReviewID": "frAt_UzOeUIiI-bHyBgn_w", "Overall": "4.0", "Content": "So while trying to interesting and healthy while travelling we made it back again this time we both tried the Royale.  One of the ingredients was in short supply so they offered up a alternative \"rendering\" we both gobbled this one done.  Regretfully the wine was not as good as we hoped - yes I know a good sulfate free organic wine is hard to find.  Over all a great place to get a good meal.", "Date": "2012-10-14", "Author_Location": "Winnipeg, Canada"}, {"Author": "Kailin C.", "ReviewID": "JOiHzz9wPgLhkxjkrvSMgQ", "Overall": "5.0", "Content": "Tao always satisfies. The Royale (rice, beans, avocado, sauerkraut, other veggies, topped with Goddess Dressing if you so desire) is my standby if I'm really hungry -- I sometimes feel silly eating it when it's something one could so easily make at home, and they charge around $12 for it, but they really make it perfectly. After that I'd recommend the sweet potato burrito, the black bean burger, or the quasadilla. These are a tad more affordable at around $8-$10. You should also check out the flavorful cocoa nibs that one of the employees makes himself; they're in a jar by the cash register.In terms of atmosphere, you've got their great remodeling inside and their mostly shaded patio outside with about 8 tables. I guess you could say I'm a big fan.", "Date": "2012-08-06", "Author_Location": "Minneapolis, MN"}, {"Author": "Molly W.", "ReviewID": "HSXY99lw_hzgcOZjFV-gaw", "Overall": "5.0", "Content": "Clean, healthy, vegetarian living... it's not for everyone.But if it's for you, then DON'T miss out on Tao Natural Foods!  This place is so cute!  The old school counter looking right into the kitchen and the fun stools totally make me feel like I'm in a downtown New York hipster diner.   The staff is so friendly and knowledgeable (definitely crunchy, but who doesn't love some crunch at an organic cafe???).  The service is great and the menu options are perfect in my opinion (again, not for everyone).  You can go super clean with a vegan macrobiotic veggie/rice dish, get the super healthy juice of the day (kale, broccoli, beats and apples!) or go dirty with a Quesadilla or even \"The Doozy\" (a delicious salad containing just about everything and topped with Annie's Goddess dressing).   Even when I go dirty, I still walk out feeling better than I do after most restaurants.  Oh- and brunch here can be great too!  I love coming in on a Saturday or Sunday alone with a paper and just chilling at the counter with a great bowl of oatmeal.", "Date": "2010-03-17", "Author_Location": "San Francisco, CA"}, {"Author": "Morgan A.", "ReviewID": "HVYTMPb7k5hzQWovIT-hrw", "Overall": "5.0", "Content": "This place is great =). I have been here once but I like the place a lot. Friendly staff, good food, good coffee drinks. I will be returning the next time i'm in the area =).", "Date": "2012-02-11", "Author_Location": "Minneapolis, MN"}, {"Author": "Becky L.", "ReviewID": "1lZg0vpDm8Vfr-JfoirRjQ", "Overall": "4.0", "Content": "Healthy and yummy but pricey.", "Date": "2012-08-30", "Author_Location": "Minneapolis, MN"}, {"Author": "Frank W.", "ReviewID": "lDrJJtPdpF3-lLmVa5AItw", "Overall": "5.0", "Content": "I came to Minneapolis for a conference.  They had the green juice I was looking for and the black bean burger was good, too.", "Date": "2011-11-02", "Author_Location": "Austin, TX"}, {"Author": "Adam O.", "ReviewID": "ZEwAUxkxk4AbUeg0MHF7_w", "Overall": "5.0", "Content": "Great meal at a fun spot. Black bean burger was delicious and had a hefty portion of guacamole on it. Great deal with the Tuesday 1/2 price bottle of wine too!", "Date": "2012-06-13", "Author_Location": "Minneapolis, MN"}, {"Author": "Andy D.", "ReviewID": "PuJqPYWZYxrOvk3ASMJh6Q", "Overall": "4.0", "Content": "Recently went in for some quick takeout. I had the sweet potato burrito- which was awesome! I can't want to go back.", "Date": "2012-06-17", "Author_Location": "Minneapolis, MN"}, {"Author": "Potato L.", "ReviewID": "NYKvIVeznjGPGmyl_O7X8g", "Overall": "4.0", "Content": "I visited the place with a couple of friends about a week ago. There was an episode in which we reserved a table from opentable and the restaurant said they are cancelling their tie to opentable and thus we did not have table when we arrived. The waitress was very nice and apologetic about the miscommunication and tried hard to find us a table soon. The three of us were all very pleased with our orders--one had a salad and the other two sandwiches. All of us prefer light but flavorful food which is exactly what the restaurant offers--healthy food that is not bland. I personally thought the place appeared to be a bit pretentious at first glance but what does that hurt if it offers great food? The price was OK given the location of the restaurant and the size of the servings.", "Date": "2013-06-10", "Author_Location": "Saint Paul, MN"}, {"Author": "Ute B.", "ReviewID": "v30BFeIjDgGXlvwVPDvrZg", "Overall": "3.0", "Content": "I just finally got to try Tao for the first time, and was quite impressed, a great spot for vegans if you're looking for quick, healthy and tasty meal. I had a delicious butternut squash soup / salad combo and a cup of green tea for under $10 and look forward to returning and trying other dishes, many of which can be modified to be vegan, according to the extensive menu. However, I will not likely return over lunch hour on weekends, the reason being the atmosphere. It was practically impossible for me and my friend to have a conversation while a group of about eight kids freely roamed around in a rather noisy fashion while their parents, who appeared to work at the restaurant or neighboring store roamed with them or did not supervise them at all. And while I'm happy for those employees and their families to be able to have their kids at work with them, it doesn't make for a very pleasant dining experience to be surrounded by screaming children or have one of them trample on my purse and jacket while climbing around on the bench I was sitting on. Hence the 3-star rating.", "Date": "2012-09-29", "Author_Location": "Minneapolis, MN"}], "RestaurantInfo": {"RestaurantID": "_hiUA0nM03nD36hoCcxqbg", "Name": "Tao Natural Foods", "Price": "$$", "RestaurantURL": "/biz/tao-natural-foods-minneapolis", "Longitude": " -93.29325900000000", "Address": "2200 Hennepin AveMinneapolis, MN 55405", "Latitude": " 44.960811999999997", "ImgURL": "//s3-media3.fl.yelpcdn.com/bphoto/6wzxLmNIU8iN8gZgdsWuyw/90s.jpg"}}