{"Reviews": [{"Author": "Carl A.", "ReviewID": "jLmlsE4nleaS0fNNOc71Mw", "Overall": "4.0", "Content": "This is not the best Korean in town, but it will definitely do.  On my second and third visit, I ordered the Kimchi Jigae, which is spicy kimchi, pork and tofu soup served in a hot stone pot.  Add some rice and it's delicious.  Tasted very authentic with limitless spice and flavor.  I've also tried the Dol Set Bi Bim Bap, but something wasn't right and I found myself adding more and more sauce just to get the right flavor, which never was the case.  I have tried making it myself, so I know a lot goes into marinating and cooking all of the vegetables in a very specific way, but I'd hit up another Korean restaurant for some tasty BiBimBap (Seoul Garden)They've got a great location in the Asian Town Center which has a variety of things to do on a crappy day.  Get some cheap produce and ethnic food at the grocery!  Watch the martial arts class! Visit the art galleries! Listen to a poetry read!It's a fun little plaza it is.", "Date": "2014-02-09", "Author_Location": "Cleveland, OH"}, {"Author": "Ba Chomp Ba Chomp Ba Chewy Chomp P.", "ReviewID": "edkd1rWL3UCSPmxOmS30Xw", "Overall": "3.0", "Content": "Second time at Miega.Very clean.Comfortable seating.The service bell on the table is mute as the wait staff is keenly on standby.There seems to be a bit of a language barrier for some of the wait staff  - just be patient.The fried dumplings were amazing. I got the seafood pancake appetizer - good but a tad greasy (not sure if that is how it is to be served as I am not an experienced Korean dinner).I will be returning.  I would especially like to go with a bigger group of people and a bigger appetite.  The BBQ at the other tables looked like a fun way to experience Korean.", "Date": "2014-01-28", "Author_Location": "Cleveland, OH"}, {"Author": "Sunshine S.", "ReviewID": "GOvyMMrLc6cqgpbxqxmTxw", "Overall": "5.0", "Content": "Went last night (Friday @ 6:30pm). Was pretty quiet and service was fast and good. I have been here about 7 times and this was my first dinner.  I was pleasantly surprised that I could have a fast, quiet meal on a Friday evening. A hidden gem.  I also frequent Seoul Garden in Parma but this place has better pan seared spicy squid with vegetables hands down. Also the price is a little lower for a lot of the dishes i enjoy. Also the pan fried mackerel is more authentic and less greasy. If you love Korean style Jajang myun and jampong, this place makes them pretty authentic. I can't find it like this even in Dallas, TX. Overall,  I love this restaurant.", "Date": "2014-07-19", "Author_Location": "Hudson, OH"}, {"Author": "Yuan C.", "ReviewID": "P-SHdmRT8CSmT3c5K8Tecw", "Overall": "4.0", "Content": "If you're looking for an authentic Korean restaurant, this is not the place. But the food here is still pretty good! Some items I've tried include jap chae, dokboki, galbi. and seafood pancake. The first three items are a lot sweeter than the same dishes I've tried in other places. I still recommend them though! The seafood pancake is a must! At about $7, the pancake is really filling and has a ton of seafood in it! If you have a large group coming, you can reserve the room down the hall from the main restaurant! That room has a pretty swanky karaoke machine with music from all genres and different Asian countries!", "Date": "2014-06-08", "Author_Location": "Cleveland, OH"}, {"Author": "Victoria M.", "ReviewID": "q0pWcfItKHwuz2s5Hd0jjA", "Overall": "5.0", "Content": "Very nice place. Been here several times! Seafood & Kimchi pancake, neungmian taste good!", "Date": "2014-07-06", "Author_Location": "Cleveland, OH"}, {"Author": "Lindsay H.", "ReviewID": "SxTuqWGYQUSOsq2zLXU1zA", "Overall": "4.0", "Content": "Why are all the asian restaurants hidden away in some secret asian plaza? Even with the assistance of GPS, we had a hard time finding this place and thought it was closed. Luckily, we persisted and were rewarded with delicious hot korean food. Being in Cleveland, it is extremely hard to find diversity in terms of food, and basically everything. I'm glad we finally tried this place, as I'll definitely be back. We ordered their hot pot with assorted meats which was soooo huge and soo filling. Even after three of us stuffed our faces, the pot looked like it was still completely full. Yay for leftovers!", "Date": "2013-12-07", "Author_Location": "San Diego, CA"}, {"Author": "Mike T.", "ReviewID": "PzgW_tUPAESizOr8TQiHIg", "Overall": "1.0", "Content": "Been here two times and both experiences were similar... bad service and mediocre food.The first visit I was satisfied with the food, but the service sucked badly. I know the place is owned by an immigrant family, and service in some asian(also Europe) countries is not expected to be at the level of the US. But with that said, I have traveled in the Philippines, Korea, Thailand, UK, mainland Europe, Japan, etc., and never experienced service this pathetic. When you get the waiter to your table, order everything because you aint seeing him again until you get the bill. I should mention, both times I had to go to the counter to ask for the bill despite ringing the bell on the table several times.The second visit was the clincher. My wife ordered the bbq, where they bring the grill to the table and you cook it yourself. One of the staff had the nerve to come over and turn off the grill because the party behind us complained. Firstly, don't have the bbq if your ventilation sucks. Second, don't expect that passive display of disrespect to dissuade a guy like me... I cranked it back up and cooked that shit well done. It was either that or walk out without paying... which was an option. Never again will I go to this dump. My wife likes the market downstairs and that is as close as we will get to miega henceforth.", "Date": "2013-12-31", "Author_Location": "Cleveland, OH"}, {"Author": "Sophia J.", "ReviewID": "bzpdo22eBtdQBxnLc6IKlw", "Overall": "4.0", "Content": "What did we ordered for three people B5 K8   Seafood S16 have mu idol sot bi bim bob A5Good, awesome ,", "Date": "2013-12-06", "Author_Location": "Raleigh, NC"}, {"Author": "Yuanjia Z.", "ReviewID": "ip9HcwF8XvYtnbRsJ4YgxA", "Overall": "4.0", "Content": "I have been to this place way too many times and every time I go there, I order their chap chae (clear noodle with beef). It was absolutely the most beautiful thing they created there!Other stuff were just regular korean food. I would not recommend their rice cake dish - the color was orange, not red so that's off and it tasted off too. Not sure what went wrong but just bad.The service there was pretty good. You can ask for more side dishes if you finish them too early (I always do that). They also have a big karaoke room across the hall way and we celebrated our friend's birthday in that giant party room.", "Date": "2013-12-07", "Author_Location": "Cleveland, OH"}, {"Author": "Ruchu T.", "ReviewID": "m1l9nbQKQ-e6CJj0DVOIeg", "Overall": "4.0", "Content": "I came here on a not so busy Friday night but service was a bit slow. We got seated immediately but wasn't given water or the menus until 10 minutes later.Anyhow, we made our selections fairly quickly. My girlfriend and I ordered the S6 (kimchi jji gae), S8 (soon du bu jji gae) and K11 (jae yuk du boo kimchi). However the server returned and we were told they were out of materials for the kimichi jji gae so we switched to S7 (doen jang jji gae). The food arrived fairly quickly and came with about 10 ban chan dishes. But sadly there wasn't any steamed eggs this time (which was included 2 years ago). The soup dishes arrived piping hot and was served in a hot clay bowl. The spicy broth was pretty flavorful with good consistency. My dish had bits of seafood like octopus, clams, and shrimp. The seafood wasn't overcooked or too chewy. The K11 dish arrived a bit later. It's basically a spicy marinated pork and kimchi dish served with steamed/boil tofu triangles. The pork was had great flavor and the tofu went well with the dish. It also help calm the spiciness of the dish. We both managed to finish our soup dishes but we barely ate 1/4 of the K11 dish. The portions was generous enough for us to have it for lunch the next day. Be aware that this place serves Korean BBQ, so it does get smoky and the smell may stick onto your clothing for some time.", "Date": "2013-10-21", "Author_Location": "Cleveland, OH"}, {"Author": "Steve L.", "ReviewID": "O9NdoO3ZX8-OPs7qU_5wwg", "Overall": "3.0", "Content": "This place is upstairs, 2nd floor of the Asia Plaza, unique location to say the least. A Karate class was in session right across the way, which got me pumped up about my visit here. I felt like I was really in Seoul, too bad the food didn't complete this feeling.  My friend worked the Miega hut at the Asian Festival, I got BBQ chicken and it was pretty dam good, I was really excited to check this place out. We enter and take our seats, a cool call-bell was attached to our table, at first I didn't know what it was, then we asked. You know what they say, ask and you shall receive. Our waiter was quick and friendly. I had the Bi Bim Bop and it was a lot of food, but not all that great, it's hard to mess this up. The taste just wasn't there. They say you're body goes through a cycle, or complete change every ten years or so. Right before I turned 30 was my change. I used to love not and spicy cuisine. I just can't do it anymore. I remember before I was 20 I couldn't eat so much as Franks Red Hot without my mouth burning. Before I knew it I was eating a 7-8 on the Thai menus. Mexican. The hotter the better, now that palate is no longer available for me, my tummy doesn't like it. Maybe when I'm 40 I'll be back in the game. When that happens I'll check this place out again, if it still exists, keep messin up Bi Bim Bop, I can assure you won't be. In the middle of the floor, in the worst spot in the whole restaurant was a table bearing a reserved sign on it. It gave off the idea that it was some presidential reservation, yet it was in the lowest of peasants coordinates, maybe I'm out of the loop. It was good for a laugh though. I posted the pic of it once site.", "Date": "2013-10-08", "Author_Location": "Cleveland, OH"}, {"Author": "Lisa M.", "ReviewID": "PGk3Wyb_MJ5JjMOOa67Szg", "Overall": "5.0", "Content": "I've been to several Korean BBQs in my home state of Florida and I have to say this one is the best I've experienced.The staff were extremely friendly and attentive. I've often had the stigma of being Caucasians in an Asian restaurant and not being experts on the cuisine and either getting poor quality help due to language barriers or poor quality help due to being an outsider. Here the staff was friendly, well-spoken, and knew exactly how to help some Caucasians that didn't quite know what they wanted.Our waitress suggested a seafood noodle soup that she assured us would be excellent for leftovers, and I knew I wanted some good beef so I opted for the ribeye to grill at the table. The soup was loaded with noodles, vegetables, and tons of whole shrimp, mussels, and squid all cooked perfectly.The BBQ came out on a nice flat skillet with a small portable propane grill underneath. The ribeye was extremely tendered and well flavored, served with a raw onion to grill alongside and the traditional banchan. Every single one, from the fish cakes to the eggplant, were tasty and just the right bit to accompany our meat. Fresh romaine and a bowl of rice came as usual, but the kicker was a miso-broth based soup that I have no idea what was in it aside from tofu but it was delicious and an unexpected star of the meal.All of that was under $40 and gave us 2 days worth of leftovers. The restaurant was clean and inviting and the menu had plenty on it to make it worth coming back. The only complaint I can say is that it's a bit difficult to find, being on the 2nd floor of the Asian Town Center. But now that I know where it is, I'll definitely go back if I'm ever in the area again!", "Date": "2013-09-22", "Author_Location": "Orlando, FL"}, {"Author": "Damian S.", "ReviewID": "bg-FuTYdy3r7DELaF6F9HA", "Overall": "5.0", "Content": "First, there are \"bells\" on each table that you press when you want a waiter to come to your table. Otherwise they will NOT come and bother you. There is no such thing as slow service, only you not being smart enough to press the button.   We had a great young man from Korea waiting on us this day. The restaurant wasn't full but he seemed to be the only once working the room and was very busy. He seemed to be very flabbergasted when I spoke what little Korean I knew. My wife, not so much. LOL.   I won't bother describing the food. You either know it or you don't. Go look it up on youtube or something. BUT, it was good and the service was great and the place was clean.", "Date": "2013-08-10", "Author_Location": "Dover, OH"}, {"Author": "Lisa C.", "ReviewID": "-F92SoRFGOpWVhk8EOM_Yg", "Overall": "3.0", "Content": "Location: It can be difficult to find this restaurant if you are not familiar with the area. It is on the 2nd floor of Asian Town Center. Once inside, the restaurant is small, clean and inviting. I just noticed they opened another area separate from the restaurant for large groups/parties, which has a karaoke set up. Service: The staff are usually very nice. At my last visit, they even offered to replace our meal if we were not satisfied. The door bell on the table is also nice to have, but can attract attention from everyone in the restaurant if used. Food: Not bad.- Pros: Usually I order my usual S15 Bi Bim Bap when I come. Very filling! The crunchy rice from the sizzling hot pot is my favorite!!  My BF ordered the mackerel, which was overall fresh and pretty well priced. It even came with a seafood soy paste soup.- Cons:  The small dishes offered fluctuate in quality and quantity. At my last visit, we only were given 6 dishes, we usually get at least 8. One dish was not even edible bc of how spicy it was. I was also disappointed that they did not have tea automatically served for you. You have to ask, or you just get water. The Korean rice tea is one of the joys of Korean dining. Overall: I would come back when craving late night Korean food. Not a lot of options for Korean food in Cleveland, so having Meiga open until 10 is convenient. Seoul Garden on the west side is still my favorite!", "Date": "2013-08-17", "Author_Location": "Shaker Heights, OH"}, {"Author": "Kate A.", "ReviewID": "wwb6gzbQQYr_5INwPDfaPg", "Overall": "1.0", "Content": "Before I begin this review, I'd like to let the public know this: I am generally easy to please, as far as service is concerned. That being said, I had probably the worst experience of my life at Miega. Let me get the issues with service out of the way before discussing the food. First, It took ten minutes for receive menus after being seated, to say nothing of drinks. When we got our menus, the server dashed away from the table without asking if we needed anything, or bringing waters. We should have taken that as a sign, but we'd been told the food was good, so we decided to tough it out. Everything from then on was a chore. Getting watre and tea, refills water and tea, placing our order, receiving our order, where the f**k is our banchan, etc. The service here is a shining example of a spectacular failure.The food was boring at best, offensively bad at worst. After waiting for about half an hour, my boyfriend and I were finally able to place our order: a seafood pancake for an appetizer, bibimbap for my main, and a spicy pork dish for his. The seafood pancake took 20-30 minutes to come out, the bibimbap followed in about 10 minutes, and the spicy pork took another 10 minutes. I felt bad for my boyfriend. The seafood pancake was pretty much inedible. What it lacked in flavor, it made up for in grease. He couldn't eat it. I was starving, so I had a couple of pieces, and was really thankful when my bibimbap came out. Well, at least until I tasted it. It was the most bland, flavorless bibimbap I'd ever had. Let's be real here: bibimbap is rice with vegetables and meat on top. How is it possible to f**k that up? Miega found a way. The gojuchang that came with it tasted like ketchup. Disgusting. My boyfriend was still waiting for his pork, looking hungry and cranky. When it finally came out, it was missing a pretty crucial component: rice! It took about five minutes to flag down a server to ask. Then we waited, and waited, and asked again, and waited.... The rice never showed up. Who serves a stir fried dish without rice? The dish itself was as bland as everything else, and doused in that same ketchupy gojuchang. By this point, my boyfriend didn't even care... he was just happy to finally have some food in front of him.Oh, and did I mention this place is friggin' expensive? $45 for lunch for two. To summarize: We were there for two hours, had the most inattentive service of our lives, had a really bad lunch, and still had to drop nearly $50. Bummer.", "Date": "2013-10-21", "Author_Location": "Lakewood, OH"}, {"Author": "Jaime W.", "ReviewID": "7Xj9Acddwzg1HBt56NmTnA", "Overall": "4.0", "Content": "I went here with a friend on a weekday and lucky they close later than 9 because none of the other Korean places were still open. Anyhow this place just opened not too long ago and the place is pretty much decked out. Great traditional door that can found in the Korea houses used mainly as their exit door. Each table has a bell service option which I find awesome and rare in Cleveland. So anytime you need something, just ring the bell and someone would come attend you. On to the food, this place has a great selection to choose from. From your traditional appetizers such as Korean dumplings and Ddukkbokki, they also had a Chinese-Korean dishes like Jjangmyun that I like so much and Korean BBQ! This place has it all and the prices were a bit pricey but the portions were plentiful. We ordered their ddukbokki and tried it for the first time. I was disappointed due to the lack of taste. In other words, it was mainly all of the rice cakes in a pool of tasteless red chili paste. It wasn't hot enough and maybe I have a standard from eating from Seoul but I was not a big fan of their version whatsoever. There were fish cakes, onions in the dish but when it comes to Korean food, the chili paste is everything. For the main entree, I ordered their jjangmyun and this was exceptionally tasteful. The pork was tender and the black bean sauce was great. I'd have to come back to try their BBQ!", "Date": "2012-10-18", "Author_Location": "North Royalton, OH"}, {"Author": "Jennifer W.", "ReviewID": "DSlyjyE2xO8Vu3kJRbWCgw", "Overall": "5.0", "Content": "What is a non-meat-eating, half-Korean gal to do? Since cutting most meat out of my diet, I had very rarely looked back... until it came time to go to a Korean BBQ with friends. It was the first time I found myself longingly craving meat. The bulgogi and samgupsal and even kimchi jigae was now pretty much off-limits.However, I discovered that Miega is by far the most accomodating Korean restaurant in Cleveland when it comes to non-carnivores. It is not on the menu, but if they have the ingredients, they will make the most beautiful, delicious platter of vegetarian gim-bap (Korean sushi) with freshly cooked fried eggs. The kimchi jigae is already made vegetarian (the pork is added after the stew cooks, so it's easy to omit). My husband ordered vegetarian bibimbap and they left out the bulgogi and added tofu in one of the most beautifully-arranged bibimbaps I've ever seen!I occasionally eat fish, and this is the place to have it! The grilled mackerel is delicious with rice and kimchi. All of the banchan items that are served before the entrees have been delicious!   The servers are wonderful - I always enjoy trying to use the very, very small amount of conversational Korean I know with them, and they are happy to humor me and offer pronunciation help. Tip: Another great thing about Miega (I hope/think)  is that it is BYOB. We have brought a bottle of wine to dinner there a couple times. When I visited Korea, drinking soju with every meal was customary - I now tend to feel like any Korean dinner (well, I guess any dinner) seems more festive with a bottle shared with friends.", "Date": "2012-07-19", "Author_Location": "Cleveland, OH"}, {"Author": "Christine L.", "ReviewID": "DKztG4oK5mPqloS60adDNg", "Overall": "2.0", "Content": "This spot definitely has *better Korean food than other places in Cle. But by no means an authentic experience.  Satisfying for a quick Korean food fix though!", "Date": "2013-11-07", "Author_Location": "Cleveland, OH"}, {"Author": "Dick S.", "ReviewID": "dJShMI7I_DlTFfW_e9oIkA", "Overall": "5.0", "Content": "I returned to Miega and fortunate for me. Never in all my many decades on this earth had I a better server. She brought me a salad, many varieties of banchan, a fork, some soup, and smiled as I asked to move far from the table with two young women and an abundance of unruly kids. The word to describe this young woman has yet to be invented. Had I just returned from Afghanistan after ten years, me own grandmum could not have made me more welcome at her kitchen table. Years ago cousin Kathleen met me at the Honolulu airport with a plumeria lei. She rushed me to her favorite Korean restaurant and ordered bi bim bap.  I had no desire for rice again for months and no longing for bi bim bap ever again. But because Miega's prices are steep I thought I would order one of the less costly bi bim baps. I forgive you Kathleen, it is a good dish. Just goes to show no matter what you have seen, some one can come along and show you better. Thanks Miss Wonderful Server.", "Date": "2012-06-13", "Author_Location": "Cleveland, OH"}, {"Author": "Funglin W.", "ReviewID": "RsUiDLsN5IfLcndHsDGWAg", "Overall": "3.0", "Content": "Sigh. I heard Miega gamed it's fame when it had a booth at the Cleveland Asian Festival and was asked to start a restaurant. Because of that, I was really excited about their food. Sad to admit, it's not that authentic and Seoul Garden out in Parma is still way better.Pros: good amount of good, nice variety of sidesCons: not authentic enough, their food is a bit on the sweet side (specially the apChae), service was slow. Side dishes-- my favorite part of Korean restaurants are always the sides. Miega has one of the better variety of side dishes in Cleveland. Sadly, it's still not as good and as much as Seoul Garden's. And, if my friend and I didn't ask for their steamed egg side dish, they wouldn't have brought that out... which indicates a bit of bad service or frugality? Entree-- I love that they give big portions for the Kalbi but it didn't taste very authentic and it was a bit too sweet for me. The Japchae was the same-- big portions, but a bit sweet.I think Miega is a decent Korean restaurant in Cleveland, but it could be better.", "Date": "2012-06-03", "Author_Location": "New York, NY"}, {"Author": "Kenny Y.", "ReviewID": "H_qv-aJbZQJqKw1gxGVK0w", "Overall": "4.0", "Content": "The restaurant has improved on their karaoke room (they prettied up the room and got a bigger TV), so I wanted to write a quick update.  A couple of things to mention about their karaoke:1) It's free.2) The room is set up in an American style, even though they use Asian karaoke books.  That is, there is a stage with two microphones, and people sing facing the audience versus facing the TV.  They also have a disco ball and a smoke machine.3) The song selection is not as good as Korea House - there are distinctly fewer recent songs.4) They kicked us out at 9 pm on the Friday we went because they \"needed to set up the room for the next day.\"For being free, it's pretty good.  But otherwise I'd say Korea House is your better bet.The service here is still impeccably good (with the cute little call buttons at the tables), and the food is still quite delicious.  The stone pot bi bim bop is decently-sized and tasty, and my friends really like their tofu soups. They no longer have the steamed egg side dish that I mentioned in my earlier review.", "Date": "2012-03-30", "Author_Location": "Cleveland, OH"}, {"Author": "Jeff B.", "ReviewID": "_BPN9GLcsFG2RKkIWw0RPw", "Overall": "4.0", "Content": "This place rocks it with their _____ out.  The decor  is pretty amazing.  A lot of the art work was from the guy next door.  Oh yeah come for Korean and you get an art show too. Did I mention that the Japanese drumming squad practices upstairs  as well, you may get some pretty cool music on a Sunday!I was the only person there for an early dinner during the week. There was some Korean soap opera on their TV,  I kind of had a look of befuddlement on my face and they changed the show to some Korean  music video stuff.  I'm not sure which was the lesser of two evils. Back to the important stuff.The service was great,  The two ladies that took care of me made sure my water and  barley tea were never empty, as well as my banchan side salads.  I think I was offered 8 different sides. They some how knew I did not want the uber fishy mini fishy anchovy things, I was glad about that! The only thing I can think of imagine kissing someone with that on their breath!I ordered a spicy pork dish on a sizzling platter. It was very good, I asked for it to be Korean spicy, and it was a 6 out of 10! The other dish was the kimchee Jigea or something like that.  It is a kimchee,pork and tofu stew, Very tasty was well. This is good vibe place.", "Date": "2013-01-23", "Author_Location": "OH, OH"}, {"Author": "David M.", "ReviewID": "VvWPjo5yJKQpsj4Q_nHDvQ", "Overall": "3.0", "Content": "I went here with a friend who'd never had Korean.  I'd not had all that much Korean, either, so it was an adventure for me, too.  The prices were substantially higher than I'd expected, but the dolsot bi bim bap was fairly cheap.  They brought out the panchan, and it was delicious.  They offered more, but by the time my friend and I got through it, they brought us what I think was miso soup and our meals.  The miso didn't have any tofu in it, but the broth was good.  If it wasn't miso, I'm going to feel like an abject idiot.  The hot pots were fantastic;  the chili paste they give you really does something different to the dish than hoisin or other similar sauces.  All in all, I was pleasantly surprised.  The best part;  the restaurant is almost always empty, so service is pretty much instant.  The staff is super-polite and will go out of their way to make the restaurant work for you.  Could it have been better?  Yes;  even with the chili paste, the food seemed a little bland.  I hate to sound whiny, but the prices felt fairly high for Asiatown.  I might be spoiled on paying $8 for monstrous piles of food or bowls of soup, though.", "Date": "2011-09-21", "Author_Location": "Cleveland, OH"}, {"Author": "Joyce H.", "ReviewID": "M8-2QNXmAv-nc6hKx-Kw1A", "Overall": "3.0", "Content": "I was reallllly excited to try Miega with some friends. We are on a quest to find good Korean food in Cleveland.Miega is located on the 2nd floor of the new Asia Town Center. It's a cool space and I'm glad there are some small businesses there! Miega is the lone business. The inside has an updated look with warm colors. We got there fairly early (5pm) and there were a few people, but more people came in through the night (5-6 more tables?) It definitely has the feel of a restaurant that's just starting out.I ordered the dolsot galbi bi bim bap, which is rice, vegetables and beef short ribs in a sizzling stone pot. The rice got REALLY crispy, which was amazing! Mmm. The galbi was ok. I think it wasn't as soft as it could have been and the cut seemed a little thick. I also tried the kimchi jigae. I'm more sensitive to spiciness, but my friends said it was a little tame for the spicy ones they've had in the past.I guess the reason Miega is a 3 is because we are still on a quest for really good MEAT. As my bf says...no one does meat better than Koreans! Also - do not be mislead. There are no BBQ grills on the table here. They do have LA Korean BBQ that you can order though. (I just learned about what LA BBQ is! Basically, it's Korean American bbq v. the kind you would find in Korea.)Banchan was good - they gave us 8 little dishes/appetizers. They were pretty decent. I thought we'd be able to finish them all, but we couldn't by the end of the meal...", "Date": "2011-11-22", "Author_Location": "Cleveland, OH"}, {"Author": "Amy C.", "ReviewID": "Ia6hTJzQcTdwtJTx0HtDng", "Overall": "3.0", "Content": "For this new Korean restaurant in Cleveland, I tried the dol sat bi bim bap, which was tasty and had teh nice crusty layer of rice on the bottom (my favorite!).  I wish there were more meat though.  My friends and I also split a seafood pancake, which was fantasticly delicious with large chunks of seafood in it.  The side dishes is really what knocked it down a star for me because they were just 'ok'.  I've definitely had much better side dishes before, and I think that was a miss here.  The decor was nice, and service was friendly, though a bit slow.  Some tips: bathroom is outside of the restaurant to the right, and there's a karaoke room across the hallway too.  I found that interesting.  Restaurant was nicely crowded when we went on Saturday night around 7PM.", "Date": "2012-02-26", "Author_Location": "Mason, OH"}, {"Author": "Victoria N.", "ReviewID": "NcL8hXZ39gYHURmlI6yDTg", "Overall": "4.0", "Content": "Korean BBQ is not as good as Korean BBQ in California or east coast .. However still better than the mid west Korean BBQ options . It still has all the basics and good enough that I will return to eat there . There aren't too many Korean restaurant options in Cleveland .", "Date": "2013-04-11", "Author_Location": "Yukon, OK"}, {"Author": "Quin A.", "ReviewID": "Z44jIM860vO1Wf9TBVn6Rg", "Overall": "3.0", "Content": "This fairly new restaurant is on the second floor of Asia Town Plaza on Superior Ave. not to be confused with Asia Plaza on Payne. This establishment is nicely decorated with an inviting, comfortable atmosphere. We arrived around 3pm for a late lunch; we were the only diners there. The service was good, attentive and efficient. Even though it was 3pm, they allowed me to get their lunch specials (the menu said lunch was from 11am - 2pm). I ordered the braised short ribs lunch box which came with a bowl of miso soup. Our server brought us 5 side dishes as accompaniment to the entrees we ordered. The food came quickly. My lunch box had six different items within - the beef, fried rice, salad, noodles, radish, and dumplings. It was a lot of food for $11.95 The food was tasty and I would get it again, but perhaps with another type of meat (they has pork and chicken too).My spouse ordered some pot stickers as an appetizer which arrived super quickly. Those were served with a nice dipping sauce and were delicious. She also ordered a tempura dish which she did not like because it was not served with any sauce. (I think it was supposed to and the server forgot)I would visit this restaurant again to try other dishes.", "Date": "2011-09-14", "Author_Location": "Akron, OH"}, {"Author": "Faith C.", "ReviewID": "FjbvLCTmW8s6B4DVwZC7JQ", "Overall": "3.0", "Content": "I'm not familiar with Cleveland so it took me a while to find the restaurant. You actually need to turn on 38th Ave. and then turn into the parking lot of the grocery store. When you go in, go up the stairs and you'll see Miega. Miega seemed to be the only store upstairs, but I didn't really look around. It looks as though the building is being remodeled and maybe there will be more restaurants/stores coming soon. First off, I think that the name of their restaurant is misleading. The reason i decided to come to Miega vs the other Korean restaurants in town was because I was expecting a Korean BBQ with a grill at each table where you can grill your own meat.  I was a little disappointed to see this was a Korean restaurant not a Korean BBQ. There were no built in grills at any of the tables. I honestly think I should give this restaurant a 2 star rating because I was very disappointed that it was not an actual Korean BBQ! Very misleading!! Change your name!As far as Korean restaurants go, it's not a really fancy restaurant but seemed like a clean, quick place to grab a bite to eat. There was a large screen where you could watch Korean TV.Food:The bahn chan (side dishes) were pretty good but they didn't offer us any refills. (But we didn't ask for refills either). They had a lot of the typical bahn chan like kimchi, bean sprouts (kong nah mool), fish cakes (odeng). I really liked their pickled hot peppers and the small little korean pancakes.  For the meal, we got the Galbi dolsot bibimbap and the Jja jang myun. The galbi in the bibimbap was pretty tasty but it didn't seem like there was much of a variety for the vegetables in the bibimbap. As for the Jjajangmyun, it was sweeter than what I'm used to.  It also seemed that the noodles were dry noodles that they boiled as opposed to the fresh dough ones. (Although I may be mistaken). There were also a LOT of onion and not much meat in the sauce. Definitely not the best jjajangmyun that I've had but better some places. I decided to give Miega a 3 start rating because the banchan was pretty good, the service was good, the waitress was nice and attentive (but then again there were hardly any other people in the restaurant), and overall the food was ok for the price.", "Date": "2011-09-20", "Author_Location": "Toledo, OH"}, {"Author": "Rick M.", "ReviewID": "g77y1LkXkST1K2APUqu1gQ", "Overall": "4.0", "Content": "Very nice lunch. I think this place will catch on. Love the sides. Waitress very friendly. Got enough food for three.", "Date": "2011-12-17", "Author_Location": "Lawrenceburg, KY"}, {"Author": "Mark L.", "ReviewID": "tQc44icuhZeDW2J8e9sOLw", "Overall": "3.0", "Content": "I was excited to try a new Korean place out and was hoping it would replace Seoul Garden in Parma as a closer alternative since I moved to the east side.  Ultimately it turned out to be average, if not underwhelming.It's a nice little spot located on the second floor of the Asian Town Center. I was expecting grill tables (a la Seoul Hot Pot) due to the namesake (Korean BBQ) but was left a little disappointed when not one was in sight. The place was packed to the brim on a Saturday night, and the service was very friendly although not very dependable.We made reservations but still had to wait about 20 minutes, which wasn't much of an issue since most of our party was late. Our table had a nifty little button on it that allowed us to summon our server. It wasn't as effective as we hoped because it took a while for the server to get to us, but it's nice to know they give customers the ability.  We had a big party so our server was a little confused with our orders and we had to go around a number of times. They also missed one of our orders.We had a decent array of banchan, most of which tasted very good, but still can't hold a candle to the wide selection Seoul Garden offers.  We started off with \"Gu Man Du\" (fried dumplings), which tasted phenomenal. For the main entree, I ended up ordering Bok Eum (octopus, squid, veggies in a VERY spicy sauce). I was a little disappointed they didn't offer Tteokbokki, which I thought was a traditional dish and figured this would be similar. I will just say that this dish is EXTREMELY spicy with not much other flavor to it at all. I love spicy Korean but if it just feels like I'm putting spoonfuls of red chili paste in my mouth then it's not much of a meal. I was sweating and my mouth was on fire. I wouldn't order it again.Others in my party ordered: - Dol Sot Bi Bim Bap, which did taste great- some spicy pork dish I can't remember the name of, but it tasted JUST like my dish except with pork- noodles in a stir fried black bean paste, which was a bit different to me but accurately prepared according to the one who ordered it and loved itOverall, I wasn't impressed but didn't think it was too bad. I would go back but I wouldn't be in any rush. They have some menu items that I am interested in trying still, such as their japchae, bulgogi, Korean pancake, and galbi.Oh, and prices were a little jacked up compared to other places but not by much.", "Date": "2012-01-11", "Author_Location": "Cleveland, OH"}, {"Author": "Theresa C.", "ReviewID": "YCRs37txJmV-GO19ikRRDQ", "Overall": "3.0", "Content": "I do like the little appetizers they provide before dinner. those appetizers are worth 4 stars themselves. Food wise, I'd only give it a 3.5 overall. If you order the right dishes, it's a 4 star, otherwise, it's really just a 3. So choose wisely.I would NOT suggest the dumpling soup with rice cake dish. Even though I actually liked their frozen dumplings, it wasn't even fully cooked when they brought it out. It was fine after we soaked it in the soup for a while, but that was not the most pleasant experience when you want some nice warm soup. Also, their hotpot combo dish isn't the best in the world. We got the one with beef, ham, and veggies. It's the cheapest combo, and you can tell they do also provide you with the cheapest quality of meat. Chewy beef and spam, not exactly what I had in mind just reading their descriptions.However, they do a very nice job with the pork bellies. It came out sliced really thin. (4 stars for the thin slices) I hope you know how to cook them yourself because they seem to have a shortage of staff members to help you cook sometimes. Would I go back again? Yes because it's close to me and it has good appetizers. I'd go back for some more pork bellies too. But if I had other options, I'd choose other places to go instead.", "Date": "2011-10-18", "Author_Location": "Pittsburgh, PA"}, {"Author": "John G.", "ReviewID": "xxHEfBBdePxTn3v6pCz0WQ", "Overall": "4.0", "Content": "First foray into Korean food, and I was pretty impressed.  Don't be afraid to ask questions (we had NO clue what the \"sides\" were when they came to the table), and enjoy the unquestionable goodness that is Korean food.After your meal, go downstairs to the market - a great day out!", "Date": "2012-04-13", "Author_Location": "Cleveland, OH"}, {"Author": "Mariela M.", "ReviewID": "fbAe9LtwVN3hzrBhibn4-A", "Overall": "4.0", "Content": "First time here. We had a large group so we called ahead. Both the service and food were excellent. The seafood pancake and the homemade dumplings (steamed and fried) were great. I ordered the Dol Sot Bi Bim Bob which is served in a hot stone pot. This is great with the red pepper paste. I definitely recommend this place and will go again.", "Date": "2013-03-20", "Author_Location": "Westlake, OH"}, {"Author": "David E.", "ReviewID": "e394kBTPtVuDy6xUpvcQgA", "Overall": "1.0", "Content": "I think most important thing is to have good servers for restaurants.After going here twice and having bad experiences both times, it's hard to recommend this place to anyone and the food definitely doesn't compensate..Seoul Garden at Parma still rocks this place, although Korean food in Northeast Ohio  overall is not the best..", "Date": "2013-01-30", "Author_Location": "Novi, MI"}, {"Author": "P W.", "ReviewID": "eL3HoD0ZGRtqiruo5Wm19g", "Overall": "5.0", "Content": "My friend called me last Saturday asking if I wanted to get some brunch at Le Petite Triangle. We went and there was a wait as usual. I flipped through some bookmarks on Yelp and we decided on Miega. There is a weird false door with a crazy face on it. Don't try to go through that one or else you will look dumb as we did. There was a martial arts class going on across from the restaurant which was cool to walk past and see. The interior of the restaurant is contemporary and very clean. The music that was playing was awesome. They had some Korean sounding hip-hop which reminded me of an album my brother gave to me for Christmas in '97 or '98 called Bomb Worldwide: International Rap Compilation. I love to hear rap music from other countries. The service bell on the table was very cool. I am definitely not the prude I once was and now really enjoy Korean food. My favorite dish was S15 Gal Bi Dol Sot Bi Bim Bob. My friend and I both agreed that this was one of the best brunches ever. My little hangover was gone immediately.", "Date": "2013-07-30", "Author_Location": "Cleveland, OH"}, {"Author": "Vince L.", "ReviewID": "toWNWZmWJ5bSRDzUJiAVkg", "Overall": "4.0", "Content": "ok, so feeling a little more merciful today  (like my role model, Commodus -- \"AM I NOT MERCIFUL?\"), i decided to give Miega another shot.  due to my odor control issues, i went alone this time.so going solo to a Korean restaurant, one always wonders if they'll cheap out on the panchan-- and not only did they not do that, but the panchan was far improved from the last time around.  (do these restaurant owners actually read these yelp reviews or something???)so yea-- instead of the 4 lame-os i got last time, this time they gave me 8, including the cool fluffly Korean poached egg thingy.  (Koreans, forgive me for totally disrespecting that marvelous dish;  i have no idea what it's called.)so yea-- they were just courteous and attentive and gave me all the cool frills, even though i was a party of one.the dol sot bi bim bap was also, dare i say it-- perhaps even slightly better than the other ones i've tried in Cleveland.so-- upgrade.  4 stars.AM I NOT MERCIFUL???", "Date": "2011-07-15", "Author_Location": "Sacramento, CA"}, {"Author": "Kara T.", "ReviewID": "RLJ_G_1PbWsXN2ryfBenMw", "Overall": "5.0", "Content": "Stopped by for lunch and was amazed by the amount of food for the price! You will never leave here hungry. The lunch box I got was perfect. The steak was tender and could tell that all the food was fresh and of good quality. I was very impressed and plan on making this a common lunch stop. Thanks to everyone over at Miega!", "Date": "2012-10-26", "Author_Location": "Cleveland, OH"}, {"Author": "Maru H.", "ReviewID": "2lktPSXjLTZsiinqhq7h8g", "Overall": "5.0", "Content": "The best thing about my visits to Miega is the service-- you can tell the owners care about making quality food. A friend of mine mentioned in passing that her kimchi fried rice was not seasoned enough, and the owner/manager visited the table to personally ask if the dish could be improved in some way. The three dishes I have tried-- dol sot bi bin ba (make sure to get the dol sot version, because it comes in the hot stone bowl!) , a fried octopus dish, and hearty stew-- were all as tasty as you could ask for. Miega also has a karaoke room, which you can request for free! Tasty food, great service, and free karaoke-- I'd give it 4.5/5.", "Date": "2012-07-01", "Author_Location": "Cleveland, OH"}, {"Author": "Mike M.", "ReviewID": "Cx-nSDSaVQQKi5mMmSn5BA", "Overall": "3.0", "Content": "Dol sot bi bim bop. With a dish name like this it has to be authentic. Yo it was made out of Beef, bean sprouts, egg yolk, over rice. In a hot stone pot which kept the food at times burning to the tongue. Miso soup was good.  Tea was unique as well. Gave it three stars for now until I eat at the restaurant to check out the service. I would recommend if you are craving authentic Korean BBQ.", "Date": "2013-01-04", "Author_Location": "North Royalton, OH"}, {"Author": "Sue M.", "ReviewID": "VyAqthCZlXGHFtcrZThw1g", "Overall": "2.0", "Content": "The restroom and floor in the corner where we sat had evidence of mouse poop!  We didn't get what we ordered.  What we got was good!  The hostess took our menu before we placed the order...They seemed preoccupied with the large table of 15 and could care less about the rest of us.  We had tlo get up to get more water.", "Date": "2013-07-15", "Author_Location": "Moreland Hills, OH"}, {"Author": "Hyun H.", "ReviewID": "u8NNkj-D70yiyvaMp5dd5g", "Overall": "3.0", "Content": "Ok. This time, I went around 3:30PM, which is probably the least busy hour. It was. Apparently the waiters we encountered before were only there if it's busy. Imagine that. Anyways, the service was greatly improved obviously, since there were only 3 parties including us at the restaurant. Neat! The lady (I'm assuming she's one of the owners) even asked what sort of Korean show I wanted to watch :P So.. why still 3 stars? This time, I'm just being very critical of the food. Last time, the AWESOME food made up for the sub-par service. This time, the service made up for the sub-par food. I guess I was expecting a lot given my past experience.. We ordered  steamed dumplings, Jjamppong, which is a spicy seafood noodle soup dish, and tang-soo-yook (sweet and sour pork). First off, the dumplings were probably some of the best I've had. They make it fresh, all hand made and lucky for us, they actually made them that day. It was just awesome. Everything a dumpling should be :) For the jjamppong, I was quite disappointed to see how not spicy it was. It had a LOT of seafood in it which was really nice, but the broth was really missing in its spiciness. Where was the kick I experienced with the ddeokbokki? The noodles could be more chewy, as they seemed a bit too soft to be used for that particular dish. Perhaps I can ask them to make it spicier? But seriously, I'm not that good at eating spicy things yet I could not feel anything spicy-wise at all. :/ Bummer-. On to the sweet and sour pork. Well...this... I mean.. The dish looked really good. It had all the elements of a good sweet and sour pork (a bit on the Korean-Chinese food style).. But the pork smelled. Quite a bit. The pieces of meat was quite big and it could have been awesome aside from the smell. I'm not that sensitive to meat smells so if it was to a degree that I could smell it, I'm really not sure how other more sensitive people might have felt eating that dish. The tempura coating became soggy within a few minutes, which you really don't expect on a sweet and sour dish. It should have stayed crunchy for at least the length of the time we were dining, which was around 30 minutes or so. Major turn off there too. The sweet and sour sauce itself was way way too sweet, so at the end, it was a hunk of smelly pork covered in soggy tempura coating in a sickeningly sweet sauce. Seriously, will probably not order again. :/So... All in all, I'll definitely return to Miega for the dumplings, ddeokbokki and pa-jun. I did make it my goal to at least try most of their dishes, so we'll see how that goes. I do wish some of the dishes cost a bit less..but... well, I guess Korean restaurants are on the scarce side.. Miega, we shall see you again soon.!", "Date": "2013-02-16", "Author_Location": "Cleveland, OH"}, {"Author": "Anthony V.", "ReviewID": "cZAygR_v0ENViQJ3yjuClQ", "Overall": "4.0", "Content": "Doesn't have the LA korean style bbq but they do have the table top grill! The seasoning on the steaks are amazing and the staff is extremely on point and warm welcoming.  I totally recommend this place and their food. Dont set ur standards too high and expect it to be like NY or LA.", "Date": "2012-09-05", "Author_Location": "Mentor, OH"}, {"Author": "Warren K.", "ReviewID": "1bMiLW2BLhv2L-bg5rynpA", "Overall": "2.0", "Content": "I went there to find a better Korean Restaurant in Cleveland but I decided to make it the first and last visit. Food: taste is just plain with not many selections compare to other places.  The most important thing is price!!!!   It's quite expensive and overpriced. I had thought Korean house across the street was very expensive but here is like 30-50% more expensive than other places.  I can name several cheaper korean places with better food quality. Decoration is great since it's brand-new restaurant. Place is nice and clean. Service is just ok. Only one person does almost everything. We had to wait for water, bill, food, etc. But that's not too bad. Overall, I probably do not go there again to pay overpriced food there (Hot pot is like 36-40 compare to 25-28 at Seoul Garden)", "Date": "2011-09-18", "Author_Location": "Cleveland, OH"}, {"Author": "Deren S.", "ReviewID": "6su4iZ7J7jeJoHB4c68KlQ", "Overall": "4.0", "Content": "Best Korean place in the Cleveland area so far.", "Date": "2012-06-12", "Author_Location": "Oskaloosa, IA"}, {"Author": "Denise D.", "ReviewID": "fwa6v-o7kZb4AzPp_U1xcQ", "Overall": "5.0", "Content": "Service is amazing and the food so delicious!!!", "Date": "2011-09-12", "Author_Location": "Mt Vernon, OH"}, {"Author": "Frances M.", "ReviewID": "-g_TRCSDWavqGtI9GSpwOQ", "Overall": "4.0", "Content": "Somehow this place has been hiding from me for the past year - I am an avid Korean food fan and was resigned to occasional visits to Korea House when in Cleveland, as there are just too many great places in NY, DC and CA to compare inferior Korean food to.  However!  This place was so pleasantly surprising that I was motivated to write my first review since moving to CLE.First of all, it's very clean and modernly decorated.  Pleasant lighting, lots of space, shiny surfaces and quaint little seat cushions great you when you come in the door.  We were seated in a booth on the side because we had a larger party.  The banchan - excellent variety, better than I've seen at Korea House.  They included: bean sprouts, pickled cucumbers, seaweed noodle things, cabbage kimchi, shittake mushrooms, broccoli, seaweed, kohlrabi, anchovies.  Very good quality pickled dishes as I didn't try the seafood ones.  The entrees - we ordered the japchae, galbi, dolsoht bibimbap, and kimchi pajeon to share.  It was just the right amount of food for 4 people.  The kimchi pajeon was very crispy on the outside, had good flavor, was maybe a tad too thick but pretty good.  The japchae was excellently cooked, really nice flavor but could have have more veggies.  The galbi was marinated really well, had a grilled look to it and my only suggestion would be that it was a tad on the thick side (but I am a snob about it so it's probably not that big a deal in the grand scheme of things).  The dolsoht bibimbap was the best I've had in a long long time - there were so many crispy rice parts at the bottom and they give you just the right amount of sauce to put in, and there was bulgogi in it as well!  The highlight of the meal.The service - impeccable.  We had a nice young guy who was always attentive and there to give us extras of the side dishes, and came by with extra soup as well. Overally, I really feel like this restaurant deserves to do well in this city as it delivers quality Korean food at a comparable price to other places, and the experience was a pleasant surprise.  I think they haven't had much buzz due to their location (Asia Towne Center) which even I haven't been to before (and I've been in CLE for 3 years complaining about lack of asian food to eat), and I'm sure there are many other people who haven't heard of this place who would love it as well!", "Date": "2012-06-03", "Author_Location": "Seattle, WA"}, {"Author": "Annemarie G.", "ReviewID": "ZcntmK8hQEFwBdXLpqOmpA", "Overall": "5.0", "Content": "GREAT RESTAURANT!!!! The food is so excellent,so yummy. They are so nice and great service. We took are 5 year old daughter and they made her a bowl of soup with her favorite,noodles! She ate almost the whole bowl and raved about it. I love the inside and all the art work and details. This is really a great place!!!!", "Date": "2013-05-21", "Author_Location": "Cleveland, OH"}, {"Author": "Burnetta H.", "ReviewID": "jIWWTpuPt6JRNL8mQOdrxQ", "Overall": "4.0", "Content": "I liked it and I will be returning. I am an African American female who dates Asian males and so I'm exploring different Asian cuisine Tonight I ate at Miega Korean Barbecue Restaurant in Cleveland, OH and even tho I have dated Koreans before this was my first time eating Korean food...I did not care for the famous Kimchi and I would assume this is an acquired taste from birth. I really believe you have to be raised on some things to like it. Other than that, the fried chicken with salad, the white rice, and the sauce that came with the chicken were very good. I actually loved the breaded crust of the chicken and sweetness of the sauce...The salad that came with it was just lettuce with dressing pour over it but it was nothing else in the salad so it could use more stuff in it to be an actual salad. The Korean soup was good it had fresh raw green onions in it and it had a good amount of flavor. The other five sides were potatoes cut up julienne style, egg plant, zucchini, some shredded string beans, and like I said the Kimchi...I only ate broccoli. So I pay 14 for some chicken with sauce, some rice, and lettuce, with two broccoli mini spears...really should have been half the price for that...I was told that if you eat in because mine was carry out...but yeah if you ate in you actually get nine to ten sides...wow that's plenty...Overall, I liked it and I could see myself going there for lunch often...and for dinner hopefully I might meet some sexy Asian man...who knows...but I will be returning...", "Date": "2012-12-22", "Author_Location": "Cleveland, OH"}, {"Author": "Randy T.", "ReviewID": "iw5dXnyT21FkflaijJDLYA", "Overall": "4.0", "Content": "Don't know why this place was so empty when I went to dinner here earlier this week.  I'm not a good judge of the authenticity of Korean food given that most of the restaurants I've been to are all in Cleveland, but I thought the food tasted pretty good.   I really liked the kimchi scallion pancake, which was tasty but not too greasy.  My friends and I ordered the Korean barbecue with two different cuts of meat - the pork belly and the sliced beef.  Extra points for the service that night - the restaurant was empty, so the waiter stuck around to cook all of our meat for us.  One thing that I would want more of were the side dishes - while decent, other restaurants serve a much larger variety.  The waiter informed me that the owners may be installing tabletop grills soon.  I told him to persuade the owners to install charcoal tabletop grills - if this happens, I'll definitely be dropping by more often.", "Date": "2012-09-08", "Author_Location": "Atlanta, GA"}, {"Author": "Amy C.", "ReviewID": "k-Q_pqTDA56lRkxPOUku9g", "Overall": "4.0", "Content": "So I've been here a few times, and I've been quite happy with the food served, but unfortunately, the service can rather slow at times.  The menu seems to be offering an increasing number of options each time I go, and most things I've tried thus far have been delicious.  One of my favorite dishes is a soup filled with rice cakes and seasoned beef (unfortunately I'm currently blanking on the name).   The bi bim bap is also quite tasty (best when served with kalbi!).  Many of my friends have enjoyed dishes served with whole fish, although I have found them a little bit too fishy for my tastes.  The banchan are also good, with various assortments of kimchi and other pickled vegetables.  The unfortunate part is that the service, although very kind, can be a bit slow when the place gets busy.  If the restaurant is packed, you may be stuck there for several hours.  The wait time is much better when the restaurant is less busy, however.  In addition to food, Miega offers karaoke in an adjacent room.  The room is spacious, allowing for a large party.  The equipment takes up a small corner, and the books offer an oddball mix of English, Korean, and Japanese songs.  Those interested in karaoke would be happy to note that karaoke is free with dinner, although only one room is available, so it's best if reserved in advance.", "Date": "2012-03-03", "Author_Location": "Cleveland, OH"}, {"Author": "Stephanie P.", "ReviewID": "Zfpm9yRJMqUVFoK0-IIXng", "Overall": "4.0", "Content": "If you are looking for a spicy change to the regular American/italian fare this place is the ticket. Expect some tantalizing spicy appetizers automatically with your meal. Unique restaurant and the building which houses a few artists allows for some interesting visuals. The only drawback was no liquer lisc. Still, the food is great and you can always slip a small bottle of Saki (or whatever )in your purse. Moreover, the staff/service is exceptionally polite.", "Date": "2011-10-15", "Author_Location": "Cleveland, OH"}], "RestaurantInfo": {"RestaurantID": "_hOXxRBu2vzA1MsRrVxBww", "Name": "Miega Korean Barbeque", "Price": "$$", "RestaurantURL": "/biz/miega-korean-barbeque-cleveland", "Longitude": " -81.66373910000000", "Address": "3820 Superior AveCleveland, OH 44114", "Latitude": " 41.512318", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/1Ks7DcvoOQvmUNBDVeLzGw/90s.jpg"}}