{"Reviews": [{"Author": "Sandra C.", "ReviewID": "NupJ2dsNKxAm0GweYfuOwA", "Overall": "5.0", "Content": "Curry bowl-3.5Mac and cheese- small 4Buffalo tempeh- good potion 5Smokehouse- good size 4.5Portobello- love coleslaw 5Gbk burger- good portion 4Macaroons-5Granola-5Could have more basic drink optionsCleanNice staff", "Date": "2014-07-09", "Author_Location": "Parkland, FL"}, {"Author": "Phuong M.", "ReviewID": "_SOj-I1xIBMy17BUsKTjeg", "Overall": "5.0", "Content": "Buffalo tempeh sandwich! Does not taste vegetarian/vegan at all. As a meat lover, I can attest that I actually crave this sandwich even though there's no meat in it! It's just that good! The other thing I got there was the avocado toast, which I also recommend. Great light snack!", "Date": "2014-06-28", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Salvatore D.", "ReviewID": "FQlZddkEY4OKnlo-XWTEbQ", "Overall": "5.0", "Content": "I met up with some friends and was finally able to stop by and give this place try. Green Bar & Kitchen is a nice addition to the area, especially since there are not many vegetarian or vegan restaurants in Fort Lauderdale. I ordered the buffalo tempeh and loved it! The buffalo sauce spicy was delicious, the texture of the tempeh was nice and firm, and the bread fresh. I will definitely order this again, but will see if they can toast the bread just for some added texture/crunch. One of my friends ordered the garlic hummus wrap and said it was amazing. Another ordered the mac & cheese, which is spiraled zucchini with a cheese sauce... Doesn't really taste cheesy (taste more like a tangy dressing, reminiscent of the tang you would get from cheddar cheese) but it's still delicious. The only thing that I was not a big fan of was the dehydrated flax crackers that came with another friend's garlic hummus. The crackers were not very crunchy and I had a slightly bitter aftertaste. I am not letting that affect my overall rating since it was not something that I ordered personally. Overall... I will definitely come back and really looking forward to trying one of their veggie burgers. Oh... I should probably talk about their staff/service... No complaints! The young lady who took my order was extremely nice and friendly, and gave me some good feedback when I asked for some suggestions on what to order. Please give it a try!!", "Date": "2014-06-13", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "John G.", "ReviewID": "r55LyySBiZui5tp1pnmRdw", "Overall": "5.0", "Content": "Had the Raw Tacos and the Buffalo Tempeh and both were really good. I wanted to get the Avocado Toast but the person taking my order was nice enough to say that while they were still serving it, lately the avocados weren't the best. I'll be back.", "Date": "2014-07-21", "Author_Location": "Boca Raton, FL"}, {"Author": "Mariam D.", "ReviewID": "avq1Z8v3G3iqJwwW8Sn7gg", "Overall": "5.0", "Content": "Happy Hippie here. Spirulina Sunday.  I found the Green Bar & Kitchen to be a shining example of a clean, conscientious dining alternative in Ft. Laudy and a fresh spot to practice mindful eating. Raw delight. I selected my blended power juice of kale, spirulina, banana, and coconut- it was tasty and refreshing.  The patio was full on our visit so we dined in.The Bar was buzzing with guests and service seemed to flow.  I observed that the flax pancakes were wildly popular and something I'll try on my next visit. I tasted a bite of my friend's plate - raw tacos- and the walnut and sunflower meat was lightly dressed and savory.  Finally, there was Kombucha on tap, and upon recently discovering that I enjoy this drink (or at least one brand, thanks to GT) I'd like to return and see how GB's compares.  I'll also take my friend's recommendation and try the buffalo tempeh. Go Green! Plenty of parking in a private lot on the north side of the 17th Street Causeway and west of Cordova Rd, in the strip mall behind the ole' Winn Dixie.", "Date": "2014-06-03", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Sarah H.", "ReviewID": "WX7mpbVGvPjxWyYzWNzb0w", "Overall": "5.0", "Content": "Great food, easy to get to and owner loves to hear feedback. Food was delicious and tasty. I couldn't tell it wasn't meat.", "Date": "2014-07-09", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Juan G.", "ReviewID": "-QQod--lb5-Cs_HY66fAqg", "Overall": "5.0", "Content": "Food is so good here. I had the Buffalo Tempeh Sandwich. It is really spicy and hearty satisfying! We ordered the Avocado toast as an appetizer, they brought all the food at the same time, but it really did not matter (I needed the avocado to cool down the gentle fire from the tempeh).  We ordered also the GBK Burger and it was delicious. To top things out we had vanilla soft soy based ice cream cones... So good. Will return for sure!", "Date": "2014-06-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jodi C.", "ReviewID": "GeYPCHrUi2DxdekbpGWgXQ", "Overall": "5.0", "Content": "Stopped in to visit GBK, every time I'm here I remember how much I foodie love them. Had the GBK burger with that delicious chipotle mayo and a BLT, both dishes did not disappoint, every bite as flavorful as the previous. The lady beside us had the raw mackn cheese which I found out was zucchini with \"cheese\" OMG did it look good. If I wasn't so full I would of ordered it, oh well, next time. I'm so happy to see they're doing so well. I remember when they were a food truck & I'd follow them  around now everyone flocks to their restaurant.", "Date": "2014-06-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "D B.", "ReviewID": "lWqXuieguuzFXtaxFMf48Q", "Overall": "5.0", "Content": "Hello AMAZING FIND in Ft. Lauderdale! This place is one of the reasons why I absolutely love and trust Yelp. We were visiting my mom and stepdad at their beach club and were looking for a healthy alternative for lunch and snacks. This place was PERFECT. Delicious smoothies, juices, salads, and tasty desserts. I loved the decor, the vibe, the staff. I'd be a regular if I lived there. It's a little slice of heaven in Florida.", "Date": "2014-07-01", "Author_Location": "Oakland, CA"}, {"Author": "Mike B.", "ReviewID": "xmprUx5GP785PLawyW4ofA", "Overall": "2.0", "Content": "This place is SOOO hit or miss, both in terms of food, and attitude from the staff.  The GBK burger is fine and comes on one of the best gluten free rolls I've ever had.  But I can't really recommend any of the other entrees I've tasted.  Also, the juice bar is not really a juice bar, in that you can't get a simple juice: only a frou-frou concoction with maybe 15 disparate ingredients that you might not want. Ask for a single juice or mixed juice and they refuse!  And in a really snotty way.  I felt like I was in 5 EASY PIECES...I mean, they had every juice I wanted, but wouldn't serve it to me!  I just drink water here nowadays.But that's par for the course: the counter people here are often as rude, snotty and unhelpful as can be: like they're doing you a favor by letting you eat here.  At the same time, the woman who typically brings the dishes to the table is so, so sweet and helpful.", "Date": "2014-05-22", "Author_Location": "New York, NY"}, {"Author": "Michael S.", "ReviewID": "kuwPlJrafidhAPDVVO7XGg", "Overall": "5.0", "Content": "I am a two-week-in apprehensive semi-vegan. Our first meal at the Green Bar & Kitchen on Saturday was phenomenal! Coconut Thai Soup to start. Smokehouse Burger and the Firecracker Bowl for entrees. Chocolate Ganache and Macaroons for desert.Firstly, the soup was thick, delicious, and as good as any I could make at home. I only wish it had been hotter (I prefer soup heated enough to sip). A-The Smokehouse Burger was better than any beef burger, period. I can't wait to order it again. Who needs beef when healthy can be this delicious? Although the menu says BBQ sauce, it reminded me more of a decadent cream-based chipotle sauce. The bun was also high quality. A++The Firecracker Bowl was delicious as well. On par with the best Asian restaurants. Loaded with protein and a tasty sauce with hints of lemongrass and ginger. I think some rough cut veggies would kick this dish up a notch. B+Now the ganache is so good I am going to begin working on a recipe at home. This could quickly become my staple dessert. A+The staff are very attentive and take the time to get feedback and ensure a positive experience. Who knew 100% vegan foods could be so good?!", "Date": "2014-05-05", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Ashley B.", "ReviewID": "xRfsguhkBUe_vOaf7ABkqA", "Overall": "2.0", "Content": "If you happen to have a problem or complaint while being a patron of this establishment, I can assure you (especially if you are a women) you will surely be greeted by the owner with a \"I don't know what to tell you\"... After ordering a brownie a la mode for my son, I saw the staff telling each other they were out of brownies. Instead of letting me know, they delivered the \"brownie a la mode\" with a cashew cup instead of a brownie. I got up from the table to let the owner know that this was an issue (obviously serving a nut product to a child with unknown allergies is a no-brainer) and his response was \"I already told the staff, I don't know what to tell you!\". Wow!!! It's been a long time since I have encounter a restaurant that cared so little to appease it's customers!!!Good food or not, I'm unwilling to support a place that treats it's customers so poorly. Such a shame considering there are so few restaurants that cater to vegans and vegetarians. Oh, and my day was great (aside from my experience at your establishment) and regarding the \"yelling\"... I was actually calmly eating my ice cream while assuring the guy it was not necessary to continue talking about the issue. Thank you for the recap though.", "Date": "2014-05-05", "Author_Location": "Grosse Pointe Woods, MI"}, {"Author": "Hannah S.", "ReviewID": "WWjkQd_KGkfCXj_7339OxA", "Overall": "5.0", "Content": "Un-freaking-believable. A meatless wonderland. A vegan Shangri La. A cruelty-free utopia. EAT ALL THE FOODS. THE SMOKEHOUSE BURGER. THE COCONUT THAI SOUP. THE IMPOSSIBLY CREAMY DAIRY FREE ICE CREAM. Oh, and it's Wayne Dyer approved. He's practically god, so that's a hell of a recommendation.Get there as quickly as you can, and get there hungry.", "Date": "2014-05-03", "Author_Location": "Miami-Dade, FL"}, {"Author": "Carissa P.", "ReviewID": "XKTKuaI2v7jtlD3qceR60g", "Overall": "5.0", "Content": "this is my favorite plant-based restaurant in the area!  They take vegan to a whole new level with items that my meat and potato husband even loves and craves!  I've had almost every item on the menu and can honestly say that they are all delicious as well as beautifully prepared/presented.  You can tell the cooks have really done their research on meat and cheese alternatives (i.e. macadamia nut \"ricotta\", walnut taco \"meat\", \"cheddar sauce\")....all so delicious you don't even miss the real thing!  I've also had one of their smoothies and it's a nice change to the standard juice bar options; again, you can tell a lot of thought and research has gone into each ingredient and their holistic benefits.  Also, they have GLUTEN FREE BEER AND WINE AND THEIR VEGAN DESERTS ARE TO DIE FOR! I can't say enough great things about this place; try it for yourself!!", "Date": "2014-06-28", "Author_Location": "Pompano Beach, FL"}, {"Author": "Natalie J.", "ReviewID": "545y6xi_xnZxKTRfUVinWw", "Overall": "4.0", "Content": "Where else can you find gluten free food that is also vegan and tastes AMAZING!?! Only GBK.  Some of the hits on the menu include avocado toast, sweet potato spread (apparently whipped sweet potatoes with almond butter and spices)- one of my favorites, raw tacos, oh and fresh juices and smoothies.  The illuminated private seating outside, which is also dog friendly, makes you feel like you are in an oasis. You will see a lot of yogis coming here for a healthy sunday brunch after their class! Some items can be a little pricey...but then again eating healthy is usually more expensive.", "Date": "2014-06-30", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Andrew D.", "ReviewID": "_Jvu6iSpqlj369jtHWDppg", "Overall": "5.0", "Content": "I'm from LA and this would have to be one of the closes eateries to back home when it comes to , raw, vegan and fresh.!!!!  Now the service the second time was below average and disappointing by the manager himself. Unfortunate", "Date": "2014-05-05", "Author_Location": "Los Angeles, CA"}, {"Author": "Hope P.", "ReviewID": "f0ctlo1R5vimof9RXdb-6A", "Overall": "4.0", "Content": "Came to Green Bar and Kitchen for the GBK veggie burger.It's located off 17th street Ft-lauderdale in a strip mall. The interior is fresh and inviting with wood, white and green colors.I ordered my GBK veggie burger (13$) at the cash register To-Go, and waited on the patio out back where there are picnic tables, umbrella's and it was relaxing.I was overall satisfied with the burger the way a beef one would put a smile on your face.  The texture of the mix of brown rice, quinoa, chickpeas, carrots was very pleasant and flavourful.  The avocado slices were generous atop the veggie pattie.  There was lettuce, tomato and red onion as toppings, and a nice Flax bun to hold everything together.The sprouts in the burger give you extra energy, and I love the flav of sunflower sprouts.The chipotle-mayo sauce had a kick to it, and I did find the burger to have a good spice to it, and I love spice!The GBK burger came with a side spring green salad it came light with dressing and it was fresh.Great spot for vegetarian / vegan food, and a smoothie place .  Prices are higher, but what you expect to pay for fresh ingredients.I would order a veggie burger here again if I'm nearby, hungry and want to eat healthy for energy.", "Date": "2014-04-16", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Robin A.", "ReviewID": "aSFSpltd0b6udvTonmeWLw", "Overall": "5.0", "Content": "A healthy eater's paradise! Also wonderful for vegans and gluten free eaters. I came here for my birthday with my boyfriend who is a meat eater (I am too but I do enjoy the occasional vegan meal.) The avocado toast was amazing and the sweet potato dip was delicious. For our meals we had the roasted veggies wrap and gbk salad. The wrap was so flavorful and filling. I really enjoyed it. The blueberry tea was yummy too. Of course I had to have dessert. Brought home the strawberry shortcake cupcake and salted pecan chocolate chip cookie and both were so good they should be illegal! I'm coming back here soon and often! Also the prices are quite reasonable for such healthy and nutritious food.", "Date": "2014-06-15", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Sam S.", "ReviewID": "q2C8evCinyuymw2cQKtphQ", "Overall": "5.0", "Content": "Exciting dining experience for both vegans and the meat-n-potato crowd.  Every entree is a winner.  Order anything and you'll have a fabulous meal.  Save room for decadent desserts.  Astonishingly good selection of bottled craft beers.  Hard-to-find location behind the supermarket.", "Date": "2014-06-20", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jenny V.", "ReviewID": "-RNUVMmUX1p91DHk6XjMjg", "Overall": "5.0", "Content": "Love this place. I would recommend the GBK burger or the buffalo tempeh and any dessert they have available (blueberry cupcakes and pecan brownie are divine). The veggie wrap and mac n cheese were not my favorite, but that's my personal opinion. I definitely recommend this place.", "Date": "2014-07-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Rachel S.", "ReviewID": "ZxdL7uJ-32zJ4uQk2d-jvQ", "Overall": "4.0", "Content": "Here's what we tried:Firecracker bowl with tofu add-on: tasty, spicy, small portion, we did not detect any of the veggies listed in the descriptionGBK Burger. Over rated. It's good. (Not great) I was still hungry after the burger so I tried:Raw Tacos: tasty walnut taco meat in lettuce wraps. Jalapeño slices. Tasty but way too spicy (even without the jalapeños)Thumb print cookie- made of nuts. Good.The prices here are high for what you get. For these prices we'd expect ordering at the table, cutlery and water brought to us instead of having to go get the yourself each time.This review would have had 3 stars, but my friend complained about the lack of veggies in her Firecracker bowl and they gave us samples of their soft serve ice cream.I'd come back here only for that!", "Date": "2014-04-12", "Author_Location": "Miami Beach, FL"}, {"Author": "A L.", "ReviewID": "K3pgtywjg6rv545R8ZOgqQ", "Overall": "5.0", "Content": "This place is so unassuming from the outside, as it's located in a crap strip mall, but it is definitely a must-go if you're in the area and want a healthy fix. Green bar is as fresh as it gets. You pay for what you get - so don't expect this to be a cheap meal. Some favorites: Avocado toast, buffalo tempeh, the basic veggie burger, and I had a smoothie that was rockin. The hummus is blah and overpriced - I wouldn't order it. The atmosphere is fresh and clean - white and greens with a modern flair. They also serve beer and wine, along with great kombuchas and healthy sodas. A definite hidden gem in Fort Lauderdale - great for lunch or a breakfast smoothie to start your day on the right foot.", "Date": "2014-03-25", "Author_Location": "Boulder, CO"}, {"Author": "Mario R.", "ReviewID": "0keAR_HSKJDlRMwe6NOMvA", "Overall": "5.0", "Content": "Love this place, food is healthy and the ambiance is dope!!!! They have some of the best vegan treats around and they have this cookie called the Bad Ass Cookie which I haven't been able to find anywhere else.", "Date": "2014-06-06", "Author_Location": "Delray Beach, FL"}, {"Author": "Jenn M.", "ReviewID": "esXTNrjPeLvKb0v7ULrS6w", "Overall": "5.0", "Content": "I have been coming to Fort Lauderdale about 2 weeks a month for the past year and I finally found my \"go to\" location. I am not a vegetarian, but often have trouble finding healthy place to eat while I travel for business. This fit the bill perfectly.I had the hummus (excellent) and firecracker grain bowl (also delicious). On my way out, I grabbed a green juice and a piece of the \"cheesecake\" which I believe is made with cashews instead of cheese. Just fantastic. The only disappointment is that the smoothie bar was closed so I could not try that. The staff was also so friendly and welcoming. I almost felt like a local!I do agree with what other people have said about the ordering process feeling a little scattered, but that hardly dampened the experience. Great place - great food. I will be back - many times I am sure!", "Date": "2014-03-12", "Author_Location": "Madison, WI"}, {"Author": "Lowell J.", "ReviewID": "nja3sy_xrCC1594XWdL5BQ", "Overall": "2.0", "Content": "I really like the food but the ordering system of standing inline in the middle of the restaurant and the fight for a table BS is ridiculous. Please get some waiters and host/hostess to seat your guest and get a little organization in your restaurant please?", "Date": "2014-03-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Chart C.", "ReviewID": "me_0VzNimVaVWpZUQGpo2w", "Overall": "5.0", "Content": "Awsome! Should be more locations. Please come to Boca?", "Date": "2014-07-03", "Author_Location": "Manhattan, NY"}, {"Author": "Gina R.", "ReviewID": "WWsAzhm7gNTVgIHaYDty7g", "Overall": "5.0", "Content": "Yes yes yes yes yes!! Can't complain about anything. Food perfect, wait time short, staff wore a smile on their faces and every time I've gone (3 times in the past 2 weeks, and I live 45 min away!) I've always had a phenomenal experience :)", "Date": "2014-06-14", "Author_Location": "Pompano Beach, FL"}, {"Author": "Jenny R.", "ReviewID": "9dLt32PCREoydYyixt0OlA", "Overall": "5.0", "Content": "Excellent!! I was only in town for an hour and had the most amazing meal. I quickly typed into yelp \"juice bar\" and this gem came up. Delicious. I had the raw tacos and LOVED them --I also had ice cream and they added sprinkles. I bought a juice to go as I have a long drive ahead of me and wanted something healthy along the way. This was great and I highly recommend it to anyone!", "Date": "2014-03-08", "Author_Location": "South Yarmouth, MA"}, {"Author": "SB S.", "ReviewID": "_M-0yy8pIfyNlGpJL7keZA", "Overall": "3.0", "Content": "I'm not a vegetarian so I probably don't belong here. But it's cool, I get the whole clean eating fad so i entertained this place because my sister came the other day and enjoyed her juice. What she did not enjoy was the veggie wrap that came equipt with  a short and curly hair. Moving on, all these granola eating waiters need to pull their glorious locks back and slap on a hair net. Yes, your hair is long and well conditioned. No, I don't want to see your strands in my food. Ok. The food. I ate the Thai coconut soup. Yum. Just the right amount of spice. It could stand a little more cilantro but that's just personal preference. I tried my sisters quinoa burger. It was also pretty good.It's all clean and neat looking inside and very LA-ish out side. Nice vibe.", "Date": "2014-04-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Bruce F.", "ReviewID": "V77LZ3EYE32P0kcWJ-A3Cg", "Overall": "5.0", "Content": "Great vegan food !Sunday brunch has good choices. Make sure you get some side items for additional protein. Portobello burger excellent. Good smoothies, and everything. Haven't had a bad dish yet", "Date": "2014-06-08", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Tyra B.", "ReviewID": "6tpWyUXTiZXsiLQAsaOWrQ", "Overall": "4.0", "Content": "OMGosh....so good! Very friendly owner/staff, nice, relaxing ambiance.  But most importantly - LOVED the food! Fresh, high quality and great flavor. Avocado toast - yum, Veggie wrap - more yum, Tacos and GBK burger - even more yum.  Highly recommend!", "Date": "2014-05-30", "Author_Location": "Plantation, FL"}, {"Author": "Clint N.", "ReviewID": "_X3FIKb8-ElmpG1hDuDBoQ", "Overall": "5.0", "Content": "Best vegan food! Best atmosphere! Best service! I wish I lived next door so I could go there more often!", "Date": "2014-05-31", "Author_Location": "West Palm Beach, FL"}, {"Author": "Kristine A.", "ReviewID": "RCQYdzxAcXUCTvk5ABq1HQ", "Overall": "4.0", "Content": "Be prepared to spend some serious $$ here. It's in a really awful place & not easy to find, since there is construction right around the shopping center where this is. They have fresh juices & the one I ordered easy on the ginger was so strong they had to tone it down & it was still too potent. Their portions are pretty small, I ended up w/ an appetizer along w/ a meal & dessert but it was pretty damn tasty. Good stuff.", "Date": "2014-05-21", "Author_Location": "Boston, MA"}, {"Author": "Mylinh N.", "ReviewID": "fZLRrZ6RIkD8uhNf3-piag", "Overall": "4.0", "Content": "Whenever I am in another city, I try to eat cuisine I can't get in Miami, so naturally when I am in Fort Lauderdale, I immediately search for Vietnamese or vegetarian. Yesterday I was in the mood for something light and nutritious so I decided to take a chance on the Green Bar & Kitchen. Located in an unassuming strip mall flanked by a Chinese take-out restaurant and an unmarked office, I was a little weary of what I was about to experience. HOWEVER, upon entering I was immediately relieved by the ambiance. The space was clean and bright and smelled of the wonderful juices that were being prepared. I went around 4pm so it wasn't busy at all. There was no wait. The staff was very friendly and helpful, suggesting I try the GBK Burger since it is one of their most popular dishes. IT WAS AMAZING. Nothing about this burger is generic, meaning, the veggie patty wasn't a prepackaged Boca or Morningstar product or just a black bean, bread crumb concoction. It was hardy and flavorful. The bun was made of quinoa and millet, which made it both healthy and light. There was just the right amount of chipotle mayo (I was worried it was going to be drenched, since in Miami everyone loves to over sauce things) to add that extra kick. Get this burger and add avocado, it is worth it! After finishing this delicious burger I went ahead and purchased some desserts to bring home. The box consisted of raw thumbprint cookies and an assortment of macaroons. THEY WERE ALL DELICIOUS.Vegetarian/vegan restaurants will always be a little more expensive than fast food or fast casual establishments due to the quality of their ingredients. You really get what you pay for. Green Bar & Kitchen was worth every penny and considering I've been to almost all of the vegetarian/vegan options in Miami, Green Bar & Kitchen is the best I've had since moving to South Florida. Makes me wonder...Should I move to Fort Lauderdale??", "Date": "2014-04-05", "Author_Location": "Miami, FL"}, {"Author": "Tanya H.", "ReviewID": "eJSu5J8Oy5p0QfZBnmabnQ", "Overall": "5.0", "Content": "Ok so I was dying of hunger..really. I was in the area already and I just googled this place by chance. The ambiance of this place was awesome, very bright and happy looking lol. The staff was super sweet. I ordered the GBK burger, very tasty, which was ranked best burger in Broward (so the waiter guy said ;)) then I decided to have so fun and order a vanilla and chocolate swirl Ice cream..ok no lie, thus was/is/will be the best ice cream I have ever tasted! I am so serious..I hVe completely found my guiltless pleasure. :)", "Date": "2014-05-08", "Author_Location": "Hollywood, FL"}, {"Author": "Laura R.", "ReviewID": "rh4ceLDA1lPCdJO9qTHswg", "Overall": "5.0", "Content": "I don't know how long I've been waiting to find an opportunity to come here, but I'm glad to say I finally went! Did all the hype live up to my expectations? YES! Was the food great? YES! Was the service great! YES! For starters, I walked in this place in complete awe as to how cute it was! Very clean, white, and spacious. Staff was friendly, they welcomed me as soon as I walked through the door and they also explained the menu in depth for me. I decided to get the coconut curry soup and the avocado toast. DELICIOUS. I'm a big fan of avocados, so you can only imagine how excited I was to try this dish. I really loved that the spread was very fresh, it had sprouts, and a lot of flavor! The soup was absolutely perfect! The right amount of every ingredient. I also tried the happy yelper which was pretty good! Considering I'm not a big smoothie fan, it passed my test!Defenetly coming back here, that avocado toast got me hooked!", "Date": "2014-01-13", "Author_Location": "Hollywood, FL"}, {"Author": "Danny G.", "ReviewID": "jJHo3_cY55jGk4_NAVXxhw", "Overall": "4.0", "Content": "I enjoyed my food so much that I went back for more the following day! I had the Buffalo chick'n sandwich, avocado toast, and the Thai coconut soup. I think my favorite was the avocado toast because it was so refreshing and tasty! My only complaint is that when I went with friends, one of the servers took my friend's plate before she was even done! She was still holding half a sandwich and had to eat it without a plate. A server should ALWAYS ask if someone is done before removing anything. It was very awkward and uncomfortable, but other than that this place is good in my book.", "Date": "2014-04-24", "Author_Location": "Miami, FL"}, {"Author": "Redbliss P.", "ReviewID": "LWMwRDwlrHxiTePm5qTIwg", "Overall": "4.0", "Content": "Veggie wrap is heaven.  Brought reluctant client (non vegetarian) for lunch.  We each had the veggie wrap and we both loved.  He was pleasantly surprised and happy that he could have a great and healthy lunch.Only complaint is the lack of seating.  Got there at 1pm and nowhere to sit.  Lucked out and found a table just as our food arrived. Yay!Definitely a return customer.", "Date": "2014-02-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Eric M.", "ReviewID": "RkSReewuESpmygKTo13Seg", "Overall": "4.0", "Content": "Great discovery ill be back a bit hard to find, great friendly staff, creative food, and a nice place to enjoy a meal what more can u ask for. Since I was here the first time their method of service changed a bit and I needed to get used to it, they now serve very similar to Pei Wei where they bring the food to you numbered table. Still a great spot, and needed in Fort Lauderdale. Looking forward to #2 which I hear is on the way but for now the most important I can say is on the North side of 17th Street turn just after the Irish Pub you must be on the west bound side of 17th Street. The burgers are great, Thai Sub (spicy) all great, actually enjoyed everything I've had.", "Date": "2014-05-03", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "A G.", "ReviewID": "gUZZS-1iQ84d-CgZNxNCqQ", "Overall": "4.0", "Content": "Had one of the veggie burgers and avocado toast. Both excellent.  Nice patio.  Different and good enough that we'll definitely return.", "Date": "2014-05-18", "Author_Location": "Boca Raton, FL"}, {"Author": "Sean P.", "ReviewID": "nXQGIsCUluuh-iXI7z0TfQ", "Overall": "4.0", "Content": "The Green Bar & Kitchen is truly a vegan's oasis, nestled within a sketchy parking lot just off of A1A before Fort Lauderdale beach.Stopped in for a Sunday lunch with my girlfriend and was immediately welcomed by the bright and super clean decor, a major plus! I ordered the buffalo tempeh sandwich while she had a salad. After ordering, we helped ourselves to glasses of their cucumber flavored water (which to be honest neither of us were major fans of) and found a table to wait for our food.Minutes later, both of our dishes were out however... they forgot the avocado in my girlfriend's salad and my sandwich was un-satisfyingly small, that being said the buffalo tempeh was good, very good, a lovely consistency with a beautiful array of flavors... And after flagging down one of the food runners we managed to wrangle up some avocado for my girlfriend's salad.This place is great, they are very, very good at what they do. The only problem being, I left this place the same way I came in...Hungry!", "Date": "2014-01-05", "Author_Location": "New Rochelle, NY"}, {"Author": "A G.", "ReviewID": "gUZZS-1iQ84d-CgZNxNCqQ", "Overall": "4.0", "Content": "Had one of the veggie burgers and avocado toast. Both excellent.  Nice patio.  Different and good enough that we'll definitely return.", "Date": "2014-05-18", "Author_Location": "Boca Raton, FL"}, {"Author": "Caroline C.", "ReviewID": "C0GDeGfCBKRzjZihsQoaIA", "Overall": "5.0", "Content": "I just had a pleasant dinner for one here and the food was absolutely delicious! The restaurant itself was a little different than I had expected. You order your food at the counter and have it brought out to you... I was expecting a waiter/waitress. However I frequent vegetarian/vegan restaurants and this was by far the best veggie burger I have ever had. I got the Smokehouse Burger and it was simply delicious. If you're not a garlic lover (like me) I would ask for about half the fresh pressed garlic on top. I also got one of the juices (celery, bok choy, romaine, lemon, fennel, spinach, parsley, turmeric) and the Buffalo Tempeh sandwich (for tomorrow's lunch, although I did sneak a bite or two already) and they are both equally as delicious. I will definitely be back here soon and I highly recommend to anyone looking for a delicious and healthy meal!", "Date": "2014-06-23", "Author_Location": "Lake Worth, FL"}, {"Author": "Jim J.", "ReviewID": "AqMSNocJyunSWiY-EQN4oQ", "Overall": "4.0", "Content": "We tried GBK for lunch the other day. The Buffalo Tempeh sandwich, Avocado Toast, and the BBQ \"Chicken\" Sandwich were excellent while the Salad with Kale and mixed greens was good, but not stellar. We were expecting more kale. \"Expecting more\" is the only negative overall. After spending $57 for three people for lunch, I was still hungry and couldn't wait to get home and raid the fridge. My advice to the owners is to keep up the good cooking, but know that vegan cuisine will never enter the mainstream with such pretentious little portions.", "Date": "2013-11-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jen D.", "ReviewID": "ebQOfSOXFgIZu6PurQeLTw", "Overall": "4.0", "Content": "In all actuality I give it a 3.5 but I rounded up because they're vegan/organic and that's awesome. What makes them anything less than a five star establishment is their service. I've been here a handful of times since they've opened and I feel they really need to work on welcoming their guests. You can still say \"hello, i'll be with you in a minute\" while doing something else. No one likes to just stand there being ignored, at least not me. With that being said and over with, the food is incredible! You can't get a better vegan meal this side of Fort Lauderdale. I will continue to tolerate mediocre service as long as they always sell their buffalo tempeh sandwich :-)", "Date": "2014-03-24", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Charmie P.", "ReviewID": "lOJbUwLNrk7E6iD5La4nrQ", "Overall": "5.0", "Content": "My vegan sister brought me here, I was hesitant, I don't mind vegan food if prepared right, however many places think a salad and some veggies is the extent of vegan cuisine, but not at Green Bar! Green Bar takes Vegan food to the next level, its imaginative, and full of different ingredients that create a distinctive and filling bite of healthy heaven! Service is friendly, the restaurant is small, very clean and modern.  The desserts are incredible! It's pricey but fresh and very tasty.  I highly recommend it.", "Date": "2014-03-23", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Serena B.", "ReviewID": "5YAaVib1coSHf-vnKGCB_g", "Overall": "4.0", "Content": "Yummy and unique, just a tad pricey. We've had the \"burger\", Happy Hippie, and a cold pressed juice.  Enticing Instagram...", "Date": "2014-04-29", "Author_Location": "Dania Beach, FL"}, {"Author": "Jacquelyn M.", "ReviewID": "fsxRGxfkmL2Wyk6WciSD7A", "Overall": "5.0", "Content": "My review may be biased because I get so excited when visiting an all vegan restaurant. I have been here twice in the past few months.  Both times, I brought a meat-eating friend.  Each of them enjoyed the food just as much as I did.I ordered the bbq tempeh sandwich the other day that came with a side salad.  I get the free water option they have because the prices are a little up there.  However, you pay for quality and that is totally worth it to me.They do have a few dessert options as well.  I have tried the chocolate tort before, which was fantastic.  However, the prices limit me from ordering everything in their display.  This is probably a good thing for my wallet anyway. Overall, the place is clean and efficient.  The quality of food is fantastic and fresh.  When I am in the area, I will always make it a point to stop by for a healthy, vegan lunch.  Keep up the awesome work!", "Date": "2013-11-20", "Author_Location": "Delray Beach, FL"}, {"Author": "Michelle P.", "ReviewID": "GjeQflfkaFCtPsDVtAEgrg", "Overall": "4.0", "Content": "Loved this place! I went there at night, so the surrounding area is not the nicest, and it was a little difficult to find, but once I got there it was all worth it. I had the raw lasagna which was to die for! I would have loved to order another one, but instead I ordered dessert. I had two of their raw vegan, gluten free pies (sweet potato and banana) and those were also extremely good. What this place has going for them is their truly amazing, health conscious food, their beautifully decorated restaurant, and their great, friendly staff. The only reason I took one star off is because of the prices compared to the portion sizes. It's pricey and the portions are on the smaller side, but if you can afford it, go for it!!! I fell in love with this place and I'm definitely going back.", "Date": "2013-12-17", "Author_Location": "Kissimmee, FL"}, {"Author": "Jennifer T.", "ReviewID": "B_3oTrAaIR5s2dMTK4H8XQ", "Overall": "3.0", "Content": "GBK burger was the best veggie burger I have ever had. Fresh ingredients, outdoor seating was a plus. The prices were a bit too high but the quality was good. I also had the raw carrot cake and chocolate cheesecake. I didn't like the cheesecake at all it didn't taste like cheese cake and not worth 9$. Overall a healthy place. Will I go back ? No ... Way too expensive for what you get and I was still hungry . Portions were small.", "Date": "2014-04-05", "Author_Location": "Hallandale Beach, FL"}, {"Author": "Jessi M.", "ReviewID": "4fD2kMbVVBt8aMqK2O2U4g", "Overall": "4.0", "Content": "I really enjoyed the food here and the staff was super friendly. My only criticism is that the price for the amount of food is high. The burgers are a lot smaller than usual and cost a lot more than usual. While I understand that this is healthy/vegan food and thus requires fresh ingredients, charging higher prices just feeds into the misconception that being healthy is expensive; which can't be farther from the truth. I maintain a healthy diet on the same ingredients that are in each of these dishes and it does not cost any more than food I ate when health wasn't a concern. I just wanted to make this simple point, I don't mean to go off on a tangent because don't get me wrong, this place is fantastic. I love the menu and the items that are available. I will definitely be back to try some more yums. Great restaurant you guys have here!! Keep up the good work :)", "Date": "2014-04-14", "Author_Location": "Boca Raton, FL"}, {"Author": "Willy D.", "ReviewID": "38J_k05SHJSqq7hBYWKg-g", "Overall": "4.0", "Content": "Whether you are vegan or not, the food here is superb. We eat here often and have sampled the majority of items on the menu and have never been disappointed. The staff is friendly, the ambiance is inviting, and the prices are reasonable.", "Date": "2014-06-17", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Can C.", "ReviewID": "ymZtSneIzOI7Syv_iWmWSg", "Overall": "5.0", "Content": "Absolutely delish but a bit pricey considering none of it is organic. Got the burger (yum) and cashew cheesecake.", "Date": "2014-04-27", "Author_Location": "Haddon township, NJ"}, {"Author": "Martin G.", "ReviewID": "fTfgpClk1iZboJ2PhILCSA", "Overall": "3.0", "Content": "Unfortunately I like my prime ribs, burgers and steaks--blood rare with the juices running. I don't belong in a vegan restaurant but here I was. The pluses are the decor, the brightness and the 'chandeliers plus the young lady behind the register. I was not aware there was a dining patio until we left and peeked over the fence outside and it looked very pleasant.Not knowing what to order I asked the young lady and she suggested the Smokehouse Burger ($12.99) made of brown rice,, quinoa, roasted vegetables, sunflower seeds, garlic, lettuce, tomato, caramelized onions, chipolte mayo on a burger bun.I spotted the carrot cake ($4.99) and I had to have it as I will kill for good carrot cake. And I got a low calorie soda($2.00), of course.Allen had a Chick'n salad sandwich ($12.99) made of pea-soy protein, mayo, celery, red onion, raisins, seasonings served on millet and flax bread. He had bottle of lemonade ($3.50).Maybe, just maybe, if my 'burger' was called another name I would have enjoyed it more but even renaming the carrot cake wouldn't have helped. The best part of the meal, for both Allen and I, was a side dish we both had with our sandwiches which had no name and I had no idea what it was made of but it was tasty..Our lunch, with a tip (I never know what to tip in a place where all the 'waiter' does is bring the food to the table) and tax came to over $40---for lunch!?!?!Again I am not a vegetarian so it really isn't fair to go by my review of the food but next time I will go across the street to the Outback and have, for me, a great lunch for less than $20.I did give the place 3 stars because of the cleanliness, the brightness, the chandiliers and people working there plus the presentation of the food.", "Date": "2014-04-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Kate G.", "ReviewID": "vsTcO19NFr1mk9M101XDkg", "Overall": "2.0", "Content": "Food was good but beware the shifty up-selling on every smoothie and dish ordered by my party at the register by the owner!  Healthy food is expensive enough and no one likes to feel taking advantage of.", "Date": "2014-05-29", "Author_Location": "Miami, FL"}, {"Author": "Alice N.", "ReviewID": "fWEU9jWeW0Vs8xMoriyP4g", "Overall": "5.0", "Content": "Food was amazing and everyone was so friendly! Ordered:Chicken salad sandwich with avacadoBuffalo temphe sandwichBrownie- so good*Banana chocolate cake- so good*PS I'm not vegan but left a happy person", "Date": "2013-11-17", "Author_Location": "Flushing, NY"}, {"Author": "Galina M.", "ReviewID": "eoSPQXGFzHXT3QAH-JiBVQ", "Overall": "5.0", "Content": "OMG!!!  It's unbelievable - I felt like I was at Kreation or another amazing organic place in California!  This place is da bomb!!!!  Anything you order you can't go wrong!  The place simply makes me happy.  It's bright, it's got wood, white/green flowers, very airy and spacious feel to it.  Everything we've ordered has been great.  The smoothies are awesome too :)  The owner is da bomb - she's sweet and her story is just unbelievable - I think it's also online but we read about her in a local newspaper.  Anyways, if you're in the area and are looking for healthy, raw meal definitely come here!  It's a really impressive spot.  They also have an outdoor patio that's super cute but small so you may have to wait.  Da bomb!  If I lived in FL I'd go there every day!", "Date": "2014-04-01", "Author_Location": "Chicago, IL"}, {"Author": "Ross M.", "ReviewID": "fvvf7frfdmrvBOCwmfIWaA", "Overall": "4.0", "Content": "Great healthy fare.  I had the GBK burger and the Alkaline smoothie.  The burger was amazing, I could have eaten two of them.  The ingredients were all top notch.  I was there around 4pm on a weekday and it was not busy.", "Date": "2014-03-28", "Author_Location": "Broward, FL"}, {"Author": "Suki E.", "ReviewID": "V-L_UEPwWTcs4gkshVZ-dg", "Overall": "5.0", "Content": "Plant-based food that shows that just because it's vegan it doesn't have to be SOY. Vegan and gluten-free cuisine that tastes amazing and is prepared with care. Fun, casual atmosphere. All reasons I love this place. From the cute, cozy green atmosphere, to the friendly wait staff, Green Bar Kitchen is my favorite spot! My go-to dish is the veggie burger made with quinoa and served on a gluten free bun. Organic beers and wines are available or you can try one of their amazing smoothies. Elena and Charles, the owners, can be seen fluttering around the restaurant, checking in on customers or giving you a hug. There should be more restaurants like this in South Florida. A great place to eat lunch or dinner, even more perfect spot for Sunday brunch!", "Date": "2014-03-18", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "stephanie f.", "ReviewID": "fqntyI2EGa-0pg7-iKd5gw", "Overall": "4.0", "Content": "This place was wonderful.  I was a bit hesitant going in because it is a vegetarian restaurant but I was pleasantly surprised.We ordered:avocado bread appetizer (can't remember official name) - it was delightful and one of our favoritesbuffalo tempeh - probably my favorite item on the menuGBK burger - pretty goodCoconut bowl  - good and large portion, not as flavorful as the tempeheggplant lasagna - good for an appAbove all else was the service.  It was great. Our server Adonis was a complete gem.I highly recommend trying this place for a good, refreshing, healthy meal.  Don't be turned off my the alternative menu.  I promise you won't be disappointed.", "Date": "2013-09-21", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Catherine D.", "ReviewID": "cJYmKSAO5GCLcO9ucFvguQ", "Overall": "2.0", "Content": "I hope it's just growing pains because a really well run place just turned into a mad house. I can't go here anymore if time is an issue because it seems the lines got longer and the help less able to manage them. The food is delicious still and I will stay a customer but please, what the heck is going on? The staff that I previously reviewed as\" knowledgeable and friendly\" now seem to know less and appear stressed and confused. It's not the atmosphere it was just a month ago. Whatever you guys changed, STOP, it's not working.", "Date": "2014-05-24", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Bonnie M.", "ReviewID": "iWAhxihn4vSbeziS0C4D2A", "Overall": "2.0", "Content": "I love the interior and vibe here. However, I was disappointed with my coconut grain bowl. I love bowls and was used to some great ones in Boston; one of my favorites had quinoa and brown rice with carrots, kale, pea sprouts and broccoli and a kicking sauce for under $6.The bowl here was nicely presented but the ratio of veggies to grains was too low and I felt like the price wasn't justified ($12?! Come on!). Grains are often cheaper than veggies so I felt like they loaded it with grains to keep their costs lower. I understand - margins in restaurants are very low and they have to be smart. It was a bit boring after the 100th chew and I was expecting more kale and cabbage! Yes, the coconut adds a nice taste but steam some more veggies and add them in. And I would l have liked it to have been saucier. It was pretty dry and all that chewing got old. I got the kombucha. I think I paid $7 - again that felt a bit over the top. Sure, Kombucha is labor intensive but once you've got a viable scoby and the right conditions it doesn't cost much to make at all. Unless they lower their prices or pump up the menu with more veggies I won't make the drive. I do hope they succeed, though, because I want more plant-based food options in the US and especially here in South Florida!", "Date": "2014-01-06", "Author_Location": "Boca Raton, FL"}, {"Author": "Oscar S.", "ReviewID": "dfvxjGwh0_dWWkYnB4QILg", "Overall": "4.0", "Content": "Excellent, healthy, tasty and modern place. The black curry is really good. About to have a Buffalo Tempeh, it's the most popular thing on the menu (or so they said)", "Date": "2014-04-02", "Author_Location": "Belle Isle, FL"}, {"Author": "Consumer R.", "ReviewID": "46Fb7-YlO6GOe_Fy9eY8Tw", "Overall": "5.0", "Content": "Lunch at Green Bar & Kitchen was a very, very pleasurable experience. Plant Based Superfood Cafe! And the food is delicious.From the juice bar to the menu to the gluten-free microbrews to amazing meals.Also, they are offering a baking class over the holidays...Vegan/Gluten Free HOLIDAY BAKING! We're In! Come join us for our Healthy Holiday Kickoff Series with our Baking Class on 12/17/13 -6-8pm with PAC Pastries !!!! On the menu: APPLE PIE...BANANA CHUNK LOAF AND ....COCONUT CREME EGG NOG PIE ......greenbarkitchen.comfacebook.com/greenbarkit…facebook.com/media", "Date": "2013-12-07", "Author_Location": "Hollywood, FL"}, {"Author": "Guy G.", "ReviewID": "0LyE0udUVO64tLbXRlKheQ", "Overall": "5.0", "Content": "Best gluten free / vegan place in Ft. Lauderdale.  Only downside is that it is very expensive and the portions are tiny.", "Date": "2014-04-22", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Veronica R.", "ReviewID": "9nVYe9Z3P4MI-uaVwuMbZg", "Overall": "5.0", "Content": "I'm so happy I finally got to visit this place! GBK is located in a small but easy to find parking strip mall with other food places surrounding it. The interior is really clean, welcoming and well-decorated. My friend and I ordered the coconut curry soup, avocado toasts and some really guilty yet delicious donut balls. I was skeptical about ordering the avocado toasts because I didn't want to get just some bread and avocado. Well I didn't, I got the most delicious and savory avocado toasts EVER! Honestly I did not want to share them with my friend but unfortunately I had already tried her soup so I HAD to share... Everyone at GBK was very welcoming, friendly and very attentive to our needs. I will definitely come back this place as I loved everything and I'm really curious to try other things from their menu!", "Date": "2014-01-17", "Author_Location": "Miami, FL"}, {"Author": "chris m.", "ReviewID": "e4-JszbeEplD1pIyYLnaBw", "Overall": "5.0", "Content": "Green bar is amazing! I was able to go there and not worry about gluten contamination. They had delicious healthy meals. I visited 6 times during the week I was visiting.", "Date": "2014-03-18", "Author_Location": "Seattle, WA"}, {"Author": "Michele P.", "ReviewID": "318wzBpt4B9tMJIhC2E9lQ", "Overall": "5.0", "Content": "LOVE THIS PLACE!!!  I was visiting family in Boca and took the trip to GBK twice. Absolutely worth it.  The ambience is refreshing, and the outside area peaceful.  We loved the GBK burger, buffalo tempeh sandwich, avocado toast, and firehouse bowl.  You absolutely have to try the desserts. They seem to change around daily but everything I tried was delicious.  Elena one of the owners is so friendly and welcoming.  Just that alone makes you want to come back.", "Date": "2014-03-09", "Author_Location": "Manhattan, NY"}, {"Author": "Debbie W.", "ReviewID": "A6n714MPS4ad8uq_Y7A4SA", "Overall": "5.0", "Content": "Mad props to GBK!! We found this gem on the last day of our stay, wish it had been sooner. Thank you for sending us off full and happy, plus a treat for the trip home too. Outstanding!!!", "Date": "2014-03-03", "Author_Location": "Discovery Bay, CA"}, {"Author": "Sara G.", "ReviewID": "TnDE25394BWEcsXDUhPQ-A", "Overall": "5.0", "Content": "I have been dyinggggg to get over to this place for a while now and finally was able to on my lunch break today. Conveniently, they are just down a shopping center from me. I had the veggie wrap. It somewhat pains me to say that this veggie wrap was better than my own, which I make a lot at home. Not only was it better, it was probably the best veggie wrap I've ever had. Bursting with flavor and not to mention their garlic aioli, holy crap! Give me a spoon and a bowl of that alone and I'd be quite happy. My wrap also came with a little noodle salad which I didn't particularly care for. Aside from that, yes, a bit pricey, but you can expect that in Fort Lauderdale. All in all I am pretty stoked on this place and can't wait to go back and try something else!!", "Date": "2014-02-21", "Author_Location": "Chesapeake, VA"}, {"Author": "J D.", "ReviewID": "O5YZeN0VkPQ1U_7BTuQWCg", "Overall": "5.0", "Content": "Food was amazing. The staff was so friendly. We need more organic, green restaurants.", "Date": "2014-05-24", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Legit H.", "ReviewID": "Qeon4IuiVbxDzOg5VeNTeg", "Overall": "4.0", "Content": "We ordered 2 great veggie burgers (mostly quinoa & grains) which came with a pinch of greens on the side & a very thick bun.  They were extremely delicious.  The chipotle mayo is killer. The prices - I dont find totally reasonable..heres why.$30.  2 veggie \"burgers\" made of a lot of quinoa & grains which are generally very inexpensive and bought in bulk. In order to have your burger topped with veggies there are up charges for avocado, tomato etc.  If you don't go for avocado etc, you get a great medium size burger patty,with a few sprouts, on bread, with chipotle mayo $13 with tax.  It's $14-16 to do it up, beyond a patty on bread. And you know most vegans are going to want more veggies on there.  But hey.  We want avocado all over our faces. Will I come back as often as I would like (everyday & sometimes twice a day)   if we could come get 2 burgers for me and my boyfriend for $20 and purchase respective other food like salads drinks and sides after that price point... I won't, as much as I would love that.  For 30ish bux just for literally one item for each of us i might be coming here once a week/every few weeks to come in and justify a drink, sandwich, other item for both of us for $50-$60 bux its more of a special place than a daily place for me.", "Date": "2013-08-15", "Author_Location": "Boca Raton, FL"}, {"Author": "LJ H.", "ReviewID": "0iF89bKearnicIq3ebvi5A", "Overall": "5.0", "Content": "The perfect place to prove to carnivores that vegan is delicious! Can't go wrong with anything on their menu but my personal favorite is the Veggie Wrap.", "Date": "2014-04-13", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Mirasol M.", "ReviewID": "XP3J-5bwv8DacWHVKj-q2A", "Overall": "5.0", "Content": "I was in the neighborhood and had to stopBy to see what all the talk is about this healthy joint. I have to say- I'm impressed!! The ambiance is clean and the menu is well organized. The creator of this menu is a genius and lures you into wanting to eat everything on their menu.A bit pricey but when your eating clean and healthy- it's the price you gotta pay! They even have a Grab and go food section- just wished they carried Ginnybakes!!", "Date": "2013-08-17", "Author_Location": "Miami Beach, FL"}, {"Author": "R.A. H.", "ReviewID": "_mXvy9CyF-BUKzy0mX2ECA", "Overall": "5.0", "Content": "The GNB Burger, Taco Salad, and Sweet Potato Dip were delicious! Great service and a REALLY great beer selection. I will definitely be back.", "Date": "2014-04-11", "Author_Location": "New York, NY"}, {"Author": "Ingrid R.", "ReviewID": "mlIs3Y9qLoe9fcwvqLXy0A", "Overall": "5.0", "Content": "Exploring and supporting new vegan restaurants.  I found Green bar & Kitchen.  A wonderful surprise, vegan, gluten free and organic. The perfect nice touch. For appetizer I enjoyed a fantastic avocado millet toast,with sprouts,  pink peppercorns topped with amazing truffle dressing. Order it!! Will melt in your mouth!!And heartier coconut grain bowl with basmatic rice, red quinoa, carrots, coconut oil,coconut flakes, white cabbage, kale, ginger, garlic, scallion, kaffir, lime leaves and red pepper. It just gets better and better. Delicious, healthy and the most important fresh!!!And of course I couldn't resist  the Pinot Noir.  Enjoy!!!:)", "Date": "2013-11-09", "Author_Location": "Columbia, MD"}, {"Author": "Chloe E.", "ReviewID": "EF4a6ofan7i_vfbiWPdf1w", "Overall": "5.0", "Content": "They deliver to my area, offer a unique menu and have juice shots!", "Date": "2014-02-17", "Author_Location": "Baton Rouge, LA"}, {"Author": "Timothy B.", "ReviewID": "ug3cMX0Ryby5_D9KQVyW0A", "Overall": "5.0", "Content": "Awesome unexpected experience. Try it!Clean fresh hip interior.    Seating inside and out.  Owners (very friendly, accommodating, helpful) on premises.   Had the veggy burger. Moist, substantive, tasty.  Wonderful dressed kale salad along for the ride.  Creative friendly juice-meister assisted me in customizing my beverage.  They have Kombucha on tap- best I've ever tasted.  This place is a true find but difficult to find!  Persevere!", "Date": "2014-03-16", "Author_Location": "Provincetown, MA"}, {"Author": "Danielle R.", "ReviewID": "JHR-aJPza-tN-cx0cPnVJA", "Overall": "4.0", "Content": "We'll start this one out with: I am not a veggie, nor will I ever be one, but I have friends that have decided that Raw, Paleo, and veggie diets are for them. So, I finally agreed to go with my friend and have a 'healthy lunch' veggie style. FMLI got a cucumber coldpressed natural juice drink b/c that is so \"in\" right now and let her order for us.  We shared the Avocado Toast that everyone raves about and the Buffalo Tempeh (OK I didn't even know WTF this was I was eating- I had to ask The Google) which came with a little mixed green salad. I was shocked to see that they also served Beer & Wine.  The toast was good, BUT there's not a lot of it. I mean it's smaller than normal sized pieces of bread and there was like 5-7 cubes of avocado on each. IF I had ordered this for my main meal I would've left hungry.  My Grandmother would've turned up her nose to this and called it \"rabbit food\" not people food. Anyhow, it was good but to be honest I liked the Tempeh better. It had a lot of flavor and 'more bang for your buck'. Bill was just shy of $30 for the both of us. They have a nice outside seating area, the indoor decor is rustic modern w/ alot of white (very SouthBeach), and they have a large juice bar for your veggie lifestyle pleasure.  I'm not running back, but it was good especially if you eat like this :)", "Date": "2013-06-17", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Katelyn T.", "ReviewID": "KuA8KRh3tP3XLnn_okMFlg", "Overall": "5.0", "Content": "WOWWish this place was closer and because I dont, my friend and I crave this all the time.We get the burger, OH MY BEST THING EVER and I am not even a vegetarian. Will TOTALLY go back!", "Date": "2013-08-27", "Author_Location": "Pompano Beach, FL"}, {"Author": "Jessica G.", "ReviewID": "AoGipgQkkemUQJfx34wGPQ", "Overall": "4.0", "Content": "In an attempt to be healthy and skinny in the new year we chose Green Bar and Kitchen for a girls lunch. We were also influenced by the \"Order the Yelp\" smoothie special.We arrived around 12:30 on a Saturday and the place was packed. It was a little stressful inside but the line moved quickly. I was torn between a few menu items, but went with the buffalo tempeh sandwich as it seems to be the most recommended item. I also order the \"Detoxing Yelpie\" smoothies and got 30% off with checkin! The sandwich lived up to its reviews and was quite good. The bread was soft and fresh, and the buffalo tempeh had just the right kick to it. This was the first time I have had tempeh in years and it was definitely much better than I remember it being...maybe buffalo sauce is key. The sandwich came with a side salad of mixed greens and a very light dressing. I wouldn't hesitate to order this again. As for the smoothie, it was well mixed and the green spinach/kale did not overpower to sweetness of the coconut and pineapple...and there were fun chia seeds on top. The service was great, the staff was quite friendly and aware of the Yelp promotions going on. They were also quick to deliver food and clear away plates.The lunch, with the smoothie and the discount approached $20..but considering the high quality fresh and healthy ingredients  this is probably fair. I know buying flax bread and tempeh in the grocery store isn't cheap either.One word of caution with Green Bar is that a good amount of their seating is outside. The patio area looked very cute, but it unfortunately it was drizzling and we couldn't risk sitting out there. The weather definitely made the inside seating a hot commodity and we were nervous we wouldn't have a place to eat..but with people coming and going it worked out perfectly with seats opening up just in time. We will have to go back on a nice day to enjoy the patio and try some other menu options...they had a bbq \"chicken\" sandwich special that looked good.", "Date": "2014-01-05", "Author_Location": "Margate, FL"}, {"Author": "Savanna M.", "ReviewID": "QxEzC-UsaXb_MWsNBNjf8g", "Overall": "4.0", "Content": "Let me start by saying I'm not a vegan, and plan on meat being a major part of my diet.  I'm also not a frequenter of vegan spots, so my review of the food doesn't have much comparison to any other vegan spots.  That being said, after a Saturday morning at the gym, the bf and I decided to check out Green Bar and Kitchen as a healthy option. He ordered the buffalo tempeh (following the other yelp reviews) and loved it.  I had a bite and was pretty impressed.   He also got the monkey smoothie (I'm sure the name was slightly more complex) and subbed out banana for strawberries.  Also very impressive. I had the superfood salad and one if the cold pressed drinks in the cooler.   The salad was ok, definitely different - not bad, but not sure I'd order it again.  Also had a cup of the curry lentil soup, this was excellent.  Prices were a little steeper than I expected to pay, but I think we'll be back to check out a few other options the next time we are being \"healthy\".", "Date": "2013-07-17", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Dax S.", "ReviewID": "XRpoNj3XblrQo6qbOerXgg", "Overall": "5.0", "Content": "I Love love love this place!!!I've never had anything bad here.  Had several deserts, A+ all of them.Kale salad: A+I was a bit apprehensive that the kale wasn't wilted, but omg was I wrong!!!  The sesame dressing was so good, but be warned it has a very strong taste.  I really had to slow down to eat it but savored every last bite!Buffalo tempeh:  my friend and I both had this with avocado, we both kept interrupting conversation to comment on how amazing it was.  I didn't want it to end!  I've gone back since and have had a hard time ordering anything else!  A+++The service was a bit slow first time I went for dinner, but she was really nice.  Overall positive experience.Table service for dinner, order at the counter for lunch.", "Date": "2013-06-13", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Lara F.", "ReviewID": "sFOjFtYHU0Vz3PYJ0jKYKg", "Overall": "5.0", "Content": "Feel so good about eating healthy!  I ordered the grilled veggie wrap which was grilled to perfection and didn't feel like I was eating health food.  The restaurant was very accommodating to our group, and we loved sitting outside.  The juices are delicious too.  Great place for lunch, although it can be hard to find.", "Date": "2014-03-11", "Author_Location": "Pompano Beach, FL"}, {"Author": "Stephanie T.", "ReviewID": "PS-OYPghRjqzV80UJoDX6Q", "Overall": "4.0", "Content": "Pretty tasty Smokehouse Burger. Not a Veggie burger person but when you get past the texture thing it was pretty good.  Happy to finally have a healthy option in the area.", "Date": "2014-03-03", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Oscar D.", "ReviewID": "dPjbl5p3Z4RdoKeh5ocw-g", "Overall": "5.0", "Content": "We finally made it here and we were not disappointed!! We were warmly greeted by owners Elena and Charles! My wife ordered the curry lentil soup and I ordered the Gazpacho and they were great! I ordered the special of the night, Portabello steak with asparagus and red wine infused gravy and garlicky mashed potatoes. My wife had the garden burger with a side salad. The food was very tasty and of course we had to get the brownie and one to go ;-)One of the servers Adonis was such a kind hearted and friendly soul!Enjoyed his energy and insight! Everyone was so nice, hopefully they will open one down in Miami soon, or we will just have to move up to Ft. Lauderdale! ;-) we will be back!", "Date": "2013-08-23", "Author_Location": "Miami, FL"}, {"Author": "Dan D.", "ReviewID": "EsFaJh4jgWNVis00LRVZVg", "Overall": "5.0", "Content": "5 stars! Boom. Awesome food. Visiting from Chicago, came 2 days in a row (and it's 30 minutes from our hotel!). Veggie Wrap and fitness fuel smoothie today. Salad and Gbk Delux 'burger' yesterday. I feel so healthy!", "Date": "2014-02-13", "Author_Location": "Chicago, IL"}, {"Author": "Miranda P.", "ReviewID": "S89jw2WIUuBpoh628HPT-g", "Overall": "4.0", "Content": "I felt like Alice in a Vegan Wonderland. This is partially because of the whimsical ambiance and partially because the portions and plates are so tiny that I feel like poor Alice during one of her mushroom-induced growth spurts. The white and wooden decor is modern yet natural and the mood was perfect as the playlist was chill, happy and indie. Three of us (normal sized girls with typical appetites) came to indulge in some wine and to sample their new night-time \"Tapas\" menu and we literally ordered one of everything on the 6 item menu. The plates ranged from $8 - $10 and most were served with a side (literally one forkful) of kale & cabbage slaw with a mustardy dressing. The curried cauliflower steak was a bit on the bland side, the coconut grain bowl was delectable without being too sweet, the raw mac n'cheese was delicious but didn't taste anything like its moniker, the ricotta lemon toast was super savory and the soup du jour was creamy and coconutty. The only dish we were really disappointed in the sweet potato truffle fries - they were limp and soggy with no dipping sauce and all we tasted was rosemary without even a hint of that rich truffle taste. The consensus overall was that everything was pretty palatable but we were all still really hungry at the end of our shared meal. We shared this feedback with our waiter which traveled faster than Twitter to the manager and the owner. We were brought two tiny desserts as consolation - a banana sorbet and a smooth, sweet chunk of \"cheesecake.\" But we were still hungry and ended up with a bill and tip that totaled into the triple digits. I'm tempted to try again at lunchtime, but I'll probably wait to come back until all the kinks are worked out as this place is still pretty new. I'm teetering between three and four stars and I'll almost certainly update it to five once I can leave here with a full tummy. It was just so expensive for what we got - and this is coming from someone who shops at Whole Foods Market. BOTTOM LINE: Hope your wallet is bigger than your appetite.", "Date": "2013-03-10", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Emily R.", "ReviewID": "7D5PQ1mh485r4ih0TCYxQQ", "Overall": "4.0", "Content": "This has been my favorite place to eat when I have had to visits For Lauderdale for business. They are really nice and the food is AMAZING!!! I loved the Avocado Toast & the sweet potato dip. This also was super child/baby friendly.... and multiple times I came close to closing (because we were on west coast time) and they took great care of us! I gave it four start cause it is a bit pricey but for the food you get, I am happy to pay.", "Date": "2014-04-10", "Author_Location": "Los Angeles, CA"}, {"Author": "Erin D.", "ReviewID": "4xnP2ud8Vn2FwBM5rJEB-Q", "Overall": "5.0", "Content": "Five stars! We ordered a burger and salad to share. Then we ordered avocado on bread, another salad and a cashew butter cup for the road. A great place and ammmaaazzziiiinnnngggg food!", "Date": "2014-02-12", "Author_Location": "Oak Park, IL"}, {"Author": "Sean M.", "ReviewID": "6sn_XNqL0xtFTvpfNe0aHQ", "Overall": "5.0", "Content": "Finally I have found a vegan establishment that can compare to the vegan restaurants in the San Francisco bay area.  Can you say vegan paradise? I think Green Bar is the closest we are going to get to vegan paradise while in South Florida. Only by chance did I find out about this place. One of my carnivorous yelp friends checked into Green Bar, but I think they checked in by mistake. Once  I saw the name Green Bar Kitchen on the Yelp check-in page I immediately decided to check it out the following day.I had to do some work on an annoying friends computer, who's place was in the vicinity of Green bar. So as soon as I left my friends place, I headed on over to Green Bar for lunch . This place is kind of hidden, it is deep within a plaza off SE 17 st. Once you see the  Waxy O'Connors Irish pub and eatery you make an immediate right into the plaza.As  I walked into Green Bar, my  pupils opened wide like a jaguar on the prowl. I could not believe what I was seeing, this could not possibly be what I think it is. Incredibly this place has a juice/smoothie bar bit.ly/VTsE1r, vegan restaurant, vegan bakery (gluten free) bit.ly/VTqb7k bit.ly/VTtMCl, and raw food entree's all in one establishment. They have cold pressed juices, cold organic beers/ wines and more. I had to rub my eyes, could this be true? They sold organic condiment sauces and other tasty edible items.They have a sample section for  sauces and drinks bit.ly/VTpI51. There is also a station for free mint water along  with free almond, soy and coconut milk to add to your organic coffee bit.ly/VTqvTC.I love the interior of this place, it is chic yet has an organic flavor. There are many attractive plants placed on the tables and walls enhancing the aesthetics of the eating experience bit.ly/VTmI8M bit.ly/VTmL4r bit.ly/VTmM8r. Each table also has a sea salt shaker and whole black pepper grinder. They also have a fenced in outdoor umbrella covered dining area bit.ly/Y5aMm9 . The Feng Shui in this place is awesome.          Recollecting myself I  then focused on what I was going to order. I decided on the Live Lasagne $12.00 bit.ly/VTlbiY and a Jamaican style ginger beer $2.50.  I also bought two vegan rice crispy squares (one of them was topped with mini chocolate kisses) to go for $2.00 a piece  bit.ly/VTlCd9. After ordering I asked the dude at the cash register how long they had been open, and he said about 1 week. I was surprised they have only been open for a week, they seem so well organized, like that had been open for a significant longer time than a week.The sun dried tomato marinara sauce and the macadamia ricotta melted in my mouth, they went perfect with the medium textured zucchini. The pesto just topped off what was already divine to the tongue. Both of the  rice crispy squares were sweet and delicious, the texture was pleasing to the palate, they were neither to soft or hard. The people here are super friendly, my hippy meter did not go off either. While I was eating, I was asked how my food was a couple of times by the workers. I was also offered samples of bakery  items.So it is a given, not only am I returning, I am returning frequently.", "Date": "2013-02-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Nicole V.", "ReviewID": "4Cr4UMRJPqXYvghC3vp8rg", "Overall": "4.0", "Content": "My girlfriends suggested this spot for lunch yesterday based on the YELP suggestion and the Yelpie Smoothie they were offering.  The place was quaint, very clean and very packed!  We got in line and ordered our food and smoothies and thankfully by the time we waited in line, a spot at a table became available.  The Buffalo Sandwich was good and the dressing that came on the side salad was light and fresh.  The smoothie was green and while I would probably be relunctant to drink something so green, I tried it and it was delicious!  I would definitely go back and recommend to others.", "Date": "2014-01-05", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Christine Q.", "ReviewID": "X3EiD-bRePA0At7bE9YudA", "Overall": "5.0", "Content": "This place is great! Food is so yummy and they have a cute outdoor patio.  One of my favorite lunch spots", "Date": "2014-02-18", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Marquis M.", "ReviewID": "vtovKcafrbHdtM_EDEMU2Q", "Overall": "5.0", "Content": "This is such a refreshing little restaurant. It was bright and inviting and didn't have a weird vegan smell (you know those places? When you walk in it just smells like a hippie??)I ordered the Superfood Salad, which I HIGHLY recommend. It is delicious and very filling. My partner ordered the burger. He said it was very good as well but not very filling. If you order the burger I suggest you get a side, as well.He topped off his meal with the chunky monkey. The flavors were good, a little protein powder-esque, but very thin. I think it depends on who is making it so if it's important to you that you have a thick shake (which if I were ordering then that would be the #1 requirement) then just be aware and maybe try making a request. Also, they have little desserts and a little market. It's overpriced, overall, but I still recommend it 100%. It was very good.", "Date": "2013-04-23", "Author_Location": "Miami Beach, FL"}, {"Author": "Rachel W.", "ReviewID": "sLaKNfv2Dm5E4g_aLWSKwA", "Overall": "5.0", "Content": "A very top notch joint. The food is high quality and very flavorful. I have been to many vegetarian/vegan places and the food is usually average- but not here. I have been twice and tried the Curry bowl- which was amazing, the veggie burger was a hit too. My mother ordered the avocado toast with pink peppercorn and even that was good too. The pre-made juices are very expensive (11 dollars) but I suppose that is the going rate. In the words of the terminator... I'll be back! Love this place", "Date": "2014-04-18", "Author_Location": "Miami, FL"}, {"Author": "Y M.", "ReviewID": "FH4sRQUwKdUCAZPihR4wXA", "Overall": "1.0", "Content": "Nastiest most overpriced \"healthy\" alternative...visiting from Cali and had to have my favorite Açai bowl and what I thought was a healthy sandwhich.9$ for a tiny açai bowl that has 40% granolla in it and nasty salty lukewarm açai paste? Gross almost made me barf...an oversalted sandwhich with tofulike buffalo meat alternative with nothing but a tiny peice of lettuce for a grand total of 21$ ? Absolutely not worth the drive there, the one star is for the side salad that came with the sandwich Take a hint and make your açai bowls bigger, add less granola, add more fruits and freeze the açai paste to make it more edible! Dont put so much salt in your food.", "Date": "2013-12-13", "Author_Location": "Los Angeles, CA"}, {"Author": "Sara S.", "ReviewID": "alRuOe4p_b1s5GIIGiZxUg", "Overall": "5.0", "Content": "Great new vegan spot in Fort Lauderdale. We had the Avocado Toast and GBK Burger and both were delicious, beautifully presented, and prepared in just a few minutes (we were starving and hate to wait!).Really enjoyed meeting the owners & GM and would love to steal their light fixtures for our office! The decor is modern and the communal table is perfect for a lunch crowd.Looking forward to lunching there often!", "Date": "2013-02-20", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "K v.", "ReviewID": "BZAYiA_asz-haQTbl61pEA", "Overall": "5.0", "Content": "After a hot yoga session downtown (Yoga Joint- it's fantastic- go) My mom and I headed here for dinner. It most certainly is a hole in the wall kind of place but the interior and outdoor eating area really are lovely. It's very South Beach-y as well as felt like we were back in CA. Regardless- it's a lovely atmosphere. We contemplated on the order for a while but settled on the GBK burger and living lasagne. Food came out a little slow (they said there was a backlog in the kitchen) but the outdoor eating area provided a nice atmosphere to chat and catch up.The food was fantastic. I dropped most wheat and all dairy about 6-8 months ago and so I'm quite familiar with raw foods, vegan, paleo and the like. My mom, was not. Her lasagne was great (albeit small) and my burger was delicious with the avocado. I took a picture and bragged to a friend in CO who is only surrounded by insane burger places and Sweet Tomatoes. It really was a great dinner. The portions are small, but in reality it's the size we should be eating. Wish the price could reflect that but, it's hard being a new business preparing foods which aren't made of garbage.All in all our check was about $25 (no drinks, just water) and it was a very nice evening. I will come again and bring a friend :)", "Date": "2013-08-19", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Amy M.", "ReviewID": "SRNUAKlWhcEghOR79UIbhQ", "Overall": "5.0", "Content": "As a Vegan I was floored when I discovered this place.  Any restaurant ( I think this is one of maybe 3) that has a truly plant-based menu is really something special, especially when it's around the corner from my house. Plus the food is tasty as well!  Great place, wish them the best of luck.  As for a favorite dish.. haven't had them all yet, but they're all good.  Plus fresh baked Vegan desserts- yum!Only complaint would be the \"Vegan\" patrons who are carrying very nice Leather Prada purses... It wouldn't be south florida if there wasn't a little bit of hypocrisy :)", "Date": "2013-03-10", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "L. W.", "ReviewID": "1_6JgASmO1LsIxdVOYoBsw", "Overall": "2.0", "Content": "Thought I would give this place a 2nd chance after being disappointed with my grain bowl last time. Well, strike 2. I won't be coming back. The overall concept is great and the food is pretty good, but prices are not in line with food portion and employees are not educated on how the food should actually look. I ordered the large tofu firecracker salad to go. It came with 5-6 TINY pieces of tofu. I asked the girl if that was the normal amount of tofu and she replied \"um yea I think so.\" And turned back around. I have no problem paying more for healthy, quality food, but $14 for a pile of greens and a few baby chunks of tofu? No thanks. I'll stick with Myapapaya as I have always had a great experience there, and taste, price and portions all supersede Green Bar.", "Date": "2014-03-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Deke K.", "ReviewID": "6D8b1z47IcFfljrDF7xZXg", "Overall": "4.0", "Content": "This is a great little plant-based restaurant with a trendy decor and help yourself atmosphere.  Order at the counter, grab your drink from the case or order a complex SuperSmoothie from the drink bar.  The staff is knowledgeable on product and not afraid to make recommendations.  Price is the only drawback, and while I defend the high prices with the organic or specialty ingredients costing more, it's fair to note the problematic drawback.That being said, this is a great place to enjoy an aloe drink ($2.50) or a carrot-ginger juice ($10) beverage.  The warm toasted coconut brown rice bowl includes wheat germ, garlic and cilantro (had garlic breath for hours afterwards).  The living lasagna is a cold dish of slivered zucchini with a sheath of tomato sauce, slice of tomato, guac topping (small portion for the expense).  The entrees were $11-$12-ish.  I felt full after the rice bowl, not so much after the zucchini lasagna.  The cookies and baked things looked yummy but I passed.  They have many organic wines, $15-$25 and several snack foods available.  They have two of their cold salads prepackaged in the case at $10 each.  They look flavorful and balanced in texture and tastes.They're open like 10 to 4 early in the week but include supper hours toward the weekend.  I would love to see their menu expand.  If prices were lower I could go totally vegan!  We need more restaurants of this category and caliber!", "Date": "2013-03-27", "Author_Location": "Lakeland, FL"}, {"Author": "Danny M.", "ReviewID": "8bnxcJy26iCp4FcKM7il-w", "Overall": "5.0", "Content": "I search and search to find... The best and most healthy places everywhere, and this place had me salivating from entry. I go all out on the regular... And this place had me out and about to spend all my money in here.", "Date": "2013-11-22", "Author_Location": "Broward, FL"}, {"Author": "Justin H.", "ReviewID": "IKfpPg-msqE1hcy-6g_NaQ", "Overall": "5.0", "Content": "Amazing atmosphere, quality of food and service also exceptional. The only thing I wish was tweaked would be additional seating or more comfortable areas to dine. But I would definitely give it a superb rating for not only vegans but anyone looking to enjoy a hearty healthy meal!", "Date": "2014-01-26", "Author_Location": "Downtown, Seattle, WA"}, {"Author": "Mya P.", "ReviewID": "EZt4sGwcUthgzUPKZ4T5gA", "Overall": "3.0", "Content": "I really WANT to give this place 5 stars. I REALLY do. However, there are just some negatives that seem to never change. The food is fab, the pricing is high. Okay, I can handle that. However, the girl at the register who takes your order, she never EVER smiles and you almost feel like you don't want to bother her because she's really not enjoying being there. I went in the other day and there was a new girl, (woo hoo!) who DID smile and DID seem inviting. Let's hope this new girl stays for a while. Also, don't bother to ask about the ingredients in their items...you will get either 1) The staff not knowing how to answer your question or 2) the staff giving you wrong info, or five difference answers. They should know that people coming to them, for the most part, are very concerned about their health and are label-readers, hence they want to know all the details about what they are eating, esp when they are not the ones cooking it themselves. They should know EXACTLY what is in EVERYTHING they sell, including the pastries and such in the front glass case. When you have one person telling you something has this in it, while another employee says something different, you start not trusting what you are eating, and that's not good.I will definitely be back and even bring friends. But I will have to warn them of the negatives above. I will be happy, however, to introduce them to the deeelish and creative food. I think Green Bar is ALMOST there. Just few tweaks and this place can be a total true gem whenever I visit the area.", "Date": "2014-03-29", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "hilary n.", "ReviewID": "Bhw27QgRG9FXi-iGzNt2qQ", "Overall": "4.0", "Content": "We have returned several times since our initial visit and have decided that besides the steeper than normal prices- we really like it. Smokehouse burger all the way! Wish it came with a pickle or some slaw!:)))", "Date": "2014-03-18", "Author_Location": "Springville, TN"}, {"Author": "Denise M.", "ReviewID": "cd0-P-AFRX7AUEw1sun60A", "Overall": "4.0", "Content": "First time here. Had the living lasagna! Very tasty. Staff was friendly. Also had the juice of the day. It's expensive though considering the portion sizes.", "Date": "2014-01-02", "Author_Location": "Hallandale, FL"}, {"Author": "Diane H.", "ReviewID": "3zM1TzkpURvlon_EHihVXw", "Overall": "4.0", "Content": "Mmmm got their weekend special - a freshly squeezed juice with beets, ginger, and I think carrots among other delicious body cleansing ingredients lol 4 stars though because it was an 11 dollar drink!! Omg I would never understand the justification for the price", "Date": "2013-11-24", "Author_Location": "Tustin, CA"}, {"Author": "didi l.", "ReviewID": "1ABztiJorTz8zq58yUHUHA", "Overall": "5.0", "Content": "My husband and I met another couple for dinner at this restaurant.  The atmosphere is welcoming, inviting and we loved the modern, clean look.  The food was delicious!  We tried several items from the menu, and I especially enjoyed the GBK Burger and the Firecracker Salad.  The portions are generous and the service is friendly.  We shared a plate of desserts, and the coconut/chocolate (it looked almost like a Reese's buttercup) was light, and simply delicious.  While we live in PB County, we'll be back for brunch!  Prices are extremely reasonable.", "Date": "2014-01-26", "Author_Location": "Palm Beach, FL"}, {"Author": "Malcolm M.", "ReviewID": "LkXH5gFFLOIFw-d0yQwgyg", "Overall": "3.0", "Content": "I wish I could give more stars to this place, for the quality and taste of the food are really good. However, the dishes are very small for their cost $$$. I would not go back, unless they double the size of the dishes, and/or lower their prices.", "Date": "2013-10-02", "Author_Location": "Hollywood, FL"}, {"Author": "Joel D.", "ReviewID": "YjB8BA8A3Bu4wB_t5BbMQg", "Overall": "5.0", "Content": "Everything was delicious even my daughter loved the avocado toast and I loved everthing", "Date": "2013-12-08", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Dan F.", "ReviewID": "FcCSXi67q32J4WLb5QRDEw", "Overall": "5.0", "Content": "Healthy and delicious!  Kambucha on tap (with ginger) is great.", "Date": "2013-11-14", "Author_Location": "Austin, TX"}, {"Author": "M B.", "ReviewID": "BWsRS-UHDOk8LRWS2Cv86A", "Overall": "4.0", "Content": "I just wish this place was fully organic,  otherwise the food is perfect for any vegan and kombucha on tap is a cool feature to this restaurant.", "Date": "2013-09-02", "Author_Location": "Miami, FL"}, {"Author": "Leigh M.", "ReviewID": "8EX16dBZzrfoRNCoCCt2Gg", "Overall": "4.0", "Content": "Came here yesterday , loved the decor , was very clean , staff friendly , firecracker salad dressing perfectly spicy ! Would come back , ingredients very fresh . Only reason for not five stars is I left hungry , guess I should have gotten a soup as well .", "Date": "2014-01-06", "Author_Location": "Oceanport, NJ"}, {"Author": "Patrick M.", "ReviewID": "Z1niv2c5UoY_Z0csVvHfPA", "Overall": "5.0", "Content": "Luv this place!! Trying to go more \"vegan\" and this place makes it an ez decision! Had their awesome lasagna, amazing pumpkin soup and delish pistachio chocolate cake.The art on the walls by Maurizio Battifora is unique and amazing. Highly recommend this place and I will make it a regular stop for lunch and dinner.", "Date": "2013-12-30", "Author_Location": "Grimsby, United Kingdom"}, {"Author": "Martin G.", "ReviewID": "DV07gMrxb-tC96Jjw3I-oA", "Overall": "5.0", "Content": "Had a great dinner here tonight on the patio. Nice Belgium beer and great veggie burger and gbk salad. Finished off with a delicious dessert and tea. Love this place!", "Date": "2013-12-28", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Tom And Sandra G.", "ReviewID": "N2qLoiqQQWzxnZyx8zD26A", "Overall": "5.0", "Content": "A highlight of our time in Fort Lauderdale!! This is a GREAT stop after our cruise and not-so-healthy food choices all week. The kombucha and avocado toast are wonderful!!! The owner and staff are also super friendly and kind. :-)", "Date": "2013-11-10", "Author_Location": "Olympia, WA"}, {"Author": "Rana K.", "ReviewID": "KpOICAWR13s92q1CF2TbEQ", "Overall": "4.0", "Content": "My cousin has gone vegan for over a year now so I'm always in search of new places for him to try. But I came across this place on yelp because I was looking for gluten-free restaurants for myself as I have gluten  sensitivity. I was very excited when I read the reviews on yelp and saw the photos of the lovely desert counter. Last night (Saturday) I took my husband and cousin to GKB to try some vegan gluten free deserts with no intention of having dinner! But when we arrived they were so welcoming that we decided to sit down and look at the menu. We ended up sitting outside at the back of the restaurant which I didn't even know they had! It's a lovely space with about 5 tables I think. The menu is simple with only a few items but they all sound delicious. Out waiter was very nice and told us about the special of the night and soup of the day. We all ordered the soup which was to die for! A creamy purée with coconut milk perfectly seasoned. I wish I knew what was in it exactly, I tasted carrots and I'm assuming some lentils perhaps. I ordered the pizza (special) which came with a side salad, my husband ordered the GKB salad and added avocados and my cousin ordered the Buffalo tempeh which also comes with a side salad. We all loved everything! Then I went crazy ordering desert! We ordered the strawberry cheesecake and chocolate tart and I also ordered 3 cupcakes to go! I managed to take pictures of everything except the deserts, no time for that! Lol I don't know which was better, the cheesecake or the tart. The cheesecake is refreshing and light while the tart is rich and dense and delicious! I also had a cup of hot tea with coconut cream which was a perfect ending to my meal. The bill came to $91 I believe before tip, then adding 20% which was very well deserved by the way, makes this place a bit pricey. I wish it was more affordable because I would go there all the time! That is the only reason I can't give it 5 stars. I can understand that they use high quality ingredients but still a bit pricey. Also the added avocado for $2.00 only gave us 4 very thin slices. I think perhaps the salad should already include avocados. The cupcakes where a bit dry but I was happy to be able to have any at all! Over all great service, very clean and cosy and the food is really delicious and I'm not even vegan.", "Date": "2013-09-15", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Alison B.", "ReviewID": "kUkQrOFbapWxaEv3RZjXjw", "Overall": "5.0", "Content": "My favorite spot for all things healthy and delicious. Everything is amazing. My favorites are the avocado toast, living lasagna and the 'chicken' salad sandwich. They really get it here!", "Date": "2013-11-17", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Dev C.", "ReviewID": "yp1p5q3XMGCFGAu0lJu61g", "Overall": "4.0", "Content": "Really interesting vegan take on food. The flavors were definitely there but the dishes were cold and I was expecting more hot food when ordering the veggie lasagna and avocado toast.", "Date": "2013-10-05", "Author_Location": "Miami, FL"}, {"Author": "Paloma S.", "ReviewID": "GLzpP2v10VnakPEYZi2xcw", "Overall": "5.0", "Content": "Truly delicious! I'm a vegetarian and finding vegan gems like this is always a pleasure! the lasagne was incredible with the most fresh pesto toppings. Must try the avocado toast- it's so hearty and fresh. I will be coming here again. ps- they add coconut cream to their coffees, always the yummier healthier alternative to creamers. note- the fresh pressed juices are great for a healthy boost.", "Date": "2013-10-04", "Author_Location": "Los Angeles, CA"}, {"Author": "Emily S.", "ReviewID": "NYJvpKZjojs6-A1OD59o0w", "Overall": "4.0", "Content": "I did my research to find a place like this and I am now a fan.  The food is fresh and very flavorful.  The avocado toast was the highlight of my meal.  The place is a little cramped, but I guess that means cozy.  The line was long, but service was fast.  My only real disappointment...ordering the sandwich I read about online only to be informed it wasn't available.  The menu changed, so be flexible.", "Date": "2013-07-14", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Bruno B.", "ReviewID": "fTmnRVwHx59JYLIdU_3bbQ", "Overall": "5.0", "Content": "I have been to Green Bar numerous times. Being a vegan, it is important to me where I eat. This is a vegan and gluten-free eatery, so I do not have to worry or think about cross contamination of dairy or other animal products.The food here is absolutely delicious!  The food is very consistent as is the service. The staff is very friendly and attentive! I would highly suggest their GBK Burger and their Buffalo Tempeh sandwich. I have always been super pleased with their soups too! All vegan and gluten-free. You can't go wrong here!  Oh and the desserts are really good as well! I highly recommend this eatery!", "Date": "2013-08-06", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Dorothy G.", "ReviewID": "Vcp0iKt_sr-BdaoDIhgnEw", "Overall": "5.0", "Content": "Had been wanting to check this place out for months as I'd heard great things but living in South Beach, I RARLEY go west of Biscayne lol. Anyway, made the trip and well worth it! Went on a Saturday so it was unbelievably packed! I was excited about the energy and light, airy space/decor and happily waited on a long line. I grabbed a cold pressed green juice, a GBK burger, a gluten free chocolate chip cookie and an Aztec Dream smoothie. EVERYTHING was delicious! Don't miss the smoothie, I'm telling you! All staff were kind and patient--with tons of people they explained to the couple in front of me in line that there was in fact NO MEAT at this vegan place (lol) and what maca is and it's health benefits. I later asked them how their meal was and they were really happy with their vegan choices haha. Love that!", "Date": "2013-09-04", "Author_Location": "Miami, FL"}, {"Author": "Lizzy S.", "ReviewID": "m8F6prt1D9WoVlKgxpiTpg", "Overall": "4.0", "Content": "I get SO happy to see places like this, as they are rare here! Green Bar and Kitchen was delicious! I had the raw zucchini lasagna which was amazing, layered with macadamia nut cheese. My husband got buffalo tempeh sand which on GF bread. For the gluten free and vegan, this is heaven! the best part? KOMBUCHA ON TAP! It doesn't get much better. The energy is happy and vibrant, can not wait to go back for Sunday brunch, gluten free pancakes, tofu scrambles and gluten free toast (another thing so difficult to find when dining out) YAY for green bar and kitchen!", "Date": "2013-06-08", "Author_Location": "Miami, FL"}, {"Author": "Rosa S.", "ReviewID": "IZjpaB8u8nrmBl-BWY4Svw", "Overall": "3.0", "Content": "I was very excited to try this place with all the hoopla about it being vegan. Somehow I assumed it would all be organic probably because of the prices, but to my dismay, it is not. The only thing organic is the bakery, but as far as the rest of the food, they can't even tell you what is and what isn't organic. What's the point of eating vegan if you might be ingesting GMO's? The living lasagna was fabulous, but it was kind of a small portion. The strawberry cheesecake was to die for!! This place would be perfect if everything was organic, and I would have rated it 5 stars. But it's not.", "Date": "2013-04-29", "Author_Location": "Hallandale, FL"}, {"Author": "Danielle G.", "ReviewID": "G_tcikQ3MmYcVLVMMKDXRg", "Overall": "5.0", "Content": "Love this place.  Little but clean and cute.  Not inexpensive BUT worth it (and a good value for what you get) to go to a gluten free, vegan restaurant and eat clean, fresh, delicious food.  Wish it was closer to my house.  The avocado toast is to die for!  Delicious fresh ingredients are worth paying for, and the care and love put into it is evident in the food they put out.  I have not stopped craving the avocado toast since I had it a few weeks ago.", "Date": "2013-08-28", "Author_Location": "Hollywood, FL"}, {"Author": "Megan J.", "ReviewID": "OoYuLE0eYtvHkYiEMuEv3Q", "Overall": "5.0", "Content": "Hello, heaven!  Finally a vegan restaurant in South Florida that you don't have to excuse its faults just to eat there.  If you've lived here a while you know what I mean- most vegan and vegetarian restaurants have either bad service, high prices and/or generally unappealing interiors.  NOT Green Bar & Kitchen! No siree, Bob! At Green Bar & Kitchen the prices are reasonable, the food is very good, the staff is always friendly and the atmosphere is very happy and clean.  It's a certain West Coast vibe that I totally love.  As far as the food goes- I've had the Firecracker Kale Sale, Superfood Salad and Living Lasagna- all were delish! I can't wait to explore the menu more!", "Date": "2013-04-02", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "terry a.", "ReviewID": "ZH8EGF4dfyJSvYa1bn5d1g", "Overall": "4.0", "Content": "First time to Green Bar!  Excellent stuff.  Open, clean with a touch of funk in decor.  THE FOOD IS EXCELLENT.  What else do you want?  I had the lasagna, raw and so tasty.  My boyfriend had, in his words, the best burger ever (veggie).  The staff are attentive, you order at the counter and it is delivered to the table of your choosing.  The food is served on nice white ceramic plates - a touch of class.  On to the deserts.. out of this world!!!  We tried the fabulous thin mint cookies (as in girl scouts- only healthy) and the superb raspberry cheesecake!  The coffee is served in these great oversized ceramic cups - all white ceramic plates / cups, very stylish.  It is clean and nice with a great vibe.  Can't wait to get back with some friends and start trying some more of these delicious food.  Much needed [and wanted] vegan restaurant in South Broward.  I am so pleased.Oh.  I heard tell that someone said they did not like the area.  Ignore that.  Great location, plenty of parking.  Lots of other restaurants and interesting little shops right there....none as healthy as Green Bar.  Wow, welcome to the neighborhood!PEACE, LOVE & GREAT FOOD.", "Date": "2013-06-22", "Author_Location": "Hollywood, FL"}, {"Author": "Margarita G.", "ReviewID": "rLmuy1xzkH9ogb-2ynlBpQ", "Overall": "5.0", "Content": "Green Bar is amazing! It felt so good walking into a very friendly place where I can eat everything on the menu since I'm vegan. The food was good too! The staff had great energy and Elena, the owner was so gracious and genuinely inviting. It felt like home.", "Date": "2014-03-10", "Author_Location": "North Miami Beach, FL"}, {"Author": "Sara R.", "ReviewID": "3p1KBOcFVli5uro3wZsKcA", "Overall": "5.0", "Content": "I'm addicted to this place and I'm not even a vegetarian !! Absolutely amazing food super friendly staff, great smoothies and food (; they also offer cooking classes which I been really tempted to try.. Their coconut Thai soup is the best and the burgers are very tasty, I visit this place very often", "Date": "2013-10-20", "Author_Location": "Miami, FL"}, {"Author": "Katerina S.", "ReviewID": "2NDuLnpNkmb-gHMPDBaz7Q", "Overall": "5.0", "Content": "A Vegan's Paradise! So this restaurant is definitely not cheap, and frankly, it's a little over priced; however, it's hard to find such delightful food for a restaurant that's strictly plant-based. I ordered the lasagna, and WOW was it delicious! I had garlic breath for like 3 days following the meal but I would say it was worth it. I also had one of their smoothies, I can't remember the name right now but it had the coconut milk in it, and that was very light and tasty too. I bought a piece of chocolate to go, which was pretty good and could be melted into hot chocolate. I would go back, but only when I have a few buck to spare lol.", "Date": "2013-05-28", "Author_Location": "Miami, FL"}, {"Author": "Sarah H.", "ReviewID": "DOLynlzoXPWkNbXhcxJ4Eg", "Overall": "5.0", "Content": "In Fort Laud for the day and I needed to get  lunch, I did a quick Vegan restaurant search and found this newly opened place. I decided to give it a go and ended having  such a memorable and enjoyable experience.My little one and I walked up to the counter to look over the menu and order. The guy  (missed his name but, I believe he's one of the owners) couldn't have been friendlier or more helpful. He answered all my questions and I could just feel his love and passion for plant based foods. After some dilberation I decided on the Fire cracker Kale salad, avocado toast to share with my 1 year old daughter and, for dessert, the  gf carrot cupcake.I really enjoyed everything. The Kale salad was surprisingly large so I even had some to take home. I really liked the spicy dressing. The avocado toast was just perfect and my kid loved it. The carrot cupcake was so good that I bought another to take home.Oh and another awesome part about eating there was how it has a community table. I loved chatting with everyone in the restaurant. This place has such a warm, loving, and positive energy, my only regret is that I don't live closer.", "Date": "2013-02-25", "Author_Location": "Palm Beach Gardens, FL"}, {"Author": "Maciel M.", "ReviewID": "TTz50cIgA-qvvJ3bSd0lZQ", "Overall": "3.0", "Content": "Really amazing raw lasagna! Wish they had organic items and less soy products. Check out the rest of my review at faunalikesflora.com/food…", "Date": "2013-10-03", "Author_Location": "Miami, FL"}, {"Author": "Ashlyn E.", "ReviewID": "tvmXlvMAHAye9SgrTADnqw", "Overall": "5.0", "Content": "I loved everything there!  Such a great selection of vegan options, and not just the usuals. I had the quinoa burger and loved it! I wish we had one of these in Los Angeles!  The cuisine would fit right in. I visited here on vacation and definitely wish I could eat here everyday. I came here with a non-vegan and she loved it! Hope we can come in again before we leave!", "Date": "2014-02-27", "Author_Location": "Studio City, CA"}, {"Author": "Michelle G.", "ReviewID": "YN6IC1PJdyu5VAwR8g9ZlQ", "Overall": "4.0", "Content": "What a nice addition to South Florida's omnivorous concrete jungle. The live lasagna I ordered was delicious, though it's size was disappointing. I also tasted the BBQ sandwich, veggie burger, and portobello sandwich, which were good. Next time I'll order the portobello.", "Date": "2014-02-27", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Stephanie W.", "ReviewID": "W87as2Kjngs9Q_NN5jFeCA", "Overall": "5.0", "Content": "so happy to have a new vegan restaurant in fort lauderdale. south florida is lacking in vegan anything! tried green bar during opening week. the location is great. the restaurant is GORGEOUS. the menu is small but the food is DELISH. try the curry bowl, the lasagna and the gbk burger! all wonderful dishes! the bakery case wasn't installed yet when i visited so looking forward to trying those goodies on my next visit! green bar and kitchen is most definitely worth the visit!", "Date": "2013-02-14", "Author_Location": "Hollywood, FL"}, {"Author": "Reg T.", "ReviewID": "DIt1SpmXHJ1aidMXVfotqg", "Overall": "4.0", "Content": "So happy to have found this place during a vacation stay.  It was a short walk from the hotel and a pleasant reprieve from the typical vacation diet.  For the area, the prices were reasonable and food was delicious.  We enjoyed salad and smoothies on the patio.  This place is off the beaten path, but well worth the find.", "Date": "2013-08-18", "Author_Location": "Bartlett, IL"}, {"Author": "Natalia H.", "ReviewID": "-653W0L1bZtROEncbeuACA", "Overall": "4.0", "Content": "My first time at Green Bar & Kitchen. I just started my gluten-free way of eating a month ago and was really starting to wonder if I ever again would be able to enjoy a lunch out without worrying about what I was eating. This is THE place to go. Had an amazing tasteful and filling GBK salad along with a cup of their Thai soup. I couldn't eat it all. Salad was huge and cup might as well have been a bowl. Highly recommend trying GBK out if you're in the area whether you're into clean eating or not", "Date": "2013-08-11", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Alexa T.", "ReviewID": "nerLq1OJZX7bVlePjl_z-w", "Overall": "5.0", "Content": "This place was really good! i wanted to try a smoothie but I got the roasted and sundried salad.  The flavors were immense, and I like that the place was set up sort of so you could talk to people.  They had organic microbrew beers and organic wines for sale which was kind of neat. I know I will be back soon, maybe I will head out there now for one of their fabulous smoothies! Oh, and another thing I liked is that they had the ingredients and what they are good for painted on the wall, which was artistic and informative. Definitely a cool place.  Oh yeah! The last thing I noticed is that everyone here was thin/slim and looked young.  I think a vegan diet really does help with that!", "Date": "2013-02-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Lisa L.", "ReviewID": "hi84eGarwKJhq0zfjkvePg", "Overall": "5.0", "Content": "I found this place from my hairdresser who owns an organic vegan hair salon!  I really like the food and the atmosphere is bright and lively! I had the chickn salad sandwich and fell in love! Overall a nice experience and I will definitely return!", "Date": "2013-08-17", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Chris V.", "ReviewID": "kSLNtMIaG5RlhjAs2rzOmQ", "Overall": "5.0", "Content": "I live in the condo next to this place so I'm always there. Buffalo chicken tempeh, kale salad, avocado toast, and their smoothies are all amazing. You think you've had good organic food at other spots until you go here and Green Bar blows past experiences out of the water.", "Date": "2013-07-14", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Marie C.", "ReviewID": "T5W7bCVAFGUIHKHFHjcC-Q", "Overall": "5.0", "Content": "Lovely spot, dog-friendly, and outstanding raw vegan lasagna and coconut curry soup! The staff could not be more friendly.  My only sadness is that I'm flying back to Chicago tomorrow and won't get to sample the entire menu (esp the desserts; the pumpkin cheesecake looks scary-good).", "Date": "2014-01-17", "Author_Location": "Chicago, IL"}, {"Author": "Brandy C.", "ReviewID": "mjOMgdy3HJ4XqPCEa81bQw", "Overall": "5.0", "Content": "Ate their today for first time after my friend took me for lunch who is a regular. Boy was I impressed. The food is light, tasty, and delicious. I had the GBK Burger and I could have eaten 3! The flavor was such a fantastic melody of sweet, savory, salty and the texture was crumbly yet held together.  It had an excellent \"mouth feel\" and taste!  I got the peach tea and as a tea lover they brewed this one right. Strong, sweet, I could have drank a gallon of it. I enjoy raw and vegan food, compared to other restaurants in the area offering the same cuisine, this place uses way less nut based and heavy raw food items. Also the dishes are unique, I've not seen them in any of my raw cookbooks.  Great for dieting and those with nut allergies.I can't wait to go back and try the other dishes. Just fantastic, fresh, wholesome, filling without that heavy feeling.I wish I lived close, I would eat there everyday!  My complements to the chef.", "Date": "2013-07-29", "Author_Location": "Hollywood, FL"}, {"Author": "Janis R.", "ReviewID": "19kQjuiv-LMS7X9uKZZhqw", "Overall": "5.0", "Content": "I began smiling the second I walked in. This place is so bright and the staff so warm and helpful you can't help but feel Welcome. We went for brunch two Sundays in a row and are working our way through the menu. So far big thumbs up to everything we've tried: the Firecracker Kale, GBK Burger, Living Lasagna and \"Chick'n\" Salad Sandwich - but the Avocado Toast with pink peppercorns sent me running out to buy a bottle of those tasty pink spice nuggets for home. Yum!What surprised me was the steady stream of people coming in. The place did a brisk business during our two Sunday morning visits. There's a breezy patio outside if all the seats are filled. I felt happy that there are enough locals to support another full vegan restaurant plus it warmed my heart to see a relatively new vegan establishment doing such robust business in the middle of the South Florida summer doldrums.", "Date": "2013-07-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Michael F.", "ReviewID": "EKWMdLX2cd9EwgjHAYAt-g", "Overall": "4.0", "Content": "This was my first time at the Green Bar. I ordered the Super Food Salad. It was Very Very Good!! I was a little disappointed that they did not make fresh juices on primacies!  They did have a limited amount of smoothies with some adders! I ordered the green love, but they did not have it at that time. Again disappointed! They did have my favorite Raw Coconut Water!! Over all the Green Bar is a really nice place with Great Energy! Decor was pretty awesome and the staff was very nice! I will be back soon to sample some more!", "Date": "2013-04-23", "Author_Location": "Davie, FL"}, {"Author": "Robert S.", "ReviewID": "8MMKvO39-kkaMdboIbV0Qg", "Overall": "5.0", "Content": "What a gem in the midst of fast fried, cheap Mexican, and mediocre seafood! Short amazing menu with all fresh local and mostly organic ingredients. Well done!", "Date": "2013-11-17", "Author_Location": "Laguna Hills, CA"}, {"Author": "Rebecca R.", "ReviewID": "GYhUmAxGrgtfSJoNZyubfQ", "Overall": "5.0", "Content": "Amazing food and delicious staff! You can't go wrong with any of the dishes here. I went twice while I was staying in Florida and this restaurant went above and beyond my little vegan hopes and dreams. Make sure to check it out if you're in the neighborhood.", "Date": "2013-05-24", "Author_Location": "Austin, TX"}, {"Author": "Noelle S.", "ReviewID": "nY7bJVmAVWP98c8BD-2zJg", "Overall": "4.0", "Content": "The food is expensive, the portions are small, but the food is delicious! I don't mind paying a little bit more when I know I'm getting quality food. The Decor is modern, fresh and cool. This is modern vegan cuisine, none of that hippie vegan. Today's special, barbecue tofu chicken sandwich, was yummy.", "Date": "2013-10-19", "Author_Location": "Miami Beach, FL"}, {"Author": "Yvonne G.", "ReviewID": "Z1mRx56lxtot1-9kPCTsbg", "Overall": "5.0", "Content": "I love this place. I am not a vegetarian or a vegan, but their food is excellent. I eat healthy and I love coming here after a workout. Excellent fresh food, good sweet treats as well. I think this place would make an excellent franchise. I'd love to see more places like this around- healthier choices for people. Nice ambiance inside- very light and breezy.", "Date": "2013-11-02", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Liz B.", "ReviewID": "IxtC-8RBZHa6Sl1HWxXAwg", "Overall": "5.0", "Content": "This place is phenomenal!  My boyfriend (omnivore) suggested it when I picked him up from the airport.  We had the butternut squash and pear soup and the sweet potato mash for starters - both were incredible.  He had the buffalo tempeh sandwich and I had the gbk veggie burger with the chipotle sauce and we were both thrilled with our food.  We sat at the communal table and met some great folks.  I can highly recommend this place.  This is vegan food done right!  We are definitely coming back.", "Date": "2013-04-07", "Author_Location": "Pompano Beach, FL"}, {"Author": "Patricia P.", "ReviewID": "S19xOVtia_7vxY7c3UR7PQ", "Overall": "5.0", "Content": "Wow! My boyfriend and I ran here from Las Olas to try it out. Because of the Florida heat, we were dripping wet. The staff were so happy to see we came so far just to try the place out, they greeted us with smiles and ice cold water. We tried two of their delicious smoothies and got to know the incredibly friendly staff. This is a magical place. I will definitely come here again next time I'm in the area!", "Date": "2013-03-31", "Author_Location": "Brooksville, FL"}, {"Author": "Lexi P.", "ReviewID": "AnJRJYsBtweIsNMHA2urbA", "Overall": "5.0", "Content": "Had dinner there last night in the patio as the temperature was ideal, cool and breezy.  The food is amazing, had the GBK meatless burger with an avocado appetizer and lemon grass \"cheese\"cake .  Wonderful food and the owners are warm and welcoming.  It's like being in a friend's house having a glass of wine and supper.  Highly recommend it to my vegan/vegetarian friends and those who would like to taste healthy, humane food which will make you feel fab and look younger.", "Date": "2013-10-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "April C.", "ReviewID": "llLagwtUfWFSt6umP7Mwsg", "Overall": "4.0", "Content": "I'm a big fan of vegan and vegetarian restaurants, especially ones that are gluten free.  Needless to say, I had high expectations of this place.  The inside is wonderfully decorated with 'green' affectations that would have made Captain Planet proud.  Plus, the back patio is comfortable too.  The food, for the most part, was delicious.  My only problem with the food was the portions are soooo small.  The Green Bar and Kitchen is really just a TAPAS Bar, nothing more.  Word of advice:  don't go there hungry.  If you want to drink and have an appetizer, this would be a great place for you.  If you are actually hungry, look elsewhere.  My friends and I were still hungry after we ate there, so we went to the Irish bar next door.This place has a lot of potential to be great.  I prefer the casual atmosphere at the Green Bar over others restuarants like Sublime.  Though, I hope they change the menu around to provide more food.  For the amount I was paying, I expected bigger portions.", "Date": "2013-03-14", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Andrew G.", "ReviewID": "o-4yXH9ut79rXsf_F7h7ZA", "Overall": "5.0", "Content": "This place should always have a five star!!!! Food is amazing for being plant based and as well as how clean and presentable this place is makes it even better! Every time I get there I'm greeted with an ear to ear smile by the wonderful staff! I'm so happy this place exist in my local area. They need to start looking to make it available in all parts of Florida ;-).. Also I can't express how much I love the owners there! They really do care about our community and they strive to be the best of the best! I give them so much props for dealing with us Fort Lauderdale people as we can be a little demanding at time. I recommend this place for EVERYONE! Not just vegans and vegetarians but also meat eaters!!! Their BLT is to die for!!!! Sooooooooo gooooood!!!", "Date": "2013-10-14", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "George B.", "ReviewID": "78ggSul6okJZmnPHpik8xA", "Overall": "5.0", "Content": "I loved the pure atmosphere with all the incredible veggie and gluten free choices. Get there early as they run out of the \"best\" stuff early, it seems. Most of the food we had was fabulous, some was just a little too salty or rich with coconut oil, but I get that. Sometimes that is the way to get some more flavor into a dish, I am just very sensitive to these tastes. Will definitely go back and recommend to everyone. These are the guys from the Zen Truck which had those amazing juices and \"un\" baked goods that my wife and I could not get enough of.", "Date": "2013-10-12", "Author_Location": "Alexandria, VA"}, {"Author": "Elizabeth R.", "ReviewID": "HIivLomVf1FmAWXrH7QkeA", "Overall": "5.0", "Content": "Like most people, my normal diet consists of a good piece of meat or fish cooked in a variety of ways (sometimes slathered in cheese and coupled with any and every type of side dish imaginable).  Over the years I've experimented with vegetarian/vegan/raw lifestyle and decided that I really can't commit to it full time due to the lack of flavor/complexity/overall satisfaction.  I don't want to state the obvious here, but you can't eat any cleaner or detox the body without incorporating the foods that only a raw/vegan diet can offer.   With that said, I have been researching some healthier lunch options in the area and happened to bump into Sean M.'s recent ROTD for Green Bar and Kitchen.  After all this bad eating from the Easter holiday, my body was craving nothing but greens and goodness.  Green Bar and Kitchen is tucked away in a strip mall next to a Chinese food joint off of 17th street in Fort Lauderdale.  Upon opening the door, I was immediately welcomed with trendy seating, cool decorations and lots of smiling employees.  Yay.  Although I did not opt for a smoothie this time, the selection seems vast.  They had everything from wheatgrass and acai shots to green goddess smoothies and the list goes on.  I was feeling like having a nice hearty lunch so the garden burger or \"GBK burger\" seemed like the way to go.  In addition, I asked about the soup of the day (mushroom) and ordered up a bowl of that too.  While I waited for my food, I browsed the small organic grocery section (complete with lots of chocolate options) as well as the grab and go soups and salads.  The organic wine and beer selection was impressive!  After grabbing a table outside on the patio, my food arrived in no time.  The veggie burger was packed with quinoa, carrot, chickpea, brown rice and spices all served up on a flax seed bun.  Bravo!  It was a nice sized patty with lots of yummy things incorporated included the chipotle \"mayo\" which gave it a nice zingy flavor with each bite.  The soup of the day was mushroom and I was really worried about experiencing a lack of flavor with a vegan mushroom soup.  Honestly, I was pleasantly surprised.  The soup had a creamy texture and a nice roasted mushroom essence.  I sensed some ground walnut or perhaps flax seed, but I really could not tell for sure.  All I know is - it rocked!  I ate a large bowl and could have easily downed another.  The staff was very friendly and came to check on us often without being annoying.  Even the drinking straws they use are biodegradable and 100% compostable.  I can see why Green Bar & Kitchen is growing in popularity.  It's one of the only places I know of that is truly plant-based and vegan in this entire city.  Their chef is a magician with flavors and may have changed my mind about whether or not I can do this 'vegan thing' full time.", "Date": "2013-04-01", "Author_Location": "Miami Beach, FL"}, {"Author": "Samantha S.", "ReviewID": "IAIkV8l59eRrNM8fFgNmsQ", "Overall": "5.0", "Content": "I am a fan for life! Best food and super nice friendly owners and staff. Elena is a sweetheart and knew my name which was super cool! I go here as often as possible-love the food and amazing deserts. I just went gluten free so it's easy to order here. I try new things each time and the staff helps me pick. It's clean and minimalist and I love the water with lemons they have waiting for you. I hope they never close shop because I actually crave their food! Eating healthy is actually easy, fun and scrumptious here!", "Date": "2013-09-01", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Nathalie M.", "ReviewID": "zoxzT0G56RuGjWYrg2pCcw", "Overall": "4.0", "Content": "Love the food here! It is creative and flavorful, as well as colorful. The staff is very friendly and accommodating, and the atmosphere is modern and fresh. They have fantastic marketing through facebook (I started following them) and the pictures they post make me drool! Delicious, healthy, and worth the extra $ to pay for organic, vegan, gluten free, and raw. Only minus is how crowded it often is during lunch hour!", "Date": "2013-08-30", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Alena A.", "ReviewID": "ZgPGqRQwnXctqev8h6UDNg", "Overall": "5.0", "Content": "Limited menu but the food is fresh and expertly prepared.  The owners are wonderful and gracious to have you in their place.  Comfortable and a notable neighborhood gem!", "Date": "2013-08-24", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Ken N.", "ReviewID": "9qFHhRTny2PXOmp7pTkLWw", "Overall": "5.0", "Content": "\"Just got off a plane from NY and found this place by accident. What a GREAT find! A vegan paradise! The selection is great, the pricing is fair, the atmosphere is laid back and relaxing. Their new and I wish them much success.\"", "Date": "2013-03-17", "Author_Location": "Hartsdale, NY"}, {"Author": "Lori S.", "ReviewID": "zLbGDFGf5URxOtu3Ri1bdQ", "Overall": "4.0", "Content": "I'll admit I was a little skeptical at first. I was invited by my son and his girlfriend, who's vegan for brunch. But I was very impressed with everything. Everyone's super nice, the service was quick and efficient and the food was delicious. I got the Chia pancakes with bananas and berries. There was a ton of berries and the pancakes were yummy. I tried my sons tofu scramble and it was very tasty. We shared  the avocado toast. It was wonderful. A wonderful avocado \"salad\" on amazing bread....that's hard to believe is vegan/gluten free....topped with pink peppercorns.  Excellent. Nice juice selection and craft beers.  We took home some cashew chocolate cups (a take off of Reese's ) and some munchkin type donut holes. They were fabulous...absolutely delicious. The other desserts...cupcakes and chocolate/avocado cake were not worth even eating.  One bite was enough but the whole place is great. I will def be back for more meals", "Date": "2014-02-03", "Author_Location": "Pompano Beach, FL"}, {"Author": "Grant K.", "ReviewID": "_qob4trpwIjNsfsqugJupQ", "Overall": "5.0", "Content": "Great raw and vegan food. I go there all the time and am always satisfied with the food. Great place!", "Date": "2013-03-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Demi N.", "ReviewID": "aI1WOUOR7PDpUXeJCNJXaQ", "Overall": "5.0", "Content": "Green Bar Kitchen is my paradise. Being a  vegan, I'm so happy they opened because South Florida is lacking in plant based restaurants. Not only do I love eating here, so does my family who meets me here since its one of the only places I can go out and really enjoy a meal. It's one of my favorite reasons for going back home. It's never a burden for them because although GBK is a niche for vegans/vegetarians/healthy-eaters, every dish is so flavorful you won't feel unsatisfied. I love that they offer more than just entrees, including organic beers/wines, a whole super smoothie bar, and a vegan bakery. The atmosphere is bright, and welcoming, and every time we go the staff is super friendly. The prices are on the higher side but If you do your research, and see all the superfoods that are hidden in each dish, their prices are well justified! It really isn't expensive, and it's definitely worth a try! (Vegan or not)", "Date": "2013-06-12", "Author_Location": "Downtown, Miami, FL"}, {"Author": "M T.", "ReviewID": "3lmOs8-Zq7ayD2DxcVQ5Jw", "Overall": "2.0", "Content": "I was in there today and the vibe was not at all what I expected.  The plaza outside is dumpy and the store signs look like temporary ones.  There were probably a dozen workers in matching fitted tees and no patrons.   It was very clean and modern looking but the cashier looked at me sideways when I asked about takeout. Something like \"ohhh sorry honey our kitchen is closed until 6 ... Yeah..\" Very much like it was the most obvious thing in the world that their kitchen is closed.  I said what about the juice bar and she pointed to the shelves of premade green juice.  With green bar being in the name,  I was very surprised that there isn't fresh made juice. The juice was from a cold pressed place in Miami and it was at least organic.  I ordered the bottled juice and a way-too-chocolatey chunk-filled vegan brownie (the vegan brownie at 4th generation in Boca kills this one!) and the cost was $14. I had to ask for an itemized receipt which was also a bit annoying.  Having said all if this, I am really itching to try the quinoa bowl and the house made kombucha so I may go back.  The kombucha on tap signs peaked my interest.", "Date": "2013-05-24", "Author_Location": "Fort Lauderdale, FL"}], "RestaurantInfo": {"RestaurantID": "_HPpHHmfQCLUvV_xizAE8A", "Name": "Green Bar & Kitchen", "Price": "$$", "RestaurantURL": "/biz/green-bar-and-kitchen-fort-lauderdale", "Longitude": " -80.13196240000000", "Address": "1075 SE 17th StFort Lauderdale, FL 33316", "Latitude": " 26.100421699999998", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/D0Eic3Kyfx95A0aN2FKzaQ/90s.jpg"}}