{"Reviews": [{"Author": "Bonnie C.", "ReviewID": "TVWcPAHgFf6FfsCbm8lVmw", "Overall": "5.0", "Content": "Djan's is just excellent, and consistently so. They have a lovely, refined dining room and have dealt with large groups graciously when I've been to parties there. They're also affordable enough to get their tasty food delivered instead if you're not feeling like putting pants on. The food is delicious. The dishes are made correctly and spicy is actually spicy without having to order five, six, seven stars. The portions are generous. The prices are a little higher than your standard Seattle thai place, but I think you really get better tasting food at Djan's.", "Date": "2014-07-08", "Author_Location": "Seattle, WA"}, {"Author": "Devin E.", "ReviewID": "IB_W-H5hrdYqxAyYyn2n5Q", "Overall": "5.0", "Content": "Great Asian fusion food.  Mostly Thai/Japanese, with some awesome combinations.  Samurai Phad Thai is my favorite, but be ready to spend some money for the fancy stuff.The lunch special combinations are a more inexpensive way to enjoy their food, but are not available for take-out.  Worth stopping by and enjoying a Thai iced tea on a sunny Seattle summer day.I have never had a problem with food quality, service, or waiting more than 15 minutes.  Check out their sister shop on Broadway, with the same menu, but a full sushi bar.  Love them both!", "Date": "2014-05-20", "Author_Location": "Seattle, WA"}, {"Author": "Christine R.", "ReviewID": "rK9x0rP_oSzW86jlzR6v3A", "Overall": "1.0", "Content": "I order from here pretty frequently. Decent food, albeit a little overpriced, but delivery is free if you spend more than a certain amount. Unfortunately, I think I won't be ordering any longer. It's now been an hour and a half since i ordered and I'm still sitting here, hungry. When I called I got the \"it went out and will be there soon, we're just really busy\". That's cool and I get it, but y'all are about to close, you have my money, and I don't have my food. It'll probably be cold by the time it arrives. Sorry, but you've lost a dedicated customer.", "Date": "2014-03-31", "Author_Location": "Seattle, WA"}, {"Author": "Vladimir M.", "ReviewID": "Ft_6hYOXWPCNopD940NtZQ", "Overall": "5.0", "Content": "Delicious restaurant. This restaurant has some of the best pad thai, which is one of my favorite dishes. I've been to a lot of thai restaurants and this one tops it off. The place has a great atmosphere, great soundtrack and generally great waitress. If you ever live nearby here going to this place can get addictive.", "Date": "2014-06-30", "Author_Location": "Seattle, WA"}, {"Author": "Katy A.", "ReviewID": "Uo-Mf0KGeGGg5R8NaiqbIQ", "Overall": "2.0", "Content": "Got a large delivery order (over $150) and realized once all the packages were opened- no rice! Even with the curry! I re-read the menu and it stated all entrees came with rice or soup. Not the case for delivery... I guess? The girl on the other end of the line was rude and disputed the fact that I was reading to her straight from the menu that complimentary rice was included with all entrees then just said, \"Sorry.\" No resolution or offer to deliver rice... Even for the curry dishes. So essentially, $11.50 for a bowl of soup. Pretty lame. Won't be back.", "Date": "2014-06-18", "Author_Location": "Orlando, FL"}, {"Author": "Ratna P.", "ReviewID": "4BV22zZosYgWXbwdB1ruKg", "Overall": "2.0", "Content": "The food is 4 stars.Portions are inconsistent.The service offends me more than the food.The biggest problem for me is the service. One of the waiter always have a \"Bank of America\" attitude. Once coming in ordering no star and the food come out spicy. I have gastric, so I cannot eat the food. Came in for lunch on a saturday, ordered brocolli with oyster sauce. Usually cost about $10 for lunch, comes with some rice. The waiter knows this, as I come in for that often. She charges me 11.70 that day, only to find there is no rice in it. How do you expect your customer to eat with no rice? The dang thing is not a steak. I had to come back to get some rice. She gave me a small box, and charge me $2.19 for the rice. So I ended up paying close to $14 for lunch. Plus, she always has this attitude: \"don't you know any better? the lunch hour is posted but we don't serve lunch in the weekend.\" And she always make me sit on a stool and not a chair while waiting. As if it can't get any more ghetto.", "Date": "2014-03-22", "Author_Location": "Seattle, WA"}, {"Author": "Willa M.", "ReviewID": "uzr4-45UDeaA8d1kR1RX2Q", "Overall": "5.0", "Content": "Just ordered delivery for a group of us. The food came within twenty minutes, piping hot, and exactly to our specifications. To the super nice delivery boy who got a really shitty tip because we failed to account for taxes: thank you. We owe you one. Literally.", "Date": "2014-06-02", "Author_Location": "Pullman, WA"}, {"Author": "Joni J.", "ReviewID": "OGsuMZfNIGT5p8rBB4rQag", "Overall": "2.0", "Content": "Called in an order for pick-up. Just a single dish, that's it. They quoted 15 minutes and went in 15+ minutes later. There was a woman ahead of me so I waited. When she left the girl who was helping her said hi and then proceeded to walk by me. She continued about her business for the next 20 minutes without helping me. There were only 3 tables in the restaurant at the time.Another man was in the restaurant waiting on an order for pick-up too. He started talking to me and told me he waited 20 minutes to order (he ordered there) and now it's been forever and he wishes he could leave, but he had already paid.At that point, I told the gentlemen that talked to me that I was leaving and good luck to him! So I left with nothing. I think the only reason I didn't stoop to one star and gave them 2 was because whenever the girl made awkward eye contact with me she still smiled at least. Also, the floors were incredibly sticky. Will not ever return.", "Date": "2014-06-15", "Author_Location": "Seattle, WA"}, {"Author": "Gideon A.", "ReviewID": "9I5wujkQ7bRbG7KYd3ZiQQ", "Overall": "2.0", "Content": "Food is great. Sometimes not.Deliver is fast. Sometimes not.Portions are fair. Sometimes not.Inconsistency is the word to describe it.I'm pretty sure who ever reads this will agree with me.Why don't they include silverware when they deliver food?Do they expect us to eat with our hands?I'm filipino, I do that only at home. Not at work.", "Date": "2014-03-01", "Author_Location": "Seattle, WA"}, {"Author": "Laura T.", "ReviewID": "o0dyYB8JdzuUwEbFigjTjQ", "Overall": "3.0", "Content": "Djan's is a cute little Thai place on 45th. The inside is bright and modern-ish in a standard house converted into a restaurant. The upstairs can be rented for separate parties or get-togethers. We were the only folks for lunch on a Saturday which was a bit surprising. Maybe because the room was mostly empty the waiter didn't pay attention to us that much. The food was decent but nothing to write home about. They catered to my companion's vegetarian needs (no fish or oyster sauce). If you're in the area give it a shot but doesn't seem worth a  long drive.", "Date": "2014-03-17", "Author_Location": "Seattle, WA"}, {"Author": "Annie H.", "ReviewID": "oU50lLuObW8944EmKg0DTw", "Overall": "4.0", "Content": "Food was great, almost dead inside though. I got the Pad Thai and it was delicious! Pretty good portion size. My waiter had a thick accent so it was hard to understand, so I ended up getting it spicy. I wasn't aware there was a 1 to 5 scale, so I think he gave me 5. It was pretty spicy. But good. Everyone else I was with liked their meal too. It looks like an old house on street. Parking isn't too bad, I just parked in the neighborhood behind it, and walked up. I have had better, but it was good.", "Date": "2014-06-05", "Author_Location": "Ventura, CA"}, {"Author": "Alexandra M.", "ReviewID": "JCtGStobXEtRFb2V_HUjbQ", "Overall": "3.0", "Content": "Lately, I've been having Thai takeout a little too often... Djan's was one of the places I ordered from (10 mins away from my neighborhood), and I specifically noted in my order that I wanted them to substitute bean sprouts and jalapeños. If they can't substitute, then take out the bean sprouts and jalapeños altogether. They ended up putting bean sprouts in my noodles anyway... Also, delivery was slow even though it was a weekday.I got the pad thai, pad see ew, and fusion noodles. Delicious -- with their pad thai being especially better than ketchup-drenched pad thai from Amazing Thai -- but nothing special and definitely not the best I've had. Their food is really sweet. I asked for everything to be made extra spicy, but my pad see ew still tasted extremely sweet.I heard they have a cozy and charming little place right off the 44 bus stop. I've never dined in, but from the quality of their food I think I'll pass and stick with their delivery service. Good for fixing your late-night Thai food craving, so don't expect more.", "Date": "2014-03-15", "Author_Location": "Seattle, WA"}, {"Author": "Suzanne C.", "ReviewID": "4YVXHuQEFLMuCBqhS2G1wQ", "Overall": "5.0", "Content": "I order from this place frequently at work for delivery.  Very prompt delivery. They use the yelp online order platform which is even better.  Wish more restaurants that deliver would utilize the online ordering tool.Green curry w/chicken - good (spice level is hit and miss if you like super spicy)Red curry w/chicken- very good (spot on with the spice level request with this dish)Fried veggie rolls - goodFusion noodles w/prawns- ok, not bad, not great....really not sure about the direction this dish is trying to take which can be confusing in textures and taste.  Maybe a concept that looks good on paper.Pad Khee Mao w/beef - goodTom Kha Soup - good (spice level is hit or miss)Overall for prompt reliable lunch at work delivery, online ordering tool and taste - great :-)", "Date": "2014-02-10", "Author_Location": "Seattle, WA"}, {"Author": "Brett J.", "ReviewID": "-NoAhWMjF9kmrssqFLvnaA", "Overall": "2.0", "Content": "I find it hard to believe I haven't reviewed this place yet - as I've lived in the neighborhood for 5 years - ordered out from them every 4 months or so and eaten inside twice.   Dining in, these days, I'd give it 3 stars.  It's ok.  the atmosphere the times I've been there is nice because it's usually empty so it's great for a date or casual conversation but the emptiness of the space might reinforce what others think about the quality of food and service.  As for the service, despite having a couple of people working 'front of house' and maybe because they don't want to feel like they are hovering - they seem to hide back out of sight and neglect going above the bare minimum of service (beverage order, drop beverage, take order, drop food and top off glass at that point) but if you need anything else during the meal or have a problem with a part of the meal good luck seeing them until they want the money again.)Dining out - which I have a lot more experience with - It was good for the first 3 years and it's the only place that delivers to me so if i'm lazy / desperate for thai I still do it - but it could be an hour - normally just 25-30 minutes.  One time it was over 2 hours.   These days though there is always a problem with something, yesterday it was the spring rolls and my last straw with this place.  Cold spring rolls, cut up into little rounds like sushi instead of a nice long roll and OH yeh, instead of being cold because they sit on top of the hot food on the way here they were steamed/warm.  OH yeh, and don't bother writing anything in the comment section on the order form when ordering because they don't bother reading it.  I can't hear my doorbell so I need them to call first. but with a plus or minus 1.5 hour delivery window I've got better things to do than watch out my front window.  Ok /end of rant/Bottom line.  It's warm, it'll fill your belly.  It's got a nice dining space. But there are lots of thai places in seattle many that are better in terms of quality, taste, and service.  And if this is your only option for delivery you're rolling the dice.", "Date": "2014-02-01", "Author_Location": "Seattle, WA"}, {"Author": "Rachael M.", "ReviewID": "nkVMg1jUFnAwfvUbhhUpdg", "Overall": "2.0", "Content": "In a fit of laziness, my fiancé and I ordered delivery from Djan's. We ordered through Yelp, which was very easy. The email said 45-90 minute delivery window and we never received any further info specifying within that window. Unfortunately, our food arrived lukewarm 105 minutes after we ordered. That's just a bit excessive. I don't think we would order delivery again.The food was...okay. I had the Pad Kee Mao with tofu and this was the best dish. Quite spicy (I ordered a 3) but flavorful with a variety of veggies and egg and good tofu. My fiancé had the Pad Thai, which was fine but nothing special. We also shared the papaya salad but it had a weird off flavor and was overly spicy. We didn't end up eating most of it.Overall, the food was fine but not good enough to have is coming back, especially given the excessive delivery time.", "Date": "2013-12-14", "Author_Location": "Seattle, WA"}, {"Author": "Una B.", "ReviewID": "0onmmFLT6XA8sD0q0LlxSQ", "Overall": "4.0", "Content": "Tasty Thai food in an adorable restaurant!This is my sister's favorite, local Thai place and I can totally see why! We dined for lunch and since it was an off hour, had the place to ourselves. Set in an older home, the dining room was airy, bright and inviting. I loved the decor and the inviting nature of the room!I, in my true new Thai fashion, ordered the Pad Thai to gauge Djan. My sister, better versed in their offerings, went with red curry. Both were served with a simple salad with peanut dressing. We traded some of our food and dove in!The pad thai was so delicious and well balanced, I was super pleased! It tasted fresh and had a fantastic balance of sweet and spicy as I had requested. The noodle consistency was spot on and I didn't want my plate of food to end! But as with all good things, it always does. I could have maybe stretched out the portion to include left overs for another meal, but ehhhhh. Since I'd be abandoning left overs at the end of my trip, I figured I might as well force it all in my belly. :) Friendly service, great atmosphere and delectable food! If you haven't tried this gem,  add it to your list and get over there!", "Date": "2013-11-27", "Author_Location": "Dallas, TX"}, {"Author": "Molly K.", "ReviewID": "XY7lZe4KgVIhYvW-3l4SjQ", "Overall": "2.0", "Content": "Long wait time for takeout, then to get home and find a hair tie in the food.  Ugggg !!,", "Date": "2014-03-16", "Author_Location": "Seattle, WA"}, {"Author": "Elle K.", "ReviewID": "jZ8vsnrjtlPHTbH2NgTtVA", "Overall": "3.0", "Content": "Food was okay. I liked the interior. The restaurant was renovated from a house, so you feel cozy inside. They did a nice job at decorating, matching simple white walls with wooden furnitures. I was in search of an asian restaurant with a private room (for 8) for a family dinner, so i wanted to try their foods beforehand.They had a cresent room and a moon shine room upstairs for a private party. Contrary to previous yelper's review, they charge 30$ fee to the crescent (smaller) room for the order of under $150.We tried appetizer plate and djan house noodles. Appetizer plate came with crab wontons, gyoza, fried tofu, and spring rolls and they were all mediocre. ( three of each selections came out in one plate). Mixed noodle taste okay but we felt like noodles were overcooked and bit soggy. When we tried to eat them with chopsticks, the noodles kept on breaking. I am not sure about lunch time, but when we went at dinner time(6:30-7:30) the restaurant was pretty empty. It was just us and one more table. The atmosphere they offer-quiet and cozy yet modern- was the best part of the restaurant. Personally, i dont think this place isn't a much of an amazing food type of a place.", "Date": "2013-11-21", "Author_Location": "Seattle, WA"}, {"Author": "Lisa D.", "ReviewID": "kkqg0FmWzydxMdLwahbMWw", "Overall": "5.0", "Content": "Still one of my very favorites! We no longer live in their delivery area, but have stopped by a few times to dine in. The restaurant is in a cute converted house, and the dining area is lovely. Very open and airy with plenty of room to sit.Fusion noodle is still outstanding, but don't miss the garden rama (sauteed vegetables with peanut sauce). I would (maybe)go vegan if I could eat this ALL the time!", "Date": "2013-11-21", "Author_Location": "Seattle, WA"}, {"Author": "Kimberlee O.", "ReviewID": "Xctf0pcjaQSnza9rZ2Lyaw", "Overall": "5.0", "Content": "Delicious Thai food and great service!Really glad we found this little gem on 45th. It's a super cute restaurant for dine-in, and the staff is very attentive, polite and welcoming both when dining in and for delivery. Will definitely be coming back!", "Date": "2013-12-19", "Author_Location": "Seattle, WA"}, {"Author": "Trisha F.", "ReviewID": "Fccoewx5hhfsVFHvtwx-lw", "Overall": "4.0", "Content": "Have you ever been to one of those places that does one thing so well while failing so completely at another that you're completely at a loss for where to rate them?Welcome to Djan's. As other reviewers have mentioned, the delivery policies are pretty nuts. I ordered through eat24hours.com, the best website for online ordering EVER, so I did know what I was signing up for. Apparently delivery always takes at least an hour, so make sure to call before you anticipate hunger.I was also pretty miffed that on a Sunday at 11:30 they were not honoring lunch special prices, which they advertise to be good between 11-3 PM. This might be because it was a weekend, but I could find no small print about that listed anywhere.Djan's is expensive, but as with most things, you get what you pay for. The portions from the dinner menu are large-- big enough for two people to share. Pad Thai with chicken and Garlic Chicken were amazing. Veggies were tender crisp and fresh. I liked the added aesthetic appeal of carrots somehow cut into multi-pointed star shapes.I will definitely eat here again.", "Date": "2013-07-21", "Author_Location": "Seattle, WA"}, {"Author": "Samantha G.", "ReviewID": "cij-V8eLrYZPybFJt_Vqdg", "Overall": "4.0", "Content": "I have never set foot in Djan but my office regularly has lunch delivered from here, and their delivery service is awesome. I also like how they wrap foil around their noodles from the lunch menu so they're fresh when when I eat them.I personally haven't found many good Thai restaurants in Seattle but almost everything I have tried here so far is delicious. Their phad thai to me is one of the better ones I've had in the city. These noodles are cooked just right, its not saucy and the flavors are balanced. The lychee cheesecake, although it seems like they just dumped lychees on top, is good. I think it's worth the splurge once in awhile. I also like their red curry and pad see ew, which unfortunately is only offered as a dinner dish not as a lunch special. However, the prices for lunch have gone up recently so I don't feel as guilty when I want to order pad see ew. The only dish I was not too crazy with was their fusion noodles, which are a mix of phad thai and phad kee mao. I'm not sure what it was about the taste of it but it's definitely something I won't crave.In terms of spice level, they lean on the higher side. I was pleasantly pleased when I order 3 stars on my meals, they actually have a nice kick to them.", "Date": "2013-03-13", "Author_Location": "Seattle, WA"}, {"Author": "Amanda T.", "ReviewID": "JlmmISQ29pVow9TWM27juA", "Overall": "1.0", "Content": "My husband and I waited for an hour to received our two pad see eiw entrees and when we finally received our order, they only provided us with one entree. When I called to ask about it, the person on the phone told me the driver was confused so only charged us for one entree. There was no offer to send out another one until I asked what we were supposed to do. I was told the chef could make me another one but it would possibly be another hour before I received it. I said forget it and we won't be ordering from them again, and I was hung up on. VERY POOR CUSTOMER SERVICE!!!", "Date": "2013-03-03", "Author_Location": "Seattle, WA"}, {"Author": "Opal D.", "ReviewID": "J-2mOTu5gIeo9VwmmgK0fg", "Overall": "4.0", "Content": "I order delivery from Djan's Dining at least once a month. The food is good and takes approximately an hour to get to you. Their phad thai and yellow curry are my standbys.  Only complaint is that they are unwilling to split cards for delivery which is a pain when I'm ordering with coworkers.", "Date": "2013-11-12", "Author_Location": "Seattle, WA"}, {"Author": "Josh G.", "ReviewID": "KIY_7l4bgvKqAflzTKqKwQ", "Overall": "4.0", "Content": "Djan's offers tasty Thai food and a very interesting set-up (former home converted into a restaurant). While a little pricier than other Thai options near-by, the portions were good and the ingredients tasted fresh. The waiter was very friendly, and service was generally fast (note: we were the only diners there until shortly after ordering, so I can't speak to how fast it would be if there's a full house).Definitely going to return to Djan's again! As of yesterday, there was a $10 for $15 Yelp offer too :)", "Date": "2013-02-18", "Author_Location": "Seattle, WA"}, {"Author": "Madison L.", "ReviewID": "gemRxM4-c5BwVBjGd8bcsA", "Overall": "2.0", "Content": "I think the food here is good. I've been here before for lunch and dinner and have always had great service (it's usually pretty empty so my friend and I are the only customers) and the food is plenty and tasty.  This place could easily be a 4 for me. The reason for downgrade is that this time I came in with a groupon for lunch. It was $10 for $20 lunch groupon. They ask you immediately if you are there with a groupon. Here's the thing, if you say yes, they give you a dinner menu instead of a lunch menu. I know, I've been here for lunch and I checked the menu online on their website before I came. Instead of $7.50 for an entree, prices are $9.95. That's a big difference, my friends. I am disappointed in their scummy ways. So, WARNING: if using a groupon for lunch, they will give you a dinner menu!Considering all the other Thai places around the area, I will not return here for another meal.", "Date": "2012-11-27", "Author_Location": "Seattle, WA"}, {"Author": "R H.", "ReviewID": "g_vZ6Y83PBovT-i59kqDgw", "Overall": "3.0", "Content": "The food here is much less sweet and a bit less salty as the average Thai place in the area. Even the salad rolls were a bit distinct with a a tougher (almost tortilla like) wrap. It seems other people have commented on the decor and mentioned that it was quiet. I believe it could be quiet if people are talking very quietly, but if the volume raises above the \"the movie is about to start\" whisper/talking then it's all over. When we were last there about 12 people were in their dining room and it was hands-down the loudest dining experience outside of a bar that either my friend and I have had in Seattle. Why is this? There is absolutely no sound dampening in the entire dining room. It is a small living room of an old house with bare walls, bare wood floors, and wood furniture. We are there for the food and conversation, not to provide a new space for Mutt Lang to mic a snare drum. For the sake of future diners - I beseech the owners to hang up some tapestries, curtains or at least a rug... Pros: Some variety in flavors for Seattle ThaiCons: Noise", "Date": "2013-02-17", "Author_Location": "Seattle, WA"}, {"Author": "Harrison W.", "ReviewID": "UClYyjMh6CvnKhDMs0_iTg", "Overall": "4.0", "Content": "As a strict Thai place, the benchmark fares of pad thai (or any other stir fried rice noodles for that matter) ranks in at a solid three stars.  More often than not, their noodle dishes end up a little soggy and mushy (as others have stated), but it's really a dice roll.  Their Djan Fusion Noodles (basil and jalepeno make it) come out a little too wet IMO, and often times a touch on the salty side.  Curries are pretty okay, above average, but it's hard to get Thai curry wrong.Djan's redeeming factor comes from their surprising decor (it looks like a house from the outside, but inside it's minimalistic wooden romantic-y) and their fusion menu which supplements the options for choice moreso than your normal Thai place.  A plethora of delicious appetizers (see: Crab Rangoon, Fried Fiery Calamari), their Pineapple Fried Rice, Thai Fried Rice, Djan's Fried Rice, and the awesomeness called Samurai Pad Thai (Bed of Pad Thai with Shrimp Tempura) really are what make Djan's shine.  On their Samurai Pad Thai their shrimp tempura really are super delish, for a newcomer I'd recommend that dish to try.  The Salmon in Heat (creative naming) is also delicious -- it is a filet of salmon with Panang Curry on top, great fusion of flavors.One note, I did order their Duck a la Funk once (Fried Roasted half duck with chili peppers, chopped onions and topped with three flavor Djan's special garlic sauce), and it came out a little bit too overcooked and dry.  However, being as I am a fan of duck-anything, I will be trying their Joy Duck Club (don'tcha love it?) next time, which is their roasted duck curry.To recap: food's pretty good (hit or miss, when it's off it's meh, when it's on, it's heaven), quiet ambiance and clean decor, but their choice in options and their creativity in flavor combinations bring it to a solid 4 stars.", "Date": "2013-04-05", "Author_Location": "Seattle, WA"}, {"Author": "Daniel C.", "ReviewID": "70eks9v5Yhs7nz7HMcWrqw", "Overall": "4.0", "Content": "Are you looking at this because you're trying to find a dependable Thai place that delivers?This is definitely THE place.  Their delivery is typical (around an hour) and most importantly, their meals are consistent.  Their pad thai is always on-the-ball, and I highly recommend their Samurai Pad Thai, which is mixed with small morsels of tofu.  Their red curry with duck is great, and their panang curry is one of my favorites.Unfortunately, they recently adjusted the portion size of their curry, so it doesn't come in a quart container anymore.  Sad, since I used to take leftovers to work for lunch.", "Date": "2013-07-26", "Author_Location": "Fremont, Seattle, WA"}, {"Author": "Coleena S.", "ReviewID": "qcYwyldNdiI19w7O--IR9g", "Overall": "4.0", "Content": "I order delivery from Djan's a lot when I am at work. I usually have to chose between this or Jimmy Johns. Sometimes I want hot food and Djans serves great Thai food. Pad Thai is delicious. Pad See Ew delicious.Basil Eggplant...yummy.Thai Iced Tea...omg deliciousLychee cheesecake ...omg deliciousMango & sticky rice ...omg deliciousI really like to order from them when it's payday or when I forget my lunch. However, now I've switched shifts and they're closed when it's time for me to eat. I can't say much about the restaurant service or ambiance, but they have great delivery service and kind drivers.", "Date": "2012-10-01", "Author_Location": "Seattle, WA"}, {"Author": "Adriana Z.", "ReviewID": "B9n3DCFAMzWaZjT9Dg0XcA", "Overall": "5.0", "Content": "Best Thai i have had in Seattle!!!We get the Pad Thai and the Pad Prik Khing...is our favorite. once they gave us the Pad Prik Khing and it was watery but had no problem giving us another one that was very flavorful, made up for the first time.", "Date": "2013-05-17", "Author_Location": "Seattle, WA"}, {"Author": "Akiko I.", "ReviewID": "LLR8T2pv3CPquvw354UhCA", "Overall": "4.0", "Content": "- Locale Destination - It's on 45 Th St and Latona Ave NE in NE Seattle. (Wallingford)The restaurant was a house. Unless you see the big sign at the front, you wouldn't notice as a restaurant. Decor is very chic - white, woods, splash of pink - like a cafe. Very cute. Bathroom is upstairs. No parking, so park on the streets by the restaurant. Nice and friendly service.- Gluttony Expedition - Spicy Ocean: Tons of seafood (mussels, salmon, squids, shrimps) and vegetables (bamboo shoots, bell peppers, mushrooms, green beans, Thai basil etc.). Seafood was cooked very well - very tender. The sauce was spicy and sweet. Good. I tried #3 spiciness (out of 5), which was maximum for me and very good/spicy. For $15, the amount of seafood and vegetables were amazing. Good dish. - Conqueror's Deduction - This was unexpectedly good. It's a bit strange to see \"gyoza\" (Japanese pot stickers) at Thai restaurant (they call themselves \"Contemporary Asian fusion cuisine\"), yet my dish wasn't so Americanized and got a good Thai flavors. For the quality and quantity, this was very reasonable. Great find ;)", "Date": "2012-05-31", "Author_Location": "Orange County, CA"}, {"Author": "Ian S.", "ReviewID": "RQRAx619XDG3Y-nWeLHc9w", "Overall": "5.0", "Content": "This place is really quite amazing.It is more of a thai-pan-asian fusion place.  The house specialties sound facinating, but for my first visit, I just had something lowball.Their prices are affordable, the portions are generous, the taste is notable, and they deliver.  Total win.This is a small house that they took over to make this restaurant, but it's very chic.  Something like 10 tables downstairs and a party room upstairs.  This place feels like a special cut above the normal area eating establishments.", "Date": "2007-07-20", "Author_Location": "Seattle, WA"}, {"Author": "Jenny W.", "ReviewID": "DXFU32HOliUDeatqMzy-4g", "Overall": "5.0", "Content": "Djan's, I'm sorry it has taken me so long to write this review. Please don't be offended...I have ordered from you so many times there are no hard feelings, right? My affair with Djan's began last November, when I went here for my birthday dinner. The 9 us got a private room upstairs, all candlelit and perfect, for no additional cost! How wonderful! We had one waitress the entire night who was very attentive (and got a workout going up and down those stairs flawlessly with our hot plates!) I ordered eggplant and basil because it said \"EAT ME!\" while everyone else ordered family-style as to share. We got chicken pad thai, green curry, egg rolls, and something else. Basically everything was delicious. The thai iced coffee was also appropriately sized and priced, something which is very uncommon. I've been booty-calling Djan's for a late night fix ever since. Free deliveries over $15! Ok, it's pathetic I don't just bus but sometimes you just want something delivered to your doorstep so you can just continue being lazy. Everytime I call they say \"45minutes\" but they always come within 20! Now that's what I call \"underpromise and overdeliver (literally, ha.ha)\" -- it's a work ethic I like very much. I usually get the same fare every time: tom ka gai, pad thai, green curry or eggplant basil, and brown rice. This more than enough for 2 meals for me and my boyfriend combined.Their pad thai is seriously THE best in Seattle. It makes Thai Tom's mess of stomach-churning, rule-violating noodles look, well, like just what I described...disgusting. It is the perfect texture and sweetness. Mmm. I know I'm not very authentic in my Thai food but hey it tastes damn good. Their tom ka gai is always perfect (though I have to say my own recipe is pretty good also) and the little button mushrooms floating on top always gets my appetite on. Eggplant is consistently tasty, but still isn't quite as good as Sichuan Cuisine's...but that's just on a totally different level.Anyway.The green curry is delicious and definitely not curry paste stuff (I have the curry paste, I know how it tastes) and once I also got spicy basil chicken but that took my tongue off. I'd say the 5 stars is really 5 stars so I actually go for 4 [insert look of shock here] which is just enough spicy and just enough mild so I can actually taste the food without crying. Now I just reserve the crying for happiness when I get my Djan's delivered :)", "Date": "2009-08-05", "Author_Location": "San Francisco, CA"}, {"Author": "Michael K.", "ReviewID": "RSEPRj7PAMiaIshm5JTE4g", "Overall": "5.0", "Content": "Yum Yum YumYum Yum YumYum Yum...errr...all the way?Sorry - I just, really loved the food I had delivered from this place on Friday night.  The appetizer platter came with fried veggie rolls, crab rangoon, fried tofu and gyoza, all of which were awesome and fried and awesome and not healthy!  The pad see ew and panang curry were both fantabulous as well - I had the pad see ew with shrimp and there were at least 15-20 good size shrimp in it!  Way generous compared to the norm and plum and tender - plus the size of the dish as a whole was ridiculous - easily would feed three.  The panang curry had tons of chicken and peppers and onion in it and was deliciously spicy and also made for three good sized plates.  All in all I'm super bummed that they only deliver to my buddy's house and not all the way to mine, but I'm glad I had the opportunity to try it and will probably get take out from them in the future.", "Date": "2012-04-16", "Author_Location": "Seattle, WA"}, {"Author": "Shekinah S.", "ReviewID": "fis7IBEKkQTOvSUqdGJCNg", "Overall": "4.0", "Content": "4.5 Stars Damn Djan's, dinner was delicious! This place is approaching 5 Stars. Had a late meal here last night. I ordered a \"fusion\" noodle dish (mixture of pad Thai and maybe pad see eiw) with chicken and my boyfriend had yellow curry with prawns. Both dishes were delightful. I'm wary of pad Thai in Seattle since you usually get that tomatoey crap, but fortunately this did not disappoint. It was delectable, perfectly spicy at 4 stars, and contained a nice amount of broccoli and chicken. My BF's curry was also darn good. His dish came with rice and potatoes and they didn't skimp on the prawns. The presentation is always lovely and I enjoy looking at what other tables are getting while I'm waiting (though a peek into the kitchen may make you squirm a little). Djan's -- definitely a do!", "Date": "2010-08-08", "Author_Location": "Saint Paul, MN"}, {"Author": "Akiva S.", "ReviewID": "OfExE6rnoWemK1pvhx91vA", "Overall": "4.0", "Content": "I'm originally from the south where it is generally known that some of the best food you can get comes from the places that most look like health hazards.  Find a guy running a BBQ business out of his garage and you've found some of the best BBQ money can buy.  With this in mind, I tend to instinctively avoid places that seem to focus too much on being slick-looking.  I also avoid places that claim to be 'contemporary' versions of traditional foods.  And I especially avoid places that claim to feature 'pan-asian' cuisine.  Thus I've been avoiding Djan's.  Big mistake, my fellow Yelpers; really big mistake.\rToday, I'm home, in a bad mood because my workstation burst into flames this morning (literally), and I decided I didn't want to prepare food for myself and I didn't want to go get take-away.  I knew that I wanted Chinese food but Moon Temple doesn't open for lunch.  So I'm crying and digging through our little pile of menus and there it was, like an sleeping infant in a coal mine (no, I'm not sure what that means either).  I called them up and they said, 'Oh!  We've been waiting for your call!'  And I said, 'Yo, yo, yo, let's make a little gastro magic, my brutha.'   And they said, 'And how!'\rWell, the food arrived a half-hour later and it made for one damned fine meal, my friends.  I ordered, as usual, far too much but I'm having problems controlling myself; I can't stop eating.  The spring rolls are fantastic and unique; the wrappers are light and fluffy like a crepe.  My good pal Johnny H. recommended the Fusion Phad Thai and he's right, I am thanking him later.  Thank you, good pal Johnny H.  The pineapple fried rice is pineapple-y, fried-y, and rice-y.  As usual with pineapple fried rices, there's simply not enough pineapple but it's got a ton of tomato and cucumber and so the universe ends up balancing out in the end.  It's a kind of dietary karma, you see.\rNow, I still prefer Chillies Paste for straight-up, out-of-the-garage, guilty delicious Thai food but Djan's beats Chillies Paste when it comes to quality vs. price ratio.  Djan's food just feels fresher and healthier.\rSo, yep.  Djan's comes highly recommended from me if by 'highly recommended' I mean 'TINA, EAT THE FOOD.'\rWhich I do.  Djan's is da boogens.", "Date": "2006-08-02", "Author_Location": "San Francisco, CA"}, {"Author": "Derek P.", "ReviewID": "k3yc2eknasdDD5KwWzjaYw", "Overall": "3.0", "Content": "Right off the bat, I must admit that I was semi-impressed with the interior of Djan's. Considering the restaurant is in a house, you almost forget that you're sitting in one.Initially, I paid no attention to the background music that was softly playing. Not music that I expected to hear in a Thai restaurant. Oldies (I think?) just didn't suit the place setting or food. Concerning the actual food. I'm dropping a 3-star rating. A little on the salty side - I liked the broccoli and beef. I'm allergic to basil and we neglected to double-check with the waitress if any was used heavily in the dishes that we ordered. Fortunately, the broccoli & oyster sauce lunch combo special had none. Unfortunately, after a bit of back-and-forth with the waitress, we found out the second dish did have basil.Me. Excuse me, do any of these dishes have basil?Waitress: That one is spicy, that one is not so spicy.Syl: No, does this have basil?Waitress: Oh, no basil.Me: [Confirming] So no basil in mine right?Waitress: Not spicyFor the price, you get a decent portion of food. I'm not sure if I'll make my way here again though. Because the dining area is detached and on the opposite side of the house from the ktichen, service is on the slow side. BTW: To the drug rep looking / sounding woman behind us, try not to forget that you're in a restaurant while you argue about a company covering your expenses... quote unquote 'ish. And to the two young women to our left, it is rude and DISGUSTING to hear and see you clipping your damn fingernails in a restaurant. Deep within I hoped for your enemies to find their way into your dorm rooms making sure to cut their toe nails on your pillow sheets.", "Date": "2007-03-19", "Author_Location": "Seattle, WA"}, {"Author": "Stephanie T.", "ReviewID": "1Im9N10MaFz0pYCLWWZBqw", "Overall": "4.0", "Content": "Crab rangoon. OK, totally not authentic Thai food (thus far have only been able to find them in the Midwest and random parts of the East Coast, not the first places you think of when you think Asian food) - but what's not to love about deep fried cream cheese/crab mixture!  (Do they even have cream cheese in Thailand?)  They have them at Djan's and they are served hot out the fryer and delicious, delicious, delicious.  Reason alone to return.The Djan's special fusion noodle dish.  This was definitely a winner - when it showed up, I thought it just looked like another Seattle pad thai, but try it - it's a little like a mix of Thai curry with Thai noodles and some exotic veggies you don't usually get with pad thai.Salmon dish.  Despite sounding exotic and delicious on the menu (marinated in Japanese soy sauce and then smothered in curry), the salmon was overcooked and dry.  I don't recommend.Candlelit atmosphere.  It seems super geared toward romantic date night - mood lighting/soft music/etc.  Too bad for everyone who actually was on a date we were that pretty noisy/rowdy group of five.  So, kind of bad for groups.  (Though I hear they deliver.)I think I've never been here before because it basically looks like a house (turns out, not such a bad thing) and is in the less wonderful part of Wallingford (smack dab across the street from that sketchy looking Fudge Brothers Pizza).  Plus whenever I'm in that area I hone right it on Rancho Bravo taco truck and can barely be convinced to think about other food.  But Djan's is worth trying when you want to mix up your Thai experience!", "Date": "2008-02-24", "Author_Location": "San Francisco, CA"}, {"Author": "cassie c.", "ReviewID": "T7c1zEezk4F2wdqsWDYXaw", "Overall": "4.0", "Content": "Considering that part of the dining experience is ambiance, this place really did it for me. Eating is a psychological experience, we eat as much with our eyes as we do our mouths (la te da. Pretentious alert!) ...... The lighting was calming, the space was cozy (which in this case is not a euphemism for cramped as hell) and the tables were appropriately spaced apart. Because this is an old house converted into a restaurant, I got a sense that I was sort of sharing this experience with my fellow restaurant goers, which actually made it kind of fun.... Don't worry though, you're not elbow to elbow with anybody, it just gives off the ever coveted community vibe. After seeing the two dollar sign ($$) price rating here on yelp, I was pleasantly surprised when in fact most entrees were around the eight to nine dollar range! Hooray! The service was terrific (and really cute too.) And the food was great...  I'm no Thai expert, I play one on TV, so I thought it was good. This was such a good place, that I almost feel sorry for the surrounding Thai places. Why hasn't everybody else figured out - florescent lighting, and plastic table tops = a bummer.", "Date": "2008-09-25", "Author_Location": "Seattle, WA"}, {"Author": "Jim B.", "ReviewID": "R5fLQD0nKE0GqBE9E1E59A", "Overall": "4.0", "Content": "These guys get three stars for having lunch specials that aren't all based on Phad Thai.  In fact, they may get my eternal gratitude as well.On top of this though, the five stars are the perfect five white guy stars.  Which means perfectly three stars.  And while that may seem strange, recently I've hit a string of Thai restaurants where five stars constitutes waving a sealed bag of chili paste around in the next room.I had their ginger chicken lunch special.  While it's not the high point of creative thai, it's totally solid.  The spices were balanced, the veggies fresh, the meat perfectly cooked.The decor is nice, the restaurant comfortable and the prices are pretty keen as well.So, I can't find anything snarky to say.  It's just good solid Thai food between the U District and Wallingford.", "Date": "2008-10-17", "Author_Location": "Seattle, WA"}, {"Author": "Ninette C.", "ReviewID": "codOwnTtkzWMq6pSx0YE_A", "Overall": "3.0", "Content": "This was a rather bizarre dinner for my friend and I. haha.  This is a little house in Wallingford. There's an upstairs, downstairs and outside.  I arrived first. We decided to sit outside. She told me to sit anywhere so I picked a table and went inside to use the restroom.  I came back and she had moved my stuff to another table.  My friend arrived a few minutes later and he wanted to sit further from the street like I originally chose so we asked to move again.  He told me that he went in and said he was looking for his friend outside and nobody did anything and just kind of stared at him. He finally explained to them he didn't know where the outside was and that they had to take him there. lol. I ordred the Djan's Fusion Noodles which is a blend of Pad Thai and Pad Khee Mao and my friend had the vegetable delight.  I thought my dish was alright...it wasn't as exciting as I thought the fusion thing would be.  I didn't think it was very spicy so my suggestion would be to order liberally esp if you're a middle of the road 3-4 star spice gal like me. My friend liked his vegetable dish. I think its cool that they have a dining room upstairs and they seem to be very excited to be near a college neighborhood as they were all about graduation parties and the such.  The house is cute for a nicer Thai restaurant.  A-Ok.", "Date": "2012-07-23", "Author_Location": "Seattle, WA"}, {"Author": "Jackie C.", "ReviewID": "98dhcTgLGDJmGQg9czYODA", "Overall": "4.0", "Content": "Would have never seen Djan's had I not been looking for it after reading the reviews on Yelp. So, thank you fellow Yelpers for turning me on to Djan's. Walking into the house, I was quickly moved into feeling like I was in a intimate dining room, not a small, former-living room.   Tables and decor were tastefully modern, again odd since we were sitting in an early 20's Wallingford home.  My point...cool atmosphere.Service was good, and the food was even better.  We ordered three dishes to share at the table all having top-star rated spices (can't remember their numbering system) spices.  The food was hot, but still had flavor.   Perfect!PS - I was weary of the water after reading the postings, but it was fine.  We drank Thai beer anyway so you can't go wrong!", "Date": "2007-08-10", "Author_Location": "Seattle, WA"}, {"Author": "Thomas J.", "ReviewID": "OM5Z0rj6B_cpqWDB3Wy3Bw", "Overall": "5.0", "Content": "The go-to delivery option in Wallingford.  Everything here is great, delivery is prompt, the food is hot, fresh, and consistent.  And giving this place 5 stars isn't like a best-ballerina-in-Toledo situation - we're talking about Seattle here, where you can't throw a latte without hitting a Thai restaurant.  Come to think of it, is there a single latte-Thai restaurant/cafe in this town? I think I've invented a new category.  I'll call it Latthai. So you don't have to walk the 1/2 block between the nearest coffee stand and the nearest Thai restaurant.Easily in the top-5-restaurants-in-Wallingford-that-occupy-­former-single-family-homes-on-45th.", "Date": "2009-03-29", "Author_Location": "Seattle, WA"}, {"Author": "Mel R.", "ReviewID": "ENvROXAmjDGTVabC94qbnw", "Overall": "3.0", "Content": "not impressed. Oh sure, the interior is cute and simplistic, but my chicken Pad Thai was drowning in sauce. It was a bit overwhelming and I couldn't finish it. The private upstairs room is great for parties or a large group as you sit on pillows at one long low table", "Date": "2007-12-18", "Author_Location": "Oakland, CA"}, {"Author": "Midge C.", "ReviewID": "mzEJGsOzT7pVAktVBAZjdw", "Overall": "5.0", "Content": "What a nice surprise! I drive by this place all the time and never thought about trying it out. I bought a Groupon for Djan's a couple months ago (I can't pass up a bargain) and the BF and I decided to try it out. We went for an early dinner and it was pretty empty. Don't let that deter you though! There were many takeout orders being picked up while we ate. The restaurant is in an old converted house, which is pretty darn cute! Our waitress was attentive (never an empty water glass), but not overbearing in any way.We ordered:*Pad Thai. I never order Pad Thai, but we both had a hankering for it for some reason. It was really good! *Panang Curry. HELLO! It was absolutely perfect. My BF was surprised that I didn't steal the whole dish for myself.*Spicy Ocean. Stir fried prawns, scallops, squids, mussels and crabmeats\\ with green beans, bamboo shoots, mushrooms, jalapeno and basil in herbal chili paste. This was a yummy dish with just the perfect around of heat.The prices are very resonable and the portions are just right. I love Thai food, and I'm excited that it is so close to home!", "Date": "2010-07-13", "Author_Location": "Seattle, WA"}, {"Author": "Trevor R.", "ReviewID": "zUXxNCIwTVNO0Iu05jUJYw", "Overall": "4.0", "Content": "I'd describe Djan's as a slightly fancy but inexpensive Thai-influenced Pan-Asian restaurant. Many of the menu items have cute English names, like \"Duck a la Funk\" and \"Joy Duck Club\". I ordered \"Spicy Basil Leaves\" (tofu w/ stir-fried with fresh basil leaves, mushrooms, onions, bell peppers and jalapeno; $7.95), and thought it was very flavorful and tasty. My only disappointment was that I ordered 7 stars (out of 5), and it tasted more like 3 or 4. Even the few jalapeno slices were unseeded. However I was happy that the spiciness didn't come from a bunch of dried red chili thrown on top. My friend's \"7-star\" green papaya salad ($9.45 w/ prawns) was even pretty hot without a single red speck on it. I'm not sure how they did it...We rented the private room upstairs ($35) where everyone sits on the floor on pillows around a long, low table that can easily accommodate 16 people. The service was prompt and friendly. Definitely recommended.", "Date": "2007-08-29", "Author_Location": "Austin, TX"}, {"Author": "katie s.", "ReviewID": "HWlPYZRXnraFLTtLv2HfVg", "Overall": "3.0", "Content": "Solid.. and I really like their Djan Noodle (a little bit of Phad Kee Mao sauce with the Phad Thai noodle)but their parking spots are way too advanced for Seattle-ittes who can barely merge without hitting each other,and the really nice waitress must not have heard me ask for BEEF in my noodle dish and brought out Fried Tofu.  Because I wasn't really in a mood to complain, I ate it anyway.", "Date": "2008-11-24", "Author_Location": "Seattle, WA"}, {"Author": "Matt W.", "ReviewID": "EDhow-zpsp6FaF0prfoh9g", "Overall": "5.0", "Content": "Rare five-star rating on this one. Djan's is amazing. Bottom line.The combination of super-low prices, great service, modern/minimalist decor and top-notch food led me to choose them to host my rehearsal dinner. After that dinner, I had 25 friends and family who agree. The bottles of wine aren't marked up unreasonably as well.Their Phad See Ew and their chicken salad (with curry) are the best of the best. You won't be disappointed.", "Date": "2009-05-04", "Author_Location": "Seattle, WA"}, {"Author": "Natalie E.", "ReviewID": "AizrNgUOKreCHTX0nCdS8Q", "Overall": "4.0", "Content": "We love this place. Happy hour is great and they have the best pad thai.", "Date": "2013-12-15", "Author_Location": "Seattle, WA"}, {"Author": "Paul F.", "ReviewID": "Re7S_O_W8Xbrew90cp-Vmg", "Overall": "3.0", "Content": "I tried Djan's the other night after feeling like I should work my way along 45th in Wallingford since I live in this neighborhood now.  And it's certainly closer than University Way or Fremont Ave.I think Djan would be a nice place for a date or to eat with family who you don't see too often or something where you like to talk and walk to see the person in front of you.  The restaurant is converted from a former home, and the interior is very white, very airy.  And as I mentioned above, it's well lit, which is a major contrast to most thai places.  There's no flaming woks or loud, dimly lit dining rooms as you walk in.  It's just a different feel, and I give it some points for that.The food was fine.  Better than the bad thai restaurants, but nothing different than the standard Seattle/Puget Sound/Northwest thai fare.  I tried the fusion noodle and my friend had the pad kee mow.  I also had a beer and the crab rangoon.  Good, nothing particularly different, pretty much the same as anywhere, same as the thai restaurant I worked at back in high school.  Which is to say there is nothing wrong with that.So if you're in Wallingford, need some thai, maybe have some good company, give Djan's a try and enjoy a small dining room where you can see and hear the people you're eating with.", "Date": "2008-10-07", "Author_Location": "Seattle, WA"}, {"Author": "Monali P.", "ReviewID": "a-q_8IaJopdUKFLtVNvevA", "Overall": "4.0", "Content": "My favorite thing about cold days is indulging in spicy Thai food to warm me right up. There is nothing better.Djan's delivered on the spice and the khee mao noodles, while a tad too greasy, served up the right amount of sweet, salt, and spice. The egg rolls were pretty good, 6 small ones in one serving. The decor is simple and kind of zen. White walls, white cushions, just a handful of tables in a white house on 45th st.. It was quiet and inviting. Good stuff Djan's! My heart still belongs to Jhanjay but I'll be back here for non-veg items and to try out their curries.", "Date": "2012-12-30", "Author_Location": "Seattle, WA"}, {"Author": "Kathleen H.", "ReviewID": "25MGiQdKXd-Lli07ETHCHg", "Overall": "5.0", "Content": "What a find! In this quaint white house is a simple but stylish little dining space. The dim lighting and subdued ambiance is countered by the wow factor of the rich flavors and spice!Tasty fresh spring rolls are a perfect start, or if you prefer fried they are not greasy at all. The papaya salad is absolutely delicious. Tom Yum soup- spice it up 1 to 5. Delicious curry and plenty of wok favorites span the menu. The service is good, the prices are very reasonable, and you may even have leftovers since the portions are ample in size. Four of us shared three apps, a soup, four entrees, a few beers and a bottle of wine for about $100.", "Date": "2007-07-23", "Author_Location": "Financial District, Manhattan, NY"}, {"Author": "Raina B.", "ReviewID": "7kVaJvhMqzLMZIsXXjy51w", "Overall": "2.0", "Content": "The previous reviews said check me out, but my experience says pass me by. We arrived for a late lunch around 12:30, and the place was completely empty - bad sign. The host tried to stick us in a corner (understandable if a ton of reservations would be arriving soon but none did) so I asked to sit by the window which he graciously allowed us to do. The service was fine, nothing shining or terrible, just average.I would have really liked this place if not for the water and food...The water tasted TERRIBLE! Lemons were soaking in the water pitchers - clearly to cover up some other taste that made the whole experience taste a sour metallic, it was gross. I tried to order green curry with steamed tofu - they only had fried. We tried to order spring rolls - they only had fried. Um, if you only have fried spring rolls they are obviously not fresh and I would never eat them *shudder*The crab rangoon appetizers were good, they are one of my favorite items to order and I thought Djan's were good. My entree however, was just ok. The chicken, replacing my much preferred tofu in this dish, was very very bland and almost dry and mealy. It tasted like cheap, super discounted, large batch chicken - which is why in this economy I have started ordering tofu, it just tastes better than the \"meat.\" Overall, underwhelmed and disappointed to report that this fusion restaurant seems like most: a good idea on paper but a disaster in practice.", "Date": "2010-05-23", "Author_Location": "Seattle, WA"}, {"Author": "Rachel P.", "ReviewID": "2qaMfZ5sVPYNDsQI2A7o8w", "Overall": "5.0", "Content": "I'm writing this review as I enjoy my leftovers from last night's delivery .... hence the 0 check-in's at this fine establishment.First off, what's better than Thai delivery?? Delicious Thai Delivery, that's what!!! The driver arrived 15 minutes before the estimated time on a Friday night! I will be ordering again and again. I pass this place on the bus nearly every day, but have not stopped in ... big mistake! I ordered the red curry - DELISH!!! Nothing out of the ordinary, but it hit the spot, more so than some of the other places in the area. I also ordered the Djan Fusion Noodles with beef ... WOW!!! So tasty!!! I ordered 3* for both dishes and it was on par ... just in the middle, next time I will definitely order 4* (I always try a new place with 3* just to make sure I'm not blowing the top of my head off with spices). I can't wait to try the Spicy Ocean among many others now that I know this place is legit! So all in all ... stoked to find a great Thai delivery place!!!", "Date": "2012-12-29", "Author_Location": "Seattle, WA"}, {"Author": "Inna B.", "ReviewID": "x_UJ23CutlkmWWNnMyy0qQ", "Overall": "5.0", "Content": "This is the place I usually go when I get dinner with one of my girl-friends. I think it's cause she loves their Japanese Seaweed Soup (and so do I)...In any case.... we have been here at least three times and always been the only ones there (with MAYBE one table and a few pick-up orders while we eat). Our favorite thing to do is to order a few different dishes (usually an appetizer, the soup, and an entree) and share them. So far we have liked or loved everything we've had.The staff is pretty hands off, but they have always been pleasant and good at refilling our water.Side note- There's another dining room (or two?) upstairs that looks great for private lunch/dinner parties.", "Date": "2009-01-29", "Author_Location": "Kirkland, WA"}, {"Author": "peter f.", "ReviewID": "g4Nmj8uqDN0b5GsNLlHMZw", "Overall": "5.0", "Content": "Food was great, staff friendly, interior cool and reasonable priceswhat more do you want?", "Date": "2006-11-13", "Author_Location": "Vancouver, WA"}, {"Author": "Kelly K.", "ReviewID": "MnbtTd5aS48RFWFkaFrdTA", "Overall": "5.0", "Content": "I love Thai food. I'm not into the overpowering flavor of fish sauce, however. Djan delivers excellent food, without that fish saucey after taste. The Fusion Noodle is a dream dish. At a lot of places I'm debating between vegetable based dishes (i.e. broccoli & oyster sauce) and Phad Thai, but with Fusion Noodle, I can have my vegies and my noodles too. YUM! I also really like their Spicey Ocean dish. I'm not sure how they do it, but all of the different seafood is done to  perfection and not overcooked to the point of rubber I've experienced elsewhere.  I also like the level of heat that is acquired in their food. 3 stars gives you fire and flavor, the way I like it. I don't want to kill my taste buds, I just like to wake them up.", "Date": "2007-04-11", "Author_Location": "Seattle, WA"}, {"Author": "Vivian N.", "ReviewID": "_9IUzKVreaodbwmwuduRRA", "Overall": "4.0", "Content": "When I livedin Wallingford, I would dine in or order from Djan's all the time. The food here is consistently delicious and well-prepared.I've tried quite a few entrees from their menu so it's hard to choose a favorite dish, but my top two choices include their house signature dish called Djan's Fusion Noodle. It's a combination of Phad Kee Mao and Phad Thai with the most divine blend of spicy and sweet from the respective two dishes. It's normally served with the skinny, Phad Thai noodles, but I would recommend ordering it with fat, wide noodles instead - more noodle and flavor for your buck!The Garlic Lover is also a great dish. This entree is a hearty mix of your choice of meat with perfectly stir-fried vegetables married in a delectable oyster, soy sauce gravy. If you order rice, I would suggest to dunk it in the leftover sauce of this dish. My boyfriend LOVES their curry chicken skewers from their appetizer menu and orders them about 90% of the time. Although I normally had their food delivered, when I did dine in, I thought their service was impeccable and the atmosphere simple, but welcoming. Djan's is a renovated house turned restaurant, so if you have a big party to bring, they'll most likely seat you in their private rooms upstairs.", "Date": "2007-11-11", "Author_Location": "Paris, France"}, {"Author": "Doug C.", "ReviewID": "J82dcCL7JyQEhoVF8jEwHw", "Overall": "4.0", "Content": "One of the most important things about moving to a new city or neighborhood is finding good frontline take-out service for the three most important delivery food groups: pizza, Chinese and Thai. Fortunately, for those who live in North Seattle, Djans qualifies as a good choice to occupy the first chair for Thai take-out. First of all, Djans is flexible with delivery and take-out service with free delivery for orders over $15. The delivery range is 2.5 miles, which due to the strategic location in Wallingford, covers most of North Seattle. Second, the food is consistent and at the upper range for the Thai food genre. I confess that I haven't tried the entire lineup of Djan's take-out, usually ordering the Pad Thai/Fusion Noodle/Chicken Cashew Nut/Spring Rolls, but I've never been disappointed. They also do a good job with the spices and I'm a little wimpier here: they range their spices from 1 to 5 (5 being the spiciest) and I typically pick the \"2\". Prices are reasonable with the entrees in the $9-10 range.As for the restaurant itself, I've never actually dined in here, but I've stood around and wandered long enough to pretty much get a good feel of the place. Djan's is a converted house and the dining area is one room on the side. It has a minimalist design with a simple white background that seems to work. They also have gone with the eternal-Christmas approach of decorating by winding small holiday lights along the outside of the building.The check-out area is at the foot of the stairs and you'll be standing in the front hallway while you're waiting for your carry-out. In these converted houses, I've always wondered a little bit about what they have in the upstairs rooms. Storage? Banquet rooms? Secret meeting halls? I'm not a pyromaniac, but I've been tempted to start a small fire in a garbage can to distract them so that I can run upstairs and find out. I suppose I could also ask, but where's the fun in that?", "Date": "2009-09-22", "Author_Location": "Seattle, WA"}, {"Author": "Joshua S.", "ReviewID": "jBfuuV3whYFN8dH50ZlzEA", "Overall": "3.0", "Content": "Service was friendly and brought things out at the right times and kept our water full but they didn't tell us about the specials for the night or ask if we wanted any dessert.The papaya salad was just ok, I don't think the spiciness added anything and would skip it in the future.We split the ocean plate which overall was very good.We got some mango stick rice to go which was excellent and made for the perfect dessert at home.The beer was a bit disappointing. If they only offered asian beers I could forgive that but they were offering 1-2 American options and didn't have any local (Seattle or Washington) options which just isn't cool.Decor was nice, but the place is a bit small. The night we were there a large birthday party showed up with a bunch of small screaming children which made our dinner much less enjoyable overall. We'll probably give it another shot and hope for less noisy dining partners.", "Date": "2010-07-21", "Author_Location": "Seattle, WA"}, {"Author": "Sarah O.", "ReviewID": "2wAEk3pfhgcuw3BbQrgyGQ", "Overall": "4.0", "Content": "I first heard about Djan's from members of my department at the UW who'd had it delivered for meetings. Word was it was yummy, reasonably priced and that the delivery service was very reliable. When I was dogsitting in Ballard I could think of no better a kind of restaurant than this to order a bunch of food from and split into a couple days meals. It turns out word of mouth was correct - tasty food ordered online and delivered prompt, hot and well packed.I can't say the Djan's Platter blew me away, but I liked having an array of nibbles without having to by a bunch of sides. The Rama had a solid quality peanut sauce and the ingredients were of a pleasing quality. The runaway hit was the Saute Eggplant. Most restaurants violate the good name of eggplant with the gooey, lumpy dishes they put out. Djan's eggplant was flavorful and had just the right texture. It was firm without being undercooked and tender without being soggy. Yum!If you're looking for good delivery I much recommend Djan's. It's a nice break from pizza and so easy to enjoy.", "Date": "2009-06-11", "Author_Location": "Seattle, WA"}, {"Author": "Kellan M.", "ReviewID": "QN13LqP4QXo6gOHISfdwbA", "Overall": "4.0", "Content": "I went here with 3 friends after reading the good reviews on Yelp.  We had no wait and were seated in a very nicely decorated dining room.  It was a bit small and we were seated a bit close to a couple on a 1st date.  But that wasn't a big deal.  We shared the appetizer platter.  Gioza, fried tofu, crab ragoon and egg rolls made up the platter, with a soy sauce and plum sauce to dip. Very good, but a bit small.  Each item had 3 pieces, could have used 4.I had the Pad See Ew.  Good portion size, 3 stars (out of 5), it was just right.My friends had different entrees and had 3 stars as well. The only problem was their 3 stars tasted like 4 or 4.5.  It was rather spicy and noticeable different than mine.Overall, a very good dinner choice for thai food.  If you are weak at heart......get 1 or 2 stars.  If you like it spicy, do 3 or 4.", "Date": "2008-02-07", "Author_Location": "Los Angeles, CA"}, {"Author": "Charles S.", "ReviewID": "YHzrOFa3F_R1cmxlM5qDYg", "Overall": "4.0", "Content": "Thai cuisine offerings are such that even the mediocre tend to be acceptable. The recipes rely on combining, contrasting, and complementing taste components, particularly spices.  Widely regarded as a Thai food veteran among my colleagues, I traveled to the ostentatious land known as Wallingford to fortify my familiarity with the rarified upper reaches of the art. I actually have no idea what I just said, so I'll move onto my review.Djan (translates to \"moon\" in Thai, I believe) is a comfortable place, made cozy by such touches as swags atop the windows. The restaurant actually resides in what used to be a house. You'll find bedrooms turned into dining areas, and a bathtub in the restroom. For starters we had Chicken Satay, a signature Thai chicken skewer dish served with a peanut sauce.  For the main course, we had Duck Curry and Drunken Noodles.  Both were fatty, but oh so delicious.  The Duck Curry's rich coconut flavor won our hearts.  The Drunken Noodles were flavorful combination of salt and sweet (but a bit too sweet for my tastes, though). The portion size was generous, and promised leftovers for my lunch the next day.", "Date": "2010-05-07", "Author_Location": "Bellevue, WA"}, {"Author": "Jeff K.", "ReviewID": "9lts2nLLQmNqrz17UAeUrA", "Overall": "4.0", "Content": "Haven't been there in person or for takeout so can't speak to that at all,  but really great for Thai delivery.Service time is slow (very long delivery times, 45-60 min), and the online ordering is a little flaky, but (1) they actually have online ordering :), and (2) the food is all super tasty.One note -- watch out for the spice levels -- even if you ask for stuff \"mild\", it's still got a fair amount of heat.  We've run into that with our 3 year old, who loves Thai in general but some of their stuff is a bit too spicy for her even on mild.", "Date": "2008-08-15", "Author_Location": "Seattle, WA"}, {"Author": "Anne N.", "ReviewID": "eV5RR3zpJkWLf6TXzQzpaQ", "Overall": "3.0", "Content": "I had my doubts about this place. But they deliver and you can order online (and it's super easy). My only rant about the delivery is that it took 1.5 hrs instead of the 1 hr as estimated online. We had the chicken satay for our appetizer. Decent. Nothing worth noting. Prik King with tofu was decent but I wish the green beans were fresher (it didn't have the crispiness that I was looking for). The swimming rama was mediocre. The \"Joy Duck Club\" -- which was a roasted duck curry -- was probably my favorite dish of the night. Tender slices of duck, pineapple, bamboo shoots...how can you go wrong? Portions are large enough to share and prices are about $9-15 per entree.", "Date": "2012-01-31", "Author_Location": "Seattle, WA"}, {"Author": "Angela S.", "ReviewID": "_M7gak_wacke_QpNbcB3rQ", "Overall": "2.0", "Content": "I've changed my mind. I will likely not be ordering from Djan's again.My boyfriend and I got Djan's delivery tonight. Not only was it 20 minutes late (taking an hour and twenty minutes from the time we ordered, when the estimate was 45 minutes to an hour), but they did not fully follow the instructions we wrote regarding peanuts.My boyfriend is allergic to peanuts. I put notes on both the appetizer (veggie curry puffs, which I knew from past experience would have ground peanuts sprinkled on top of the sauce) and the noodles (samurai pad thai; the menu does not specify if they have peanuts or not, but I had a hunch) to hold the peanuts because he's allergic. The appetizer arrived peanut-free, so I know they got that note. The noodles, however, had ground peanuts sprinkled over one corner of them. Even after removing that section of noodles, with no visible peanuts remaining, he still had an allergic reaction, to the point that it's clear that they either cooked the noodles in peanut oil or had mixed the ground peanuts in very thoroughly.Thanks a lot, Djan's. We appreciate your attention to detail. Like peanut allergies, for example.", "Date": "2011-11-26", "Author_Location": "Seattle, WA"}, {"Author": "Priscilla R.", "ReviewID": "WL7gy6OMoc8ZxjYFKt9NAw", "Overall": "4.0", "Content": "I live within walking distance to about 5 Thai places, yet I still drive out to Wallingford for Djan's. It's just that good.Djan's is WAY better than it looks from the outside. Its decor is clean, simple, and cute. They have a great wait staff who are very attentive and kind, and the food is incredible. I've had the Pad Kee Mao and Yellow Curry, and they are perfect (especially good if you can get someone to share with you, and try both). What surprised me the most was that this is just as cheap as every other Thai place! Don't judge this place by the exterior - it is worth a try!", "Date": "2008-05-21", "Author_Location": "Seattle, WA"}, {"Author": "Ben D.", "ReviewID": "Bxw2d_j9i4JaBcola8r2Gw", "Overall": "5.0", "Content": "Djan's is my favorite Thai spot in Seattle, even though I don't know how to pronounce it's name. I love it largely because when I ask for spicy, I actually get spicy. They offer all of the standards -- Pad Thai, Rama, fried rice, etc, with a few of their own unique twists that are worth looking out for. Djan's is a great place for take out, although it can be hard to find a place to leave your car while you run in to grab your food, so consider tag-teaming it with a friend hovering outside in the car.. Dining in, it kind of feels like your friend cleared out their living room and loaded up on Ikea furniture to host a bunch of people. I say that as a good thing.Friendly, if a bit slow, service and all the food you expect at a good Thai place. Tell them you want it spicy and they will do it for you.", "Date": "2010-09-02", "Author_Location": "Seattle, WA"}, {"Author": "Rebecca E.", "ReviewID": "4tp_2mA1-fRbKicvhG3nkg", "Overall": "5.0", "Content": "Oh my god this place was good. Went last weekend for a friends birthday and we rented out one of the rooms upstairs. Even with only one waitress for 17 people, service was timely and nice. The food was amazing but beware of their star system. I ordered a 2 star item and it was more like 3.5 The waitress was so awesome to even split up our checks!!!", "Date": "2010-03-24", "Author_Location": "Seattle, WA"}, {"Author": "Jeff K.", "ReviewID": "vLRlFTZfQvfux1lRcjgGPQ", "Overall": "4.0", "Content": "\"Joel Anthony,\" - Charles Barkley\"That's Jo-el,\" - Ernie Johnson \"Whatever,\" - ChuckI can't even pronounce the name, but I didn't need maalox, pepto or tums afterwards. Maybe some prevacid. I had a wonderful dinner date here tonight, mainly cause the food was good and almost inconspicuous. Definitely a cut above other Thai restaurants with it's decor, design and ambiance, and I didn't feel like I had to question if the employees washed their hands. It's not the best Thai food I've had, but pretty good. Just a tad too spicy for my ruined stomach. Now, usually when I eat Thai food, I do like it about 3 stars and expect to sweat. Well, that doesn't work when you're out on a date. Yeah, sweating is no good. Thus I played it safe and got white-boy level 2-star. We got the Djan Fusion noodle dish and panang curry. She got 3-star, trying to kill me. The service was great.", "Date": "2010-04-05", "Author_Location": "Seattle, WA"}, {"Author": "Ryan D.", "ReviewID": "q3ggEej_gZ2dY1vYO8VDYA", "Overall": "3.0", "Content": "Stopped in for lunch one day and a decent Thai place.  Now for those of you who live in Wallingford you know that every Thai person in the neighborhood owns their own restaurant.  So it is in the context of competition that I give three stars...it competes on par with the majority of the other 17 places on 45th without standing out.Lunch specials are about a dollar more than the other places but are plentiful.  The Pad Thai is not as overly sweet as some other places as well.The atmosphere is nice, in a quaint house with a nice decor.  I am planning to go back for dinner with a Groupon so will update after that experience.", "Date": "2010-05-23", "Author_Location": "Seattle, WA"}, {"Author": "Honey R.", "ReviewID": "d3QyAvhl0pzPumjMrXk0LA", "Overall": "5.0", "Content": "Very diggable!A great place to go if you want NICE and also CHEAP and also TASTY.The food is high-quality, fresh, the dishes have exciting flavors.The ambiance is great, minus the seats without backs. If you're with more than one person, someone's gotta bite the bullet.I like the Fusion Noodle dish.Best thing on the menu: Spicy Basil.Sweet service, you can eat for under $10/person or splurge a little - you'll get a great meal either way.They do lots of take-out, but it's also a nice place for a date.Parking lot behind the building. Absolutely recommended!", "Date": "2011-03-11", "Author_Location": "Seattle, WA"}, {"Author": "Kristina D.", "ReviewID": "D2b_dsH8MSvPTBDJHIL2YQ", "Overall": "4.0", "Content": "This place is good.  The food is good and the atmosphere is super cute.  It's very comfy and ambient (being in a house with light and white tables and chairs) and good for groups or cozy nights for two.  A great place to frequent if you're looking for reliability.", "Date": "2008-04-24", "Author_Location": "Seattle, WA"}, {"Author": "JOHN T.", "ReviewID": "AWsXZKMUo8EsX1KQOXhz4A", "Overall": "4.0", "Content": "Two thumbs up!Neat idea to turn the house into a dining place. Food is great. Fusion Thai is what Djan's are promoting the food as.We had the spring roll appetizer which came to as elegant. We then ordered the fried rice with chicken. That was delightful as the rice was quite flavorful. The chicken quarter (on top of the rice)  tasted as though it was brazed with coconut milk. Mmm good. The other item ordered was the cashew chicken dish. Again very good. The portions are generous. The prices were reasonable.  We left very satisfied and would definitely come back again.", "Date": "2009-09-26", "Author_Location": "Seattle, WA"}, {"Author": "Christopher M.", "ReviewID": "0gpZ8qr8K8PhOP_Z7mP83A", "Overall": "5.0", "Content": "Great Thai food! Even my Thai friends agree. Service can be a bit slow, even when the place is empty. But still a nice place to Dine.", "Date": "2013-09-13", "Author_Location": "Mercer Island, WA"}, {"Author": "Matthew C.", "ReviewID": "5umt2vI26W5GnorALIQQbg", "Overall": "3.0", "Content": "Reasonably well executed.Too Americanized for y tastes.  Lots of white mushrooms in everything.Peanut butter? in the panang curry.Nice little place in an old house.", "Date": "2007-08-28", "Author_Location": "Irvine, CA"}, {"Author": "Adriana K.", "ReviewID": "gwThRK2eCctUyegQbk5dtg", "Overall": "3.0", "Content": "I always thought this place was a catering only place - as it was in a somewhat awkward location, and the huge sign on the yard  looks so industrial and the tables never seem to be set up outside.One adventurous night, we decided to try it.  It wasn't too crowded but the table next to us was quite loud - which was awkward in such a small place - a converted house.I have recently decided that I would start eating darker meats again, so why not start with duck? I forgot how duck tastes. Therefore, I did not especially enjoy the fatty duck with bones. But the sauce was good, and I enjoyed the spring roll appetizers, and the wine.Nothing phenominal, but it was refreshing to have a clean modern atmoshpere that wasn't typical for Asian food.", "Date": "2009-09-22", "Author_Location": "Seattle, WA"}, {"Author": "Becky R.", "ReviewID": "M3u-BKQ7-Q9Z80jDIedrEg", "Overall": "4.0", "Content": "The food was fresh and good, but I am so not about sauce all over something rather it should be on the side (appetizer, Fresh Spring rolls). I expected the ones in see-through vermicelli (rice wrap?) and stuffed with veggies like carrots and sprouts, but these were so not my thing. I'm sure most people who like tofu would like them, but getting the unexpected with a soy sensitivity isn't my thing.What else....oh...the Phad Kee Mao...Yummy! Decent portion size and average price. I think they could have lightened up on the tomato and given me more noodles and chicken, but it tasted just fine.I liked the small soft and warm ambiance with the restroom upstairs, that was nice. The speed and quality of service was absolutely perfect, staff was very friendly and tried to remedy my distaste for the appetizer I unfamiliarly ordered. That is always a big plus in my book.They have a bit of hard to get out of parking in the back, but its free! They are convenient and well, just a great place to go. I will go there again and try new things. I'd recommend it to those who aren't as picky and preferential to the familiar as me, cuz they got the goods.", "Date": "2008-06-07", "Author_Location": "Seattle, WA"}, {"Author": "Leo L.", "ReviewID": "t3x9CRvi5f1yTxJi4wbYmg", "Overall": "5.0", "Content": "Update after the initial review.  It is still fantastic!  I brought my dream lady there, she just flew back from modeling in Milan for almost a year and craved Phad Thai and Thai ice tea.  I can't tell you how much that satisfied smile meant to me.Thanks guys!", "Date": "2008-12-13", "Author_Location": "Seattle, WA"}, {"Author": "Annie S.", "ReviewID": "xarmKUk6gZsXiN3CTw9QLg", "Overall": "4.0", "Content": "I don't know why it took me so long to discover this place, probably because there are so many good Thai restaurants in Fremont?  Well I was home and feeling lazy, wanting some good delivery that isn't Chinese.  I convinced the hubby to order some Thai, and Djan's definitely delivered (thank you Yelpers for pointing this out!).  It only took a 1/2 hour to arrive, steaming hot and delicious!  Such an improvement from Lotus Thai, my last Thai delivery disaster!  Garlic Beef and Phad See Ew was amazing.  I'll have to go inside Djan's next time, but at least now i have a reliable option for delivery, that even the hubby enjoyed!", "Date": "2008-01-31", "Author_Location": "Seattle, WA"}, {"Author": "Jodi I.", "ReviewID": "Fs4Q609YvH96zCeeLJlmEQ", "Overall": "5.0", "Content": "I can't find any thai food in seattle better than Djan's.  The dishes are very tasty, and vegetables are never overcooked.  I am a big fan of the pad kee mao and all of the curry dishes (especially green)!  Service is generally very fast and attentive unless you are caught in the middle of an unexpected rush.", "Date": "2009-08-23", "Author_Location": "Seattle, WA"}, {"Author": "Kendrick R.", "ReviewID": "9oorBNBelg5clEn8iCtUpg", "Overall": "5.0", "Content": "Great food - checkGreat atmosphere - checkGreat service - check", "Date": "2010-05-11", "Author_Location": "Seattle, WA"}, {"Author": "Jennifer R.", "ReviewID": "x-HIqtY3VtXAs_YZtX9cWQ", "Overall": "4.0", "Content": "Thank you Yelpers for yelpin' about this place.  I was in search of some good Thai delivery and decided to go with this one.  Placed the order at 6:45pm and received it by 7:10pm.  Not bad considering they said it'd take 45 minutes.  We ordered 5 things - Beef Salad, Phad Thai, Saute Eggplant, Red Curry and Thai Fried Rice.  All were 4 stars except one, which was a 3star.  Let me tell ya, they really do make it spicy!  Hahaha, the morning after was quite painful.Flavor was excellent in all dishes.  Portions were large - we have plenty of left overs.  Great thing about it was that they didn't skimp (is that a word?) on the meats and fresh veggies in all the dishes.  The Beef Salad had way too much beef so we added more lettuce.  Don't know what it's like dining at the restaurant but I know that I'll be putting their number in my cell phone for future delivery orders - yup, phone # now programmed in my phone.Can't wait to try their other dishes.", "Date": "2008-03-14", "Author_Location": "Seattle, WA"}, {"Author": "erica r.", "ReviewID": "VXeuLou9UVACJHjuClorIQ", "Overall": "3.0", "Content": "The food is good at this place, but it is definitely pricier than most Thai places in Seattle. It's an elegant place, but I usually order for takeout (one of the few Thai places I can find that will deliver to my house).They have been good about accomodating vegan requests, which is important to me.  We just don't order from them very often because of the prices. I can overlook that more if we dine-in, but for takeout it's hard to justify.", "Date": "2010-02-07", "Author_Location": "Seattle, WA"}, {"Author": "Herman C.", "ReviewID": "p0revHiptgLyEaY6aPv0uA", "Overall": "5.0", "Content": "High quality Thai food at very reasonable prices (i.e. a good deal).\rThe food seems to be lighter and fresher (use of high quality ingredients). While it is a Thai restaurant, it has a pan Asian flair to it (use of other Asian cooking styles).\rThe interior has a modern feel to it: Asian nouveau meets Ikea.\rSome of my favorite dishes are Cashew Nut Chicken (with pineapple) and the Japanese Seaweed Soup.\rGo there and try it out for yourself.\rOne small negative is that they charge for rice.", "Date": "2006-09-24", "Author_Location": "Seattle, WA"}, {"Author": "Kiwi B.", "ReviewID": "RlFiCxt5oI5c6WrpVyBLcw", "Overall": "3.0", "Content": "That's a high 3 stars BTWI went for the first time today for lunch so more stars may come as I eat there more.With all the Thai in Wallingford I've been scared to try any and finally gave this one a shot. I had the green curry- yum and dad had the Tues lunch combo with cashew nut and seemed to really enjoy it. The resto wasn't super busy and service was attentive. I'm glad I found a place close by that I like!", "Date": "2009-03-31", "Author_Location": "Seattle, WA"}, {"Author": "Amanda M.", "ReviewID": "v0_THXTa_dBeZeAX90Qnhw", "Overall": "5.0", "Content": "Such a cute and peaceful atmosphere. The private dining upstairs is intriguing for a birthday dinner or other celebrations. We had Fresh Spring Rolls, Cashew Nut with Tofu and the Djan's Fusion noodles, brown rice and a side of peanut sauce. I thought everything was perfect in flavor balancing and texture. They don't kid around with the spice. I am a big fan of the heat but would not order more than 3 or 4 stars next time. Great flavor in all the dishes we experience this evening. We will definitely return.**EDIT** I upgraded this tasty place to 5 stars after seeing that SeaThai across the street had 4 stars. That place is disgusting and dirty.", "Date": "2009-07-05", "Author_Location": "Seattle, WA"}, {"Author": "Erika T.", "ReviewID": "65H9qlmnrb90CvuCEvfC0g", "Overall": "5.0", "Content": "OMG I can't believe I haven't reviewed this place! This is our favorite restaurant in Seattle. We used to bring all our visitors here. I miss it so!Price: Very reasonable.Service: Fast, efficient and helpful.Location: Conveniently located near the freeway, but far enough away you don't notice the noise. Plus the house is adorable and transports me to Thailand. We'll maybe that's going a bit far, but it is quiet, romantic, and adorable. Plus they have an upstairs section which I believe is usually used for large groups.Food: Perfectly balanced spices and flavor. We love the Samurai Pad Thai dish and all of their curries. Just thinking about this is making my mouth water. Try it, I doubt you will be disappointed. All of our friends loved it!", "Date": "2011-03-22", "Author_Location": "San Francisco, CA"}, {"Author": "doug p.", "ReviewID": "K0fmNP651-b6EdI3UO8XKQ", "Overall": "5.0", "Content": "Perhaps the best Thai food in Seattle, and we have tried almost all of them in the 10 years we have lived here. The people who run the place are really friendly to boot. We have had their food perhaps 10-12 times  and it is consistently excellent.Their Pud Kee Mao is some of the best I've had, and their fusion noodles are very good as well. Unfortunately we have never been into the restaurant, we have only ordered delivery. They deliver. I'll say it again. They deliver. Finally a really excellent restaurant that delivers in Seattle, that isn't pizza. Our little city is all growed up.", "Date": "2007-09-15", "Author_Location": "Seattle, WA"}, {"Author": "Cameron J.", "ReviewID": "J5qj8TSz5yHfaWzcuXQ_Bw", "Overall": "2.0", "Content": "This place is okay, but not great. My wife and I had lunch here -- she ordered the pad thai and I ordered the green curry. The pad thai had way too much sauce and was very sweet tasting -- overall not something we'd order again. The green curry was good, but I was a bit bothered that we were charged an additional $1.50 for rice to go with our $10 curry. I'm sorry, but curries should include rice. Nothing on the menu indicated that rice was not included, the waitress asked what kind of rice I wanted -- not _if_ I wanted rice. Curry without rice is like a sandwich without bread. Overall, I found the food to be okay but overpriced. Service was okay, but nothing special. I doubt we will return.On reviewing their website, it appears we were given the dinner menu and charged dinner prices even though we were there for lunch (at noon).", "Date": "2010-01-02", "Author_Location": "Seattle, WA"}, {"Author": "Joe W.", "ReviewID": "vBWXjoaM2GOW8cZB7B5WDw", "Overall": "5.0", "Content": "This is a converted house with linen napkins, pleasant decor, tea light candles, and a reasonable amount of off street parking for the neighborhood. I asked for recommendations and was thrilled by the Saute Eggplant with chicken. The mango rice was an excellent dessert. The wine list was a good balance of depth, tastiness, and cost. Quite an exceptional experience at the same price as those cheesy strip-mall, noisy, plastic table cloth Thai joints. Great value. Great meal.", "Date": "2010-05-25", "Author_Location": "Seattle, WA"}, {"Author": "Amy B.", "ReviewID": "5n-fPg0nXUCsebHQ90-NfA", "Overall": "2.0", "Content": "Either I cook really good Thai food or they cook really bad Americanized Thai food.I'd prefer the ladder but I doubt thats true.It was good food, but I can make it at home and when I go out I get food that I generally hope has more flavor or is better than my cooking.", "Date": "2012-03-15", "Author_Location": "Kirkland, WA"}, {"Author": "Michelle F.", "ReviewID": "qCf_LNGx4xGcQTPcgh750g", "Overall": "5.0", "Content": "I hadn't been to Djan's Thai Restaurant in over five years. I used to live across the street from it, and wasn't terribly impressed with the food. However, they must have changed it up since I was there last. I left full, happy, and with my taste buds doing  a happy dance. Everything was delicious. Additionally, the service was fast and courteous, and the lemon in the water was well appreciated.We started with two appetizers: Fresh Rolls and Beef salad.The Fresh Rolls were served warm and were simple, with fried tofu and fresh cabbage in the middle and a lightly sweet teriyaki-type sauce drizzled over the top. They were good, but a little heavy for what I had expected.The Beef Salad was up next on the menu, and was quite perfectly spiced and cooked. The meat was cooked thoroughly, but was tender and light, and the fish sauce vinaigrette it was tossed in was very nice. It gave it a crisp citrus bite, with a little bit of kick. This dish was both refreshing and filling. If given the opportunity (luckily I wasn't), I could have eaten several plates of this.For our main courses, we had brown rice (cooked better than any brown rice I have had previously), Scallops al Dente, and Panang Curry chicken.  Both dishes were fabulous, though the scallops, having a much more delicate flavor, really needed to be eaten first. If (as my sweetie did) you start right in on the curry, it makes it difficult to distinguish the flavors of the scallop dish.The scallops were in a ginger-soy dressing, and had celery, green onion, peas, carrot, onion, slivers of ginger, and scallop. All were cooked to perfection - nothing in this dish was even a second overcooked or undercooked. I was very pleased to see that they didn't skimp on the scallops, either. Too often, when ordering scallops, I find I have overpaid horribly for the amount of seafood that was actually plated. With Djan's, I was terribly impressed. I imagined that the scallops I make at home for myself had just shaken their (metaphorical) fists at me. These were prepared better.The Panang Curry was a great thickness, and consistently creamy. The flavors were all there, though I would have liked it a little bit spicier. Our \"four star\" request equated to about two stars on the palate. However, given that the flavors were so well put together, I am somewhat glad it wasn't hotter. It really helped me to appreciate the flavors that were going on. The ingredients were all very fresh, and the chicken was nice and tender.Everything was very well put together, flavor and texture-wise. The service was spot on, as was the atmosphere. The prices were average to a touch high for the specials, such as the scallops ($15.50), but well worth the price. I would go back here in a heartbeat, and highly suggest you try it as well.", "Date": "2010-06-21", "Author_Location": "Seattle, WA"}, {"Author": "Drew D.", "ReviewID": "VQucoVXvKCGbbIQF5Ra64g", "Overall": "3.0", "Content": "Went for happy hour - our server seemed very confused and didn't seem to be well trained. They had only a few wine selections and when we chose the chardonnay he wasn't sure what we were asking for (and there was only one). Strange.The food was mediocre - there are much better Thai spots near Fremont that we have found to be higher quality.", "Date": "2011-05-31", "Author_Location": "Seattle, WA"}, {"Author": "heather j.", "ReviewID": "gOlWaEeShi9DQGKBXwP7sA", "Overall": "5.0", "Content": "Back when I used to live in the neighborhood I would order Djan's delivery all the time. Now that I live in the south end, I only dine in, and I am always surprised at how empty the place is! Maybe everyone just orders it to go....The food is incredible. There are so, so, so many places where you can get similar food, but this is elevated Thai/Pan Asian food and one of my absolute favorites in the city. You can't really go wrong here, but the other day while here for lunch I ordered the cashew chicken, and it was perfection. The chicken had SO much flavor, and there were cashews a plenty. The next day me and the BF split the leftovers that had been sitting cold, in my car for a quick snack and he remarked \"Wow! The chicken is awesome! If it's that good cold, I can only imagine how good it is hot!\" And he thinks chicken is the lamest of the meats. Strong praise for Djan's!", "Date": "2011-02-16", "Author_Location": "Seattle, WA"}, {"Author": "Victoria C.", "ReviewID": "8Bo26ZgKjG-6S6i40Tf-Lg", "Overall": "4.0", "Content": "I reserved the Full Moon private party room for a surprise party for my boyfriend's 25th birthday. I am so glad I did because the food, service, ambiance, etc. were excellent!PROS:1. Amazing service. I booked the room a few weeks in advance, just in case. I talked on the phone with the staff several times to readjust the headcount, and give them instructions on how to help me meet the party guests' needs, and they were super accommodating. They put up a Happy Birthday banner on the wall for us, let me bring in other decorations, noisemakers, confetti, etc, let me bring in a couple cakes and stored them until they were brought out, etc. Moreover, throughout the dinner, they were constantly refilling our waters, got the orders of all 23 people correct, served in lightning speed. Amazing!2. Great food. Up to par with some of the best Thai places in Seattle. And when you ask for a spiciness level of 4 stars, you actually GET four stars.3. Very quaint. Looks like a house on the outside, and super cozy and home-y on the inside.CONS:1. They didn't really want to split the bill, so we all paid cash. Thankfully, they warned me in advance and I told all the guests to bring cash. It all worked out!2. There is a minimal fee ($35) for reserving the party room. Not a huge deal.", "Date": "2010-10-30", "Author_Location": "Seattle, WA"}, {"Author": "Yumiko K.", "ReviewID": "s_kte5WzqAOL59BresprUg", "Overall": "4.0", "Content": "Djan's Dining is a very lovely, romantic, and clean Thai restaurant. I love the chic interior (very bistro-looking) with paper placemats, beautiful flatware (not the cheap-looking easily bendable kind), and fancy cloth napkins. I also appreciate the fact they did not place the menu on the plate!My boyfriend and I shared Pad Khee Mao (5 stars with tofu) and Saute Eggplant (5 stars with tofu) with 1 order or brown rice. Although our server thought we were crazy to order 5 stars, the food was actually just spicy enough. I LOVED the eggplant dish and how chunky the tofu was. The brown rice was a bit underdone, but everything was fantastic.Our server was very friendly and attentive. I now have another favourite Thai restaurant!", "Date": "2011-04-24", "Author_Location": "Seattle, WA"}, {"Author": "grace y.", "ReviewID": "UAjHnZKj0TM16EgAPFJ_fQ", "Overall": "3.0", "Content": "Cute ambiance and great service, but the food was mediocre.What my boo and I shared:-Fried veggie egg rolls: Decent and crispy.-Fusion noodles: Definitely the best thing we had. The noodles were a delicious chewy consistency and the sauce was tasty and spicy. The waitress also asks you if you want 1 - 5 in spicyness level. (mind you, this is thai spicy, which means even though I'm a spice-junkie went with level 3 which ended up being perfect)-Joy duck club: Ducky curry. Okay this was pretty much killed it for me. The duck was not high quality. if I'm going to pay a premium to get duck in my curry then I expect it to be tasty. The curry sauce was good but the duck was just meh.This place had a lot of potential but unfortunately with so many competitors, it's going to be a hard sell to get me to come back here.", "Date": "2011-10-13", "Author_Location": "Cupertino, CA"}, {"Author": "Angela N.", "ReviewID": "MP9u6kOhfyDeBpegEaVaDw", "Overall": "3.0", "Content": "The pad see ew left me rather disappointed -- it had an unfamiliar smokey flavor to it, and the beef tasted so strange and \"gamey\" that typically carnivorous me opted to pick out the veggies and eat those instead of the beef + noodles. Recently the bf's been on a fortunate streak of picking out dishes I like better than my own -- in this case, he went for the special crispy trout fish which had a very good tangy/spicy/sweet sauce and was served on a bed of lettuce. Though you do have to pay extra for rice (*disapproving frown*) the jasmine rice was perfectly cooked which is (sadly) always a pleasant surprise when I go out.Unless you're really, REALLY craving chocolate and cheesecake, I'd advise against getting the toffee mousse and the lychee cheesecake. The mousse had the shape and texture of a slice of dense cheesecake, and neither of us could taste the Kahlua. Way too chocolatey. The NY cheesecake had the quality of a frozen grocery store brand, and the lychee component was little more than pureed lychees spooned over the cake, so the combination was a little jarring. The desserts were much too overpriced for what we received.The service was great though, and the cozy ambiance of the artfully decorated interior is enough to entice me back.", "Date": "2010-01-10", "Author_Location": "San Francisco, CA"}, {"Author": "Roxanne B.", "ReviewID": "JEZjfkzByFIyJCDT5rU2Eg", "Overall": "3.0", "Content": "For some reason, this place didn't appeal to me too much. I've no complaints about the food, but I've no compliments either. The house that it's in kind of creeps me out; I realize some people like that, but as I sat there eating, I couldn't help but imagine people living in that, well, living room.For the prices, it didn't make enough of an impact. I've found Thai just as good closer to home, and cheaper, but this is a nice enough sit-down Thai place.", "Date": "2008-08-09", "Author_Location": "Seattle, WA"}, {"Author": "Rachel G.", "ReviewID": "Gxhe4wJtdZrwsX6xeoUWhA", "Overall": "5.0", "Content": "My roommate and I order from Djan's at least once a week (through Eat24) and we love almost everything we've tried, especially the crab rangoons and fusion noodles. Super delicious. We really like that their spice levels are consistent and the 4 and 5 levels are HOT. More hot than a lot of other Thai places.Also: NO styrofoam delivery containers. Very important to me.", "Date": "2012-04-19", "Author_Location": "Portland, OR"}, {"Author": "Libby L.", "ReviewID": "WkmmBJj-xkrMQYgJqvGjag", "Overall": "4.0", "Content": "Djan's takeout: 5 starsDjan's Dining: 4 starsThe food is really delicious. My Panang Curry was perfection: thoroughly cooked but not rubbery veggies, tasty curry, and the chicken was tender (though pretty mild for a level 3 spiciness) and the Fusion Noodles are to die for. The curry puff appetizers are good as well and the sauce for them was delicious and flavorful. My favorite is the Tom Kha soup. Salty and sweet, with a thick broth and fresh ingredients. Yum!However, nearly an hour passed between ordering and getting our food, where we observed people who had come in after us get their food. Maybe a mix up in the kitchen? Their delivery is always prompt so I was disappointed to get slow service while dining in.", "Date": "2010-05-17", "Author_Location": "Oakland, CA"}, {"Author": "Richard L.", "ReviewID": "cYYw3MRhH5hSgnK9E_jqzg", "Overall": "5.0", "Content": "This was the best Thai I have had in the Seattle area. We ordered the Gyoza appetizer, Cashew Nut with chicken, and the Joy Duck Club. Ordered brown rice and jasmine tea. Everything was excellent. The portions were large and neither one of us could finish them so we have another great meal tomorrow!The service was excellent. Polite, helpful, and the timing of bringing out the dishes was perfect.I admit, we went there on a GroupOn coupon so we were saving about $18. But I did not find the prices high at all. I will definitely be going back even without a coupon.I wish there was more outside seating but it's a small house on a small property. And eating indoors gave us a chance to see the decor which is very nice.All in all an excellent night out experience.", "Date": "2010-08-04", "Author_Location": "Folsom, CA"}, {"Author": "Nick B.", "ReviewID": "WAzqT7AuajPG2dSuLpiGxA", "Overall": "5.0", "Content": "This thai food is as good as it gets, no doubt.  Just watch out, the spiciness is the real deal!  I recommend starting out with a 2.  If you go with a 4 as I did the first time, you will be screeching like a 13 year old girl at a Jonas Brothers Concert.  I'm pretty sure a 5 would cause you to incinerate your tongue.I recommend any of the pad thai dishes, particularly the Pad Khee Mao.  The crab rangoon are excellent appetizers as well!  Also, the curry is great!  Service has always been outstanding (I have eaten in once, but mostly do take-out).  Everybody is friendly, the place is pristine, and the food is outstanding, no place more deserving for a 5 star review!", "Date": "2009-07-25", "Author_Location": "Seattle, WA"}, {"Author": "Cameron C.", "ReviewID": "fEy4G35-cGt_A3GjpGoTRA", "Overall": "4.0", "Content": "I never thought Thai food would evolve into one of my comfort foods but Djan's has filled a void I never knew existed.  Chances are if you order takeout, you will squeeze 2-3 meals out of a single entree.  They don't skimp on the to-go orders and this single girl appreciates that!   I'm borderline pescatarian but stick with their tofu dishes.   Their pad thai, panang curry, and pineapple fried rice are fantastic.  3 stars (on a scale of 1-5) could make you break a sweat...and I like that.  Crab rangoon ain't too shabby either but let's face it, anything fried with cream cheese stuffing is going to be tasty.Dining in at Djan's is decent but the atmosphere isn't much to get excited about.  People just come in for quiet conversation and good food.  The house is cute but definitely has wear and tear.  It doesn't take much effort to notice all the walls are scuffed. I'd hoped to rent the room upstairs for a birthday party in May of 2009 but they wanted to charge a pretty steep price for it on top of the food.  That was a dissapointment.  Plan to park on the streets around the restaurant.  They have one or two spots in the  back but you can't tell if there's room until after you pull off 45th and drive up the teeny driveway.  It's just not worth even checking.", "Date": "2010-05-11", "Author_Location": "Seattle, WA"}, {"Author": "Crooked T.", "ReviewID": "u5NCJwdGiQ1miZlDMRFKVQ", "Overall": "4.0", "Content": "Dining in at Djan''s is good stuff.  It's homey, inexpensive, and the food is fresh and tasty.  The red curry chicken as well the pad thai fusion I ordered both hit the spot.  I didn't eat all of both because I was sharing with my special honey, but damn if I didn't want to!  On the downside, the lemon water tastes a little funny, the Thai iced teas are a bit too sugary, but these gripes are merely nit-picking.  I enjoyed myself and so did the little woman.  Keep up the good work Djan's.  I'll be seeing you again...", "Date": "2007-10-01", "Author_Location": "Seattle, WA"}, {"Author": "Cs W.", "ReviewID": "4hVgYnzPgB-0sdhOe_OUYA", "Overall": "4.0", "Content": "After trying all of the Thai delivery places in the Wallingford area (all three of them) this place takes the cake. Sure, not everything on the menu is 5 star quality, but for everything that is so so, there is something fantastic on the menu.  Also, this isn't one of those \"greasy Thai\" places. You know, the ones equivalent to getting Chinese food from the Safeway deli. The food here is fresh, spicy and usually very good. Definitely Order:  I love all of their curries. Every one. The Cashew Chicken is great, as it the Pik Khing. The Papaya Salad is A-MAZING if you get it 3 or 4 stars. I think it would be boring any less spicy.Pass: Chicken Rama, Pad Thai, any of the fried rice. I have never dined in the restaurant (it is always take out and delivery for me) but it is a cute space and usually fairly empty. Don't be scared. I would guess that 70% of their business is delivery or take out. You can even order online (perfect for my phone order averse hubby).", "Date": "2010-05-26", "Author_Location": "Seattle, WA"}, {"Author": "Sandra R.", "ReviewID": "cX58ZqmYao7ksXdyVDP1eA", "Overall": "4.0", "Content": "Delivery was quick! Overall tasty food, but I won't order the salad again.Tom Kha Soup with Chicken is delicious, I ordered a 4 star and it was perfectly spicy. The chicken was tender, and the broth was yummy.The Papaya Salad was not what I was expecting. The papaya was white papaya (a clear white) and shaved like long sliced carrots or noodles. I was expecting something different. I'll steer clear of Papaya Salad unless it's Green Papaya, and from the Tamarind Tree in the ID.", "Date": "2010-08-21", "Author_Location": "Seattle, WA"}, {"Author": "Angela S.", "ReviewID": "KsQm1aoVXnqJ9ccFYFHUVQ", "Overall": "4.0", "Content": "I visited Djan's last evening on a whim--it's been a long time since I've ordered from this Wallingford Thai restaurant, and longer still since I've dined in.I was pleased to see that the ambiance had improved in the last year or so. The tables were welcoming, the lighting was better. The place felt more alive, even though there were only a handful of diners there on a Sunday night.As an appetizer, the veggie curry puffs with cucumber-chili dipping sauce were to-die-for (of course, I was also starving). The fusion noodles with tofu was a satisfying choice for a main. While I must say that the tofu was a tad on the chewy side, the noodles felt like comfort food, and the spice (4 1/2 stars) was exactly the heat I asked for.I'm glad I tried Djan's again. You should, too.", "Date": "2011-07-25", "Author_Location": "Seattle, WA"}, {"Author": "Kate L.", "ReviewID": "wDOL950cnwApUBxLjE798A", "Overall": "4.0", "Content": "Pretty good Thai food. A little pricey for Thai food around the U district though. The service was okay, although the waitress did seem very \"frowney\". She wasn't mean, but just had the face of a very unhappy person...Anyways, we got phad thai, phad kee mow, and eggplant sauteall were on par with the other good thai food places on the ave", "Date": "2012-05-22", "Author_Location": "Seattle, WA"}, {"Author": "Jared S.", "ReviewID": "AZCdS7Htq3yA9C-SzNyRKA", "Overall": "4.0", "Content": "I've had good experiences with this place. The \"Garlic Lover\" dish is pretty damn tasty. I've always ordered takeout, so I can't speak for their restaurant service, but everyone that I've gotten takeout orders from has been friendly, and the service prompt.", "Date": "2013-03-07", "Author_Location": "Seattle, WA"}, {"Author": "Julie S.", "ReviewID": "Js84Deo0wh_yKAldPVoeNw", "Overall": "3.0", "Content": "After reading the reviews for Djan, I was really excited to try it out. Unfortunately, I was disappointed on a number of levels. First, the service was on tranquilizers. We were given menus immediately, but it took almost 20 minutes until our server came back to take our drink/food orders. Another 20 minutes later we finally got the bottle of wine we ordered after asking the waiter and the busboy (who eventually brought it out himself). Our food didn't come out for over an hour after that! Second, some of the friends I was eating with really love spicy food, and others don't. Two of them ordered the same dish, one with 5 stars the other 2 stars. The dishes tasted exactly the same, with exactly the same amount of spiciness. By then, we were all too hungry to send it back, but just another disappointment. I was satisfied with my Pad Thai! I'm hoping this was a waiter specific occurrence, but I still don't think I will go back to Djan. Sorry!", "Date": "2010-09-26", "Author_Location": "Seattle, WA"}, {"Author": "Naika A.", "ReviewID": "LuNpfEOHivG1JzZcK4nSow", "Overall": "3.0", "Content": "I really want to like this place because the fellas who run it are very decent and the place is cute, but the food is just...mehh- and that's the only reason I'll give this place 3 stars instead of 2. For me, it's never what I expect it to be which is sad.1st time, we got: the beef salad, which was delicious. the crab wonton which was good, and the joy duck club which i actually hated. there was just a flavor clash that I didn't anticipate. I also got a Thai iced tea which was great, but those are hard to mess up anyway.2nd time, we got the calamari and the samurai pad thai. One important thing to note about the calamari is that it's nothing like MOST other calamari dishes. It is literally an individually fried calamari TEMPURA style. You can imagine my disappointment when I opened the box (we got take out) and saw 10 pieces of tempura calamari. So I should note that I absolutely hate tempura- it's just too much fat and crunchiness for me to handle and it's just never seasoned right. To make things worse, the calamari doesn't actually have much taste. If it wasn't for the duck sauce they provided on the side, this dish would be a miserable fail :( and it already was a fail for me, unfortunately.Now, the samurai pad thai, despite having tempura shrimp on it (lol), was very very tasty. My one and only complaint is that I asked for a spiciness of \"3\" and this honestly tasted more like a \"5\". I hate spicy foods so that was unfortunate....So, these weren't the worst experiences I've ever had, they just weren't that good, so I most likely won't be eating here again.", "Date": "2013-07-10", "Author_Location": "Seattle, WA"}, {"Author": "Brittany P.", "ReviewID": "PCy7OvVH5NxkM5MRkiXuMw", "Overall": "5.0", "Content": "This is definitely some of the best Thai food I have had in Seattle. I always recommend it when people ask for a good thai place. I have gone here several times for appetizers and drinks or a a big dinner with family and friends. I love their pad thai and the curry is always amazing! The atmosphere is warm and welcoming and they have some private seating upstairs if you want it to be a little more private.", "Date": "2013-06-19", "Author_Location": "Seattle, WA"}, {"Author": "Miguel S.", "ReviewID": "FuW3Ut4GejmqTFvnUddEfw", "Overall": "5.0", "Content": "I am was relatively new to trying out Thai food and this place was great! The service was friendly and the food was rich in flavor. The beef could have been a bit softer but it was still good.", "Date": "2014-01-22", "Author_Location": "Inglewood, CA"}, {"Author": "Geoff T.", "ReviewID": "pCkpltTN-8f-RsDopDWaZw", "Overall": "4.0", "Content": "This is a great little Thai restaurant.  Nice atmosphere and the Cashew Chicken is REALLY good.  Skip on getting the rice at $2 a person, or just get one and split it.  We also tried the pineapple fried rice recently and it was awesome.", "Date": "2013-06-07", "Author_Location": "Seattle, WA"}, {"Author": "John R.", "ReviewID": "fYHZSndgQf3niw2SL6Ti4g", "Overall": "1.0", "Content": "Well...the reviews on here seemed pretty good...the food on the other hand was really really really bad...the phad thai was way too sweet and very soggy and ive had way better veggie rolls out of the freezer (not that freezer rolls are very good).I also had to pull a one and a half foot piece of hair out of my throat after eating!!i feel cheated. it was gross. don't eat there.now i feel guilty for giving it a bad review...thanks Djan's...", "Date": "2008-08-20", "Author_Location": "Seattle, WA"}, {"Author": "Vanessa K.", "ReviewID": "RDZlOx_KD-3A_922c0FhCw", "Overall": "4.0", "Content": "Djan's is great. It's in my neighborhood, and the inside is comfy and calming. I've always been treated politely by the staff, and even though I usually take-out my order, I am always offered a table to sit at while it's being prepared and a glass of water while I'm waiting. In a small place like that I was originally worried about taking up space waiting on take-out, but they are actually quite accommodating. ^__^My food is always prepared timely (10 mins or less) and is piping hot just the way I like it. I had my first curry at Djan's some years ago, and it's still my favorite - the yellow curry. Nice enough for a date, casual enough to grab food on the way home from a long day of errands.", "Date": "2011-02-02", "Author_Location": "Seattle, WA"}, {"Author": "Britt F.", "ReviewID": "Tv2eeFz9UFrXvYE33I82Cg", "Overall": "4.0", "Content": "Best Thai in quality and quantity for the price in Seattle. I love it. Have had the pad Thai and several curries. All excellent.", "Date": "2013-05-27", "Author_Location": "Anchorage, AK"}, {"Author": "Steve A.", "ReviewID": "Wz7TAay2kgmIptAYKHeriw", "Overall": "4.0", "Content": "Always consistently great. Good Red Curry and excellent Pad Thai. Our go to for Thai takeout.", "Date": "2013-12-15", "Author_Location": "Seattle, WA"}, {"Author": "Eryne R.", "ReviewID": "kB_FUO1ZEgCHniPA7eHxCw", "Overall": "4.0", "Content": "After driving by Djan's fairly often, my boyfriend and I stopped in for dinner last night, and were glad we did!The ambiance at Djan's is much more cozy and refined than it appears from the outside. The downstairs dining room is small, but full of flowers, soft lighting and comfortable chairs. It's definitely a great place for a date.The food and service were also impressive. We started with the curry puff appetizer, which was crispy and filled with a delicious curry that tasted more Indian than Thai. For our entrees, we had the Spicy Basil and the Fusion Noodles. I'm fairly picky with Thai, and I was impressed with both. The Fusion Noodles were especially great, filling, and different from any dish I've had elsewhere. I should also mention that I ordered a 4 and it was ridiculously spicy - almost too much to be enjoyable (and this comes from a spice-fanatic). We ended the meal with the Chocolate Toffee Mousse. Dessert was unfortunately the reason I bumped my review down from 5 stars. While still rich and chocolatey, the mousse was obviously frozen and lacked the light airy texture I was expecting. Not a huge deal, but for a $7 dessert, I had hoped for something not frozen at least (on the bright side, we saved half for leftovers and after a few hours in the fridge it was thawed out, delicious, and fluffy). The servers were not overly friendly, but they were polite, attentive (I particularly appreciated this because my mouth was on fire and I was guzzling water nonstop), and gave us some space to leisurely enjoy our night.My advice - skip the Thai Tom and May Thai's of the Wallingford/U District area and check out Djan's the next time you're looking for good Thai food. I'm honestly surprised at how little business Djan's seems to get despite great food and relatively inexpensive prices.", "Date": "2012-12-18", "Author_Location": "Seattle, WA"}, {"Author": "Shea C.", "ReviewID": "kZbE0r7zxuEpLvw7-kw6-g", "Overall": "4.0", "Content": "Food was good!", "Date": "2013-03-30", "Author_Location": "Seattle, WA"}, {"Author": "Lara L.", "ReviewID": "SOvEwoqwoW5HOQAvCjwKjA", "Overall": "3.0", "Content": "I was actually just trying to call in an order to pick up and the line was continually busy which is *always* frustrating. So, I just popped in and decided I might as well sit and eat b/c I was in desperate need of a glass of wine or a cocktail. Well, no cocktails and a limited wine selection which was average but enough to satisfy my urgent need! The two people that saw me were a bit scattered and lost in getting me seated, acting surprised that I wanted to actually sit and dine there, but it wasn't a problem, I already knew what I wanted, grabbed a table, got my glass of wine and my food came super quick. I had the garlic chicken - no rice just over vegetables and it was fantastic. I agree with other reviewers that their spiciness scale is tuned to pretty spicy so my 2 (on a scale of 1-5) was actually more spicy than I would have preferred but still edible. So just keep it in mind! Would come back - or at least order take out again!", "Date": "2013-09-19", "Author_Location": "Seattle, WA"}, {"Author": "Rachel L.", "ReviewID": "_85Fmq-ycSBsuJpsYBTsvw", "Overall": "3.0", "Content": "Nice ambiance, yet reasonable prices! Unfortunately, we had LOTS of time to enjoy that ambiance. One poor woman was trying to run the whole dining room, which isn't big, but it was busy! She was very sweet, but just not that competent. Not sure what it is with the fried tofu here, but both we and another table got \"tempura tofu\" instead of what we ordered (in my case, Tom Kha with tofu). The food was good, not great. Highlights were tasty peanut sauce with the satay and plenty of veggies in the fried rice. Decent size portions, but nothing outstanding. Solid and local, so we'll probably keep trying it.", "Date": "2009-01-01", "Author_Location": "Seattle, WA"}, {"Author": "Scorpio P.", "ReviewID": "m4ukXVk2725lOnTjpFTsDg", "Overall": "4.0", "Content": "Above average food.  Wonderful atmosphere and excellent service.", "Date": "2013-04-15", "Author_Location": "Seattle, WA"}, {"Author": "John T.", "ReviewID": "9qid1avaomR2rWmjt2D3Ew", "Overall": "3.0", "Content": "We tried these guys for takeout. The Spring Salad with grilled chicken and a sort of curry dressing was delicious. The Fusion Noodles made an odd first impression on my wife, who thought they tasted like dishwasher soap, but she got over it. The flavor is definitely unusual but I liked it. Don't let that put you off -- for Thai takeout, it's good and definitely better than Lotus Thai down the street.", "Date": "2008-08-05", "Author_Location": "Seattle, WA"}, {"Author": "Alison L.", "ReviewID": "lzcz3MMPn_afYfYDv8ZVZw", "Overall": "5.0", "Content": "The tap water tastes a little funny, but it's okay because everything else is FAB. me love you long time!", "Date": "2007-07-13", "Author_Location": "Ann Arbor, MI"}, {"Author": "Scott C.", "ReviewID": "i78amjJhDGpNIz_6CuWoKQ", "Overall": "3.0", "Content": "Good food, good service.  I had Djan's fusion dish which is basically a spicier Phad Thai with more vegetables.  The red curry was also very good.  Decor is simple and unobtrusive.  Wait staff is attentive.  Fresh flowers by the window.  Come here for a pleasant meal.", "Date": "2007-09-23", "Author_Location": "Redmond, WA"}, {"Author": "Kiran C.", "ReviewID": "NFANWyI3iZ1gX_r1J7IRcg", "Overall": "3.0", "Content": "I would really like to give this place 3 1/2 stars.  The atmosphere was very nice.  This place is extremely clean and simple.  There wasn't a lot of decoration like you see at most thai restaraunts.  We arrived before the dinner crowd and the place was empty.  We had excellent service and the food came out quickly.  We ordered cashew chicken, the house noodles, a red curry with beef and a one of their fried rice dishes with tofu.  The cashew chicken was exceptionally flavorful.  It exceeded my expectations.  The curry was a bit flat and unimpressive.  The noodles were ok.  The fried rice was extremely good but the portion size was a bit small.  I think I would go back to this place especially considering the atmosphere and low prices.  I would recommend you check it out sometime.  Apparently the upstairs can be rented out for private parties just as an fyi.", "Date": "2008-07-22", "Author_Location": "Seattle, WA"}, {"Author": "non o.", "ReviewID": "TTmsLAzWAKghgB3Kbw9H3g", "Overall": "5.0", "Content": "I love this place! The restaurant is very clean and staff are really nice. I love their Pad Thai with Tofu. Yum! Also don't forget to order Thai ice tea. Yum x3!", "Date": "2008-07-05", "Author_Location": "Seattle, WA"}, {"Author": "Alex G.", "ReviewID": "TSeppeJf6piF35jPf70PNA", "Overall": "5.0", "Content": "Some of the best Thai I've had, particularly the pad thai and pad sew yew. It's very flavorful and tastes as if every noodle touched the wok for awhile. It can be a dollar or two more expensive than some of the usual spots, but well worth it. Eating in is a treat, because its a cute place, but I love that they deliver to my apt. too!", "Date": "2010-12-31", "Author_Location": "Seattle, WA"}, {"Author": "Anthony H.", "ReviewID": "1wliYVJaXa7RzMKFfaRKNQ", "Overall": "1.0", "Content": "The food is good, but this place's delivery policy is ridiculous. I can understand charging a small delivery fee OR having a minimum order size, but charging $4, AND requiring me to order $25 worth of food is completely ridiculous. I will never order from them again.", "Date": "2012-10-26", "Author_Location": "Seattle, WA"}, {"Author": "Doctor J.", "ReviewID": "qINHeXsfWV4dg8stb3wcXg", "Overall": "5.0", "Content": "A great spot for dinner, and a spectacular deal for lunch.  Go with the Fusion Phad Thai, but make sure and get an iced tea or beer with it.  They don't go easy on the heat.", "Date": "2006-07-28", "Author_Location": "San Francisco, CA"}, {"Author": "Derek C.", "ReviewID": "lu1_Uts2fp-qo3_Oa8AQmA", "Overall": "4.0", "Content": "Wow this place is cool. I was not expecting the interior to be the way it is from walking up to the house. It's really nice. I ordered the fusion noodle which is their specialty mix of pad khee mao and pad thai. It was delicious. I also enjoyed their tofu. It was hearty and came in good size chunks. Sometimes at thai places they fry tiny pieces of tofu so long that they get huge and puffy - and filled with oil. I wish this place were on the ave so they could be closer to me! Definitely give them a try.", "Date": "2009-06-08", "Author_Location": "Seattle, WA"}, {"Author": "Polly H.", "ReviewID": "QnhFhNuX1F_9OUFKUIazwQ", "Overall": "5.0", "Content": "First of all, Djans does lunch delivery which is great in itself but to make things better, they even deliver to the UW campus which is rare!  While I would order even mediocre food to not have to go out into the rain some days, Djan's food is excellent!  The prices are reasonable, the lunch specials are well priced and you aren't forced to have pad thai.  Although the pad thai is quite good actually.  So far my favorites are the fried rice and cashew chicken.  Both are amazing.  Oh and if you say spicy, they actually believe you and add spice..I know that sounds funny but some places hear me say spicy, take a look at me, and decide i can't take it for whatever reason and make the food mild...blah....I can take it and Djans delivers...literally!Did I mention lunch delivery!?!?    Order it today!", "Date": "2009-02-24", "Author_Location": "Seattle, WA"}, {"Author": "Rossana Y.", "ReviewID": "NkSPubxwvCR19MT_Z35sRg", "Overall": "5.0", "Content": "On the outside, it looks like someone's house and you question yourself if you came to the right place. The inside has a nice, romantic atmosphere with some modern Asian style...even the bathroom! The food is always so good with perfect portions and low prices. I had the green curry and my friend had the Djan fusion noodle...both of which I recommend. The service is very friendly and they even come check up on you which is nice. Makes me wish I lived in Wallingford so I can stop by here and order take-out whenever I want. Love it :)", "Date": "2009-09-23", "Author_Location": "Lynnwood, WA"}, {"Author": "Ane P.", "ReviewID": "Q9Jdb6JJG91p2iC0N9YK1A", "Overall": "4.0", "Content": "This restaurant just gives off a great vibe. Not to mention that the food is very well prepared, and the service is excellent. The interior has a very minimalist and clean feel. I had gone here prior to their remodel, and i love it just as much--if not more, now. I appreciate the homey feeling of this restaurant, as you are aware that the cooks are just in the next room (or what you would imagine was originally the kitchen in this house). I will continue to dine here for years! It's so quaint and unique!", "Date": "2008-07-21", "Author_Location": "Seattle, WA"}, {"Author": "Carly P.", "ReviewID": "th4n4QMEuaxWMepEskqIvQ", "Overall": "1.0", "Content": "Terrible delivery service. Ordered delivery once and instead of getting it within their 45-60 minute windows they showed up 90 minutes later. I was charged three dollars for delivery and when I signed the bill the delivery guy told me that he wanted a tip. Normally of course, but not when the food is already late and I've paid for delivery with my order.Food is pretty good. I got the Tom Kha for a second time. They put the wrong star numbers on the two different soups I ordered (one was tofu with 4 stars, the other chicken with 3 stars - they switched them) and there was a lot of coarse ginger that you can't really eat floating around in there. This is the first bad review I've given and it makes me sad!", "Date": "2012-11-04", "Author_Location": "Portland, OR"}, {"Author": "Lilly T.", "ReviewID": "jYD4sxF3MEbE1QlWn5TRfw", "Overall": "4.0", "Content": "Cute little thai restaurant in Wallingford with nice ambience lighting and warm lit candles during dinner time. We had the garlic lover's stir-fry and the Djan fusion noodle. Food was tasty, I'll definitely come back sometime soon.", "Date": "2009-04-01", "Author_Location": "Seattle, WA"}, {"Author": "Claire D.", "ReviewID": "XNJw60LRm0zG45KZviXcJg", "Overall": "4.0", "Content": "So, I've only tried this place for delivery, but was really impressed! We ordered the red curry and the Djan Fusion thing (pad thai-ish). Both were really delicious and arrived in huge portions. Just polished off the leftovers for lunch. This will definitely be my go-to place when I'm craving take-out.", "Date": "2008-02-13", "Author_Location": "Seattle, WA"}, {"Author": "Nick C.", "ReviewID": "KcAQxZnau_jgBB-9dymaMw", "Overall": "2.0", "Content": "Was here recently for tastynetworks's dinner.  I ordered Samurai Pad Thai, medium and Thai Ice tea (only reason I ordered the Thai Ice Tea was not liking the stale water with taste of lemon, some how tasted like rust).  The Thai Ice tea was delicious, can't say so for the pad thai.  Overly spicy for medium, and found part of a clam shell while I was chewing, adding some undesirable crunchiness to the food.  Shrimp Tempura was well breaded, but more of fried chicken style than tempura.", "Date": "2010-05-22", "Author_Location": "Seattle, WA"}, {"Author": "Bobby M.", "ReviewID": "SG7TwIh7HcyUC2B9XvIabQ", "Overall": "4.0", "Content": "Good food and GREAT service!  Some of the nicest people work here.  It's relatively inexpensive compared to some of the other Thai places around here and the food is just as good.  I've had their curry and several of the noodle dishes.  I'd recommend this place to anyone wanting to eat Thai food in the area.", "Date": "2009-04-18", "Author_Location": "Seattle, WA"}, {"Author": "Paige W.", "ReviewID": "jFBiMAqi6tP59vQ5lnzP8A", "Overall": "2.0", "Content": "I ordered Tom Yum soup for delivery.  It came in about 40 minutes, which pleased me; however, there were no utensils or napkins!  I just moved into a new apartment and have yet to buy silverware.  This made it very difficult to eat the soup.  I know most people have silverware, so I understand if Djan's is trying to cut cost by not handing them out to everyone, but at least ask the customer if they need them.  As for the soup, it was okay, but I've had better.  I think it could have used more lemongrass, or something.", "Date": "2009-11-29", "Author_Location": "Issaquah, WA"}, {"Author": "TIffany S.", "ReviewID": "xxjEWj1kk31VWNAbak4f0A", "Overall": "5.0", "Content": "I admittedly have never eaten inside this restaurant so I can't account for the ambience but the food is spot on!  This is our go-to Thai delivery joint.  We've probably ordered from them a dozen times and every time they are on time and the curry is phenom.  And I love that you can order on-line too.  Yum!", "Date": "2012-01-31", "Author_Location": "Seattle, WA"}, {"Author": "Nanana A.", "ReviewID": "cHb0z4ik7WOlh6s_R4w7dA", "Overall": "4.0", "Content": "The decor was nice when you walk in, simple oak tables and white canvas cushion chairs and benches.  It's is unusual that it's in a house, but I would go back again.  The panan curry with beef was excellent...we ate every bit....yummy!  our favorite next to the Lychee cheescake, another excellent choice!  The calamari appetizer was okay.  The slices of calamari was deep fried in a nice coating of a bread crumb, but the calarmari would slip out when you took a bite.  The basil chicken was good, but I'm use to a sweeter flavor, but overall the items we ordered were good.  The portions were large, the price is very affordable,  and the service was attentive.   It wasn't crowded when we went there.  For 4 people was spent $45.   what a deal!!!!!", "Date": "2007-09-09", "Author_Location": "San Francisco, CA"}, {"Author": "Jayne A.", "ReviewID": "ZcENwFEqS0ptawxNn_oh9A", "Overall": "1.0", "Content": "I ordered the Tom Yum Soup, Cucumber Salad, Fusion Noodle, and a Diet Coke. The Tom Yum Soup was nothing but oil and mushrooms, i ate about 4 spoonfuls and was completely grossed out. The cucumber salad was steaming hot and the fusion noodle was tasteless and overly slimy. No utensils came with the meal and I asked for a side of hot sauce which was no where to be found. The only thing I finished was the Diet Coke which was luckily, cold.", "Date": "2009-11-03", "Author_Location": "Seattle, WA"}, {"Author": "Laural B.", "ReviewID": "36o5n3PJ81OaJ96XZJsZwQ", "Overall": "5.0", "Content": "This place is great except for the ice water. That is to say, no ice. If you pay for a beverage, you will not regret any other part of your dining experience.", "Date": "2006-05-12", "Author_Location": "Bellevue, WA"}, {"Author": "John M.", "ReviewID": "Nl_dSLkte-B_wBDZ9GF-AQ", "Overall": "5.0", "Content": "Had the Penang and it was top notch. The samurai phad Thai was also groovy. Ambience was casual but upscale. If you are looking for some good Thai look no further", "Date": "2012-05-17", "Author_Location": "Seattle, WA"}, {"Author": "Kelly H.", "ReviewID": "wbJDvs6Lpl66suKisRpwqg", "Overall": "4.0", "Content": "such a lovely restaurant! i had heard about this place from a couple friends and finally tried it...and i was impressed. love the decor. love the dining area...(very cute and intimate). food was very good. and LOVE the service. our waitress was super nice and kept my water glass fullwe had the phad thai, yellow curry and thai iced teas...so good. i usually go to the ave for thai food but i might start coming here...i think its actually closer to my apartment too", "Date": "2008-04-27", "Author_Location": "Irvine, CA"}, {"Author": "Sara F.", "ReviewID": "HN65XswJnDyq8fBLYhtN2Q", "Overall": "4.0", "Content": "Went here with the husband Saturday night for dinner and was very pleasantly surprised. I was a tad worried upon parking as it's pretty far down on 45th but once you go inside, it's pretty cozy and cute. We ordered the seaweed soup with chicken as a starter and it was really delish. Very nice smoky flavor to the chicken and the seaweed wasn't mushy, the flavors were great. Then we shared the Fire Scallops w/brown rice and ground chicken spicy salad. All were very good! The scallops weren't overcooked and had a great sweet and spicy flavor to it. Overall I was really pleased with this place and happy to discover a new great neighborhood thai place to go in or get take out from.", "Date": "2010-01-31", "Author_Location": "Anchorage, AK"}, {"Author": "Cristina L.", "ReviewID": "he4rbu1nzZeyoHRL9gzeag", "Overall": "4.0", "Content": "Lunch was beef with cashew nuts and my friend had pad thai. Our dishes had just the right portions and were delightfully flavorful! I asked for mine mild on they spicy-meter and was glad I did. It had just enough kick for me to enjoy-I'm really a wimp when it comes to spicy! We also had fresh spring rolls which were a little-well different with wheat wrappers, but still good. Djan's is a quaint little house that's been turned into a restaurant. We loved our seat by the window and all the fresh flowers throughout were a nice touch. Definitely an enjoyable lunch!", "Date": "2011-09-15", "Author_Location": "Sierra Vista, AZ"}, {"Author": "Kim S.", "ReviewID": "4ZuBdZdPXFpl6WrwaDeLhw", "Overall": "4.0", "Content": "Great food, some of the best Phad Thai I've had in the Seattle area.", "Date": "2013-09-22", "Author_Location": "Seattle, WA"}, {"Author": "Arun S.", "ReviewID": "lak4-E3XsXp5avkmW5UoLw", "Overall": "4.0", "Content": "Very good Thai food. We got there on a Saturday evening and it was empty but a few others came in after us. The server was very attentive and helpful. The crab rangoons were great; crispy on the outside with soft, hot cream cheese inside. We got the pad kee mow and the green curry; both were very good and flavorful. A little spicier than we had asked but we liked the entrees. It is located in a converted house and its interior is simple but nice; perfect for a relaxing dinner.", "Date": "2010-08-24", "Author_Location": "Seattle, WA"}, {"Author": "Daunielle R.", "ReviewID": "LOUdiKBCetKs7zdCwVUzyA", "Overall": "4.0", "Content": "When I first decided to move to Seattle, I knew I would make it my mission to seek out scrumptious Thai food. As my favorite type of cuisine (besides pizza ... and I'm not so sure pizza counts as cuisine) I was thrilled to hear Seattle was a keeper in the realm of Asian dishes. I have only ordered delivery from Djan's so far, to which the service was prompt and very friendly! Reading some of the other reviews I know I'll have to give a sit-down meal a try =) The ever-so popular pad thai was absolutely delicious, and I loved that I could choose my own spice intensity! For appetizers we got crab rangoon and dumplings which were fantastic. We also got scallops with vegetables as well which did not fail to satisfy and curb our mouth-watering hunger for the aromatic scents emitted from the tin countainers. Djan's just became my new top Thai.", "Date": "2009-06-04", "Author_Location": "Somerville, MA"}, {"Author": "Nadine W.", "ReviewID": "y8yZ_e-dX0Cqqy2rvF2lww", "Overall": "4.0", "Content": "I love any restaurant located in a house! They really optimized the coziness of this turn of the century home, maintaining the integrity of the structure while maximizing its best features. The decor is lovely and the staircase leads to a private dining area for groups upstairs. The food is excellent as well which can be tough to do in a city filled with Thai restaurants. This one is definitely worth the trip!", "Date": "2010-03-17", "Author_Location": "Redwood City, CA"}, {"Author": "S B.", "ReviewID": "VstVHmzmkJ1oriMulGsFVA", "Overall": "5.0", "Content": "You know how each Thai restaurant has its signature dish? Djan's fusion noodles are the bomb! It's like spicy, broccoli, basil phad Thai, but so much better. The place itself is classy, perfect for a date night. And I have had nothing but top notch attentive service every time I've been.", "Date": "2013-09-06", "Author_Location": "Seattle, WA"}, {"Author": "Jack C.", "ReviewID": "KIeHgQsBhqwcqjZVlHFVhg", "Overall": "4.0", "Content": "Tasty food and important for some, delivery is offered. However, the restaurant failed to mention about a \"delivery\" charge, even though we were in the radius. That was a little annoying. I don't mind paying for it, I just didn't want to find out via a deliveryman while waiting for our food. Overall good quality and with prices were relatively reasonable, about 8-12 dollars for most dishes.", "Date": "2009-11-14", "Author_Location": "Seattle, WA"}, {"Author": "Brandon H.", "ReviewID": "NXfJx3Qsr6DcTyl5uyHPWQ", "Overall": "3.0", "Content": "Cute Thai restaurant with a nice clean, warm atmosphere.", "Date": "2012-05-05", "Author_Location": "Mt Horeb, WI"}, {"Author": "N H.", "ReviewID": "Toom82QXgBMUohgfqmGBMQ", "Overall": "1.0", "Content": "One of the worst dining experiences I have had in a long time.First, we ordered delivery that was supposed to take 45-60 minutes.  After an hour and 20 minutes, I contacted the delivery service (eat24hours.com) to find out where the food was.  The live chat rep (who was very friendly and helpful) said that he had called Djan's and was told that they were \"running behind\" but that the food was \"on the way\" and would arrive in a few minutes.  The food did not show up for another 20 minutes, which indicated to me that it had not, in fact, been \"on the way\" as the restaurant had claimed.  (Although I guess it's possible that the driver got lost...)Next, the food was so cold when it arrived that I had to reheat it.  I am not someone who wants food to be extremely hot, but this food wasn't even lukewarm. Finally, the food itself was lousy.  The texture of the prawns was off and they didn't taste quite right, so I stopped eating them.  My mom didn't notice anything and continued to eat them, then became sick about an hour later.  Perhaps they went bad in the hour and 40 minutes it took for the food to arrive.  The noodles, as another reviewer mentioned, were mushy.  They had the consistency of noodles you'd get in a microwavable Thai bowl from the grocery store. Unfortunately these noodles cost far more than $1.50.  I typically eat Thai food 2-3 times a month and thus am pretty familiar with different dishes, as well as the variation in quality across different Thai restaurants. This was the worst experience I have had, though I will add the caveat that most of my complaints might be related to the fact that I had the food delivered.  Presumably the food wouldn't have been cold if I had eaten in the restaurant. But given the prawn experience, I probably wouldn't risk eating in the restaurant either.", "Date": "2012-10-21", "Author_Location": "Seattle, WA"}, {"Author": "Hanna D.", "ReviewID": "fQ8tbwASMvePKlHa6S0jhA", "Overall": "3.0", "Content": "not the best ever, but a solid 3.  I got it delivered, and it came faster than the website said it would--on a Friday night of a holiday weekend, that's pretty impressive.  So obviously I am only rating it on the food, not on service or ambiance.  I had fried veggie rolls (not terribly greasy and I liked the glass noodles inside) and the garlic lover with chicken--the chicken was grilled, which was tasty, but I could have used a few more veggies, it was kind of salty, and the heat factor was lacking.  I ordered a 3, which is usually plenty for me--this barely registered.  Overall, not bad--I'd try it again.", "Date": "2009-07-03", "Author_Location": "Seattle, WA"}, {"Author": "Ian S.", "ReviewID": "AY6bAIL4oJqNYEpCJDIvMw", "Overall": "5.0", "Content": "Excellent food, good service, nice interior. The space is small, so if another table is obnoxious, there's not much to do.... but very good overall. Each time I've been here now, every dishe at our table was notably good, and well above my expectations. I'll put this on my short list of best Thai spots in Seattle. ***after going for a variety of times, this is now my favorite thai spot in seattle***Decor is white & natural wood, clean and soothing. A new favorite. I'll be back.***My favorite, I'll keep coming back.***", "Date": "2010-08-26", "Author_Location": "Green Lake, Seattle, WA"}, {"Author": "Marni R.", "ReviewID": "rbo_mSM1Xnkhrw24zjGeAw", "Overall": "2.0", "Content": "I've liked Djan's in the past, but it's been years, and this was delivery - those are the caveats. Last night was a lousy enough experience that i'm not giving them another try. The deep-fried tofu has a breading on it (never imagined having to ask about that - it was disgusting); \"fusion noodles\" - the description invokes pad woon sen but it's basically pad thai - and included a stealth piece of an ingredient i had clearly specified i'm allergic to, so i'm both sick from the part i ate before i found it, and have to throw the rest out (good to take those little \"do i really still react to this? Yep.\" tests now and then... not really.) The soup was just kind of blah.Lastly, i ordered for delivery through clickeats, which asks for an address update but doesn't give you a way to delete old addresses (and i really looked around the site, to try to prevent...what ended up happening). I'd had delivery from Djan's through them one time a long while ago in an old place. Entered the new address, checked that it came up on the order confirmation, etc. After waiting ravenously for a long time (for the food i would ultimately find so not to my liking as to be inedible) i got a call - from the door of my old address. WTF? So things were cold and that much nastier when they did get here. The whole experience was a major bummer. Two stars rather than one because someone with different preferences might have found it more tolerable. It just totally did not work for me.", "Date": "2010-12-09", "Author_Location": "Seattle, WA"}, {"Author": "Abby A.", "ReviewID": "r5W4gYegKCt2xNqfNtnbjw", "Overall": "2.0", "Content": "The pick up order was fast and on time.  I got the fusion Noodle dish and man was it salty!  Nothing special really.", "Date": "2011-02-24", "Author_Location": "Seattle, WA"}, {"Author": "Erika H.", "ReviewID": "tupVYvRf5kRLQtg94yDSMg", "Overall": "5.0", "Content": "The Combo Noodles incredible. The fact that they deliver is dangerous.", "Date": "2011-06-16", "Author_Location": "Seattle, WA"}, {"Author": "Kristin F.", "ReviewID": "Nh1_wBfsiQcPVWLU3pz0qQ", "Overall": "2.0", "Content": "When I first moved to Seattle 3 years ago, this was my favorite Thai restaurant.However, we've ordered from them 2-3 times in the past 6 months, and each time has been worse than the last. On one occasion, our dishes were so spicy that I could barely choke down a few bites (despite asking for my usual 2 stars). With our final order, the Pad See Ew noodles were goopy, gross, and tasteless. I'm not sure what happened, but we're giving up.", "Date": "2012-01-02", "Author_Location": "Seattle, WA"}, {"Author": "Bob B.", "ReviewID": "qXvwKS9Xqb2b3A4sL1AhbA", "Overall": "2.0", "Content": "I have only ordered from Djan's once and it was take away, but based on this order I am reluctant to order again. I ordered Pad Thai so that I could compare to Sea Thai, where i have ordered in the past. Boy, what a difference. Maybe tonight was an off night for Djan's, maybe they have a new cook or something. I will probably give them another try, but this order was seriously sub par. No spice, no condiments, no peanuts, no scallions, very few bean sprouts, no flavor, just a pile of noodles and some over-cooked meat. Way too little care for $13. Sea Thai is way ahead of this.I want to point out that the food was on time and the staff was friendly and polite. Still, I had to get into the kitchen and finish this Pad Thai myself.", "Date": "2012-04-17", "Author_Location": "Seattle, WA"}, {"Author": "Rosa M.", "ReviewID": "4ts6rhQ0MjvLhJw-DhReRw", "Overall": "4.0", "Content": "Djan's Dining is the best Thai food I've had in Seattle so far.  My husband and I have been to the restaurant once but mostly order our food. The place is a cute, minimalist, white space (which I liked) and the service was on point..  They have a particularly delicious egg plant dish (I don't remember the name), and tasty Pad Thai and garlic chicken mmm.  In certain days the delivery took a bit longer than expected, but these orders were during peak hour times on rainy days, any other time the delivery was on time (this time delay is why I gave 4 stars vs. 5 stars in rating).", "Date": "2012-07-07", "Author_Location": "Seattle, WA"}, {"Author": "Hallie P.", "ReviewID": "0h5DLD5zF0lmGkBV_Qz_Gg", "Overall": "5.0", "Content": "As a full time grad student with two jobs, I've eaten food from many different delivery places.  What sets Djan's apart from all the rest is the quality of their food, their ability to follow directions and their friendly delivery people.  The food arrives fast and hot.  My favorites  are the chicken tom kha soup and the mango sticky rice.  The crab rangoons are also fantastic.  If you're looking for a tasty dinner without leaving your couch, call Djan's.", "Date": "2012-08-01", "Author_Location": "Seattle, WA"}, {"Author": "Jen C.", "ReviewID": "wnyego7c1WNwBGACfukJ8g", "Overall": "5.0", "Content": "This place is cheap for lunch. They always have good service and I feel really relaxed eating here.", "Date": "2007-06-20", "Author_Location": "WA, WA"}, {"Author": "Chris P.", "ReviewID": "Vv2AkuO8kr8ftV72qYrUAA", "Overall": "5.0", "Content": "I have been in Seattle for 6 months, and so far this is the best restaurant I have found. The food is perfectly cooked for a fresh taste. A nice mix of vegetables with the meat dishes. The Pad Thai Fusion (I forget the exact name) is excellent, and the curry dishes, chicken/broccoli and others. Good appetizers and some great happy hour specials.", "Date": "2010-03-24", "Author_Location": "Seattle, WA"}, {"Author": "Christian S.", "ReviewID": "yAxd8dZ29WfAyeeluGmmGA", "Overall": "4.0", "Content": "I have been searching for a Thai place in Seattle for a few years and after trying Djan's last night I have found it.  The food here is amazing.  Pad thai with tofu, vegetable delight with brown rice, fresh spring rolls, and fried veggie rolls.  Quite possibly the best Thai food I have had in Seattle.  The only critique would be that it might be time to invest in some new tables and chairs.  I will be going back many more times I am sure.", "Date": "2010-11-03", "Author_Location": "Seattle, WA"}, {"Author": "Nicole W.", "ReviewID": "pDqa4kI8hNr7ufPV-xlyrA", "Overall": "4.0", "Content": "Great flavor, huge portions, AND they deliver!  I've experienced several Thai places in the area and they are one of my favorites.", "Date": "2011-01-06", "Author_Location": "Seattle, WA"}, {"Author": "Farah A.", "ReviewID": "CMFmqbat73XXaUeMaNm8SA", "Overall": "1.0", "Content": "I just ordered delivery from Djan's and I wish I'd ordered from somewhere else. When I spoke to them on the phone, I asked them to make sure there were no peanuts in anything we ordered since I'm very allergic. Our food arrived 20 minutes late, our drinks were missing from our order AND there were peanuts in my curry! I probably won't be ordering from this place again unless I'm in the mood for another allergic reaction.", "Date": "2012-05-16", "Author_Location": "Seattle, WA"}, {"Author": "Lisa N.", "ReviewID": "4N4OGYPiPY8OVQoPxERksg", "Overall": "3.0", "Content": "I ordered take-out from Djan's last night without knowing anything about them and was promised delivery within 45-60 minutes. Surprisingly my food showed up in only 25 minutes! I ordered tom yum soup and chicken pad kee mao, both 3 stars. The tom yum soup was tasty, but lacked the depth of tom yum that I typically like. It was primarily overpowered by lots of lemongrass and the chicken was overcooked and tough, but beggars can't be choosers. The pad kee mao was no where near what I would expect 3 stars of spice would be, but it was passable. The bites that didn't have basil were a little on the bland side and I could have done with a lot more flavour, but I've definitely had *worse* Thai food than this. With all of the options in Seattle I'm not sure I'd ever order delivery from them again, but maybe eating in house will give me a better dining experience. I'd definitely like to try the fusion noodle!", "Date": "2012-12-17", "Author_Location": "Seattle, WA"}, {"Author": "Christina L.", "ReviewID": "jlJm5AOXISCQsoZpZ7MxYA", "Overall": "4.0", "Content": "We eat here a lot and I have never had bad food here.  The pad thai and fusion noodle dishes are the best in the neighborhood.", "Date": "2009-07-21", "Author_Location": "Seattle, WA"}, {"Author": "John G.", "ReviewID": "iCqSnwTGj_-Jkuhc_ib2fQ", "Overall": "5.0", "Content": "Hands down the best Thai food in Seattle!  I love the Pad Thai and the Cashew Nut.  I would recommend calling your order in, though, because in a rush the service can be a little slow.  Still, totally worth the wait if you have the time.", "Date": "2011-01-01", "Author_Location": "Seattle, WA"}, {"Author": "Megan C.", "ReviewID": "ZEdEotUF7txnMJlk1Ubmew", "Overall": "5.0", "Content": "The folks here are nice, the food is good and ample. The Samurai Pad Thai? Delicious! The upstairs private room is nice if you have a big group (a big group that doesn't mind sitting on cushions on the floor). As another reviewer mentioned, it never seems too crowded, so you can certainly make a last-minute decision to eat here. They do seem to do a brisk trade in carry-out, and you can pre-order online. I don't range far through the menu, because I just like what I like, but I've never been disappointed.", "Date": "2011-03-30", "Author_Location": "Seattle, WA"}, {"Author": "ShmoHaw K.", "ReviewID": "_WAovAMnyMAIvc0f0iEnjw", "Overall": "3.0", "Content": "The quality of the food relative to the high price is the reason for the three-star review. I don't like being charged an extra dollar for rice when I order curry, and I don't think the yellow curry I ordered--which was good--was good enough for the high price.", "Date": "2011-03-30", "Author_Location": "Seattle, WA"}, {"Author": "Ashley M.", "ReviewID": "Yz1OyI-Gen5JmdD0A2BdUw", "Overall": "5.0", "Content": "Everything about this place was perfection!  I love that it is in an old house with charm, and the minimalist/natural decor is lovely.  My boyfriend and I are \"Phad Thai\" people. Us branching out is ordering Panang Curry. Our server never let our water get too empty, our food came out at a decent rate, and was probably the best Phad Thai I have EVER had, and I have had a lot of it. I went in the late afternoon but I can definitely imagine the romantic ambiance that I have read in other reviews.  Overall, a gem!", "Date": "2011-06-12", "Author_Location": "Seattle, WA"}, {"Author": "Tony G.", "ReviewID": "2fC2r9Pd2tfBhBelsO4u6Q", "Overall": "1.0", "Content": "First things first. The food is some of the best Thai food I've had in Seattle. Service for delivery (not delivery person, who is always nice), however, is poor. Here's why.Most of the time they deliver within 45 minutes. However, I called once to object to the delivery of room temperature Pad Thai, Grilled Beef Fiery Salad and Red Curry and the employee on the other end of the line said it wasn't her problem and that it's their right to deliver cold food if they're busy. Incredible. And this was not the first time cold food was delivered. We used to order from Djan's once a week and get cold food about a quarter of the time. However, this was the first time we called and complained. A much more minor complaint is if you ask for the complimentary wontons every time you place an order over a certain dollar amount and once forget the coupon code, they refuse to give it to you. Technically fine, but for regular customers, it shows a trend of bad customer service. After that conversation, we stopped ordering from them.", "Date": "2011-08-07", "Author_Location": "Seattle, WA"}, {"Author": "Cory F.", "ReviewID": "f00ZxSQPlNMvW_RHZ1XuOA", "Overall": "4.0", "Content": "Had the seafood medley.  Excellent.  Friends had Green Curry and the Djan's Fried Rice. Also got the appetizer platter and all 4 were solid. Excellent food and not too expensive.", "Date": "2011-08-26", "Author_Location": "Seattle, WA"}, {"Author": "Bromley A.", "ReviewID": "k2SkF1orjfgzQzcAK75wpw", "Overall": "5.0", "Content": "My friend and I ordered from here last night (delivery). Usually, I get Thai food from a place down the street, but we needed the food delivered and had limited options - good thing. I'm glad to have finally tried Djan's, after driving by it for years. We got the Pad Khee Mao and the Pad See Eiw (both of our favorite noodle dishes)? We agreed that they were the best we'd ever tried in Seattle. The veggies were flavorful and cooked just right and the tofu was excellent. We were impressed that the noodles were not all glued together, like often happens with delivery food. I thought the prices were reasonable for the Wallingford and the delivery was so fast for a Friday might. They said 45-60 minutes, but they arrived in 20! The portions were also generous. I will definitely be choosing Djan's from now on.", "Date": "2012-06-09", "Author_Location": "Seattle, WA"}, {"Author": "Duane M.", "ReviewID": "QoJ2ZJ6Nw7hLd5N_Z2cLjg", "Overall": "4.0", "Content": "Good thai food. We had the cashew chicken, vegetable delight, and tom yum soup. Order entrees to share because the portions are quite large. You'll probably need rice on the side too. Lots of cashews in the cashew chicken, and but 2 stars was a bit too spicy. If you're not sure, go with less spicy. I am spicy eater in our group order ed order ed order ed order ordered 3 stars and thought it was a bit too spicy. Overall good experience. We will be come to back if we are back in the area.", "Date": "2013-03-03", "Author_Location": "Seattle, WA"}, {"Author": "Lady G.", "ReviewID": "vuhp861Hkdupx7Fq_Jml7w", "Overall": "5.0", "Content": "Djan's is my favorite thai establishment in Seattle. It's a great, cozy, comfortable environment with deliciously cheap thai food. Their lunch special price and portions simply cannot be beat. The service is always excellent, prompt and courteous. I really can't say enough about how amazing they are and how fabulous their food is. The only thing that sucks is their parking lot, but for where they are located, at least they have one.", "Date": "2008-07-13", "Author_Location": "Seattle, WA"}, {"Author": "Jenny G.", "ReviewID": "AEAeNjCC0ljdpAicFZHyog", "Overall": "2.0", "Content": "I bought the yelp deal today on my way to Djans for lunch...only to discover that you can't use it on the lunch menu...irritating! I thought maybe I could just order one main entree and some sides and still order off the lunch menu cause frankly it's a good deal and I didn't feel like saving the coupon because I never eat here for dinner...didn't  work. I ended up having to pay full price for everything and maybe saved myself $1...but it certainly wasn't worth the hassle.  And after all that the Rama I ordered wasn't very good..I'm accustomed to it being seved over spinach...not iceberg lettuce (and broccoli and carrots)...it got really watery in the end.", "Date": "2013-01-14", "Author_Location": "Wallingford, Seattle, WA"}, {"Author": "Tyler F.", "ReviewID": "G7QXLZzPd9XHt7LsECZjTw", "Overall": "5.0", "Content": "The Garlic Chicken was great!", "Date": "2013-01-14", "Author_Location": "Seattle, WA"}, {"Author": "Hai Yen N.", "ReviewID": "ss4XutBtHsH7UkeSup-AXQ", "Overall": "3.0", "Content": "What sets Djan's apart from other Thai places is not the quality of the food but the atmosphere.  It is situated in a little white vintage house off 45th.  Hardwood floors, strategic and soft lighting and a spare, modern aesthetic make this place feel much higher class than your average Thai restaurant.  That being said, the food is decent.  Nothing ever tastes bad here but you can get better at other places.  I have enjoyed their fusion noodle (a mix of phad thai and phad kee mao), green curry and recently, the garlic lover's stir-fry.  If I am craving good Thai food and don't care if the atmosphere is up to par, I would go elsewhere.  But if I am craving decent Thai food to be enjoyed in a low-key, relaxed atmosphere I'd pick Djan.  I like that you feel you are having dinner in someone's home, like a dinner party.  And I agree with a reviewer below who mentioned that they charge for an order of rice even if you're ordering curry.  And we all know that no one eats curry without rice, so it's annoying and stingy of them to do this.", "Date": "2010-01-07", "Author_Location": "Seattle, WA"}, {"Author": "Marissa J.", "ReviewID": "-NBq9qK981zobMeORSNabw", "Overall": "5.0", "Content": "I love this place so much. Best Pad Kee Mao, Cashew Chicken, and Crab Rangoon I've had anywhere. Doesn't look like much from the outside but it's pretty cute inside. I've been going here regularly here for years and miss it already now that I no longer live in Seattle.", "Date": "2012-11-01", "Author_Location": "Washington, DC"}, {"Author": "Roku T.", "ReviewID": "wBa7QSNz8e1Z_1QhudlSPw", "Overall": "5.0", "Content": "as far as thai restaurant goes, djan is my favorite. the place is clean, staff is friendly, and i think of their green curry for days after i had it.", "Date": "2006-11-11", "Author_Location": "Seattle, WA"}, {"Author": "Kasey R.", "ReviewID": "1laofqh54LsrfizcYIhOlQ", "Overall": "4.0", "Content": "I love this place. I order togo all the time and they always get everything right and it is super fresh! I wouldn't recommend the Rama here, but everything else on the menu is outstanding!", "Date": "2008-11-05", "Author_Location": "Seattle, WA"}, {"Author": "Julia L.", "ReviewID": "7-E-hMltPQw6GVs8b_zy4g", "Overall": "5.0", "Content": "Good take-out restaurants are usually just that, for take-out only. Their atmosphere leaves much to be desired. Not so with Djans, Djan's is located in what used to be a house on 45th. It's all white, both inside and out, and had a very comfortable, airy, contemporary asian feel to it. It's a great place for a \"date dinner\" that won't break the bank but is romantic and intimate. They also have a party room upstairs that holds about 30 people. Oh, and the food? fantastic. Never too oily, great balance of flavors in the currys and a mix of standard thai fair (phad thai, phad see iew) as well as some signature dishes. Their prices are extremely reasonable, rivaling those of the cheap, atmosphere-less thai places everywhere else. Plus, they have a lunch special in which you get a mountain of food (curry, rice, a stir-fried noodle dish, a gyoza AND an entree dish) for about $7. Try this place immediately! But don't tell too many people, I still want to be able to get my take-out in under 10 minutes.", "Date": "2009-08-28", "Author_Location": "Seattle, WA"}, {"Author": "Janine S.", "ReviewID": "-YU6l2w9xfChx_qYdHEEJQ", "Overall": "5.0", "Content": "Located in the wallingford district by the university of washington, djans dining is at first hard to locate because it is right off of the freeway and looks like someones house. Once you find it, you will find that the parking lot is also like someones house, a tiny gravel patch which awkwardly sits about 4 cars max. Once inside though, the experience changes from one of WTF? To that of wowza! The interior is white, and very homely, with little decorations here and there which again adds to that \"someones house\" feeling, but this time in a good way. The music played is Brazilian boss nova, not very Asian but one of my favorite types of music, it adds a calming zen like atmosphere. The menu is great as well, there are a bunch of different varieties of choices, with the fusion noodles being my favorite. The portions are just right, and the presentation excellent, with a rounded piece of orange peel included in most of the noodle dishes. Make sure to check out the restroom upstairs as well, it has some interesting decor. Definitely recommended for a romantic, hole in the wall type of place!", "Date": "2010-08-07", "Author_Location": "Bellevue, WA"}, {"Author": "Derek R.", "ReviewID": "LjyMfmEugSg0i_GtO6vR3Q", "Overall": "1.0", "Content": "So were gettin ready for service this evening and were lookin thru the walk in and theres really nuthin we can spare for the ole familia meal....so we decide to order some delivery from djans.....OOOOPS!! they said the food would be about 45 min...respectable since it was Sat...but I really wonder if they were that busy...I'm just in from FL so I figure thai food heres got a be acceptable at least...even to open business in Seattle.......We got  fresh spring rolls....I dunno what they were tryin to pass off here...some kinda flour, what shoulda been rice paper tortilla with some fried white meat??? CHicken??? i dunno and a piece of cucumber...Weak!!! The beef vegetable delight was descent....edible at least...tasty vegetables....The Pad thai was an embarrassment and a disappointment...It tasted as my friend said.....\"MMMMM Ketchup Pad Thai\" gimme a break...and the brown rice looked like it sat in the steamer about 20 min too long....this was terrible food for alot of money....Take my opinion or leave it i doesn't bother me cause I will not be venturing here again!!!!", "Date": "2007-12-09", "Author_Location": "Seattle, WA"}, {"Author": "Raymond K.", "ReviewID": "XYcVgSirL_CG0bOpISjFsw", "Overall": "4.0", "Content": "I stumbled on this place as I was lost and needed a place to eat for lunch.  The restaurant on the outside looks like an old house.  The decor is nice and it is relatively clean, except for the seat cushions at our table.  We got the Crab Rangoon, Pad Thai, Djan's Fusion Noodle, and one of the curries, can't remember which color.  The Crab Rangoon, didn't really contain a lot of crab, and it had mostly cheese.  The Pad Thai was actually the favorite as it tasted good.  The Fusion Noodle came in second, and the curry was alright.  The portions were large, as it easily fed two men and two women.  The prices were pretty affordable and it was overall a decent experience.  I would come back here also if I am in the area.", "Date": "2011-07-12", "Author_Location": "San Jose, CA"}, {"Author": "jennifer c.", "ReviewID": "k1_rZ2gXDQVeT5Dj1Cs1lw", "Overall": "1.0", "Content": "Urgh.  So an hourish ago, I was perusing Yelp to find a decent Thai place that delivered.  I found a promising place on Lake City way that everyone LOVED but they didn't answer their phone.  Next time I guess.  Then I read some more and found one that looked good except for the reviewer who said there was dog crap in the corner.  Dog crap?  INSIDE a restaurant??  Whaa?  This is crazy, is Thai really that difficult?  So we called THIS place (which we have ordered from before, unmemorably in either direction).  Ordered pad thai, panang curry, and some beef salad thing.  When it arrived, via very nice delivery dude, it was not very nice food.  Disgusting is more like it.  Horrible.  Pad thai runny and musty and syrupy all at once.  Curry sweet, thick, boring, blah.  The beef salad however, was the worst.  It didn't even SMELL good.  Hot dry chewy beef turds with a little crappy cold lettuce and wilty onion and nasty dressing with weird little white flecks in it (I am guessing it was dried garlic powder).  I am now debating whether to call them and tell them how gross it was.  I want my thirty damn dollars back.  Nice delivery guy can keep the tip though.", "Date": "2008-10-20", "Author_Location": "Felton, CA"}, {"Author": "Sarah C.", "ReviewID": "17U3Ni4407bVffguuySz0Q", "Overall": "5.0", "Content": "This is my favorite Thai place in Seattle. The cashew nut chicken is my favorite but seriously everything is good. I enjoy going both for a sit down meal or getting takeout when I'm on the run. The service is always friendly and prompt. There is hardly ever a wait to sit so it is a great choice for a Friday or Saturday night when everywhere else has annoyingly long waits.  I have brought friends who live in other neighborhoods here and they now all drive to Wallingford for Thai food. Highly highly recommend!", "Date": "2012-01-08", "Author_Location": "Seattle, WA"}, {"Author": "Jamie F.", "ReviewID": "WDitrEltpwtgWa3YrdjTRw", "Overall": "5.0", "Content": "Whenever people ask me for Thai recommendations in the U-district or Wallingford, I recommend Djan's. It's the best quality Thai food, the most affordable, the best atmosphere, and the best service. It's in an old, white house on 45th, and the food is perfect. It's spicy, made with high-quality ingredients, and carefully prepared.", "Date": "2010-02-21", "Author_Location": "Seattle, WA"}, {"Author": "Rosa H.", "ReviewID": "qNRO2lsIhKCzKVCQ-1Qo9w", "Overall": "5.0", "Content": "My husband and I ordered food from this joint and it was unexpectedly some of the best Thai food I've ever had.  We ordered an egg plant dish and garlic chicken, it was seriously the most flavorful egg plant I have ever had.  Five stars no doubt.", "Date": "2011-12-28", "Author_Location": "Seattle, WA"}, {"Author": "J T.", "ReviewID": "pHT8PrOL2qx-02cHpVfikw", "Overall": "4.0", "Content": "I love this place, great food and they deliver to me which is even better. The garlic beef or tofu if awesome as is the djan fried rice and it comes with curry chicken pieces on top so it's a meal. Don't  order the pad se ew for delivery, it gets mushy, not sure how it is in house. My biggest problem with this place is the inconsistency on the spice stars. I've order 4 stars and 1 star on the same dish and it was exactly the same. Other times 1 start was 1 star. There's no way of knowing what you'll get at each visit. This is a major problem when sharing with a child or if your personal tastes are for the mild. If you like spicey then you'll have no problem. The restaurant itself is an old bugalow house on N 45th in Wallingford. Would be good for a quiet dinner but not great for kids as you can hear everyone else and kids would be heard for sure. Overall great food and service. Worth a try.", "Date": "2012-04-15", "Author_Location": "Seattle, WA"}, {"Author": "Jason K.", "ReviewID": "3-Oq6xoQC-rIDpPRRm-IEA", "Overall": "5.0", "Content": "Definitely the cleanest and freshest tasting thai food around the area.  I order delivery from here every couple weeks or so and the food always comes on time and hot.  Only complaint is that soemtiems I'll ask for 4 or 5 start spiciness and it's still not strong enough for me.", "Date": "2012-05-28", "Author_Location": "Seattle, WA"}, {"Author": "Reviews A.", "ReviewID": "Vw82O4YyDZgg6pvdsOKZTA", "Overall": "2.0", "Content": "This used to be my favorite Thai place in terms of flavor, I've never really liked dealing with the people who work here, though.  Last time I went, though, the food was tough and the flavors were muddled, the service was awful (bad attitude, late.... the appetizers came out with the food, etc.)  I know they were busy that day but because the flavor was so subpar, I don't think I will ever be back.  The atmosphere is great, though.", "Date": "2010-05-08", "Author_Location": "Seattle, WA"}, {"Author": "Jen W.", "ReviewID": "nDOGiklRZy69dGddMBP8xg", "Overall": "5.0", "Content": "I have searched everywhere in Seattle for a restaurant that makes Pineapple Fried Rice as delicious as they do in Portland, OR.  At long last, I have found my new Thai delivery!  I will only order takeout from this restaurant from now on.  Friendly staff too!", "Date": "2010-12-19", "Author_Location": "Seattle, WA"}, {"Author": "Glenn F.", "ReviewID": "uNBBER3Uhshnrsdca51LlQ", "Overall": "3.0", "Content": "I want to love this place but it falls shortt.  It's in need of a little tidying up on the interior.  The seat cushions are stained, the walls are dingy, lighting needs replaced, and it does not appear to have a wheelchair accessible bathroom.  How can that be possible without being in violation of city code?  The food is good overall but on the pricier side of Thai food.  The waitstaff are always friendly but it does not make up for some of the things it lacks in terms of ambiance and necessity.", "Date": "2011-05-30", "Author_Location": "Seattle, WA"}, {"Author": "Teddy W.", "ReviewID": "2M3ZR_Iwaxe94HHY73_hYA", "Overall": "4.0", "Content": "Definitely a favorite of mine. My wife and I came to this place on our first date, and come back regularly. Highly recommend their Chicken Pad See Ew, and the Vegetable Delight (my wife's favorite). It's a fun little place, and has a couple of parking spots out back. Reasonably priced, fast service.", "Date": "2011-06-02", "Author_Location": "Portland, OR"}, {"Author": "Pamela J.", "ReviewID": "gBinxFm3FteIiZosGXL3Wg", "Overall": "1.0", "Content": "I used to be a fan of this place but after tonight I will never use them again. If I could I would give zero stars. First off, the girl taking the order and my information over the phone could barely speak English and could barely understand me- I had to repeat myself several times and it took almost ten minutes to place the order due to her lack of understanding the english language. Then after almost an hour they called saying the card didn't go through and after going over the information discovered they wrote down the wrong card info, THEN twenty minutes later they called again because they were lost and after talking to the guy found out they wrote down the wrong address!! After almost 90 minutes they finally showed up and discovered that they put the wrong number of stars on the meals and after taking the first bite I found HAIR in the food!!!! I was so pissed I called the restaurant and demanded a full refund and again I had to repeat my name several times because they couldn't understand what I was saying!!!! My name is Pam and the girl kept saying, \"Emily?\". I am surprised and very annoyed by their complete incompetence and will never order from them again. I strongly advise going elsewhere.", "Date": "2012-01-04", "Author_Location": "Wallingford, Seattle, WA"}, {"Author": "Ruby G.", "ReviewID": "zH7ssM5RhqBd9Mk3gcTC0g", "Overall": "4.0", "Content": "I've eaten here once and ordered delivery a couple times. For me, the delivery has been great. The food usually arrives on time or earlier and it's still pretty warm. My two favorite dishes are Joy duck club, the pad thai, and the crab rangoon appetizers. The duck is crispy, and I like that. I usually order a spiciness level of 3-4, but the spiciness that I get varies. Sometimes it's way too mild, and other times it's just right. For my boyfriend, who always gets a 5, djan's is usually not spicy enough. Overall, I like the flavor of djan's food, but it's not always spicy enough.", "Date": "2012-02-22", "Author_Location": "Seattle, WA"}, {"Author": "Lucy C.", "ReviewID": "87ynGH5K4cVcTR1G6ZvcLQ", "Overall": "2.0", "Content": "I ordered a lunch combo from here last week (for delivery), and the pad thai was both flavorless and mushy. I mean, these aren't noodles that have been soaking in water for a few days straight, so why are they mushy?! Satay was good but I've had better - the flavor didn't make its way through much of the meat at all.", "Date": "2012-03-26", "Author_Location": "Seattle, WA"}, {"Author": "Alcie M.", "ReviewID": "-ZAF12BJ2_Se-hK0pdQgOQ", "Overall": "3.0", "Content": "I'll preface this by saying that the food was delicious.  I had the cashew/tofu dish and it was excellent though for strict vegetarians be aware that it has oyster sauce in it.  In fact my whole experience was going well until the bill came and I realized they don't take Amex and that my Visa wasn't in my wallet nor did I have any cash.  I couldn't pay on the spot and you'd think I had committed some horrible crime.    I had to run home and I offered to leave my Amex card and phone number which they held on to and I came back within the hour and they were more friendly but geez they really treated me as though I was a very untrustworthy person who wasn't going to come back. I had my one year old daughter with me and I don't think I look like the type to dine and dash without paying (whatever that type might look like).  I'll admit it was pretty spacey of me to not consider beforehand that they might not take Amex, but hey, they can't fault me for having the means to pay but not the means that worked for them.  Needless to say, though the food was good I am not going to a place again where they make me feel like a worthless piece of crap for an honest mistake.", "Date": "2013-06-07", "Author_Location": "Seattle, WA"}], "RestaurantInfo": {"RestaurantID": "_IC0KsGR4AV4P9TTjEwOrg", "Name": "Djan’s Dining", "Price": "$$", "RestaurantURL": "/biz/djans-dining-seattle", "Longitude": " -122.32541", "Address": "264 NE 45th StSeattle, WA 98105", "Latitude": " 47.661541", "ImgURL": "//s3-media1.fl.yelpcdn.com/bphoto/6Nc047xxc44_xvKmEQsv8g/90s.jpg"}}