{"Reviews": [{"Author": "Lena D.", "ReviewID": "V0eN8fTcUKNpkngPHtsA4Q", "Overall": "5.0", "Content": "just had lunch - one of the pre-fixe lunch specials - $12.50 for the 2nd lunch combo - salmon sashimi, rice, chawanmushi  - egg custard w seafood, miso soup, shrimp tempura - all super fresh and very very tasty!  I can't wait to go back!food came out fast, they were pretty packed with a line waiting however we took up the two bar seats - great deal, value, perfectly satisfying!also, i must add, very friendly and courteous service.", "Date": "2014-06-19", "Author_Location": "Financial District, Manhattan, NY"}, {"Author": "Clinton L.", "ReviewID": "50_QV8ZTOVsle8qBAxC7OQ", "Overall": "4.0", "Content": "My colleague and I randomly Yelped this restaurant for a business meeting. We were seated promptly upon arrival and the waitstaff was attentive to our needs. Very welcoming atmosphere, clean and well-lit. Service was excellent and I appreciated all the little things--putting our sake bottle in a shallow dish of ice, the warm hand towels in the beginning, the humble mannerisms of the waitstaff and the complimentary green tea at the endIf you order sashimi or sushi (as I imagine most would) it comes out very quickly. Granted, we were there past peak hours (close to 8:45 pm) but the restaurant was still probably about 80% capacity and quite busy.The portions of sushi, while not voluminous, were generous and delicious. Very appropriately priced for what you get. If ever you are in this neighborhood and would like quality Japanese food at a sit-down place with comfortable ambiance, I would definitely recommend Wajima.", "Date": "2014-05-21", "Author_Location": "New York, NY"}, {"Author": "Althea L.", "ReviewID": "5-js9yEUtD4R_BRzdDfQig", "Overall": "4.0", "Content": "Lunch special is now $12.5 ( was $11). My husband and I both got the first set: chirashi: 5 pieces of sashimi and a tamagoyaki (Japanese omelette) over rice. tempura: 2 pieces of shrimp and 1 broccoli over rice. cold soba noodleschawanmushi (steamed egg)miso soupAll come in small portions and its a perfect combination for a day when you want to just have some varieties of Japanese food at once. The sashimi from the chirashi is pretty warm and tasted like pre-cut, which I was pretty surprised. Tamagoyaki was really good and well-done ( which is very difficult to make and I am sure they have a skilled team in the kitchen). Tempura was fried quite fair, but the sauce was already added-on ( have never seen this before), and if you don't eat it soon enough, they become soggy. Soba noodles came in the sauce (which looks more like a cold soba noodles soup) and covered by freshly cut big green onion slices. The flavor of the soup, green onions and seaweeds all together made it a satisfying dish. Chawanmushi is flavorful and silky, and miso soup is  pretty authentic. As this price, we both were very happy with it. Also, this is a place obviously not one for children. it's small and during lunch time it is just packed with people work in the area. We brought our toddler and she was asleep in the stroller. The staff were very friendly and gave us a table for four to have stroller well-situated.", "Date": "2014-05-15", "Author_Location": "Upper East Side, Manhattan, NY"}, {"Author": "Bluest X.", "ReviewID": "0BTGpxRzrn8WiP97RgXGlQ", "Overall": "5.0", "Content": "It's traditional Japanese food. Good! $16 for one in lunch special with taxes and tips. A little expensive. But Nice place for lunch!", "Date": "2014-07-10", "Author_Location": "Bayside, Queens, NY"}, {"Author": "Conscience C.", "ReviewID": "2xkh0iMSN-Ad6ipT6_Ig1A", "Overall": "4.0", "Content": "What a find! Wajima works on so many levels.As a lunch place they get you seated and served quickly and promptly. They understand the lunch crowd is often on a tight schedule.  They offer fresh fish , a great selection and offer attractively  priced lunch specials.  What's not to like?  They even serve Natto handrolls!", "Date": "2014-07-09", "Author_Location": "Manhattan, NY"}, {"Author": "Hannah S.", "ReviewID": "oLuoLFW_-Ed-_QBwtWkxTw", "Overall": "4.0", "Content": "This place was great. I was initially worried that this place would be a hole-in-the-wall joint that I would get food poisoning from. Let's just say that I was wrong. This little place is actually really nice with a lot of great lighting and decorations. We were the first people to eat there on a Sat night around 6 when they opened for the night. I had the deep fried udon which was in an amazing smokey flavored broth and was just full of flavor-I thought it was great. Someone in my family is allergic to shrimp and some things just come or are made with shrimp without them advertising it on their menu, that wasn't acceptable when his dish came with 2 pieces of friend shrimp on the top. The vegetable tempura was delicious. I'd be happy to return, but, WATCH OUT FOR ALLERGENS!!!", "Date": "2014-06-14", "Author_Location": "Huntington, NY"}, {"Author": "Crystal L.", "ReviewID": "62XanSzMcn-J-kLbY78Yow", "Overall": "2.0", "Content": "I came here for lunch, but I didn't order the lunch special which was my mistake.I ordered two sushi rolls - spicy salmon and avocado & eel. Both were mediocre and very small for ~$7/roll. The service was pretty bad when we first walked in - we were ignored for a while even though there were empty tables, even after speaking with someone.The lunch special for $12.50 looked good though, might consider coming here again to try that but don't order the sushi rolls a la carte.", "Date": "2014-06-12", "Author_Location": "Markham, Canada"}, {"Author": "Christina C.", "ReviewID": "bBLrETPqG9OxVbvs9nqK2Q", "Overall": "4.0", "Content": "Just finished the salmonzen set lunch! It is a tasty and fulfilling lunch.  I like the variety: 4pcs of raw salmon over rice, chawanmushi (steam egg), 2pcs of prawn tempura & a bowl of miso soup. All for $12.50. With tax & tips, I paid less than $16 for a good meal.  Service is fast & personable.", "Date": "2014-04-22", "Author_Location": "New York, NY"}, {"Author": "Kamila R.", "ReviewID": "TmDf2rCfhpItWiAHObROiw", "Overall": "4.0", "Content": "The food here is absolutely delicious and the pricing is not so bad either! I order the chicken sukiyaki which you get to cook at the table yourself on a cute mini stove top. With the meal I received 3 different vegetable sides, white rice, green tea and green tea ice cream. All this came include in the \"dinner\" price which was pretty good considering all you get. The green tea ice cream was absolutely amazing! Who would've thought? We also ordered edamame and the seafood egg dish for appetizer both were scrumptious. I find no issues with the food here whatsoever. By the time I left I was really full but it was a satisfying full where 8 didn't feel distrusting because the food overall was healthy, clean options. Staff is very friendly and place is very clean. Not too grand of a selection of drinks but you can definitely find something. Definitely a place I'd go back to.", "Date": "2014-02-15", "Author_Location": "Marlboro Township, NJ"}, {"Author": "Harue J.", "ReviewID": "GKkU3MIh5UVSnyDWwPAQZw", "Overall": "3.0", "Content": "A quiet place that serves decent, straightforward popular Japanese dishes.  Nothing fancy but comfortable.  They have set menus that are good deal.", "Date": "2014-05-06", "Author_Location": "Manhattan, NY"}, {"Author": "lillian l.", "ReviewID": "wGQCxc8XhX4yO0oJAEhheQ", "Overall": "5.0", "Content": "Awesome lunch special. $12.50 for a tray with (all mini portions): shrimp tempura (2 pieces over warm rice)cold soba noodleschirashi (sashimi over sushi rice)chawanmushi (steamed egg)miso soupThey are pretty busy as soon as they open at noon, but food comes up very fast and the wait it only about 10 - 15 mins throughout the lunch hours.Everything was delicious - can't wait to come back!", "Date": "2014-04-10", "Author_Location": "New York, NY"}, {"Author": "tryptophan n.", "ReviewID": "PckF8zAuy5DYUSuAl1EhGg", "Overall": "4.0", "Content": "Dinner for 2, fridayAge dashi tofuUdonsukiTempuraa roll of some sortAll delicious.Udonsuki is meant to be shared, full as I was, I didn't suffer finishing it.  Piping hot, will steam your clothes, and dominate the table if you're at a 2top.Age dashi tofu had an initial crunch that's so elusive, not a chewy blanket face down in the sauce.Tempura, bright and crisp, great flavor, clean oil.ServiceGracious and unhurrying.Between the undonsuki tableside and the timing of delicate, fried dishes arriving at their peak, you can feel the level of attention.Spare and well divided space that balances openness and privacy and intimacy.  This does not read as well from the front/entry as it does from being seated at the tables.", "Date": "2014-04-15", "Author_Location": "New York, NY"}, {"Author": "Kimberly L.", "ReviewID": "814G2hIEDGkBN8lVqFIevg", "Overall": "4.0", "Content": "$11 for lunch, in this neighborhood?  It's UNREAL.  Working in this horrible wasteland of midtown east/UES there are legit no good spots for lunch under $25-$40.  How have I missed Wajima for the past 3 years??  Well...I guess I will be playing catch up.Other than the slight language barrier with our waitress, I would have given 5 stars.  My co-worker asked for a \"soup spoon\" and she looked at us like we weren't speaking English.  \"Soup spoon for the soup\" Nothing \"Spoon (this time with a motion over the miso soup)\".  Then she says \"Spoon?\" Oh. yes.Anyway, arrive around noon to beat the crowd and I promise you won't be disappointed!", "Date": "2013-11-20", "Author_Location": "New York, NY"}, {"Author": "Donna F.", "ReviewID": "nrwmmpc0If--4MoIdFbVpg", "Overall": "2.0", "Content": "It must have been an off night. At least, that's what I've been telling myself for the past two weeks since my boyfriend and I had a fairly underwhelming meal at this place on Saturday 12/28/13. Where should I start? Well, for one thing, even though the restaurant wasn't crowded when we sat down, it took a very long time for our waitress to appear, and progressively longer intervals passed as we waited for drinks, appetizers, entrees, etc. I also noted that it seemed there were only about 3 servers working the tables. Couldn't find people willing to work over a holiday weekend, Wajima?Anyway, back to the food. I decided to order  the crab with seaweed appetizer (can't recall the name of the dish), and when it came out (after roughly 20 tedious minutes), I was disappointed. Five little dollops of imitation crab meat over a bed of wilted seaweed. It's a good thing I was starving and had some wasabi to give them a hint of flavor. The sushi entree....hm. Not horrible, but definitely nothing special: three tiny rolls filled with spicy salmon, tuna, and yellowtail (at least I think that's what they were made of, they all tasted the same) and smeared with globs of spicy mayo. My boyfriend got the Shabu Shabu and wasn't thrilled with it, but it was good enough to prevent hunger pains. There were a few highlights interspersed throughout the meal: I enjoyed the sake, and their green tea was also good. I also thought the hostess was nice to offer us a space to place our heavy shopping bags so they wouldn't get in our way at the table. But overall, I felt deflated by the experience, especially after having read all the stellar reviews on Yelp. Would I come here again? Probably not, but I might change my mind over time.", "Date": "2014-01-10", "Author_Location": "Hoboken, NJ"}, {"Author": "Lisa B.", "ReviewID": "WZu3l7iU5wcdeuIcwQ5A-Q", "Overall": "5.0", "Content": "Wow, I'd forgotten how good sushi could be.  We ventured to Wajima on a cold November day based on the positive yelp reviews, and we were not disappointed!  The lunch specials are affordable for the neighborhood ($15ish), and the meal was impeccable from start to finish.  Authentic green tea, flavorful miso soup...even the rice had the perfect consistency.  The sashimi literally melted in our mouths, and the meal was complemented by excellent service.  The restaurant is small, so it's probably best for groups of four or less.Highly recommended!", "Date": "2013-12-01", "Author_Location": "Austin, TX"}, {"Author": "Jocy C.", "ReviewID": "vjfz7mtumTDVPh-d926rtA", "Overall": "4.0", "Content": "Wajima Japanese Restaurant is an easily missed restaurant in midtown East.  Plain storefront in a quiet neighborhood.  I was introduced to Wajima by a fellow coworker for dinner... and this place did not disappoint.  It's a hidden gem (for dinner anyway)!Wajima is an authentic Japanese restaurant - not like the myriad of Japanese restaurants that are Chinese owned.  Zagat proudly boasts Wajima as the \"real\" taste of Tokyo \"without the long trip\".Their Agedashi Tofu, Sukiyaki (Japanese Hotpot), and their Sushi/Sashimi are good items to get.  The Sukiyaki is cooked at your table and served hot.  Sushi/Sashimi are fresh.  Dinner portion size also comes with soup and dessert (green tea ice cream).  YUM!", "Date": "2013-10-26", "Author_Location": "San Diego, CA"}, {"Author": "Mike R.", "ReviewID": "XlHe5WPAujCJDM7xmo1R4g", "Overall": "4.0", "Content": "Most of their foods are pretty good, should try the fish egg pasta-Yum!Seats are pretty crowded so good chance of waiting to be seated, especially on Fridays and weekends.They also offer fair amount of alcohol selections", "Date": "2014-02-03", "Author_Location": "Wallingford, CT"}, {"Author": "Allene T.", "ReviewID": "1ehtgreO2G6Dk-WPWbe4PQ", "Overall": "4.0", "Content": "After seeing a friend's picture of the Sanmizen $11 lunch special on Instagram, I was immediately sold.  The next day, coworkers and I ventured into the UES for some Japanese.SOLID lunch combo - 5 dishes for $11 - reminds me slightly of dimsum without the choosing.1. Miso soup - yum2. Tofu/egg/seafood/mushroom thing - my favorite of the set.  It's hot and super flavorful.. I would order it on its own.3. Soba noodles - be careful - theres a thing of wasabi on top.  This cold noodle was refreshing4. Ten don - 3 pieces of tempura (2 shrimp, 1 broccoli) over rice.  The tempura batter was pretty soggy when I got to it, but nonetheless flavorful and tasty.  A little greasy for my liking, but what do you expect from tempura?5. Chirashi - 4 slices of fish + egg over sushi rice.  Fish was fresh, but a little warm for my liking.Great mix of food - your taste buds won't get tired of your dish.Best lunch I've had in a while, and all for $11!  Will be back when I feel like venturing up to UES again.", "Date": "2013-09-19", "Author_Location": "New York, NY"}, {"Author": "Rob P.", "ReviewID": "5cCK4IkEWFsa7jPOhCSonA", "Overall": "5.0", "Content": "A bit pricey but you get what you pay for.  More authentic Japanese cuisine with some items on the menu that I was curious to try.  Service and atmosphere all very nice.  I'll be back.", "Date": "2014-02-15", "Author_Location": "New York, NY"}, {"Author": "Wing C.", "ReviewID": "m8VgOw05gX5ww65g_bGEQg", "Overall": "4.0", "Content": "After reading fellow yelper, Allene T's review and learning about their $11 lunch set, I immediately bookmarked Wajima as my next to eat lunch destination. My fiance, his aunt, and I arrived at 12PM. There were only about 3 occupied tables at that time and we had no trouble being seated. By 12:15 when we placed our order however, the place was full house. There were parties gathering around the front entrance waiting for a table to become available. So glad we came right before the lunch rush! They have the regular lunch menu available but it was a no brainer for us to go with the lunch specials. They have 3 choices and we decided to order one of each. They didn't have tuna sashimi rice bowl that day so they asked if we are okay with salmon sashimi instead - sounds perfect to me. The food came relatively fast and everything tasted spot on. The shrimp temperas were nicely breaded with perfect crunch and seasoning. The sashimi were really fresh. The cold soba noodle was extremely refreshing! The steamed egg had a nice kick of ginger. The miso soup was a little bit too salty but still delicious. An amazing lunch set all for $11. My fiance had the sukiyaki beef + tofu and hot soba noodle set. He said he wasn't blown away by the soba noodle but still very satisfied. His aunt's lunch set basically had everything in mine except hers didn't come with soba noodle and it was an all salmon bowl - she also was extremely happy with hers. Service was a little lacking - our waiter/waitress never came back to check on us after serving us the food, our water glasses were empty throughout the entire meal. Nevertheless - 3 lunch sets for $39 dollars including tax in midtown! - what a steal!", "Date": "2013-10-09", "Author_Location": "Washington, DC"}, {"Author": "Alice C.", "ReviewID": "FTTP25WwrKGVcIYRhpiqxA", "Overall": "5.0", "Content": "Love the food in Wajima. They are very high quality and reasonably priced. They serve authentic Japanese food. I love everything they have on the menu. Especially love their tempura, sukiyaki, sushi, anything with salmon. You will know they are your go-to sushi place when you had their sushi. It's served at the right temperature, just like the ones in Japan. You also get the Japanese service. Everything is down to the details. When you go there for dinner, they give you these cute and yummy dishes for starters. I go there when I crave for a simple but good Japanese meal.", "Date": "2013-12-19", "Author_Location": "LONG ISLAND CITY, NY"}, {"Author": "Audrey I.", "ReviewID": "HeSkOED7h_Q02yKoBc8-Gg", "Overall": "4.0", "Content": "Lunch here is the best deal I could find in the neighborhood.. the quality of food is MUCH better than \"so called japanese fusion food\", tiny bit less than super fancy restaurant, BUT the price is the same or less than the fusion-confusion Japanese restaurants.At night, they have shabu-shabu, sukiyaki, etc which are served at the table, it's plenty of food plus, appetizers (authentic japanese) and i think dessert, really good deal again!!!! I go there 2-3 times a month, it's casual but clean environment so it can be perfect for girls' night out if you want to sit and eat good food in more quiet environment, or get cozy with your lover :) However, I would not use this place for romantic date, if that's what you're looking for. It's definitely more cozy and casual, than cool and romantic.My fav are the dinner deals, tempura, sashimi etc, it's cheap and comes with a lot of food, yet good quality.The hostess are very nice and hard working..which adds to it.I find the drinks to be more on expensive side, for the food being so cheap but maybe that's how they have to make money..! Syochu and sake is ranging from $9 to $15 per  a glass, but the glass is so small. Overall, it's a place to go if you're hungry and want a good food with less money in mid/up town east!", "Date": "2014-04-08", "Author_Location": "New York, NY"}, {"Author": "William W.", "ReviewID": "hfAkzM9fSeR1j4ETYYNaog", "Overall": "5.0", "Content": "Love the food. It is a simple low key excellent Japanese Restarunt with reasonable prices. I had the sushi - sashimi combination at $25. It was better than the more expensive sushi on the upper east side", "Date": "2014-03-23", "Author_Location": "New York, NY"}, {"Author": "Darwin P.", "ReviewID": "9_5C5UG8rMrPlMPtID4wdA", "Overall": "5.0", "Content": "Best experience ever!  Lots of unique things to try.  Sashimi, sunomono, agadashidofu was all great.", "Date": "2014-03-08", "Author_Location": "Calgary, Canada"}, {"Author": "Eponine J.", "ReviewID": "SP_Uv9nUl_mYu7WQuBMIRw", "Overall": "4.0", "Content": "you know when you go to a legit jap restaurant and you want to order every single appetizer. you are lucky here as all the appetizers ive tried turned out good.get the sashimi. it melts.", "Date": "2014-02-20", "Author_Location": "New York, NY"}, {"Author": "Margaret F.", "ReviewID": "O5E_jOxHvjKURZ0DXNHM8Q", "Overall": "5.0", "Content": "Note: This review is only based on the Sanmizen lunch special (tempura over rice, chirashi, chawanmushi, cold soba, miso soup). The lunch specials here seem great and definitely worth the price. I was eyeing this place for three weeks after I saw the FABULOUS \"sanmizen\" lunch special. $11 for all of that?! I definitely wanted to try it. So today I was finally able to come here with a friend. We got here just before 12 PM when it opens but they let us in cuz it was freezing and we were seated right away. Soon after though, this place got filled quickly so if you get here right in the middle of the lunch hours then you might have to wait a bit. Of course I ordered the Sanmizen lunch special (as of 2/28/14 it's still $11) while my friend got the third option of the lunch specials (as of 2/28/14 it's $13). While we were waiting, we were given some warm towels which were greatly appreciated, and some green tea. I'm not sure if they always give out the towels or if it was just because it was freezing today, though. The food arrived shortly after and the portions are smaller than they seem in the yelp pictures. Pictures are difficult to capture the exact size. Nonetheless, it was really filling. All parts of the lunch set were delicious. Tempura was a bit soggy when it got to me but it still tasted fine. As for service, they seemed polite enough. Just not overly welcoming/enthusiastic. One of the waitresses refilled our cups of tea while we were in the middle of eating, but she never smiled. The actual restaurant is super nice, too. Looks very clean, modern, and has Japanese (?) paintings decorating the walls. I will definitely return if I'm in the mood for a great lunch special deal and in the UES area.", "Date": "2014-02-28", "Author_Location": "OAKLAND GARDENS, NY"}, {"Author": "Bo J.", "ReviewID": "y4_Al7IqNBV2HGSnSyf8wQ", "Overall": "4.0", "Content": "Pretty dope lunch spot if you're in the area. The $11 lunch combo is solid. Essentially there are 3 options with various combinations, but I usually get the sanzimen (sashimi, rice, tempura, soup, etc). The ambiance is pretty solid -- usually really bustling during lunch, but the noise isn't bad at all and I usually get seated quickly. The staff looks a bit overworked sometimes, but generally the service is pretty good.", "Date": "2013-08-09", "Author_Location": "Manhattan, NY"}, {"Author": "E K.", "ReviewID": "YhWjo-3nb2bNv-3Q5ss3Zg", "Overall": "5.0", "Content": "Awesome lunch special! $12.50 for everything!! Quality food that's cheap with large portions. Had the sanmizen. Everything was delicious. I really liked the steamed egg. It was seasoned well, and the sashimi was fresh too. Service was fast as well.", "Date": "2014-04-23", "Author_Location": "Orange County, CA"}, {"Author": "Valerie Z.", "ReviewID": "P4btGZZ89TyO1YaG2s-d5g", "Overall": "4.0", "Content": "I had a early dinner set of edamame, miso soup, eel and avocado roll, salmon roll, and green tea ice cream with red bean. Everything was tasty, though I wish the sushi rolls had been larger. My friend had chicken teriyaki and the serving size was much larger. Even so, the portions for everything else were good. The service was also really great. The waiter paid great attention to when my friend and I finished each course so that the next course came only seconds later. The ambiance was really calm as we had come in early.I'm not from near NYC, but if I come back, I hope to try the sukiyaki.", "Date": "2013-04-19", "Author_Location": "Outer Richmond, San Francisco, CA"}, {"Author": "Julia B.", "ReviewID": "VmyACmxkwcG-pYoJWLJ7iQ", "Overall": "4.0", "Content": "3.5 stars.When you and a friend discuss Jiro Dreams of Sushi and their plans to visit Japan, a craving to have suhi comes oh so naturally. A quick search on Yelp took us here and Wajima gave us the perfect spot to catch up, eat good sushi & sashimi and leave happy with how gentle it was on our wallets.The first thing I noticed when we walked in was how quiet it was despite how busy it was. That is always a good thing in my book. I like that the decor is understated and simple, which allows you to focus on the food rather the decor. The menu is simple and their sushi & sashimi combo deal for $25 is a steal - both of us went with it and enjoyed what we got.I don't eat sushi much in NYC but should I find myself in the area, I'll definitely return Wajima again! While it's a couple blocks away from the subway station, it still feels tucked away, which I feel is hard to come by in the middle of Manhattan.", "Date": "2013-01-10", "Author_Location": "Brooklyn, NY"}, {"Author": "Joe C.", "ReviewID": "UsunyezxF8tIiCpCg6qCyA", "Overall": "4.0", "Content": "Excellent sushi, when you factor in location, service, atmosphere and the quality of the fish ... this place is my #1 in midtown east.", "Date": "2013-11-09", "Author_Location": "Los Angeles, CA"}, {"Author": "Eva W.", "ReviewID": "onYYTyS0vk3I5-eXHgViIA", "Overall": "3.0", "Content": "Not that great. The employees aren't that friendly, and the place is a bit dingy. The waitstaff is Japanese, but the patrons are mostly white.For entrees, they have have a la carte and dinner options, which includes a soup and dessert. We started off with the scallop sashimi, which wasn't as buttery and soft as they usually are. I had the shabu shabu, which I found really tasteless even with the dipping sauces. Dining partner had the negimayaki, which he enjoyed, but I found a bit overcooked.Not worth it at the price point.", "Date": "2012-12-27", "Author_Location": "New York, NY"}, {"Author": "D C.", "ReviewID": "bW05wdg4GB1IzMQUpHKUfQ", "Overall": "4.0", "Content": "Legit sushi in upper east, more authentic and much better value than sushi of gari. My kind of sushi joint, will visit again.", "Date": "2014-04-24", "Author_Location": "Clarksville, TN"}, {"Author": "Caesar R.", "ReviewID": "HSk81mXS-N5OCD6aHU3hFA", "Overall": "4.0", "Content": "$11 lunch special is the way to go!  There are three options.  2 of the options have chirashi style rice bowl with raw fish and shrimp tempura.  The third option is a beef sukiyaki with fried tofu.  Service is quick and efficient.  All the food comes out fresh and hot.  The sushi rice on the chirashi dish was the best I've had in a really long time.  Definitely an authentic Japanese spot to enjoy a quick lunch at a great price.", "Date": "2013-03-14", "Author_Location": "Brooklyn, NY"}, {"Author": "Victoria O.", "ReviewID": "igEQAJO8RrZM9eg3ynHJSg", "Overall": "2.0", "Content": "I ate here tonight because Circus was closed for a private event. I give it 4 to 5 stars for decor. But I have to say as far as value and quality (based on the sushi and the tempura), I prefer Ginza which is not a hole in the wall with ugly walls by any means. It's definitely better looking, though, with a lot more space between tables. The cold sake list is quite good and I had two individual servings of the Sakawone (sp, I didn't write it down). The miso is particularly good and I came down with a bug in New Jersey this weekend so that was comforting. My friend and I were perplexed as to why we were brought hot tea halfway through the meal (between appetizer and entree) and he thought it was quite bizarre that he would be served tea in the middle of his beer. I would not come here by myself or choose to come here with a dining companion again when Ginza is around the corner but it is a nice place with good though not great sushi. (Really, the salmon, tuna, yellowtail don't hold a candle to Ginza though Ikura was good).I'm sure I would think it a 3 or 4 star if I tried the lunch special everyone is talking about but since Ginza has THE most amazing Bento box which includes soup, salad, two baby shu mai dumplings, I don't know why I would try it. Friend called me and said, \"We won't be going there again. It had all the charm of a washboard.\" Actually, the ambiance was the ONE 5 star part of this. It's not a normal sushi joint but Ginza is pretty cute with the wood walls. I admit I love sukiyaki and might try that but given I have had various appetizers and cooked food at Ginza and been happy always, I doubt I would give it a try here.One last note: my friend ordered sushi not in a combination but individually. He eats sushi rarely and only likes a few kinds of fish. He is a foodie and Manhattanite of 30 plus years for whom food was central part of life and work and he thought it was \"quite expensive.\" I explained that of course it was, as he ordered individual nigiri at night. But this place, in addition to not that fabulous, is overpriced.", "Date": "2012-12-17", "Author_Location": "Santa Barbara, CA"}, {"Author": "Jing M.", "ReviewID": "ZltMiMvGJfyN2JsMjIKi6g", "Overall": "4.0", "Content": "I'd say their food is very good, but is a little bit pricey given the quality of the food. The location is convenient to get to, as it's close to central park and fifth avenue. I tried their Tofuagedash, which is fried and has a little bit sweet flavor. I enjoyed it. The sashimi is tasty too. The serving is not too big, which might be good for someone who doesn't want to spoil their stomach.", "Date": "2013-06-27", "Author_Location": "Ann Arbor Charter Township, MI"}, {"Author": "Ufei C.", "ReviewID": "67hrDqJshqD0V3yANZYcFQ", "Overall": "5.0", "Content": "I had the lunch special and was pleasantly full afterwards. For $11, you really can't beat this. Fresh Chirashi, soba noodles, miso soup, tempura and a really smooth steamed egg. The portions were just enough to give you a few bites of each and to leave you full at the end.", "Date": "2013-11-27", "Author_Location": "New York, NY"}, {"Author": "Carlin Y.", "ReviewID": "-qJMlr9UiIfVkXnzENLK4g", "Overall": "4.0", "Content": "Ok, listen up. This place probably has the greatest lunch deal you will ever find at a Japanese restaurant in Manhattan. I'm telling you now, this review is ONLY FOR LUNCH. Everything is WAY too expensive on their menu for how it tastes, BUT if you go there for lunch, they have this awesome lunch special for less than $13 that includes a delicious variety of shrimp tempura, miso soup, steamed egg, sashimi bowl, and soba noodles. It's absolutely delicious and totally worth it; I've yet to find another place that does it like they do. Service is ok, not the greatest but not terrible either. Price for quality and quantity of food is totally worth it with the lunch special. Anything else on their menu is kinda out of bounds unless you've got money to spend. Would totally come here if I ever was in the area again for lunch!", "Date": "2012-11-22", "Author_Location": "New York, NY"}, {"Author": "Lianne C.", "ReviewID": "EsnKub0qqxUmf-Kx-Ds7hw", "Overall": "4.0", "Content": "Consistently quality sushi & sashimi, with a healthy serving of authentic Japanese offerings on the menu. Everything is good. Their sticky rice is exemplary. And the price is absolutely right for the location, the quality of the food, and the attentiveness of the wait staff. It's our go-to place now when we crave Japanese.", "Date": "2013-11-30", "Author_Location": "Queens, NY"}, {"Author": "Jennie W.", "ReviewID": "_RzEv8AxcLBY_CV0ZYGvTA", "Overall": "2.0", "Content": "I checked out Wajima on a Friday night after reading good reviews of it on Yelp. What you can't tell on Yelp is that the prices are way jacked up for a Japanese restaurant  - you're looking at spending at least $30/person (the high end of $$ or low end of $$$). It might be because it's near such a large tourist shopping area or because it's surrounded by lots of overpriced \"fusion Asian\" or kitschy ethnic places that can get away with overcharging their customers. I'm sure this place is great if you're willing to shell out extra for Japanese food, but I wouldn't come here for a regular evening meal.Besides that, the place was full, a crowd of mixed tourists and Asians, the waitstaff all Japanese, and the decor kind of bland and brightly lit.My friend and I ended up going around the corner to Ginza Japanese Restaurant, which had lower prices (~$15-18/person). We were skeptical because of what I'd read on Yelp and because it looked like a non-Asian crowd, but the food was great and we paid a normal amount.I will come back to Wajima for maybe a special occasion or when I want a pricier Japanese meal!", "Date": "2012-11-03", "Author_Location": "Brooklyn, NY"}, {"Author": "Alex W.", "ReviewID": "mp-jSX0idf6BMiXuXmcCKg", "Overall": "5.0", "Content": "This has become my go-to place for lunch when I can't think of anywhere else to go. Please keep in mind that I've only come here for lunch. The place is small but somehow Wajima has managed to architecturally Wajima arrange everything so it fits a lot more people than you'd think. On weekdays, Wajima opens for lunch at noon and I never have a problem finding a seat when I arrive at 12:10pm. The lunch menu has three prix fixe options and my favorite is the Sanzimen. In my opinion it is the best and most assorted lunch option. There's sashimi, rice, soup, tempura, the works! Best of all it's not very expensive (at around $14-15 after tip / tax) and it leaves me full for the rest of my work day. I've never noticed any disgruntled staff in my many times there but then again, I don't look out for attitudes like that when I'm just out having lunch with my coworkers.For the value and quality, I'd give this lunch option a full five star rating.", "Date": "2013-02-06", "Author_Location": "New York, NY"}, {"Author": "James A.", "ReviewID": "6Pdv4HXc46FmZfm-9EWeeA", "Overall": "5.0", "Content": "Usuzukuri was delicious and beautiful. Great place to get some sushi. Also enjoyed the spicy tuna rolls and the miso soup.", "Date": "2013-11-30", "Author_Location": "Gilroy, CA"}, {"Author": "Chris J.", "ReviewID": "NwwOUtITnwe9zfOsulgodg", "Overall": "5.0", "Content": "This is the best Japanese restaurant I've found so far in NYC.Few places get it right like this one. There is a freshness to all the food. We started out with the watercress in sesame sauce. It was suggested to me by the waitress and it was just amazing. After that, my wife and I had a few rolls which were so good. A good sushi place has their sushi rice slightly warmer than the fish inside. Few places in the city do this. It creates an interesting combination of warm and cold in your mouth. The desert we had was the first one on the list. I don't remember what it was but trust me, order it. I've never been to japan but i believe that this is the closest I'll get without getting on a plane.", "Date": "2013-02-06", "Author_Location": "Bronx, NY"}, {"Author": "kathleen c.", "ReviewID": "yCcb_6sMxeEpr3XrrNwxaQ", "Overall": "5.0", "Content": "This place is a gem!  As soon as I stepped in, it felt so... ZEN.  All the wait staff is like freshly imported from Japan, the owner (I think) is charming and grandmotherly.  And the food is comfort food.  It looks fancy, but it's really simple, down to earth, and VERY tasty straight up Japanese food.  There's none of that Asian fusion stuff here!We had the shabu-shabu, which came with a variety of veggies (napa cabbage, green onion, onion, tofu, enoki mushrooms and carrots) and beef that had JUST the right amount of fat.  My friend had the sukiyaki was perfectly flavored and not too sweet, not too salty (although it was missing the raw egg, but i'm not that huge a fan).  Lastly I don't know what they put in their green tea ice cream, but it was creamy and just enough matcha flavor.  YUM.  The price (for dinner, at least) was a bit on the high side, but well worth it for a refreshing simple Japanese meal made by honest to goodness Japanese people (and not people imported from the DR).", "Date": "2008-10-25", "Author_Location": "New York, NY"}, {"Author": "Paul C.", "ReviewID": "PA582Hj64KDAAtaGnyMxzg", "Overall": "4.0", "Content": "I'm giving this place a very very reluctant four stars. Actually it gets four and a half for food as the soba noodles in benito broth that I had was insane. The broth was really aromatic, the noodles were fresh and plentiful and they had some great spices to mix in. Although, it was not cheap.The hostess was super nice but my waitress was just on the border of rude. I asked her about the different menu options and she looked at me like I was an alien. After I ordered I flagged her down and asked for an order of uni and she gave me a really dirty look.Even when my check came she was disdainful, almost dismissive. I wasn't rude or obnoxious or anything so I don't get it. Maybe it was a cultural thing. I'll still probably give this place another shot.", "Date": "2012-02-10", "Author_Location": "Manhattan, NY"}, {"Author": "Kajitsu N.", "ReviewID": "-EduXBsHrZqYwduCSaJfKw", "Overall": "5.0", "Content": "For the money, best sushi restaurant in the 5th ave uptown \"business\" area.Quick, fresh, always a table, great service.   The rolls are smaller but everything above makes up for it.  I love this place!", "Date": "2012-05-03", "Author_Location": "NY, NY"}, {"Author": "John H.", "ReviewID": "GLRizfKG9U9ZhXk9Ujzuog", "Overall": "3.0", "Content": "The lunch special at $10 dollars is a steal.  I've only had the lunch special here so I can't really comment on anything. else.  All I can really say about the food is that it tasted good.  Not the mind-bending experience sushi can be, but you get what you pay for in the Upper East Side.The ambience is Japanese modern and it's really quite clean.  The waitress was extremely helpful and always refilled my tea when my cup was barely half empty.  I will say something about the clientele though.  I was wearing a t-shirt that said Germany on it and some old dude came up to me and said I shouldn't be wearing that because Americans don't like Germans.  WTF?!!  I am American.  I like the Germans.  This isn't the middle of the twentieth century grandpa.", "Date": "2011-01-06", "Author_Location": "Los Angeles, CA"}, {"Author": "Jade N.", "ReviewID": "YER1kNwCEQmDPU0MPFQ8Bg", "Overall": "3.0", "Content": "I went to Wajima for dinner yesterday and it was alright. The restaurant is plain and the decor was easily forgettable. The waitresses spoke just enough English to get by and the pricing was reasonable especially for midtown.I got the typical sushi & sashimi dinner for $25. The sashimi slices were on the thin side but the quality was top notch. What really bothered me was that this is a Japanese restaurant without a sushi bar. It didn't occur to me until after I ordered my meal that I can't see the fish! For some reason this makes me a little nervous. I can't remember ever having sushi that was prepped inside a hidden kitchen. It's like going to a bar/restaurant and having your drinks brought out to you instead of seeing some guy behind a counter make it. Something just seemed off.Other than that, nothing really stood out. I had a mediocre day and a mediocre dinner.", "Date": "2010-08-10", "Author_Location": "New York, NY"}, {"Author": "Pia M.", "ReviewID": "T30KzFsniLbvcP8w5ljCLQ", "Overall": "5.0", "Content": "What looks like a hole in the wall from the outside is actually an adorable little Japanese resty on the inside. The hostess was welcoming, our waitress was nice and super fast, the sushi was delicious (I got the spicy tuna, salmon and yellowtail lunch special for $15). Will definitely be back for many lunches here.", "Date": "2013-07-11", "Author_Location": "Manhattan, NY"}, {"Author": "Bonnie L.", "ReviewID": "ViFIduqGiK_H8v6YYpU1mw", "Overall": "5.0", "Content": "This place is delicious!!! (and bear in mind i'm only reviewing on the basis of one dinner)I ordered the Sukiyaki pot and oh my, was it huge. it couldve fed both of us, no problem, but obviously we didn't know that. The soup was amazingly tasty and i love eating all the vegetables and meat with the rice they provide.One down side was that i couldn't bring it back since it was so delicious. :( but that just means i'll be back much very often!My friend ordered the sushi omakase and it was really fresh and delicious as well.  I trust her because we both grew up in Asia eating Japanese food like our lives depend on it, and oh my - was this a good find.", "Date": "2012-12-03", "Author_Location": "New York, NY"}, {"Author": "Stephanie R.", "ReviewID": "4d3F0fWtvVzZxR292PnZCw", "Overall": "4.0", "Content": "Excellent salmon sashimi and green tea! This restaurant has a wonderful Japanese-inspired ambience that is instantly relaxing and inviting. It's a good place to go if you want to talk without yelling over the people at adjacent tables, which tends to happen often at good NYC restaurants. I was also particularly fond of the sake china, miso soup bowls, and small mugs for the green tea - all nice touches to accent the food.My friend ordered a beef dish that was prepared and cooked table side which looked quite exciting. It came with soup, sides (e.g. pickled vegetables, seaweed, rice), and ice cream, which seemed like a pretty good amount of food for $20! She also said it was delicious.Furthermore, the waitress we had was appropriately attentive. I would definitely come back.", "Date": "2012-04-14", "Author_Location": "Manhattan, NY"}, {"Author": "Kelvin T.", "ReviewID": "Mv2iLqRJE7F4PqAOYTN9JQ", "Overall": "4.0", "Content": "Great lunch deal not the best quality of fish but the value for money can't beat it. Tempura, sashimi, soba, steamed egg, miso soup, $11. ; )", "Date": "2013-08-14", "Author_Location": "New York, NY"}, {"Author": "Helen K.", "ReviewID": "8WOWFfAuT0c8E3bCM6rWwA", "Overall": "4.0", "Content": "Love their lunch special! Everything is very authentic. It is just like having lunch in Tokyo or Kyoto, wherever they are from.My friend loves their skiyaki. It was a bit expensive $27/person but worthwhile trying. Very clean, zen-like soup of beef and vegis. Their udon is great, too.Those who work in the area are fortunate to have lunch there.Whenever I have chance, I tried to take lunch there even by myself. If you go there around 2, you can be seated in 10 min.Too bad they are not open during weekends.", "Date": "2013-04-20", "Author_Location": "Manhattan, NY"}, {"Author": "Tiffany C.", "ReviewID": "MSsOoWLt0TnbeMYzq1XDHA", "Overall": "3.0", "Content": "This is a cute and intimate Japanese restaurant with friendly staff that I stumbled upon thanks to the Yelp app. I tried their spicy yellow tail with scallion roll, the toro roll and the spicy salmon roll which were all pretty decent. The miso soup was a little too salty. I also tried their assorted sashimi which was pretty good. Their food seemed pretty fresh. For dessert, I had their green tea ice cream which was pretty phenomenal. You can tell that it's pretty good quality.", "Date": "2013-07-30", "Author_Location": "Sunnyside, NY"}, {"Author": "Lee M.", "ReviewID": "_aH8fqFj-CS_VsEN32f9ZQ", "Overall": "3.0", "Content": "Lots of rave reviews on Yelp for Wajima.  My experience was good but nothing extraordinary.  Got here around 1pm and the resto was half full.  I sat at the bar, which is just a bar.  No sushi bar in sight (I found this somewhat odd for a sushi bar).  There were a few lunch specials - the usual bento box stuff with typical rolls.I ordered the sashimi off the regular menu.  The fish was fresh but for $20 I was expecting a slightly larger portion to be honest - a critique I rarely give.  Three pieces each of yellowtail, salmon and tuna - a couple of pieces of chopped tuna and 2 slices of whitefish.  It came with Miso soup, a couple of pickled veggies and a bowl of white rice.  The more I write the review, I guess the portion was pretty reasonable all considering - I guess I was super hungry that day.With tax and tip, it was $25 -   very expensive for lunch for leaving hungry.", "Date": "2012-08-13", "Author_Location": "New York, NY"}, {"Author": "Robert J.", "ReviewID": "ZrZumQL6PyvTM13ZtmZnfw", "Overall": "4.0", "Content": "I like the sushi and California roll . The serving staff was kind. Good place to eat out.", "Date": "2013-11-11", "Author_Location": "Manhattan, NY"}, {"Author": "Taiyo O.", "ReviewID": "BuG8yVNXkj_SfWSS_UsTFA", "Overall": "3.0", "Content": "3 stars is only for one of three Lunch Specials.I opted for the fist set menu from Lunch Special, Samizen ($11) - much more sauce needed for this tasty Shrimp Tempura Don. Sad and dry thin sliced of Sashimi with nicely seasoned Sushi rice was okay. Soba noodle needed more sauce and a touch of graded ginger would be nice instead of old Wasabi. Perfectly executed soft savory custard Chawan Mushi (savory pudding) with nicely seasoned Shiitake Mushroom with tiny shrimps was tasty.  Miso soup with tofu was a bit salty. I like to have Japanese food with green tea. The FREE tea served here was surprisingly good.If you are in the area and hungry for quick, easy and cheap but acceptable Japanese lunch, come to Wajima. Better than pre-made Bento Boxes!", "Date": "2011-10-27", "Author_Location": "New York, NY"}, {"Author": "Tracy X.", "ReviewID": "INZlcT990S3oEY7qm_tG9w", "Overall": "4.0", "Content": "Authentic Japanese fare in midtown. Wonderful selection for lunch, with 3 lunch sets to choose from---2 of which are variations of chirashi with tempura, and 3rd being a choice of noodles (soba or udon) with agedashi tofu. The space is definitely on the small side, and lunch time could be a bit hectic with lines to the door. I would highly recommend making a reservation in advance, or stop in right when they open at noon. Bare in mind, the hostesses mean business, if your party is not complete, they will not seat you. Period.", "Date": "2013-05-06", "Author_Location": "New York, NY"}, {"Author": "Arjan S.", "ReviewID": "RNN9qnf4IDzU5kWzSdxzkQ", "Overall": "5.0", "Content": "Had a great lunch time meal here - everything was spot on - the service and good were exceptional. Highly recommended.", "Date": "2013-08-14", "Author_Location": "West Chester, PA"}, {"Author": "Yoshi M.", "ReviewID": "MsZ2Cn15eZ-sjafAy1ylmQ", "Overall": "4.0", "Content": "In search for moderately priced AUTHENTIC Japanese food is hard to come by in NYC.Well here you have it..... At a very good price you get a menu that was thought out by a JAPANESE person. LOL. not a all in one chinese/japanese/thai restaurant. They offer a decent sized sukiyaki (even for 1 person).... to sushi to udon. I was a fan of their sushi as the rice actually had flavor unlike all the FAKE sushi restaurants in the city. Overall enjoyed the JAPANESEYYYY- feel and the FOOD. You know its good when you hear customers speaking in Japanese :)", "Date": "2011-12-27", "Author_Location": "New York, NY"}, {"Author": "Sue P.", "ReviewID": "4JoC0FnRxSNc0JUix_v9qw", "Overall": "2.0", "Content": "I was two blocks away and really didnt want to walk over to Sakagura or Soba Totto so i yelp'd my way here for lunch.Fast but very rude service from our waiter, start to finish. Our party was appalled how blatantly unpleasant this woman was. We went in towards the end of their lunch service (seated around 1:50, their kitchen closes at 2:30, restaurant closes at 3)$11 lunch specials. The fish in the Chirashi was fresh, but the rice was overly sweet. Tempura was good. Everything else was just mediocre. Not memorable. I wouldn't necessarily set aside time to go back or recommend the restaurant, but if I was dying of hunger a block away, I might stop by the for cheap lunch.", "Date": "2012-06-25", "Author_Location": "Brooklyn, NY"}, {"Author": "Mandy L.", "ReviewID": "obiX8NaSiI8o8zLmN6hXJA", "Overall": "3.0", "Content": "Probably the most authentic Japanese restaurant option... around that area.  They have choices beyond chicken teriyaki and california rolls.  The appetizers and small plates stood out the most.  We got a tripe dish that was simple and clean.  And even though chicken teriyaki might sound typical, the set menu comes with traditional Japanese root vegetables and pickled vegetables.  Husband thought his sushi set was fine, but has had better elsewhere.  Service could be better.  We went at an earlier hour for dinner... felt like the whole wait staff was just staring at us while we ate!", "Date": "2013-04-18", "Author_Location": "New York, NY"}, {"Author": "Therese M.", "ReviewID": "FNmvT6y_ium_l5rKCwZ4aA", "Overall": "4.0", "Content": "Oh Sushi, sushi, I would be lost without you.  The savoring taste of fresh fish on my mouth leaves me breathless.  There's something about visiting a Japanese restaurant.  Needless, to say there's a special place in my heart for sushi restaurants.  I am always on a search for real and honest Japanese food.They have some appetizers which are not usual items in NY, like the stewed beef tripe, watercress in sesame sauce, yamakake (sashimi maguro in grated Japanese mountain yam), vegetable stew (yasai nimono), which are all very good and authentic. The fish is fresh; like the salt grilled chilean seabass, and paper-thin cut fluke sashimi (usutsuguri) . Even the traditional standby items like Tempura are very well prepared, which really shows the ability of the chefs. Was this venue out of the way: Not at all--just around the corner from my office.Will I come again: hell yeah!Mix of crowds mostly people in business suits trying to get in for lunch.  It was a great excuse to take more than an hour lunch.  Tip: The downside this place gets pretty packed you might want to come after 1pm.", "Date": "2012-02-15", "Author_Location": "MIDDLE VLG, NY"}, {"Author": "Sandra D.", "ReviewID": "lCKul1XkykocRd2uBOp7kA", "Overall": "4.0", "Content": "Love the food. Taste like japan. Lunch set are fast and fair price. So popular that if not all party is there you have to wait. Would recommend the place", "Date": "2014-02-16", "Author_Location": "Westfield, NJ"}, {"Author": "Christina F.", "ReviewID": "_Vi8y6nrlEUoRf_jimNXYg", "Overall": "5.0", "Content": "Such a delight. The pre-fixe dinner is a steal-- highly recommended! Great sushi and terriyaki chicken. The green tea ice cream is awesome!", "Date": "2013-01-28", "Author_Location": "New York, NY"}, {"Author": "Joe M.", "ReviewID": "qNsMzhY-HCwA1HlCCprhtQ", "Overall": "3.0", "Content": "Very attentive wait staff with limited knowledge of the English language.  Ingredients in the Shabu Shabu were very fresh (including the perfectly marbleized beef).  Although, we much preferred the Sukiyaki; mostly due to their very-tasty-not-too-salty Sukiyaki sauce.  Getting the Tamagoyaki for appy was a mistake.  It may have been good for what it is (I don't know), but it just tasted like sweet eggs in the shape of butter.I hate green tea, but their green tea ice cream was phenomenal.  A must try.", "Date": "2009-11-09", "Author_Location": "Nassau, NY"}, {"Author": "Mr A.", "ReviewID": "Ua542Q033HDjggkjNH7l6g", "Overall": "3.0", "Content": "I come here for their Sanmizen lunch combo once in a while.  It consists of cold soba, shrimp tempura with rice, chirashi, chawanmushi and a small bowl of miso soup.  The portion is little but I enjoy the the variety.  One star off for the impolite staff.  They don't smile and never come to check on your food or refill the tea.  So you don't have to give them too much tips.  Another star off for the small portions, if you have a big appetite, you will need to order two servings to fill you up.", "Date": "2013-12-29", "Author_Location": "New York, NY"}, {"Author": "Ahmad M.", "ReviewID": "EPgs_8ddHdVzy1zmwdBzfQ", "Overall": "5.0", "Content": "Awesome food. Awesome service.I did not expect this. And for that price?!!?!?! it's definitely a good value. the service is just great. and the nigri is more than great. definitely will come again.", "Date": "2012-07-23", "Author_Location": "Corvallis, OR"}, {"Author": "Claire C.", "ReviewID": "mbvsSojBg2U2VFTsUDFP6w", "Overall": "5.0", "Content": "This place is fantastic! They have great weekday lunch specials, for only $11 you get tempura, sashimi, soba, chawanmushi, and miso soup. And the food is always excellent. I can't think of a better lunch deal around the area. Dinner is also good, but pricey. Overall it's a lovely restaurant, the staff is very polite, the ambiance is great, and the food is fresh and delicious.", "Date": "2012-04-20", "Author_Location": "Midtown East, Manhattan, NY"}, {"Author": "Alexandra S.", "ReviewID": "WCJoMerc0CwbZ9hbGfX0cA", "Overall": "5.0", "Content": "Excellent sushi and excellent prices, especially for New York. I had the sushi lunch and the eel was amazing! I highly recommend.", "Date": "2013-07-31", "Author_Location": "Boston, MA"}, {"Author": "Kate F.", "ReviewID": "UqRuOSqJVd9b7ttWIsOB9Q", "Overall": "4.0", "Content": "Pretty good -- we've been here a few times and the sashimi has been consistently good (agree with everyone that its weird there's no sushi bar)...not the best atmosphere but has a legit vibe.", "Date": "2013-01-03", "Author_Location": "New York, NY"}, {"Author": "Kate Y.", "ReviewID": "jcignuPEi57_gkUAhSWYgQ", "Overall": "4.0", "Content": "Wajima", "Date": "2013-10-02", "Author_Location": "Manhattan, NY"}, {"Author": "LV C.", "ReviewID": "Xb5Xfm_SmPxBKT0ahZBu-g", "Overall": "4.0", "Content": "Stopped in for a quick lunch. Had the soba noodle set. It was soo good! Broth was super tasty. Also tried the sushi but wasn't that fresh.", "Date": "2012-12-17", "Author_Location": "New York, NY"}, {"Author": "Yoona K.", "ReviewID": "er5Cj-xWOAWESjNx8k47Cg", "Overall": "4.0", "Content": "A go-to lunch spot for me and my co workers! Their specials are quick, delicious and perfectly presented. The service is really great; they even give you a hot towel at the beginning of the meal, which is great for those days when you just don't even have time to wash your hands before eating. The food, on the whole, is very flavorful but definitely on the sweeter side - typical of some Japanese food - but overall, a solid place to go. Took an out-of-towner there and they also loved it too.Way to go, Waj!", "Date": "2013-05-03", "Author_Location": "New York, NY"}, {"Author": "Kent W.", "ReviewID": "mi3PWegwsEav-wHu1Sy4mQ", "Overall": "4.0", "Content": "Terrific ambience! The Japanese dishes here are very authentic, and the sushi are fresh. My best friend had the super cheap lunch special that came with that silky egg yellow-looking thing w/ mushroom on the bottom. They serve their food and tea in nice looking dishes and cups. (Sorry I couldn't steal them for you homeslice mei mei - but i still love ya =D )", "Date": "2010-06-08", "Author_Location": "New York, NY"}, {"Author": "Kristina W.", "ReviewID": "T1VTCbDlZrLckFpF69yTQg", "Overall": "4.0", "Content": "I've been wanting to try this restaurant for awhile and it didn't disappoint.  I tried a variety of dishes including the cold soba which was on the heavier side of buckwheat-y, the black cod which was good, the tofu which was good but I've definitely had better, and the sashimi which was excellent.  The waitress recommending trying more things off of the special menu because she said those were more authentic.  I'll be going back soon to try those.", "Date": "2009-03-02", "Author_Location": "New York, NY"}, {"Author": "Michelle G.", "ReviewID": "llu_-IsxsxNRbUL8LalcnQ", "Overall": "5.0", "Content": "This Japanese restaurant is FABULOUS. I'm from Japan so I KNOW when I taste the authentic Japanese food. This places gets a full five stars for food, food and food!I came here on a late Saturday evening with my husband. We just walked in because i wanted to eat Japanese. The place isn't fancy but clean. Do you know why!? Because they put every penny into their fantastic food. For the price, they serve really authentic, fresh, honestly good food. I can't say it enough. No, I'm not their family or an employee; I'm just a Japanese girl who knows her food when it's awesome!I had Sashimi dinner combo.Holy crap! The sashimi was SUPER FRESH  and the salmon melted in my mouth. I was speechless so my husband got worried. I told him to try the salmon and he was speechless, too! If you like sashimi, this is a must-order. In addition to the main entree, the combo came with 2 Japanese appetizers, miso soup, rice, pickles, and ice cream at the end. It was very filling and it was only $25 or so. My husband ordered the Tempura dinner combo. I remember seeing 3 or 4 shrimps plus 6-7 vegetables. I ate his egg plant tempura and it was wonderful. Warm and juicy. The thin tempura batter really accentuated the flavor of the veggie. Like my combo, his came with the other combo sides as well.At the end of the dish, I was fully satisfied and wanted to try everything on the menu. I'll be back for certain. For a New York restaurant, I thought the interior was spacious. This was great because we don't have to listen to other people's conversations and there are plenty of space around the table.", "Date": "2012-08-11", "Author_Location": "New York, NY"}, {"Author": "dice-K S.", "ReviewID": "yVqidx1-msyL3-YopVs0eg", "Overall": "4.0", "Content": "I have been here a few times..It's a great neighborhood Japanese Restaurant with authentic Japanese food taste. looking at the menu they also have a decent size Sake selection. Highly recommend ordering a bunch of appetizer a splitting them amongst a group. The place is family owned with a professional wait staff. enjoy.", "Date": "2010-01-05", "Author_Location": "Brooklyn, NY"}, {"Author": "Brian J.", "ReviewID": "YRPs1xvjd1aNwHegUbwjQA", "Overall": "5.0", "Content": "Great authentic Japanese restaurant in a casual environment.  The manager and staff are all Japanese as well as many of the patrons.  We've become regulars ever since we discovered this place and are recognized by the staff each time we visit.  The food is consistently great.  We usually order a mix of sushi with other more authentic Japanese fare on the menu.  I have never been disappointed and the price is very reasonable for the quality.  We will continue to be frequent customers of Wajima.", "Date": "2008-12-26", "Author_Location": "New York, NY"}, {"Author": "Lynne T.", "ReviewID": "BZBFk2XKK3ykcNBLwb0N9Q", "Overall": "4.0", "Content": "they had a special when I went there with my relatives which at least half of my relatives ordered. The clear soup is soo yummy! The ikura, tamago and ebi aren't anything to get excited over but the shrimp tempura roll is the best i've ever had!!! They had a variety of rolls containing strange combinations like mango and ebi. My brother ordered the shabu shabu and he ate everything! and i mean everything, the waiter was so surprised when a 12 year old boy ordered an old man's dish and then finished it all by himself! oo and btw my brother isn't fat at all he is a skinny as an asian boy can be!  It is really good and after you can walk to pinkberry just down the street.", "Date": "2009-08-12", "Author_Location": "Honolulu, HI"}, {"Author": "Terren J.", "ReviewID": "4D47HIVXacPYaR1mBoNSfQ", "Overall": "4.0", "Content": "Very neat and authentic place for lunch.  Their lunch specials are great for those that want to try a little bit of everything.  For around $10, I got chirashi, soba, shrimp tempura on rice, chawanmushi, and miso.  The fish slices were on the thin side in the chirashi but I guess that's NY portion for you.  Overall, it's a cute place for a nice, relaxing lunch.", "Date": "2010-02-25", "Author_Location": "New York, NY"}, {"Author": "Cecilia S.", "ReviewID": "vwBKlgPDzGwGDvblzlsm1g", "Overall": "5.0", "Content": "Best lunch special of the city! I still cannot believe how delicious, fresh and affordable is their food !", "Date": "2010-05-25", "Author_Location": "Brooklyn, NY"}, {"Author": "Peter H.", "ReviewID": "-y332TDtdGfyDZKwxNu5RA", "Overall": "4.0", "Content": "came here for an after work dinner with a friend.  very quiet atmosphere.  Ordered the sushi platter with 3 rolls for like 15 bux.  Good value.  The sushi tasted very fresh and I really enjoyed this place.  Would come here again for its proximity to work and quality of food", "Date": "2011-08-11", "Author_Location": "Manhattan, NY"}, {"Author": "J C.", "ReviewID": "AULXxBi0811rukxyHsiqvw", "Overall": "4.0", "Content": "Cool looking environment. The staff are very friendly and attentive (then again, weren't too many people when I went). Love the sashimi dinner. A little pricey.", "Date": "2012-10-16", "Author_Location": "Jackson Heights, Queens, NY"}, {"Author": "Maiko K.", "ReviewID": "Ow8JYtMFEIgapVbQaykeww", "Overall": "4.0", "Content": "Why hasn't anyone reviewed this place!? I'm always in search of great Japanese restaurants and this one is a real find.  The ebi shinjo (shrimp fritters) tasted like the kind my mom used to make, the ankimo (monkfish liver) was smooth with the citrus ponzu cutting the creaminess nicely, and the sashimi was excellent. And the side rice... I don't know how they make it but the rice was truly sublime.  My boyfriend commented too, that it was the best rice he'd had in a while. It says something when the rice is as good as the main dish!FYI, they have a pre-theatre dinner set there that's about $20 for side dish, soup, entree (which includes the sashimi entree), and dessert.", "Date": "2008-02-24", "Author_Location": "Brooklyn, NY"}, {"Author": "Lauren W.", "ReviewID": "4-DXch6aMi60qXOO0ewgmw", "Overall": "2.0", "Content": "Not much of a selection and the sushi was not that great.", "Date": "2011-12-03", "Author_Location": "Wilmington, DE"}, {"Author": "r s.", "ReviewID": "pdxznq8sSOtL_666uA5zjA", "Overall": "5.0", "Content": "Best spot for lunch in a 4 block radius. The lunchtime bento box options are delicious and reasonably priced. Service can get slow in the afternoon but overall I've found service to be decent. The 5 star rating is for being an affordable but tasty lunch option in a typically overpriced part of town.", "Date": "2013-08-01", "Author_Location": "Brooklyn, NY"}, {"Author": "Kari g.", "ReviewID": "9LV0XKq_M5k4uQZC4wXksw", "Overall": "3.0", "Content": "I was actually surprised to see this high of an overall rating. I feel generous giving it 3 stars. If 3 stars is \"A-OK\" I would say its \"JUST OK\" Afrer having been to many sushi restaurants, or even compared to any restaurants, in NYC, this one was not memorable in food, ambiance, or service.Upon entering at 8:30pm on a thursday night, I had reservations because it was totally dead. No people at all. But... we still decided to give it a whirl.I was planning on getting the sushi sashimi dinner for $25, but they wouldnt make ANY substitutions .... I actually dont like to see such inflexibility in restaurants... The waitress was also short and  combined with the latter, I knocked a star off for customer service.The food was decent, not expensive and not inexpensive. We ordered a roll and sashimi. The fish seemed fresh, but they made it in the kitchen, no sushi bar, which was unusual. I was pleasantly surprised that they bring you complimentary tea at the end of your meal. This is becasue the whole night the restaurant gave me the \"stingy\" vibe. So overall, I woudlnt go back. Its decent to get dinner with a friend if your in the area, but I wouldnt recommend it for much else because there really is no ambiance or anything special about the service or food.", "Date": "2011-09-02", "Author_Location": "Manhattan, NY"}, {"Author": "E L.", "ReviewID": "2tHPlHMe3pELRztUv4Rn8g", "Overall": "5.0", "Content": "An oasis in a hectic city. Five star service. Clean cool & welcoming, the $20 menu great value. Exquisite miso soup, sushi. Kept refilling the lovely green tea and cold water. Many green tea choices. Lovely refreshing green tea ice cream. Would go back tomorrow if in NY.", "Date": "2012-09-07", "Author_Location": "Washington, DC"}, {"Author": "Ed W.", "ReviewID": "yrNmu2WosJS5Yj8ZiZ5O7Q", "Overall": "4.0", "Content": "The sukiyaki dinner ($25 per person) was delicious.  It is preceded by a few sides like seaweed salad, and was more than enough food.  Did I mention it was delicious?  The atmosphere and decor is low-key here, so I would recommend it for a quiet dinner out.", "Date": "2010-08-02", "Author_Location": "New York, NY"}, {"Author": "Kiome T.", "ReviewID": "GOerXEewNzN3fzMsj4oS0A", "Overall": "3.0", "Content": "The food was great a little over $20 for the dinner however, its worth it.  The Miso soup was great so was the ginger salad however the desert An-Mitsu, was...different: fruits, red bean paste with mini jello cuts. If you are planning to come as a group, you better fine another locate because the restaurant is ideally for couples on a date, chasing up with old friends, or even taking your boss out so she/he can finally remember your name, for once.", "Date": "2011-01-21", "Author_Location": "Bronx, NY"}, {"Author": "Adrian H.", "ReviewID": "PQ7q6ffc5LffaAcKAM78xQ", "Overall": "2.0", "Content": "Nothing special.  The food is alright, but the portions are small for the price, and the service was not good.  I don't eat shellfish or eel, and so I *specifically* asked what kind of nigiri came with the sushi/sashimi combo, and was assured that it was all ordinary fish like salmon and tuna.  Sure enough, it came out with some crab and eel nigiri.  They took the two nigiri back, but refused to substitute them with something else, insisting that the combo comes as-is.  Penny wise, pound foolish.", "Date": "2012-08-16", "Author_Location": "Cambridge, MA"}, {"Author": "Zashi M.", "ReviewID": "JCgOUTH-EQruN0vXMV2GyA", "Overall": "4.0", "Content": "Very authentic Japanese food. If 75% of the patrons are Japanese, you know it's authentic.They have awesome lunch specials just under $10 and it comes with so much food. I had the chirashi lunch special and it comes with shrimp tempura over rice, soba noodles, an egg custard (salty and not the sweet kind) with miso soup. That's alot of food for $10. Very delicious!!The soda was overpriced at $3 for a glass from the fountain. Do call before you head over for lunch or dinner. They were closed for a whole week during July 4th.", "Date": "2009-08-01", "Author_Location": "Bayside, Queens, NY"}, {"Author": "Matthew P.", "ReviewID": "3lgKppOiWJjjMpNbJq2Tog", "Overall": "2.0", "Content": "Any sushi bar WITHOUT a sushi bar in the dining room should be carefully considered. And this is not an exception.  Went for lunch - razor slim pieces of sushi - expensive and mushy tempura...do yourself a favor and get a slice of pizza instead.  Marginal at best.", "Date": "2010-11-08", "Author_Location": "McLean, VA"}, {"Author": "Kathleen R.", "ReviewID": "YKrGb95qJueP0loBcpEPJw", "Overall": "4.0", "Content": "Great Lunch special deal -- a lot of quality Japanese food for $10.", "Date": "2010-12-07", "Author_Location": "Manhattan, NY"}, {"Author": "Roland T.", "ReviewID": "xDeUyH51ykBVY25kN1HnGQ", "Overall": "5.0", "Content": "Great value and vibe. Pre-theater $20 meal (before 6:30pm) with salad, soup, entree, and desert! Beautiful presentation. Recommend: watercress with sesame, traditional bento box", "Date": "2012-02-24", "Author_Location": "Cambridge, MA"}, {"Author": "KitKat B.", "ReviewID": "RkEjqVYJRqLieSLOyKNxOw", "Overall": "4.0", "Content": "Chirashi, Tender Cooked Octopus with Soy Beans, Tempura dinner, Salmon Skin Roll were all excellent. The fish were on the thin side but very good quality and very tasty. The prices were very reasonable. Highly recommend.", "Date": "2013-04-10", "Author_Location": "New York, NY"}, {"Author": "Alexander K.", "ReviewID": "W-wv2dDEc7PyxBKYBYqvkw", "Overall": "5.0", "Content": "Simple, not crowded, fair priced and yet amazingly delicious japanese restaurant, almost gives a feel of japan itself", "Date": "2012-08-08", "Author_Location": "Theater District, Manhattan, NY"}, {"Author": "Charlie C.", "ReviewID": "_vSmcWwwhj5qfqX9pD8V5Q", "Overall": "5.0", "Content": "Best Japanese restaurant around and one of the very few left that is actually owned and operated by a Japanese owner/chef.  Been there multiple times and the food, customer service, cleanliness is always consistently amazing.  If you want a dining experience that is pretty damn close to one you'll get in Japan, I would suggest this place any day of the week :) PS calming interior decor - just another bonus ;)", "Date": "2012-06-04", "Author_Location": "Manhattan, NY"}, {"Author": "Linjiang C.", "ReviewID": "Dn25-FYfYLDKzrFvfVoBCA", "Overall": "5.0", "Content": "fresh and delicious sushi.", "Date": "2013-06-20", "Author_Location": "Jersey City, NJ"}, {"Author": "Anthony D.", "ReviewID": "rJUe4KONJCIypAIi0iibGQ", "Overall": "5.0", "Content": "Lovely Shokada Bento box for lunch, some tempura, some fried fish, some fried and breaded softshell crab, really nice combination and arrangement. SImple understated space just off Lex, quiet place, really nice staff. Great place!", "Date": "2007-06-07", "Author_Location": "Brooklyn, NY"}, {"Author": "Joseph B.", "ReviewID": "ruJt51I1GJsqZzUdGEMIQQ", "Overall": "4.0", "Content": "yummers! this place is exceptional! i've been here for lunch only and the lunch special is such a good deal. the food is authentic and and sushi/sashimi is always fresh.", "Date": "2008-05-20", "Author_Location": "New York, NY"}, {"Author": "Sandra M.", "ReviewID": "HQ32ZTBhcFDhM0uTRPD-9g", "Overall": "4.0", "Content": "we thought they had the best miso soup we ever had.  had the sashimi dinner and it was good.", "Date": "2010-08-21", "Author_Location": "Jersey City, NJ"}, {"Author": "Audrey P.", "ReviewID": "8jnQ0OZA1E9bvqHcEIgLpA", "Overall": "5.0", "Content": "I really loved everything about this restaurant. A modern, clean and cozy place with such warm and friendly hospitality. Moreover, I loved the food! Everything was so fresh and delicious. We first had beef negimaki, fried eggplant,and spicy tuna rolls for appetizer dishes, and I'd give them all perfect 10's! There were a lot more of appetizer dishes on the menu, somewhat of a fusion style with a bit of twist. Wanted to try them all if I could! :)  Then, I had pre-theater dinner set which cost $20 that included spinach salad appetizer, authentic miso soup, tasty Japanese bento box, and scrumptious green tea ice cream as a dessert. Everything was just SOOOO delish! Just the right amout of texture, flavor, seasoning and even presentation was fantastic. I am very picky when it comes to raw fish, and the mini sashimi pieces they included in the bento box was very fresh. Can't really say anything bad about this place. I give them a \"very deserving\" 5 stars, and would definitely go back next time when I am in the neighborhood. :)", "Date": "2012-05-26", "Author_Location": "Bayside, NY"}, {"Author": "David A.", "ReviewID": "pqipeCZk2lJcv9Z5s034BQ", "Overall": "5.0", "Content": "Great food, great service. Love Mika from Tokyo!", "Date": "2010-04-23", "Author_Location": "New York, NY"}, {"Author": "Esther D.", "ReviewID": "6Rz49npLf3MgkJolIu3j8A", "Overall": "4.0", "Content": "4 and half stars I will give food was excellent, tender octopus great same as trype sushi sashimi plate great complimentary green tea beers reasonable as was whole meal price. Service great. Would recommend without hesitation.", "Date": "2012-10-03", "Author_Location": "Australia"}, {"Author": "michael h.", "ReviewID": "DXPgGFuz9XWAJcb5fF2byQ", "Overall": "5.0", "Content": "It is hard to find good, honest Japanese food, so my wife and I were very happy to eat at Wajima.  If your palate is such that you can appreciate the harmony between the rice and fish when eating sushi then you will truly appreciate this restaurant.  Side dishes have nice, seasonal types of food which are prepared with care and presented nicely.    Wajima is not an over the top type of place, it is simple and laid back.  We look forward to returning again soon.", "Date": "2011-03-27", "Author_Location": "New York, NY"}, {"Author": "C. O.", "ReviewID": "0aoXqRrvaanPrjz_0KFFRg", "Overall": "5.0", "Content": "Price and quality cannot be beat in midtown!  Nice big dining room with high ceilings and simple decor.  Lunch and dinner specials are truly a deal while the interesting list of specials can add a new flavor sensation to your repertoire.  Lovely service with staff who remember you and what you like.  Who cares if you don't see a sushi bar in front of you?  There's no mistaking the freshness and quality once you taste the food.  Always a pleasure and delight.", "Date": "2011-09-14", "Author_Location": "Manhattan, NY"}, {"Author": "Cherish N.", "ReviewID": "yRWTttnRhhLgH-UsOPF8gQ", "Overall": "4.0", "Content": "Very nice and quiet Japanese restaurant. Well priced. We had sushi, sashimi and shabu-shabu.  The fish tasted very fresh. I had never had shabu shabu before but I enjoyed it immensely. It was the most nutritious meal that I've had in a while. This meal is prepared tableside which was an pleasant experience. I will definitely come here again.", "Date": "2011-12-17", "Author_Location": "New York, NY"}, {"Author": "Eli R.", "ReviewID": "YvnnE_ErwoWG_vzPvFJRYQ", "Overall": "4.0", "Content": "Good, fairly cheap sushi", "Date": "2012-05-22", "Author_Location": "Seattle, WA"}, {"Author": "Jack G.", "ReviewID": "qfqSOOjC-kTkbZblJPsTSg", "Overall": "5.0", "Content": "Best sushi in NYC hands down....honest Japanese food made by real Japanese people.", "Date": "2012-08-01", "Author_Location": "Congers, NY"}, {"Author": "Ana K.", "ReviewID": "3vsRdBehISNjo6vykrYQmA", "Overall": "4.0", "Content": "The samizen lunch special is the best deal. For $11 you get a nice assortment of sashimi, tempura, soba, and some other dishes. Consistently excellent. Wish there was a greater range of appetizers. But they know what they are good at, so I can't fault them for sticking to their strengths.", "Date": "2012-05-08", "Author_Location": "Manhattan, NY"}], "RestaurantInfo": {"RestaurantID": "_IoXWW5aXSYCZZsVU96akA", "Name": "Wajima Japanese Restaurant", "Price": "$$", "RestaurantURL": "/biz/wajima-japanese-restaurant-new-york", "Longitude": " -73.96774000000000", "Address": "134 E 61st StNew York, NY 10021", "Latitude": " 40.763506999999997", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/QocTh9LBGtYvPZmBiXlRZQ/90s.jpg"}}