{"Reviews": [{"Author": "Matt V.", "ReviewID": "R9P2YJe0cFIlHE-MU5FAaQ", "Overall": "5.0", "Content": "I have never been here so I decided to finally go. I thought it was a local independent restaurant, alas this is a chain. That being said the menu is full of classic and unique Italian food. My service was so nice and attentive, zero service complaints. I ordered the garlic & shrimp mizithra pasta amd it was so damn good!", "Date": "2014-07-18", "Author_Location": "Tampa, FL"}, {"Author": "Sam B.", "ReviewID": "AdmVEVBoj3A1R6Aqf6ykQA", "Overall": "1.0", "Content": "Came here with the kids after going to the arch. Got to the restaurant @ 2:15pm. Plenty of employees working.  not a whole lot of customers either.  Told the waiter we we in a hurry. Got the kids dishes ordered right away - when he came with our drinks, we told him we were ready to order. He said he'd be right back. 10-15min later he comes back and takes our order. The kids' food comes out and looks likes typical kids entree from any chain - they liked it.  We waited and waited. The kids finished their meals and got their dessert and finished that also. We still didn't have food, but \"it would be out any second\".We ended up leaving without any food.  as a courtesy, they did comp us the kids meals and drinks (sodas), but in my opinion, that was the least that they could do.", "Date": "2014-04-27", "Author_Location": "Greendale, WI"}, {"Author": "Rach M.", "ReviewID": "-wd70TCBaEuWKvc8a8OKnw", "Overall": "1.0", "Content": "Visited on Father's Day, June 15, 2014.  After being seated, it took over 10 minutes for a waitress to greet us and get our drink order.  We placed our food order, beginning with an appetizer before our meals.  The food itself took over 45 minutes to arrive at our table and the appetizer never came, let me add, the restaurant was NOT at full capacity or super busy by any means.  A manager brought our dinner out and when I mentioned to take the appetizer off the bill since we never received it, all she offered me was a statement that the kitchen was busy and sometimes tickets get lost, no apology at all whatsoever.  I have worked in food service over 8+ years and cannot believe the lack of customer service that we received.  We will not be returning!", "Date": "2014-07-19", "Author_Location": "Maryville, IL"}, {"Author": "Iris H.", "ReviewID": "ND_NwasBq7e-qPtSh_GPtw", "Overall": "4.0", "Content": "Went here for a family dinner and it was great. Gorgeous building, pretty good food..it's not Italian on the Hill but it was decent. Kids loved the balloon man and it was just perfect for us and our group. Pretty fast service and really nice staff.", "Date": "2014-07-16", "Author_Location": "Saint Louis, MO"}, {"Author": "Kay Dee H.", "ReviewID": "i_mtzjSYvO8azLp8eyLOww", "Overall": "3.0", "Content": "I come here basically for that Mizithra cheese. I can't seem to find it anywhere (except Amazon...although I havent searched Whole Foods yet) so I buy a few containers for extra. The OSF is an old fav of mine and brings back good memories of yesteryear. (The only downside is having to hold my breath going in and coming out of the establishment due to the horses parked in front due to the smell!)", "Date": "2014-06-24", "Author_Location": "Saint Louis, MO"}, {"Author": "Darius D.", "ReviewID": "-73Y7qu1TNGrhvZLL2uGEw", "Overall": "4.0", "Content": "being a st. louis native, my mom would bring us here all the time, and thus started a tradition. my wife and children brought me here for father's day to celebrate, i ordered the chicken postman o, and it was delicious, the waiter was extremely attentive and very personable, we enjoyed conversation with the kids as well with each other. this is a true \"family-friendly oriented\" restaurant, and a perfect place to go, have fun!!!", "Date": "2014-07-09", "Author_Location": "Saint Louis, MO"}, {"Author": "T.J. M.", "ReviewID": "AIrP1hb1tw1gf3CiE9SLqQ", "Overall": "4.0", "Content": "Always a good choice when with the family.  Good food at an ok price and the balloon man comes around to make balloon animals for the kids.  And last but not least free ice cream at the end of the meal.", "Date": "2014-06-01", "Author_Location": "Murphysboro, IL"}, {"Author": "James R.", "ReviewID": "EmmGsXpLqYQ1gUluLdeHUQ", "Overall": "1.0", "Content": "The names says it all.  Old pasta.  Not as good as Chef Boyardee.   Yuk.", "Date": "2014-05-31", "Author_Location": "Saint Louis, MO"}, {"Author": "Cyndi R.", "ReviewID": "gWSvbsKTxeb3vT0SltOi7w", "Overall": "4.0", "Content": "I hear a lot about this place and I have been here a few times. Last time I came it was great, this time I wasn't as impressed. I had to wait nearly 30 minutes for a table for four. When we got seated there where open tables everywhere. I tried something new and I wish I would have stuck with the Alfredo or bakes lasagna. I think this place is defiantly hit  or miss, but still very worth trying. I am obsessed with the decor makes me feel like I'm on the Titanic or something!", "Date": "2014-03-28", "Author_Location": "Salem, IL"}, {"Author": "Sarah V.", "ReviewID": "gqJqRjzjhXj-G9s2tsmeOg", "Overall": "3.0", "Content": "Highlights: -Riverfront location -Old Wooden Décor -Intimate Ambiance -Average Prices -Great Service -Gluten Free friendly. Lowpoints: -$6 parking or lots of walking -Average/Poor food We attended the Old Spaghetti Factory with a large group of 15 young people. The waitress was by far the best part of our experience. She was so attentive and accommodating. We all had separate checks, which is a real hassle, but she handled it beautifully. Ask for Felicia, and you will not be disappointed. Most of us ordered the dinner entrée which includes table bread, salad, meal, coffee tea or milk, and vanilla or spumoni ice cream. The bread is good, and the house pesto-ranch is great, but they put way too much on their salads. I ordered the chicken and gluten free pasta with red sauce. They have an entire gluten free menu. The presentation was almost cafeteria style. No flair at all. Honestly, I will not be returning to the Old Spaghetti Factory. The ambiance is not worth the sacrifice of eating less than average Italian. This is St. Louis, and we have an abundance of phenomenal Italian food. Try somewhere else folks.", "Date": "2013-12-20", "Author_Location": "Saint Louis, MO"}, {"Author": "James H.", "ReviewID": "a5JcJJktBd3LFsFxpc2AZw", "Overall": "5.0", "Content": "Very good for the price; spaghetti dish, bread, salad, and dessert for around $11. They have very good spaghetti and I would recommend their cheese bread. Also, this place has an amazing scenery.", "Date": "2014-05-04", "Author_Location": "Carbondale, IL"}, {"Author": "Alaina P.", "ReviewID": "Egl6NTEPkrx6NuSA-Qvmew", "Overall": "2.0", "Content": "The atmosphere had an old time feel to it with the wooden and glass interior but was very comfortable with the dimmed lights. The starting bread was tasty, but nothing special. The pasta was average as well with a bit of variation in types of spaghetti on the menu, but the portions were generous. I ordered one of their unique ice creams for dessert and it was a satisfying end to my meal but not memorable.", "Date": "2014-04-18", "Author_Location": "Washington, DC"}, {"Author": "SW R.", "ReviewID": "t8lnU_qwZfxZAb3RB37PVg", "Overall": "5.0", "Content": "If you are in St Louis and you love spaghetti this is THE place. Great meat sauce and don't forget the Mizithra.", "Date": "2014-03-24", "Author_Location": "Tulsa, OK"}, {"Author": "Al S.", "ReviewID": "wbSzP96pwsMCGw02kmmqcA", "Overall": "3.0", "Content": "My second visit and my last. They was going to seated us next to the kitchen, been there once its very loud ask for another location, it was like pulling eye teeth, so they seated us in some half-a?? street car with tables next to it with people's head next to your table by the window. Help is like a chicken with its head cut off. Never got bread on table. After meal the trademark of Spumoni was not even offered. Great for a Brady bunch experience but not for a quiet couples dinner. Go to some other italian restaurant if looking for a romantic dinner. If your just hungry and don't care about service or noisy environment the food is fine this place is for you.", "Date": "2014-03-16", "Author_Location": "Collinsville, IL"}, {"Author": "Katie K.", "ReviewID": "Dyk0FDlYKGciqRnErLZ10g", "Overall": "3.0", "Content": "Chose this spot to carbo load before the Rock 'n' Roll Marathon/Half-Marathon this weekend and I enjoyed myself. You get a lot of food with your dinner/entree so keep that in mind (soup or salad, bread, ice cream)Really enjoyed the Sicilian cheese garlic bread appetizer, although it could have been crispier.The food was fairly average but I did enjoy it. I've definitely had much worse in the way of Italian dinners.The atmosphere was pretty fun, old town charm and lots of activity.", "Date": "2013-10-30", "Author_Location": "Milwaukee, WI"}, {"Author": "Azsure D.", "ReviewID": "QpnW081wSQUdz9m9KtWjZQ", "Overall": "3.0", "Content": "If you want good food, go somewhere else.If you want an attractive decor you're at the right spot. The only thing going for it is the ambiance and nostalgia. The bread was warm and tasty, too.But none of our food tasted good. The salads were swimming in dressing. The pastas were swimming in grease. Even my son with a bottomless pit in his stomach only ate a few bites of his meal.The service was alright, nothing special.Too bad.", "Date": "2013-08-05", "Author_Location": "Bloomington, IL"}, {"Author": "Brian M.", "ReviewID": "9jaJVXE-CH_T_LKMPgmizQ", "Overall": "2.0", "Content": "I have never really understood the fascination with the Old Spaghetti Factory, there are so many better places for Italian here in Saint Louis however I still find myself here from time to time. The location is good, however Laclede's Landing has seen better days, hopefully one day we can get some new development on the old Switzer building site to help add some additional density to this once great area. Atmosphere here is very casual, shorts and T-shirts are common place here, unlike places on The Hill where I recommend a collared shirt at a minimum, food itself is average, however the atmosphere is fun and festive, great place to take the family and then walk down to the riverfront. Also if you are there you might as well get a bowl of Spumoni ice cream to top off your meal.This isn't quite the place I would recommend a tourist stop by unless all other options were exhausted, however due to its location it does seem to do well and is always busy.", "Date": "2013-05-07", "Author_Location": "Saint Louis, MO"}, {"Author": "Lorraine N.", "ReviewID": "d3dTAEl5R28-7x1jdc6gMw", "Overall": "3.0", "Content": "Love the building this is in as I think it was an old hotel.  I loved the bar which is were we sat and our bartender was fabulous.  The food is very bland.  I got the alfredo/ broccoli and it wasn't horrid just nothing with any flavor.  I guess I would say go here for a quick snack and drink but get your dinner somewhere else.", "Date": "2013-10-19", "Author_Location": "Minneapolis, MN"}, {"Author": "Joel H.", "ReviewID": "DWBnACNlfA8B-izxwOaBoA", "Overall": "5.0", "Content": "The place, atmosphere, waitstaff, food and everything about this place was amazing!!!!!!", "Date": "2014-02-17", "Author_Location": "Belleville, IL"}, {"Author": "Jimmy L.", "ReviewID": "rDY5ZBn3BjeAVurnALs6tA", "Overall": "3.0", "Content": "I have memories of frequenting this place in San Jose (CA) as a pimply-faced college kid (25 yrs ago!), and thought that the \"spaghetti with mizithra cheese\" was the bomb!As a visitor to St. Louis, and walking 'round Laclede's Landing and the waterfront, I thought I'd grab something simple and quick before rushing out of town on the next train...As a chain restaurant, of course, they do a really good job of finding the vintage/rustic waarehouse spaces and changing 'em up with even more of the rustic feel to keep that old vibe goin' on.Twas a Sat night, and the wait was a good 30-40 min or so. After all these years they are still pretty standard.The hostess came by, and I thought I'd return to my ol' roots and order the spaghetti with mizithra cheese - though I changed it up and ordered it with bacon, mushrooms, and garlic - for 12.95 or so. As usual, this also included the drink, soup or salad, and bread. Still a great deal!Salad and dressing were decent. The waitress only came back once to refill my drink. The wait time between the salad and the entree was a little bit too long - at about 20 min or so, and it wasn't my original waitress who brought it to me...Spaghetyi was too dry, and I had to add the whole dollop of butter (that they gave me with the bread)! That actually helped. I did not taste any garlic at all.Service was OK, but to be expected for this kind of place. Great place for fam ilies, BTW.Actually, I had set my expectations low already, but for what it is, I happily give 'em three stars.", "Date": "2013-02-01", "Author_Location": "San Jose, CA"}, {"Author": "Hadley W.", "ReviewID": "opb00koqTnwDWVnEVvbndA", "Overall": "2.0", "Content": "Let's start this off on the most positive note I can think of - our waiter was stoned out of his gourd and probably should not of been working! I ordered the mushroom sauce and their brown butter sauce as a manager special. it was okay , lots of noodles very little sauce on either. If you're going to write in the food description,\"fresh sautéed mushrooms \"in a sauce, I expect fresh sautéed mushrooms not and I repeat not canned crappy mushrooms!!! I hate resturaunt a that pull food stunts like that. If we hadn't been celebrating a special birthday I would have called them on it !don't lie about what you use if you don't use fresh don't say you do. I can't stand liars and I can't stand restaurant supply I guarantee you I will never be back again meanwhile our server couldn't do his job so we had three other waiters taking over for him. The three other waiters were fantastic polite professional and on the ball but I think one waitress knew there was a problem with our waiter she asked questions about him , we didn't want to tell her he was stoned out of his gourd she already knew it and just wanted confirmation . Overall I would've gone to another Italian restaurant goodness knows there's plenty of good ones just a few miles from my house.", "Date": "2014-04-06", "Author_Location": "Affton, MO"}, {"Author": "Timothy G.", "ReviewID": "Q8ZoBOl1Y0_TJCuuf0rERw", "Overall": "3.0", "Content": "We were craving some Italian while keeping it downtown, so we ended walking down to the Landing to hit OSF for the first time.Decor - Very nice.  Historic building, lots of dark wood, low key lighting.  I think they managed what other chain places wish they could.Started off with the tapenade.  A bit oily, but still quite tasty.  When i saw it was being served with flatbread, I expected pita, but instead had matza-esque flatbread.  Nice touch.Salads - dropped the extra $1.25 for the Caesar.  It was decent and had more flavor than others have said, but you'd be kidding yourself if you thought it was handmade.Entrees - I went with the meatloaf and my wife hit the lasagna.  Both met expectations.  And thank goodness, no Provel!  As part of the meatloaf entree, I had a side of the spaghetti with mizithra and browned butter.  It was interesting -- extremely sweet.  Imagine butterscotch or toffee spaghetti.  That might be a bit too dramatic, but it is sweet.Dessert - hey, free ice cream, you can't beat it.Wine - dropped $20 for a bottle of Mondavi cab.  That retails at around $8-10, so the markup wasn't anything too horrible, especially compared to more upscale places.Service - we were promptly seated and our server was attentive but not overbearing.  We were taking our time making decisions and he recognized that and did not rush us.One thing to note - the entire place is non-smoking.If we could give 1/2 stars, I'd probably bump this up to 3 1/2.", "Date": "2009-06-11", "Author_Location": "Saint Louis, MO"}, {"Author": "Brandee H.", "ReviewID": "KTfxJVirK8KTg1sTX6GeEQ", "Overall": "1.0", "Content": "I went there thinking that all the childhood memories I had were going to be as good as I remembered. YUCK The place is a dump. The food was absolutely lackluster. No flavor!!! The service was mediocre at best. The server was reaching over our plates. He was sweating like crazy but the place wasn't busy!If you are going to go there just get the spumoni ice cream and get an animal balloon from the guy who walks around making them.", "Date": "2012-08-29", "Author_Location": "Saint Louis, MO"}, {"Author": "Pete D.", "ReviewID": "KclGh2DUd2t4x6jusPtKWA", "Overall": "4.0", "Content": "Took my family there during a recent visit to St. Louis. Everyone enjoyed their meal and I felt it was reasonably priced! I'd go back!", "Date": "2014-04-02", "Author_Location": "Lombard, IL"}, {"Author": "Michelle L.", "ReviewID": "DdXHE2xExJHF53ZEt6XU5g", "Overall": "4.0", "Content": "I've always loved the Spaghetti Factory and have had really good experiences here.  Sometimes the wait is long to get in, but you know that going in so don't go starving to death or you'll pass out before getting your food.  The longest I've had to wait was 80 minutes.The decor is old Victorian style, although the last time I went I noticed things have changed a bit.  They have removed some of the fringed lamps and replaced some old booths, added new lighting.  Maybe it has to do with code...The food is really good and at a great price.  It includes entree, drink, salad, bread and dessert.  No other place I know of includes all that for about $11 per person.My favorite is the plain mizithra pasta dish (minus the mushrooms).", "Date": "2011-05-17", "Author_Location": "Cary, NC"}, {"Author": "Michelle B.", "ReviewID": "41AnTDRPRbEib58vsDhajg", "Overall": "1.0", "Content": "gross! what else can I say. the downtown location is somewhat charming but the ambience is quickly overshadowed by the catatonic service and the horrible food. the service-the server spoke in monotone and showed no emotion whatsoever the whole evening but made an attempt at a joke before the check arrived. the entrees-served with an iceberg lettuce salad and a super salty minestrone soup. we left both untouched. the mushroom spaghetti were served without any cheese. neither did the server offer some parmesan.  it consisted of  tasteless tomato sauce from the can, five sautéed cheap mushrooms and a generous pile of soft spaghetti. absolutely disgusting! my husband got the cheese spaghetti. that was considerably more edible and fattening.", "Date": "2013-06-15", "Author_Location": "Clayton, Saint Louis, MO"}, {"Author": "Jacob U.", "ReviewID": "F-fOTFVwOxcQQ0rBXN9mzw", "Overall": "4.0", "Content": "Ok this is a bitter sweet review for me. Ever since I was young my family and I would make a yearly hommage to the Arch followed by the Old Spaghetti Factory. It was by far my favorite place to eat until we moved to the area. Possibly the nostalgia was blocking my taste of the food because recently the food and portion sizes have been medicore. Now don't get me wrong $10 for starter salad, bread, pasta, AND ice cream is very reasonable esp for downtown St. Louis, but recently their portion sizes and sauce usage have taken a hit. Yes you can pay an extra $2 for a larger portion but who wants to pay $2 for just a little more spaghetti and sauce.Reccomendations: Pesto (house) dressing, spaghetti w/ white clam sauce, spumoni ice cream.Bottom line: AWESOME atmosphere, reasonable prices, and good food. Not a place I would frequent, but it's nice to stop in every once in awhile for a trip down memory lane.", "Date": "2012-01-08", "Author_Location": "Scott AFB, IL"}, {"Author": "Tom C.", "ReviewID": "fOsJYtDl8ISFLH0_JxsCig", "Overall": "3.0", "Content": "Came here for a work event with a team of about 50. They had a nice area blocked off for us and did a good job keeping glasses full and plates of food coming. The food was what one would expect from a chain Italian joint although a step above an Olive Garden which I know is not saying all that much but it was definitely better. The way they handled a big and fairly rambunctious group allows me to say without reservation that the Old Spaghetti Factory would be a fine choice for a large team activity/dinner.", "Date": "2011-05-25", "Author_Location": "Huntersville, NC"}, {"Author": "Hans G.", "ReviewID": "jChNcqyke6Bkmtu7ufajWQ", "Overall": "4.0", "Content": "So, it's a chain with all the authenticity of Applebee's... but they handle large parties well and the place (in the basement of a historic building on Laclede's Landing) is interesting.  The food is both consistent and predictable.So, 4 stars in context.  By no means should couples or tourists in small groups consider this an endorsement over any of the numerous more original places within walking distance.", "Date": "2006-09-18", "Author_Location": "Amsterdam, The Netherlands"}, {"Author": "Sara C.", "ReviewID": "jEDK62q38zyc9HTuDnEKFA", "Overall": "3.0", "Content": "After a long afternoon driving from Columbus, OH, to St. Louis, MO, we were hoping that this place was still open when we walked up at 9:35 PM.  I had fond memories of going to Old Spaghetti Factory locations for my birthday as a child, and in particular was looking forward to the brown butter and Mizithra cheese spaghetti.There was no one by the top floor entrance when we arrived, but we followed the signs down the staircase to the hostess station, where we were greeted and seated in a small booth.  There was the requisite train car with booth inside in a larger area of the dining room.  Dan had the garlic shrimp fettuccine, and I had the half clam sauce/half brown butter and Mizithra cheese.  There was also a loaf of bread which disappeared quickly (mostly because someone had only had a slice of pound cake for lunch), and salad.  Dan was a little disappointed at the beer list, but had a glass of Fat Tire.  The shrimp in Dan's meal came with tails still attached, which made it a little awkward to eat.  My spaghetti was rather watery, which caused the flavors to run together.  Our waitress was polite but very brisk -- probably due to the late hour.  We felt a little rushed throughout the meal, even though it was only 10:20 when we left.  Also, since the doors to the building lock automatically at 10PM, we ended up wandering fruitlessly through the atrium and back into the restaurant before being informed that there was a small button near the exit which would unlock the door so we could leave!It was fun coming to a Spaghetti Factory after so many years, but I'm not sure I would come back again; it is, after all, just spaghetti.", "Date": "2012-09-05", "Author_Location": "Columbus, OH"}, {"Author": "Brooke R.", "ReviewID": "KjTe7vQnaoMPgGMeGUVqQw", "Overall": "3.0", "Content": "I hate to say it but I am really dissapointed with this place. I used to be a big fan. They used to have amazing fettuccine alfredo. Now it tasts prepackaged and uneventful. So the last time I went I ordered something different. I got the chicken marsala. SO disappointing. It was the saddest little chicken marsala I ever did see. The good points of this place is location, atmosphere, and the bread and butter. You can't beat Lacledes Landing for a location. Its an amazing place to just walk thru. As for atmosphere, I love the trolley car in the middle of the restaraunt and the booths made out of beds, the awesome staircase. Its a grand place to eat in. The bread is a hearty loaf that comes on a carving board with oh so yummy garlic butter. It was the highlight of my meal. We did call ahead so our wait time wasn't even five minutes on a saturday night.  The food arrived quickly and our waitress was decent.  Go once and form your own opinions.", "Date": "2008-08-07", "Author_Location": "Pawnee, IL"}, {"Author": "Jason A.", "ReviewID": "mmt-2csTmZhudkJzNZAojg", "Overall": "4.0", "Content": "Quick place to eat if you are visiting downtown St. Louis.  We had a 4 year old kid with us, and the atmosphere worked well.  The food was good enough that I would go back, but it was simple enough that the price was right.  I can't say the flavor of my Lasagna was anything special, but sometimes a few simple ingredients is all it takes.  I would return if I were in the area and didn't want to spend all night at a decent restaurant downtown.", "Date": "2010-10-09", "Author_Location": "Harker Heights, TX"}, {"Author": "Jenni A.", "ReviewID": "ZIlUQyrqjKhBw4DPDyFTSg", "Overall": "5.0", "Content": "The atmosphere and ambience can't be beaten!! I can sit and just look around for hours at this place! I love the decor!  The food of course is excellent and the service is outstanding!  A must do in St. Louis!", "Date": "2013-08-17", "Author_Location": "Saint Louis, MO"}, {"Author": "Jessica B.", "ReviewID": "2SWHUGOpf9wZfbiVbvqkKg", "Overall": "4.0", "Content": "I love this place! It is so beautiful, the food is good, and it is reasonably priced! You can get your meal, a salad, a drink, and ice cream for $10 I think. The ravioli is sooo good.The only down side is that you can't make a reservation for less than 6 people I believe, and so there is always a long wait. You can call ahead an hour before and then it's only about a 20 minute wait but sometimes people can wait as long as 2 hours.", "Date": "2012-09-11", "Author_Location": "Carterville, IL"}, {"Author": "rob c.", "ReviewID": "Rva0_fkKSyTzQoFTWOGc1w", "Overall": "4.0", "Content": "My dad and my sister are borderline obsessed with Old Spaghetti Factory restaurants.  There, I said it.  Me, i merely think they're good, cheap food.  Seriously, though, he'll seek them out in any town he's in, and she used to drive 8 hours from Montana to get dinner at one.  I mean, it's good spaghetti and all, but whoa, dude.  And last week when we were wandering St. Louis, my dad was appalled at the thought that it might have closed, ranting at the injustice of it all after it didn't show up on a map.  His relief that it was still open was equally palpable.But don't let my bewilderment at that sell this place short.  It's really good food, in some neat old-warehouse type locations (especially this one in St. Louis), with decent portions, salad, bread, and dessert all-inclusive at a pretty low price, particularly for downtown locations.  These places are especially good for kids, too; if you're taking them out to a ball game or the science museum or something, this is an ideal way to get those mouths fed.", "Date": "2007-08-07", "Author_Location": "Boston, MA"}, {"Author": "Jai J.", "ReviewID": "bl-eqq8PVPIma_6A29Cbtw", "Overall": "5.0", "Content": "Mmmmmm!!  I really wish we had an OSF in San Antonio!  I miss their Italian style meatloaf and their awesome lasagna!  I loved smelling the bread as soon as I'd walk in...And then after stuffing my face full of their wonderful food, a walk by the river always topped off the evening.", "Date": "2008-07-30", "Author_Location": "San Antonio, TX"}, {"Author": "Howie F.", "ReviewID": "p-W30ydYWcYmYU00CzgVKg", "Overall": "3.0", "Content": "Food is good, not special, but good.Great value (under $10 for an entire meal including drink?).I am keeping it at three stars however as I thought it was a St. Louis restaurant, it ruins my memories of a childhood when I thought it was special we had this cool place in STL.Location is beautiful though, what was this a church?", "Date": "2009-10-29", "Author_Location": "St Louis, MO"}, {"Author": "Jen B.", "ReviewID": "1N-Sd-4UQTwM-nCD0sfs7Q", "Overall": "4.0", "Content": "We took a group of more than 20 teenagers here for an 8:30 p.m. reservation. We arrived piecemeal after 9 p.m. and we were treated like royalty. The food is predictable and generous, but it was the service that impressed me. And the reasonable prices! Not one of our Los Angeles born-and-bred teens had eaten at an Old Spaghetti Factory before - and I'm not sure many would go back. But the server saved the day by providing speedy meals for our horde.", "Date": "2008-11-25", "Author_Location": "North Hollywood, Los Angeles, CA"}, {"Author": "Betty I.", "ReviewID": "LS_UjVyPeSDcNC4h2F676Q", "Overall": "4.0", "Content": "We go here with my husband friend & his family. I got strawberry lemonade that's very good for 2.99 !We  also got : Garlic cheese bread & Toasted ravioli for appetizer.I got Gourmet Jumbo Crab Ravioli for entree. My husband had chicken marsala.Than for dessert we had mud pie. All the food was delicious ! Service was good.Atmosphere was unique. I love this place ^,^Definately will come back again to taste some other food.", "Date": "2012-09-04", "Author_Location": "Imperial, MO"}, {"Author": "Asaf O.", "ReviewID": "TutAN_vd0UwmtF2EIbYHpw", "Overall": "5.0", "Content": "After eating at the Old Spaghtti Factory in California, I wanted to try this one when we were in St Louis and it did not disappoint. I had the Browned Butter and Mizithra Cheese Spaghetti like I had in California and it was great. The building is not as unique as the one in Duarte but it is still very very pleasant. Try it and you will not be disappointed.", "Date": "2008-08-10", "Author_Location": "Skokie, IL"}, {"Author": "Kathryn P.", "ReviewID": "gnrtZEupHEb1NszVuh4jJA", "Overall": "3.0", "Content": "I have been here before about 20 years ago and while not much has changed the overall ambience has gone down.  I remember it being more quaint and cutesy.  The food was ok, average Italian fare.  The house dressing is good, but over all just -ehhh.", "Date": "2013-04-09", "Author_Location": "Chicago, IL"}, {"Author": "Travis F.", "ReviewID": "M9EDuZqHnRDw5IJbbrHh9Q", "Overall": "4.0", "Content": "I love this restaarant, its inside in a basement setting, very romatic if your going for that effect! They also have an ol' street car you can sit in! Very nice! Food is awesome if you love the Italian foods! Try it! you will like it!", "Date": "2012-10-22", "Author_Location": "Saint Louis, MO"}, {"Author": "Mbigggbass Y.", "ReviewID": "5kWE337trdeHFUovY0znmg", "Overall": "1.0", "Content": "Food ok but service sucked can't get what u ask for ,about 14min later they bring it out ,after waiting 40min to be seated  hello", "Date": "2013-12-28", "Author_Location": "Cement, OK"}, {"Author": "Greg P.", "ReviewID": "rl4RkMmNkKq6EWVAC-oiOg", "Overall": "2.0", "Content": "Went here with a group of friends after a afternoon at the St. Louis Symphony. The wait wasn't too long considering it was around 5pm on a Sunday.I chose the Meat Lovers plate which came with Italian sausage, Sicilian meatballs and of course Spaghetti and my wife chose the Spinach Ravioli with a white cream sauce instead of the meat sauce. I have to say while sausage and meatballs had good flavor, I wasn't impressed with the spaghetti/meat sauce at all. It looked and tasted more like it came from a bottle at the store. It was soupy and wasn't meaty at all. The server was very welcoming and friendly and prompt to get us refills and remove plates/glasses that were empty. The free scoop of Spumoni Ice Cream was very tasty and a nice complement to end the meal.I hadn't been here in a while but I can't say I was overly impressed especially considering I got what I figured would be a classic signature dish.Price wise it wasn't bad at all but for the trip/parking/food. I'll go elsewhere.", "Date": "2010-10-04", "Author_Location": "Belleville, IL"}, {"Author": "Jeremiah T.", "ReviewID": "7Rg_kZ8CpcfeXaNIQpwNOA", "Overall": "4.0", "Content": "We are here on a business trip.Good: The best appetizers ever we are going again to get more. The drinks were ok BAD: The bar tender was a jerk we were the only ones at the bar and still no service and when he did it was with an attitude. Then the service at our table when we got one was Slow. \"We asked if we never could eat here again what would you eat?\"The waiter said the lasagna it was so bad my wife and I only ate one bite and that was it. We are not the kind of people that order something and don't pay for something but this time we made an exception. It was nasty tasting and it was slimly. The waiter took it off our tab we decided to go. It only took him 20 min to get our check we asked for 3 times.WE LOVED The Ravioli best ever!!!!!great", "Date": "2012-12-28", "Author_Location": "Killeen, TX"}, {"Author": "Leslie W.", "ReviewID": "W7H2xgTrPWfUjw_ud57hsA", "Overall": "3.0", "Content": "I ask myself, why did we dine here?  I wanted to try St. Louis barbecue since we were in America's #2 barbecue Capitol.  However since we had a flight out the next morning, my husband didn't want to risk getting sick.  Thus we played it safe and ate here.  We arrived on a Sunday night and the town was dead.  We parked across the street in a parking lot that charged $6.00, because we didn't know of any other parking options.  The ladies at the hostess stand were not so friendly, like when we checked in for our reservation it seemed like we were bothering them.  Our waitress, however, was bubbly and friendly.  The food was standard, nothing spectacular, since we've dined at this chain before.  The only gripe I had about the food, was the side order of broccoli barely had any mizithra cheese.  It mostly tasted like steamed broccoli with a little bit of melted butter.  When the dinner was over, as we walked out of the restaurant we said, \"Thank you\" to the host staff.  They hostess' didn't even nod or reply back, which I thought was so rude.  Anyway, we had a good time connecting with family, but I would not come back here again.", "Date": "2013-08-21", "Author_Location": "Sacramento, CA"}, {"Author": "Sarah S.", "ReviewID": "PPgkRMV3Haz0FFK97Jy8Jw", "Overall": "4.0", "Content": "When I was a kid and didn't live in St. Louis yet, no trip here to visit family was complete without a trip to the Old Spaghetti Factory. I don't get there very often now that I live in St. Louis but whenever I do, I remember that I still like it, even though it's a chain!I am coordinating a program for a group of kids from Spain who are visiting this summer, and today we did the \"downtown\" tour. OSF was an easy choice on where to eat because it's well priced and easy, and I love how each meal comes with soup or salad plus ice cream. Plus it's about 5 minutes walking from the Arch. Sold!We walked in at noon and were seated within 5 minutes - a group of 12. Our server came over and told us she was in training and was also being supervised by another server. No problem. I ordered toasted ravioli for the table since they had never tried it and it gotten eaten up quickly. Our servers got our used plates out of the way quickly and brought bread and our salads. They were nice enough to bring the salad dressing on the side (without us requesting it) for everyone because the kids had never tried ranch before, and the servers wanted to make sure they had a choice if they didn't like it. Nice touch. All the kids loved it so it was used up. They kept our water glasses filled, bread plentiful, and plates cleared. Food came and the kids loved it too. I enjoyed mine. The ice cream came - another hit. We were stuffed. All for $148 for 12 people, with apps, salads and dessert, not including tip. I left a nice one - great service! They really took care of us and got us in and out in an hour or less. I recommend this for groups or a nice and yummy lunch or dinner!", "Date": "2011-06-29", "Author_Location": "Saint Louis, MO"}, {"Author": "Ed A.", "ReviewID": "eOOdRgYnnC7pIU3ru8BMIA", "Overall": "1.0", "Content": "I'm really not sure why anyone would eat at this place.  I mean if you like Italian cuisine, this is not the place for you.  The pastas are HORRIBLE and the place is usually crowded so you might have to wait for awhile for the privilege of eating this horrible food.  If you like gimmicky places, you will probably enjoy this, but just drink alot and eat little and you will probably have a nice experience.  If you do drink alot, take a cab home!  I see that some folks have given this place rave reviews but I attribute that to the fact that they took sound advice and drank alot and thus felt good about giving the place a good review.  It is really, really horrible.  Try some food without drinking and see what I mean.", "Date": "2010-01-18", "Author_Location": "Saint Louis, MO"}, {"Author": "Jeanie M.", "ReviewID": "CUx5JBjZhO1YZmSZtTrNqg", "Overall": "4.0", "Content": "I love going to the Old Spaghetti Factory with friends. It's casual and homey. This a great place to take kids,too. Decent food and decent prices. I have yet to have a bad server.", "Date": "2012-12-18", "Author_Location": "Pineville, LA"}, {"Author": "Maggie W.", "ReviewID": "00tyJ4LD47O997slBh2QGA", "Overall": "3.0", "Content": "It all began when I discovered our reservation for 10 had been given away.  We were running 15 minutes late so I called ahead, but apparently when I spoke to the manager upon arriving, this call never occurred.  After this, I was determined to go elsewhere, but my best friend who loves Italian and was visiting home from Vegas, had her heart set on this childhood favorite.  So I caved...I'm such a sucker.The manager did scrounge up a table for us pretty quickly (maybe it was the laser looks we were giving him), and we were introduced to the best part of the restaurant: our waiter.  This guy was so cheerful and animated he immediately brightened everyone's mood, despite the murky-looking water and completely lackluster food.  The interior of the restaurant is gorgeous, with high, beamed ceilings and a plush lounge.  But the best part, the waiter, stood on a chair to sing me happy birthday and got the whole restaurant involved.  No, it wasn't my birthday.  Not that we faked it or anything, but for some reason he asked us who had the most recent one, which happened to be me.  Guess he felt like giving out free desserts.  Anyway, this normally would have made my cheeks burn (which it did a little), but it was all in good fun and we ended up experiencing a pretty good end to a pretty crappy beginning.", "Date": "2008-08-12", "Author_Location": "Saint Louis, MO"}, {"Author": "Catherine S.", "ReviewID": "KlyvvXjVdRmmWk7QUB4aBg", "Overall": "3.0", "Content": "Kid-pleasing menu, great atmosphere, good value. Nice waitstaff. Yeah, not the most amazing food, but a perfectly decent family meal for a perfectly decent price.", "Date": "2010-04-02", "Author_Location": "Lake Zurich, IL"}, {"Author": "John D.", "ReviewID": "_ON8hCclraAKGdXJ1IbqnA", "Overall": "4.0", "Content": "Very nice place! It is in a nice area; right near the Landing. I have always gotten great service and the food is delicious. The only draw is if you want to park close, you have to pay. And if you aren't careful, you can get lured by a homeless person pretending to be a parking attendant. Nonetheless I always eat well here and the specials are just the right amount of food, and it comes with dessert!", "Date": "2010-08-04", "Author_Location": "Chicago, IL"}, {"Author": "Steve H.", "ReviewID": "Gpe6uARFreyH_zXHae58-A", "Overall": "2.0", "Content": "Don't know how this place stays open and why so many people love it.  The house specialty is misithra cheese spaghetti.  Think of it as noodles with parmesean, but will little flavor and the dryness of sawdust.  I mixed it with the linguini with clam sauce, and it was tolerable.", "Date": "2013-02-05", "Author_Location": "Saint Louis, MO"}, {"Author": "Melissa T.", "ReviewID": "NJYrodGanPxUkri7TDARrg", "Overall": "3.0", "Content": "Service was slow and the food was ok. However, for the price, you got your moneys worth", "Date": "2010-07-25", "Author_Location": "Princeton, IL"}, {"Author": "Sadia Lynne B.", "ReviewID": "KzP9emCqqDlxvlO93wNcFA", "Overall": "2.0", "Content": "BEAUTIFUL BUILDING adorned with a massive antique winding staircase...very Victorian...Heavily ornate.  I enjoyed the aesthetics and \"feel\" of the restaurant.  However,  The pasta is not homemade...WHY is that management???  If you call yourself a SPAGHETTI FACTORY, then where is the FRESH pasta??? My food was terrible.  I am sorry to say it, but it was really bad.  The only things that made me smile, or mildly impressed me about the meal was the spumoni scoop at the end of the meal alongside the cool balloon man who made my son a great creation (DONT FORGET TO TIP HIM PEOPLE).   What did I have for dinner? Chicken Parm & spaghetti. THE PARM was super dry, no fresh tomatoes, the \"sauce\" I bet comes right out of the can.  WHOEVER IS MANAGING THIS PLACE IS IN THE WRONG BUSINESS.  USE fresh pasta, use homemade sauce (that tastes good), use fresh Mozz...change the menu.  MAKE IT MORE AUTHENTIC!!!!!!  After bashing the crap out of your food, I must applaud your management staff for being so friendly.  Other than that, if you guys want to stay afloat, you must kick the kitchen in the ASS, food from the 1980s is not going to pull you through the hard & slow months.P.S. KUDOS to the owner of the building for salvaging it.", "Date": "2013-01-29", "Author_Location": "Boston, MA"}, {"Author": "Bill S.", "ReviewID": "vHH57l17quSejKoy-J4RYg", "Overall": "2.0", "Content": "This place  has a great ambiance,  and they really push the people through by the hundreds ,  I was amazed at how many people where seated while we where there , I really liked the atmosphere  the food was marginal at best though,  but the prices where pretty good  and the service was very good   so if you asked me if i would go back  ?   Well I guess so  if thats where everyone else wanted to go   but it wouldn't be my first choice by no means .", "Date": "2012-11-04", "Author_Location": "Cary, IL"}, {"Author": "Sherah B.", "ReviewID": "XAjdiy7w2uC3u2yWRi4gBQ", "Overall": "5.0", "Content": "This is a great place. I remember coming here with my parents when I was little and being enthralled by all the brick. It really is a lovely setting. I have been back many times and absolutely love how you can order whole wheat noodles. Can you do this other places? If so, I'm unaware. The mizithra cheese and brown butter is amazing and their house ranch is great too. Fun atmosphere & great for big groups since there is a lot of space. Some of their cocktails are good too!", "Date": "2009-10-22", "Author_Location": "Peoria, IL"}, {"Author": "William C.", "ReviewID": "uoDOsllvoZo1iU2pNe5eGQ", "Overall": "3.0", "Content": "On my most recent business trip to St. Louis I stopped in for a quick dinner before heading to the ballgame.  The food was as good as usual but the serving size seemed smaller than I remembered from previous trips.  The service was just okay.  My server was training a new person.  This does not bother me other than the fact that my server was just okay.  My drink glass stayed empty far too long and there were long gaps with no service even though the restaurant was not even half full.  This is on the heels of my last trip where I had the pleasure of listening to one server complain about his evening plans and work schedule to another server.  There seems to be a lack of professionalism in this restaurant.  I like the food but will go into any possible future visits with very low expectations for the quality of the service.", "Date": "2012-05-12", "Author_Location": "Springfield, MO"}, {"Author": "Chris W.", "ReviewID": "88B6Qnis6B0WCKGNoRfVNg", "Overall": "4.0", "Content": "Looking for a place to take 3 picky kids while on vacation in St. Louis and the spaghetti factory provided just what we needed.  From the casual dining, excellent service, and balloon animals for the kids this will become a stop the next time we are downtown.", "Date": "2012-07-21", "Author_Location": "Clive, IA"}, {"Author": "Les S.", "ReviewID": "AeoiDgJ32kJdrlgD-_iHDA", "Overall": "1.0", "Content": "I would prefer to leave zero stars.  I ordered the spaghetti with Meat Sauce, completely inedible!!  I would have complained, but the server took forever to come back to our table.  Several people around us were angry about the service.", "Date": "2010-08-16", "Author_Location": "Clinton, IL"}, {"Author": "Trisha Eve J.", "ReviewID": "5pItpH11IkT3CUK8MRQrSA", "Overall": "3.0", "Content": "Visited: August 5th, 2011After the arch, the 5 of us went to the Old Spaghetti Factory. Now I've heard of this place before but never had ate there. I know that most of the locations are in California, with two of those locations being in San Diego County. One of them was near my alma mater Cal State San Marcos. Anyway, we walked on over to the restaurant from the arch, which took us about 15 minutes. When I walked inside, I thought this restaurant was decorated nicely, with a trolley car smack dab in the middle. We walked upstairs and were seated promptly. The menu was decent and so were the prices. I ordered the baked lasagna, my boyfriend ordered the spinach and cheese ravioli, Michael ordered the Fettucine Alfredo, his son Keaton ordered the spaghetti with meat sauce (from the kids menu), and his step-daughter Kylee ordered the spaghetti with marinara sauce (also from the kids menu). For appetizers for all of us, Michael ordered the cheese bread, olive tapenade, and toasted ravioli. We got our food within ten minutes. I enjoyed the toasted ravioli and the cheese bread, but not the olive tapenade. I don't particularly like olives, but Michael had me try it. It was pretty much chopped up olives with toasted crispy bread. My lasagna was tasty, but not the best. That's how Michael felt about his Fettucine. But Rob and his niece and nephew seemed to enjoy their dishes.  Overall, the meal was ok, nothing too spectacular. The prices were decent so it's not like it was breaking the bank for the food we got.", "Date": "2011-08-13", "Author_Location": "San Diego, CA"}, {"Author": "Kevin H.", "ReviewID": "V80-tAzx5fDJjvSihgg2tw", "Overall": "3.0", "Content": "Another trip to St. Louis, another review of a St. Louis restaurant. I've got to admit this travel thing has gotten old, and quick. Not that St. Louis has bad food, because it doesn't.Anyways, being rather tired for a LATE flight into town the night prior I decided to keep things close to my hote. Seeing as I always stay at the Gateway Arch Hampton, restaurants in the Landing are quite close. Old Spaghetti Factory is one of the few places at this point I have not been to down there.At first I didn't realize that this is a chain, but then I remember a long time ago I had been to the one in Columbus OH. As usual when I am in St. Louis I sat at the bar, alone; which, normally I would say that is a big indicator of a restaurant, but it always seems that these places are slow when I am in town. I ordered the lasagna which came with a house salad and bread. The salad honestly was your typical Dole straight out of a bag lettuce mix and there was NO flavor to the dressing. When I get caesar dressing on my salad I want that signature tang that caesar dressing should have; this dressing was boring and muted, no tang, no garlic, nothing. On the menu, it said the lasagna was baked, and always fresh. I got the feeling that this stuff was something similar to the Stouffer's lasagna you can buy in the grocery store. The ricotta was dry, and much like the salad there really wasn't a whole lot of flavor to it. The only real saving grace to my whole meal was the two pints of Schlafly Heffeweisen I had. For a town that gets lot's of attention because of Anheiuser (yuck) it amazes me that you don't hear much/anything about this beer elsewhere, they brew some AMAZING beer, so much so a buddy of mine from back home keeps asking me to bring a case back with me each time I'm down here.I'm half tempted to give this place a two, but the bartender who served me last night was very nice, and friendly so I'll give it a three. That being said I don't imagine myself making a return trip to any Spaghetti Factory.", "Date": "2009-05-19", "Author_Location": "Leesburg, VA"}, {"Author": "Rob C.", "ReviewID": "aPqmm11dgMAVN1E-N3LT4w", "Overall": "3.0", "Content": "one of those family kid friendly places -- almost a prerequisite.commercialized dishes, nothing extraordinary.cool interior, liked the antiques.", "Date": "2008-01-06", "Author_Location": "Palo Alto, CA"}, {"Author": "Salena P.", "ReviewID": "-p666Ug_BmlNghYd21MTLg", "Overall": "1.0", "Content": "Worst food ever!", "Date": "2012-10-26", "Author_Location": "Fishers, IN"}, {"Author": "Brandy Z.", "ReviewID": "JWP1bwr3gLPkMedB1MJE6g", "Overall": "5.0", "Content": "Goddang! This is some phenomenal spaghetti with chicken sausage and marinara. If your in town where one is at get there and eat some pasta cause its off the hook!", "Date": "2011-10-29", "Author_Location": "Houston, TX"}, {"Author": "Prakash S.", "ReviewID": "qA3jeYK-iy2o-vR6ooDSVg", "Overall": "5.0", "Content": "Great hidden treasure in downtown St. Louis.   Great family resturant or for a night on the town.  Fresh, well cooked food.  Fabulous Pasta and bread.", "Date": "2007-03-10", "Author_Location": "Winchester, VA"}, {"Author": "Sue S.", "ReviewID": "2y2VgJlWqa9QGEwh39eRPw", "Overall": "4.0", "Content": "Our very large group dined here while visiting St. Louis. The restaurant is very conveniently located within walking distance of the Arch and downtown hotels. While not gourmet, the food was good and they are nicely set up for families and groups. They do have a kids menu and the service was excellent. It also has a nice atmosphere and a good beer selection.", "Date": "2012-08-22", "Author_Location": "Chicago, IL"}, {"Author": "e e.", "ReviewID": "lSdODT7Xql81LFMMQiuJ7A", "Overall": "4.0", "Content": "good 'chain' Italian food. comparable to an olive garden, but with more character- and who doesnt love that kind of food??the interior is beautiful- and great location.  the menu is simple (pasta pasta) but food is a solid good.  plus with every entree you get bread, salad, drink, and dessert! (my boyfriend was ecstatic with all the 'free extras')", "Date": "2009-07-18", "Author_Location": "Chicago, IL"}, {"Author": "Kevin C.", "ReviewID": "6U5eLr67GIRXTqdWTTG2jQ", "Overall": "4.0", "Content": "Went looking for someplace to eat and found this online, they don't have very good signs.  Even finding the entrance when I could see inside wasn't that easy.It was a little dark but the food was good.", "Date": "2010-06-05", "Author_Location": "Kansas City, MO"}, {"Author": "Kirk K.", "ReviewID": "5l4l6m5Txn2dPUhDPByuaw", "Overall": "4.0", "Content": "We found this as one of the restaurants that had a gluten free menu and had to go! Good gluten free menu options that are tasty and not pricey. Hope to go again! Thanks so much for being sensitive to this allergy!!", "Date": "2011-09-08", "Author_Location": "Washington, DC"}, {"Author": "Julianne M.", "ReviewID": "UKiE7tOAv7FjvIxxv6QuJg", "Overall": "5.0", "Content": "It was my birthday tradition to come here when I was younger. Went recently and the food is still good! The atmosphere is nice and intimate.", "Date": "2013-08-14", "Author_Location": "Saint Louis, MO"}, {"Author": "Oliver G.", "ReviewID": "kcT-3xonghRm9fkZSVC_0w", "Overall": "2.0", "Content": "Cool location, absolutely forgettable food, and some of the worst service I've ever had.  At least the manager had the sense to give us some gift certificates because even she knew it was awful.  Should be a fun place to take the kids, we must have really caught them on an off day.", "Date": "2009-08-15", "Author_Location": "Nashville, TN"}, {"Author": "Justin Y.", "ReviewID": "swjJlhV0yj6Wt6icndvttg", "Overall": "4.0", "Content": "It was pretty good food and located on the river front.", "Date": "2010-01-03", "Author_Location": "Lubbock, TX"}, {"Author": "Ryan G.", "ReviewID": "TNUJviTPHf8DcjpfGdL9tA", "Overall": "4.0", "Content": "The vibe and the food are both outstanding.  The location is great- downtown St. Louis, in amongst some great old buildings.  The food is really satisfying.  Good Italian fills you up and this place doesn't disappoint.", "Date": "2012-07-02", "Author_Location": "Kansas City, MO"}, {"Author": "Steve S.", "ReviewID": "LPyitlIyhSWTpmlg3kRQAw", "Overall": "2.0", "Content": "I just had the most unpleasant downtown St. Louis lunch experience I can remember having.  Our adventure began by making reservations by phone, and being informed of when they could seat us.After arriving on time for our reservation, we had to wait another 15 minutes.  It was another 15 minutes before we even got to *place* our order, and a full 45 more minutes - an hour at the table - until our food even got there.  When it did, one of the orders was wrong, and most of the rest of the food was cold.  Meanwhile, the whole table was drinking only water, and our dinky little glasses got refilled once in that entire wait.After sitting at the table for an hour and a half, we finally got our checks - they were nice enough to split it and spare us any automatic gratuity, which is why they held onto that second star.  That, and our server was really rather polite.  But we were there for a total of two and a half hours at lunch, for crying out loud.It's obvious that the only reason so much went wrong is because they were understaffed.  But being understaffed isn't an excuse for cold food and an immense wait on a Friday lunch.", "Date": "2007-08-10", "Author_Location": "Saint Louis, MO"}, {"Author": "Tabitha M.", "ReviewID": "Du5BzFIg5L71vek8w-KIZw", "Overall": "4.0", "Content": "Old Spaghetti Factory may not be the most authentic Italian restaurant but it has a nice atmosphere and good food. I ordered a combo meal of lasagna and chicken marsala, which was completely unnecessary but delish! The portions were huge and both tasted good. It's not quite your grandmother's cooking but it is a definite step above Fazzoli's. Our waiter, Fletch, was super friendly and made great food/ drink recommendations. While it may not be anything spectacular, the food hit the spot and the service was great!", "Date": "2010-08-15", "Author_Location": "Saint Louis, MO"}, {"Author": "karl c.", "ReviewID": "g5ajArAtit528_uZ0pGD6A", "Overall": "3.0", "Content": "We found this place by accident. I was glad that we did. It is not five diamond food, but it is good. The atmosphere was quaint and the service was average. I would suggest it if you are near the Arch and looking for a good place to eat Italian.", "Date": "2010-08-18", "Author_Location": "Pampa, TX"}, {"Author": "Steve K.", "ReviewID": "gjJ0vAw1E3P8HGRcvQI-aw", "Overall": "4.0", "Content": "The food is good but not great.  You can certainly find better Italian any number of places in and around St. Louis.  But the ambience is fantastic, especially for groups.", "Date": "2011-11-14", "Author_Location": "Breese, IL"}, {"Author": "Heather L.", "ReviewID": "6T_GMPtzPfRRgJCT2baUaQ", "Overall": "4.0", "Content": "Love this place. Can't beat food like this for the price. We are locals and have been hundreds of times so have had both good/bad service, and good/bad food experiences. Meatloaf used to be my favorite but the past two times it was dry, lacked flavor and gave me a belly ache....could have been bad. Stick with the browned butter and mizithra cheese dish. Its the best. If it tastes like a burnt grilled cheese, they cooked the butter too long, send it back. When its done the way it should its HEAVEN! Complete meal includes salad (creamy pesto house dressing YUM!!), tea/soda, and ice cream for dessert", "Date": "2011-12-10", "Author_Location": "Collinsville, IL"}, {"Author": "Matthew C.", "ReviewID": "5YYocKR4gF85sXu9Ku5FXA", "Overall": "4.0", "Content": "My family has been coming down town to the old spaghetti factory on the sunday before x-mas for 32 yrs. now saying that I can say they are slowly cutting costs on food portions and quality. Eating here is an amazing experience in its self and the food is pretty good.", "Date": "2012-03-21", "Author_Location": "O'Fallon, MO"}, {"Author": "Greg R.", "ReviewID": "wXZk5Iiu5ItoZryBP2Tpuw", "Overall": "2.0", "Content": "Went last night on my first trip to St Louis. The spaghetti sauce tasted like the sauce from chef boy r dee's ravioli when I was growing up. The atmosphere was nice, waiter was great, but the food just lacked the Italian quality my family was hoping to enjoy. The meatballs were great. Italian sausage, I  have had better from a spaghetti supper fundraiser at school.", "Date": "2012-08-07", "Author_Location": "Platteville, WI"}, {"Author": "Ivy B.", "ReviewID": "OeVICcZL9cgFbf_JLaWczQ", "Overall": "4.0", "Content": "This is one of my guilty pleasures.  I miss the one in Kansas City so much that I like to go here when we take our son to St. Louis.  The food is consistently good, ambience is great and everybody loves it.  Great place to go with your kids!", "Date": "2013-02-08", "Author_Location": "Kansas City, MO"}, {"Author": "K W.", "ReviewID": "8kd7adreTKePletnoAZxBg", "Overall": "4.0", "Content": "Michelle our waitress was great!!!  Very fun!  Minestrone unbelievable!  There were 6 of us....we waited about 50 min for a table....not bad.  Food was very good....mizithria with brown butter, mushrooms, n bacon was Fantastic!!!!   Great time was had by all!", "Date": "2011-02-27", "Author_Location": "Ballwin, MO"}, {"Author": "Jayme N.", "ReviewID": "5D6kQYYrypREBRoKlsKJBw", "Overall": "4.0", "Content": "This gets four stars because it is very kid friendly and very cheap. The food is edible and my kids have enjoyed dining here for years. Would never be a \"date\" place but a good alternative to McDonalds for the kiddos!", "Date": "2013-01-28", "Author_Location": "University City, Saint Louis, MO"}, {"Author": "At B.", "ReviewID": "MJRD78prDb7aDtKf2tUdIw", "Overall": "2.0", "Content": "Bland food it is like the food at Sbarro's, fast-food Italian.", "Date": "2012-10-20", "Author_Location": "Rosemount, MN"}, {"Author": "Tuesday J.", "ReviewID": "Uo5rmHdy6WsE4jPvxasDcw", "Overall": "5.0", "Content": "Fun decor.  We sat inside a real old train car!  Good food.  Fun for the whole family. Beautiful historic location.  Lots of character.", "Date": "2009-11-29", "Author_Location": "San Francisco, CA"}, {"Author": "Steven W.", "ReviewID": "uH7G6ZSSbkkv3BI0xseZwg", "Overall": "1.0", "Content": "Huge portions of mediocre food.  Poor service.  Will stay away.", "Date": "2011-12-31", "Author_Location": "Washington, MO"}], "RestaurantInfo": {"RestaurantID": "_JCHMJMs7mWEMpYWQe0geA", "Name": "Old Spaghetti Factory", "Price": "$$", "RestaurantURL": "/biz/old-spaghetti-factory-saint-louis", "Longitude": " -90.18328110000000", "Address": "727 N 1st StSaint Louis, MO 63102", "Latitude": " 38.6306206", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/qL3QTNO0ArTfmsZjjmmozQ/90s.jpg"}}