{"Reviews": [{"Author": "Jessica S.", "ReviewID": "4x72rk7lg-opJH80dJs-iQ", "Overall": "3.0", "Content": "My boyfriend always always wants to go to Dave and busters. He never stops bothering me about it so the first time we went, we spent $60 and lasted about an hour on games. Definitely not worth it. So we decided to come on Wednesday which is half price games and still paid the $57. Much better deal! Because 2 hours of gaming for the both of us is fun, and the perfect amount of time! The issue why I docked some stars is because about 5 games (we were positive we won) wouldn't spit out tickets. I didn't want to call someone every single time so I just dealt with it while feeling a little bit annoyed. So fun date night regardless! I opted for sweet tomatoes right next to Dave and busters as I didn't want bar food today and something with a little more nutritional value.", "Date": "2014-06-05", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Mary G.", "ReviewID": "ddrz6rhZ6CeaydfrZqsa6g", "Overall": "2.0", "Content": "This place is kinda falling apart but I gave it 2 stars because the inside is kinda pretty.I especially like the glass mosaic thing they have inside the restaurant. The games didn't interest me much but I know someone who had a lot of fun there. Every time I go, it's very empty and it's kinda depressing. They don't really have windows.", "Date": "2014-06-29", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Steven S.", "ReviewID": "VuavI6ey0OW1PEGin8l_MQ", "Overall": "2.0", "Content": "Atmosphere is nice. Love the game. Food's cold.Service is a bit on the slow side during the day, which is understandable because of the off hour, but maybe the place would be better served if they close off some of the dining areas during the day. Great if you like to relax, though.", "Date": "2014-06-18", "Author_Location": "Gainesville, FL"}, {"Author": "Nene M.", "ReviewID": "_HKEGY32WZvu8Z9ppZXyDA", "Overall": "1.0", "Content": "I wish I could give 0 stars just for the lack of cleanliness ! There is trash everywhere , at every game at every table , all over the floor. The only reason I keep coming back is for the kids . They however can't get enough of that basketball game and the price is right wheel. If it wasn't for cups and trash everywhere I would have given this place a solid 3 stars !", "Date": "2014-07-17", "Author_Location": "Miami, FL"}, {"Author": "Alex L.", "ReviewID": "Zz6X2548U654pju9oWoq5w", "Overall": "3.0", "Content": "When my wife and I started dating we would come to D&B with a large group of friends quite often.  The drinks were not fantastic, but got the job done- there are rather large crowds on the weekend nights, and it is a fun way to break the ice with someone- if you don't feel like games there is a huge bar and a full menu to order from.  They have many different types of seating, so whether you are trying for a romantic date, or you came with 20+ friends, there is a table for you.  We've come with 20 people for a birthday, and ordered just drinks and desserts- the donuts with dipping sauces is absolutely fantastic.  So are the hotdog appetizers.  Since we've been married we come here all the time with my wife's younger cousins.  I have to say that the lunch experience is far different than the after dinner, \"I just came for drinks and games\".  There are lots more kids during the day, which is to be expected- but if you are looking for lunch date place- this may not be it.  Families come during the day with tons of kids and they are running around all over.  But- if you are looking for a place to watch a sports event, then the over sized flat screens might just entice you to ignore all the screaming kids. The vibe later in the evening is just completely different and the fact that the place is not state-of-the-art and only 1/3 the size of Boomers doesn't matter when you've had a drink or two (which you can't do at Boomers)- I have to agree with Brittany- that you just can't give this place more stars because the restrooms are seriously atrocious. I really had high hopes that D&B would realize that they were disgusting, and that while they renovated the front of the place, that they would also do something about the bathrooms.  However, they did not.  If you are not having a restroom emergency- DO NOT use the bathroom-", "Date": "2014-05-05", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Samantha D.", "ReviewID": "yNtcAM8t3xA67sILK54lJw", "Overall": "2.0", "Content": "We came here for my birthday since we have always liked Dave and Busters and have a lot of fun at them! This one although fell short of others I've been to. A lot of the games didn't work or you couldn't play the same card on one game for two players, like the play card cashiers said you could. So we had to buy another card so we could play all the games together. The place itself wasn't the cleanest and looked run down. The bartender wasn't friendly or seemed to care if we wanted drinks. We would have had a lot more to drink if we would of got some service. Best part is that we won a TON of tickets! Within 5 mins of being there I won 500 tickets and my husband won 1000 tickets not long after me! Don't get me wrong we still had a blast but we wouldn't go back or recommend this location. I think there are other places around that you could have a lot more fun at.", "Date": "2014-05-06", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Kay J.", "ReviewID": "juj8KJ1jNc2_xr0Adt_iHA", "Overall": "4.0", "Content": "Didn't eat here, just played games. There was a variety of games to choose from-action, shooting,  strategy,  sports, etc. There were a lot of kids/families,  we went in the afternoon,  but that wasn't an issue for me.Minimal wait time, friendly staff!The photo booth took my money and when I informed a worker he tried restarting the machine with no luck, then he got the manager immediately.  He refunded my money apologetically. Overall great experience, fun with friends or family.", "Date": "2014-05-10", "Author_Location": "Pompano Beach, FL"}, {"Author": "Ashley A.", "ReviewID": "__JfJ-w4Ccs3d2uf1giwGA", "Overall": "5.0", "Content": "We frequent here for any sporting events first and foremost. They have the best bar for dinner, drinks and amount of tvs. Would highly recommend coming here! You can't beat being able to just get up and head to the back for a few games to play either", "Date": "2014-05-28", "Author_Location": "Hollywood, FL"}, {"Author": "Amy M.", "ReviewID": "v2HVz642TbKZCf4N2HHSrQ", "Overall": "4.0", "Content": "The only reason I didnt rate 5 stars is because of the food. I went there yesterday night for my birthday. Easy parking. The place was packed!! As we entered we were charged $5.00 per adult which was something i was not aware of but it was ok. The view took my breath away. We decided to eat at the restaurant because we were starving and it looked beautiful. The entrance of the restaurant was a little confusing.We actually had to chase the hostess down  because we went through the back way instead of the entrance even though we walked by numerous servers they didnt bother to ask if we needed help. After we were able to find the hostess,We immediately got a table. It took about 5 minutes for a waiter to come and she was friendly but seemed uninterested. She looked like she was there to just serve you and thats it. Our food took about 10 minutes to come and everything looked great but we didnt have any silverware or napkins at our table so we had to wait 10 more minutes for the waiter to come back. I ordered the nachos and my husband the ribs with chicken wings. Honestly we ate half of it because we were really hungry but everything tasted like crap and the chicken wings were cold. The nachos tasted like pure prapika and taco mix powder. The ribs tasted old and stale. For the amount of money Dave & Busters make they should seriously consider changing the food and waiters should be more cautious to their guests. Other than that, the games, the atmosphere and the drinks at the bar are amazing. They have really really stepped up their game since a couple of years back. They have all the games you can think of from modern to arcade!! It was awesome! We ended up with 3,233 tickets got our prizes and left at 1:30 am. One issue we had was that there were some games that wouldt give you ticketsm we had to chase some of the guys that work there to help us with the tickets which was a little annoying. I had a great night but my stomach was not happy. The next day i spend the whole day on the toilet. Defenetly suggest skipping the restaurant if your coming here. There are various restaurants around that will give you wayyyy better quality food and doesnt force you to pay 18% of gratuity. Other than the food dave & busters is defenetly the place to go to for fun.", "Date": "2014-07-13", "Author_Location": "Miami, FL"}, {"Author": "Ryanne A.", "ReviewID": "oxBFIXgSGEKN9JES8vMv3w", "Overall": "1.0", "Content": "HORRIBLE SERVICE!!!!!! ZERO STARS!!!!! We were there for longer than 45min and we didn't even get a glass of water...Got there, got seated, were not even acknowledged and when we were waitress was rushed brief and rude.......worst of all never got our food, beverage, and or even a glass of water.... Rude waitress you are in the wrong industry....FIND ANOTHER Job", "Date": "2014-06-26", "Author_Location": "North Las Vegas, NV"}, {"Author": "Lauren U.", "ReviewID": "xc3R4YSx-JR78Uo8ds_XHQ", "Overall": "4.0", "Content": "A couple friends of my husband's and mine suggested that we meet up to hang out at Dave and Buster's, and i wasn't sure what to expect. I was very pleasantly surprised by good ol' D&B. I haven't been here for years and years, definitely not in my adult years, and it was a lot of fun!The restaurant reminded us of TGI Friday's. It's not good, but it's not terrible. It's food. I had ribs and my husband had cajun shrimp pasta, and they were both fine. There's definitely something for everyone on the extensive menu. The server was great! We also filled out surveys about the meal to get some free games.The game section is amazing -- it's clean and organized, not like some seedy arcades I've seen in malls before. It doesn't feel weird at all to be an adult playing games in there. There are tons of couples and groups going around, plus other people playing with their kids.There is a lot of variety, including the more traditional games like skeeball all the way to more modern games like Fruit Ninja!Overall, we had a great night and really enjoyed ourselves. If you're in the mood for something other than movie and dinner, this is a great alternative. It keeps you young! :)", "Date": "2014-04-08", "Author_Location": "Miami, FL"}, {"Author": "Jessica D.", "ReviewID": "rB5PIVaKTr-iRmrJ4OpRhw", "Overall": "5.0", "Content": "I haven't been to dave and busters in many years but the few times I have been there I always had a blast. I just told my husband that I want to go to dave and busters next weekend and he's all for it. He's a big time gamer so I knew he'd go with me.The food I thought was very good. I remember ordering the loaded potato skins and they were delicious. Their food is similar to bar food or food you would get at denny's. It's a pretty good sized menu.The arcade is loads of fun. It's like being a kid again. I love wonder woman and the last time I was there I won a wonder woman doll. I was thrilled, lol I had that doll for years. I used to keep it on my desk at work.If you just want to kick back and have a fun filled day of being a kid again, then come to dave and busters!!", "Date": "2014-03-29", "Author_Location": "Coral Springs, FL"}, {"Author": "Andrea A.", "ReviewID": "FaIrHHFrFIvHUIm1tvWBlw", "Overall": "2.0", "Content": "Came here for happy hour on a Thursday because what can be better than drinks and skee- ball, right? Well, drinks at the front bar were great, cheap and service was good. It's relatively tame, very few kids in the front and there's pool tables, huge projection tv's and shuffle board.When you slip back to the 'midway' it's a whole 'nother story.  Craziness galore and the bathroom are disgusting. I walk in thinking... Are these open to all the drunkards  walking Hollywood blvd? Absolutely a mess and didn't look like they've been cleaned up in a long while.These two stars are for drinks and service in the front bar only... Don't go back there, it's a headache.", "Date": "2014-04-17", "Author_Location": "Miami, FL"}, {"Author": "Steven L.", "ReviewID": "8pfurgvVhhmLsP9xDRMPmg", "Overall": "4.0", "Content": "D&B is always a fun place to play games, play some pool, virtual golf, have a few drinks, and eat some good food.  I recommend ordering the Mountain o' Nachos and South Philly Burger.", "Date": "2014-06-13", "Author_Location": "Fort Meade, MD"}, {"Author": "Katherine M.", "ReviewID": "jQZfbLbtR2FU54FeN0qmkw", "Overall": "1.0", "Content": "Awful service and disgusting food. Our waitress took 10 minutes to bring us waters and another 10 minutes to refill our drinks. The pecan raspberry apple salad had no flavor and neither did the grilled salmon. 45 bucks down the drain pretty much. When I asked another waitress to get us our check, she have me a ton of attitude. I've worked customer service jobs a lot, that was just unacceptable.", "Date": "2014-05-29", "Author_Location": "Walnut Creek, CA"}, {"Author": "Dana S.", "ReviewID": "p1XTibkOFrEPLiaSHwGjRg", "Overall": "4.0", "Content": "We had a good time here on Valentines Day.  The food was decent but I probably wouldn't order that particular dish again (Chicken parmesan w/ fettucine alfredo).  Was a bit watery.  I asked for some bread and it tasted like dirty dish water. :/ My boyfriend got a steak and potatoes and was happy with it. We had a really good time playing in the arcade.  Lots of variety, not too much wait time between people and games.  Would deff come here again :) But maybe order something a little bit different to eat :)", "Date": "2014-02-21", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Mark S.", "ReviewID": "MSgfnzdyh8MFW1tIkV9_YA", "Overall": "2.0", "Content": "The server royally screwed up my order then argued with me about it instead of fixing the problem. Even the manager, who was eventually brought over, was a sour faced old troll of a man who only reluctantly fixed my order after I forced him to reread the menu. Also, everything is a bit gross and unreasonably sticky, even for a kids restaurant.", "Date": "2014-06-18", "Author_Location": "Orlando, FL"}, {"Author": "Brittany M.", "ReviewID": "u1MCAROlp06X3ElmIIMtnA", "Overall": "3.0", "Content": "So this past Thursday was my first real experience at Dave and Buster's. My girlfriend wanted to go bowling, but after that plan fell through I suggested Dave and Buster's.What's better than cocktails and video games? Nothing.We had the time of our lives. Seriously.Some advice:1. Please play the zombie game. It's the coolest game I've ever played. Not only is it 3D, but your seat vibrates and some other cool stuff that actually makes you believe you are being attacked. 2. Don't miss the air hockey for four. Yes, four of you get the play each other at once. Just thought I'd throw that in there since I love air hockey and literally kick everyone's butt in it. My husband laughs at how competitive I am at that game! Haha.3. Do not go there at 10pm unless you want to wait forever for your drinks and food. The service was not that great. We had to order our drinks from the bar. 4. If you like margaritas this is the place! They are either made delish or horrible and they are definitely delicious here!5. If you order the calamari, expect about six pieces. It's good, but small. It comes with fried onions but that's pretty much all you get. They should call it the onion appetizer instead.6. Brace yourselves when you walk into the bathroom. It's disgusting. The slow service and bathrooms are the reason I just can't give more stars. Overall, the delicious margaritas and awesome games is what will keep me coming back!", "Date": "2014-04-27", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Carell D.", "ReviewID": "MCooFVPRSa76naknImizOg", "Overall": "1.0", "Content": "This place is thee worst place I have ever been to. I never feel compel to write a comment but this place was horrible. Everyone from the waitress to the manager on duty (June 26th around 9pm) were completely rude. The waitress messed up my friend and I's order multiple times and when I expressed my dispelled feelings to the manager her brushed them off and ignored what I was saying. I was uber pissed because I came there to unwind from a stressful week and they made it worst. I wasted $36 of my hard earned money. SMDH If i could say more on how much I hate this place I would.", "Date": "2014-07-01", "Author_Location": "Pompano Beach, FL"}, {"Author": "Terrance C.", "ReviewID": "e_8qiFziHm90stu3WMTTQQ", "Overall": "5.0", "Content": "Great place to eat and play great arcade games. Wednesday is half off on the games which is nice. The food is great !", "Date": "2014-05-14", "Author_Location": "Hollywood, FL"}, {"Author": "Vanessa H.", "ReviewID": "oKkkkTOZupezUSEinw_jaA", "Overall": "1.0", "Content": "Arcade is a yes... the food is no no for me. However the alcoholic drinks are really  tasteful", "Date": "2014-05-08", "Author_Location": "Miami, FL"}, {"Author": "Elvia M.", "ReviewID": "Ig1VOQyKzc3EB2yG3XX6lg", "Overall": "4.0", "Content": "This is a great place to come for family fun, they remodeled the inside dining and redid the whole menu. The food is well priced and you can also get an eat an play which we always opt for. The games are well taken care of and they are always staying up to date. My 9 yr old niece loves coming here, and I love to see her smile eveytime we come.", "Date": "2014-03-21", "Author_Location": "Miami, FL"}, {"Author": "Amira M.", "ReviewID": "cAHYCvZUanKvcnG1hMBp0g", "Overall": "2.0", "Content": "I love going here.  This place is amazing.  I've been there with kids, co-workers, families, and even on a date night.The arcade was clean and chaotic but the bathrooms were worse than that of a gas station.The food has always been a slight step above fast food for me.  It seems like they have so much potential.  Not sure why the vibe is so off here.  The staff seem to hate their jobs.  Maybe a slight overhaul would make this place really rock.", "Date": "2013-08-27", "Author_Location": "Baltimore, MD"}, {"Author": "Haim L.", "ReviewID": "8xTHyjj27h7vh0ae1P5HRw", "Overall": "4.0", "Content": "Place is great I came here with my girlfriends cousins and we had a great time the kids got to run around and play games and I was able to sit and drink it was fun I can not complain about that service was good games were fun only issue was the prizes they give we're horrible it was better to just keep the tickets then trade all those tickets for a bar of chocolate", "Date": "2014-03-03", "Author_Location": "Hollywood, FL"}, {"Author": "Katrina B.", "ReviewID": "e_9juQMDZkS8az5E8NUzcA", "Overall": "4.0", "Content": "Went here for the high school football signing day event, very nicely done. I have always been a big fan. Great place for groups and family events. Reasonably priced and great atmosphere will definitely continue to return.", "Date": "2014-02-12", "Author_Location": "Hollywood, FL"}, {"Author": "Brian A.", "ReviewID": "9suC45-7wUP_NWT1imvJTA", "Overall": "4.0", "Content": "havent tried the food but the drinks and games were fun.", "Date": "2014-05-11", "Author_Location": "Miami, FL"}, {"Author": "Anthony L.", "ReviewID": "OgGXJSIYgvwZ4GtgqQwqTw", "Overall": "3.0", "Content": "I've visited this Dave & Buster's from Jacksonville. We went there for the recent UFC fight and I will say, their bar was sweet! Make sure your bartender is Perry. He would make the experience chilling at the bar even funnier. A lot of chitchat and everyone seems a lot friendly talking about the fight surrounding 4 TVs 2 Projections and that's from just my view of looking and not looking around. There is an ATM at the enters if you need too, and the bathrooms are actually in the center of the building which was a bit weird, you'll see. Also the best games is trivia when we all interact with each other people playing and Mario kart! Have fun gaming! My experience showed me in this D&B ( bar area over the games )", "Date": "2014-02-04", "Author_Location": "Orange Park, FL"}, {"Author": "Neal O.", "ReviewID": "rgzoiQ8pDucUcqFERjh1lw", "Overall": "4.0", "Content": "D&B Update Review for 8/14/13My family and I went here again, we didn't eat any food in this visit and we played some games but mostly the ones with tickets, I found out one of the machines with tickets coming out that the \"Slam-A-Winner\" was glitched in result giving me over 2000 coupons and every time we had to call the guy to fix the ticket vending thing. I had a total of 2316 tickets and I got 2 teddy bears with hoodies (725 coupons each), pair of earphones which was 600 coupons, and a shooter which was 235 coupons. Only thing that I saw on the store is one of the bears on the hanging tags is says it's going for 700 coupons and it was supposed to be 725, maybe they didn't get to change them yet.However this place must put perfection into their machines and their store since it can fool people in which that I had rated 4 stars \"THEY GAIN A STAR!\" from my last review. Oh yeah since I sent a post to their Facebook page about my sickness that they gave me 2 $20 coupons that I got in the mail and we didn't had to pay for nothing I think in this visit.", "Date": "2013-08-14", "Author_Location": "Miramar, FL"}, {"Author": "Tony C.", "ReviewID": "pW9III7kDXcOpTMQqPmF7A", "Overall": "2.0", "Content": "This place is probably good for kids but the restaurant is extremely slow and the food isn't all great either. The cause is probably a small kitchen and not enough people working there.", "Date": "2014-02-18", "Author_Location": "Dania Beach, FL"}, {"Author": "Charles C.", "ReviewID": "HttZ5OmahPzwuYMn3ibP3w", "Overall": "2.0", "Content": "I went in for lunch and a few games. Drinks were overpriced and food wasn't very good. I was appalled that they add a 16% \"gratuity\" to EVERY check. If I want to tip I shouldn't be forced to. They then say you can ask for it to be removed. I don't want to be that one that says take the tip off. I am a very generous tipper and when they auto add the tip that's all she's going to get.", "Date": "2014-03-23", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Ilona P.", "ReviewID": "PdEFSyOxGlQH1sr-3zIjWg", "Overall": "2.0", "Content": "Not bad for a laugh. I really wish they had some pinball machines here... The games are mostly in very good condition but it seems to me that D&B is wasting a lot of space on old fashioned casino machines; maybe they're trying to lure in the Golden Girls? Wednesday offers half price appetizers and games, I took advantage of that offer and made out very well on the bill. FYI, for the ticket collectors, now they count your tickets by weight as opposed to feeding them into a machine. I don't like this method, it's faster but how do I know that the scale isn't rigged? I'll have to investigate this more...  Obviously, Friday and Saturday nights are filled with amateurs so don't bring the kiddies on those nights and keep your eyes open for the ghetto-fab fashion show!", "Date": "2013-11-08", "Author_Location": "Pompano Beach, FL"}, {"Author": "Natalie P.", "ReviewID": "pyQZrByepQIOU_83VMj9hQ", "Overall": "2.0", "Content": "I want to like Dave & Buster's. I really do. I just can't. I've been to D&B countless times over the years. I like the concept and it's conveniently located just off I-95. But here are my issues: *The food. The descriptions sound great. But in reality, the food isn't so good. In fact, after many chances, I don't think I will be eating there ever again. The apps are OK, as long as you are drinking. *The drinks. To be fair, some of the drinks are pretty good. But, most of them are pretty pricey. And they are weak. I do like the bar area, but every time I've sat at a high top, my waiter disappears. I end up having to go to the bar to get my refill. *The billiards area is nice, clean and there are usually plenty of waiters to refill your drinks. But one specific visit ruined the billiard area forever. Our waitress insisted on collecting a Credit Card to keep the tab open. She said that wasn't D&B policy, it was hers. Hmmm...ok. We told her that we were all separate, but she replied that she only needed one card. She took the Birthday Boy's Credit Card. When others in our party would try to pay for their drinks, she replied \"Birthday Boy is paying.\" Which he clearly wasn't. He ended up with a $300 bill that she refused to split up. Nice. * The game area is fine. It's great for adults and families. And, they have dining in the game area if you want to play while you eat. All in all, the place isn't THAT bad. But the food isn't worthwhile, the service stinks, and occasionally I've had to pay a COVER (to eat?!?!). In my opinion, save your time and patience. Go somewhere else.", "Date": "2009-04-16", "Author_Location": "Hollywood, FL"}, {"Author": "Kym T.", "ReviewID": "bP6nfFwR9donmfo8-VUAZA", "Overall": "2.0", "Content": "Not new to D&B, but first time at this location. It's a nice looking place inside, but they seemed to care less about helping patrons upon entry. The lady at the front reception seemed surprised that we were asking fur assistance. Once we wandered around as a result of their suggestion to sit \"where ever\", we came back and asked to be seated since there was no table large enough in the gameroom to hold our party. Our waiter Andre was overwhelmed in the beginning, but turned out to be a pretty good waiter. The ladies room was dirty and smelled of urine. Even another patron commented on the bad smell. For a tourist area, Epic Fail!!!", "Date": "2013-09-25", "Author_Location": "Chicago, IL"}, {"Author": "Wilson T.", "ReviewID": "qGkt6DfgkoCUPRp-L7d83Q", "Overall": "1.0", "Content": "Really poorly managed...I recently visited here the food was average and service was average.My biggest complaint comes from redeeming game tickets for prizes.  I can understand that it gets pretty hectic here with all the kids running about finding prizes; but I can't overlook how poorly managed this area is.  I waited in line for 30 minutes to redeem my tickets to be the next person in line, then an employee announces everyone redeeming tickets should use the next counter.  This stirs the crowd to run to open counter.  The original counter that I was next in line refused to redeem my tickets.  I complained and was they responded \"yeah we screwed up, sorry\".  It took me one hour to redeem my tickets.Advise to management treat customers with respect and make an effort to make amends for screw ups.", "Date": "2013-12-21", "Author_Location": "Santa Barbara, CA"}, {"Author": "Cassie G.", "ReviewID": "OUJhQcxYSf242Qt8SpPExA", "Overall": "5.0", "Content": "I love this place! We went here for my sister's 21st birthday. This was a first time for the entire party. When we got there, we had some problems getting in because I drove my brother down and you needed someone 25 to escort in a minor. *rolls eyes* Once calling my mom and having her come to the front desk to check him in, we were fine. Basically we all got a bunch of apps and drinks. I enjoyed the food for the most part. The cheese fries are not cheesy at all lol. My friends loved the Philly cheese steak egg rolls. I love their cocktails they have. I had a snow cone and a banana split! Yummy =) If you love arcades then you'll love this place. We had a lot of fun playing the games. They had a lot of games I'd never played before. Best part is I could have my drink right there and play =) Prices were great! I couldn't believe how cheap it was in the end. Service is not that great, but we were also a large party so they automatically added gratuity to it.  I love this place and can't wait to go back!", "Date": "2009-04-25", "Author_Location": "Boca Raton, FL"}, {"Author": "Mona L.", "ReviewID": "l1ASw19QEr525jyAlneLnA", "Overall": "5.0", "Content": "My family likes this place.  Drinks are good.  Fun for dinner then play around in the arcade.i always eat the Honey Mustard Spinach salad, it has strips of chicken breast.  Very good.  It is my favorite salad.  The plate is huge, and price is inexpensive...about $8, My son eats the burgers, which he always enjoys...hubby eats steak with potatoes...i steal his potatoes, one bite at a time, haha....as he is always stealing or trying to steal my salad....i'm quicker than he is.. :)", "Date": "2007-08-03", "Author_Location": "Aventura, FL"}, {"Author": "Megan J.", "ReviewID": "qjar8XkJxkgQvp8DoBVm0Q", "Overall": "2.0", "Content": "I came here for a birthday party last night for one of my adult friends. I felt like I was on another planet for 4 hours.  I could write a mini novella on this place but I'm going to keep it the highlights:The Good:*Food was good & was typical bar food.*Crowd was AMAZING for people watching. Families, first dates, high schoolers, slutty high schoolers, pregnant teenagers, etc. I love watching a hot mess and D&B more than exceeded my expectations.*Arcade games were fun if that's your thing. It's not mine but other people seemed to really enjoy themselves.The Bad:*16% gratuity on everything (food, drinks from the inside bar, drinks from the arcade bar, etc.) *The arcade area smells like mildew. 100% agree with other yelpers. *Our waitress was nice but definitely doing the bare minimum. We had to flag down multiple people after our food arrived for simple stuff that could have been avoid like having silverware, condiments, soft tacos for fajitas, etc.. The Undecided:*They don't take reservations. We waited an hour and  1/2 for a party of 20 and we seated at 2 separate tables within eyesight of each other.*There was an 18% gratuity for parties of 8 or more. They didn't charge it to our party but I'm not sure why.Overall, I'm torn between what to give this place. A part of me thinks \"This place isn't bad if you know what you're getting into! 3 Stars!\" But, then I think about the forced gratuity, and it just knocks it down to a 1 star. I get having automatic gratuity on large parties but for every item from any size table? It's just like a giant sign from management \"We think you're a cheap jerk! Now give us your money and we hope you accidentally leave another tip!\" Gross.Splitting the difference and going with 2.", "Date": "2012-04-22", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Nicholas M.", "ReviewID": "hOJBcJO4rALhWrKLLODPXA", "Overall": "5.0", "Content": "I haven't been here in years.  But they have completely cleaned up the place and the food,  and service was great.  I will definitely be coming back more often.", "Date": "2013-12-13", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Shaun M.", "ReviewID": "3_Qyo_T_UUmb-1DLmnAj6g", "Overall": "5.0", "Content": "Ok, I've been to D&B across the USA, and have never experienced the awesome service that I got here. Our server was Joyce splendid service and very accommodating. The manger \"Scott\" checked on us  several times to make sure we were doing ok. It seemed to me as the employees here were team players,full of life everyone helping everyone. From what I saw, this staff is every business owners dream team. Food was awesome as well, sorry everyone im a sucker for service.", "Date": "2013-09-27", "Author_Location": "Naples, FL"}, {"Author": "Ronnie F.", "ReviewID": "i0HWWYyrPwLyc1guSZUn3w", "Overall": "1.0", "Content": "Possibly the worst food I've ever had in a South Florida restaurant. We were a party of 7 and everyones food was cold, during appetizers and entree.Our waitress was great. Can't fault her.Won't be returning. .", "Date": "2012-09-30", "Author_Location": "Miami, FL"}, {"Author": "Howard H.", "ReviewID": "HFgJQVG7HYv3TJBb3zJrow", "Overall": "3.0", "Content": "I am not impressed about this place at all.  I guess its fun if you like pool or arcade games.  Beers and drinks are not cheap.  But as far as food goes, its just okay.   I ordered a peppercorn Steak and the temperature of the meat is all wrong, and it was a little salty.  I had better tasting steaks at Denny's.  Probably will only come back for the happy hour...but not even sure if they have one.", "Date": "2013-07-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Frankie F.", "ReviewID": "jwOjqiHxHd24QzjC4KtCjA", "Overall": "3.0", "Content": "3.5 stars Great place to have a corporate team-building event. My team had a sit down dinner in the private dining Midtown Room. Mexican food was served, not the best, but decent for Dave and Busters whatever that means, I didn't get ill so that's good. You can have a scavenger hunt which was the highlight of my evening. Get into groups, in my case we had four groups of 10 or so, each team gets a list of questions they need to answer and/or items to collect, all the answers and items lie within the Dave and Busters space. You are timed and at the end the most correct answers and items completed is the team winner. The groups are running around the space just having a blast. The players are not allowed to talk or get answers from any employees and there are \"referees\" on the floor watching you. The winning team toasts with a glass of champagne and bragging rights.", "Date": "2008-03-14", "Author_Location": "San Francisco, CA"}, {"Author": "Ian O.", "ReviewID": "7qTtbLe2N6sL1-V9RuaXRw", "Overall": "3.0", "Content": "The games are always fun. The drinks are always good. The food... ...I am not a fan of.", "Date": "2013-10-22", "Author_Location": "North Miami Beach, FL"}, {"Author": "Martin O.", "ReviewID": "0HgEVRXTx8bnPgisnE2XEA", "Overall": "5.0", "Content": "If you have a nephew or niece in town for the weekend and want to improve your favorite aunt or uncle ranking, then this is the place to take them. It's minutes just minutes from the Fort Lauderdale airport. They have an impressive selection video arcade machines and Las Vegas-like token machines which reward you with tickets for outstanding play. My favorite games are: the dump truck token machines; the basketball hoops and the machine that grabs the prizes with the large hook. There are several dinning areas and bars which you can eat and play or dine separately. I normally at a table in the bar area after playing a few games. They have a very good selection of comfort food and also includes a special where you are given some extra tokens. You'll need to purchase a card at the front desk which is good for all nationwide Dave and Busters, so be sure to keep it.  You can use your card at all of their locations which includes New York Times Square. I understand if you are using one at a new location, you can activate the card for roaming at the Spaceship inside the arcade, prior to re-filling it. It never seems to work very well if you do it at the bar or at their registration desk. Any unused tokens or tickets will be stored on your card.  Finally, if you are bringing your own children here, plan on spending some serious dollars and waiting as they redeem their tickets for prizes before you leave. That said, there are life lessons here as your kids prepare for Las Vegas. They will either learn how to conserve their tokens or what it feels like to be out of tokens. There is always plenty of parking in front.", "Date": "2007-07-06", "Author_Location": "Miami, FL"}, {"Author": "Angel C.", "ReviewID": "muFj4nmzgEj1KfRR0lA-uw", "Overall": "1.0", "Content": "Just a few words, don't waste your time in this place. 1 - Smells like Mildew 2 - Food portions are small and GROSS..!!! 3 - 85% of there video games don't work Better of at the Ale House next door. Nuff said..", "Date": "2011-09-23", "Author_Location": "Miramar, FL"}, {"Author": "Pam S.", "ReviewID": "b0HlNc6OsY_3hOtSpMIt-A", "Overall": "3.0", "Content": "PLEASE YOU HAVE TO HAVE YOUR DRAFT BEER TESTED!  There is something REALLY wrong with it.  It tastes like mold, no matter which brand you buy.  Your bottled beer is too expensive so I gag down the bad draft.  My husband and I try one from each bar and decide which one is the least disgusting.  But they are, invariably, BOTH way funky.  Also, no way to email your place directly.  Frustrating.  Oh, and you could be nicer to smokers.  Forcing people to stand is punative.  This is not the way you should treat cutsomers.", "Date": "2011-03-11", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Annie C.", "ReviewID": "xSsHCd0_baDOPwQQcfML-A", "Overall": "3.0", "Content": "This place is not bad.  Me and monkey got nothing to do on our weekend and was gonna go to TGIF next door and then saw Dave & Buster's so we looked at each other and say why not.  Always hear it's full of a bunch of crazy kids but that's back in California.  I'm not sure of monkey's thoughts but for me, getting buzz and playing games at the same time was fun!!!! Then I end up playing almost every game and lost every battle so it became ;-( to me.  I ditch the games and went to a ticket machine and pulled the handle on it to see what number it lands on as it's the number of ticket I'll get.  Hey I end up with 2000 tix!!!!!  But I think the suck part is that in the prize section, many things are soooooo highly mark and its like you have to have 50 tixs and up to get something, they should have prize all the way down to like 5 tix for a piece of candy or something.  In case a parent takes a little 5 year old kid in there with small tix, at least that kid can go home happy.  I had 8 tix left and was sadden to take it home and can't get anything for it ;-(Time for a drink!!!! went back for more drinks with monkey.  I did order some appetizers from there.  The bartender was nice and honest ;-) But it's like the usual American fast food.  Greasy but good togo.  I didn't eat at their restaurant part by the pool tables.  If you and a group of friends likes to drink and shoot pool then this would be one place to consider.  If you want a drink but have kids with you, this would be the place to come for a drink watch sports or whatever is on tv while the kids run around and play.Of course I went mid week but I'm sure it's packed during the weekend as there is also a theatre close by.", "Date": "2012-07-02", "Author_Location": "Dania Beach, FL"}, {"Author": "Brian L.", "ReviewID": "zF0uchu2hf7y--Bf5OEaFA", "Overall": "3.0", "Content": "Terrible service. We moved twice just to get a server. Place is great for fun and games, though.", "Date": "2013-10-13", "Author_Location": "Hialeah, FL"}, {"Author": "Cindy P.", "ReviewID": "qAZRnFgK26fSMxqjG6GLNA", "Overall": "3.0", "Content": "Food: The food itself was good, I had wings and it was pretty delicious.  The wait for the server to come and greet us at the table was ridiculous, but I think it was just a one time mistake on their part.  After we ordered the service was actually good.  I loved the Snow Cone they have on the menu, it's the best drink ever!!Games:There's a large variety of games just like all the other Dave and Buster's.  Some for older kids and some for the younger kids.   But this place needs to work on their security.   It is not good for business to have college kids shoot other customers with an air cannon and to climb up the skeeball ramp.", "Date": "2011-08-22", "Author_Location": "Harleysville, PA"}, {"Author": "Dan C.", "ReviewID": "SbhpmATTm2YtWz8pOTJn7g", "Overall": "3.0", "Content": "Just ok food and the games are getting more and more expensive. You'll spend a small fortune in enterteinemnt here.", "Date": "2013-08-09", "Author_Location": "Hollywood, FL"}, {"Author": "Colleen C.", "ReviewID": "2pObbh5YVUha4tqYaPj78w", "Overall": "3.0", "Content": "I went here on a whim since I found a $10 gameplay card in my wallet that I'd forgotten about.  After already drinking a bunch prior to this visit, the first stop was the bar, of course.  Due to a recent remodel, a number of their beers on tap weren't working (read: the beers I wanted).  We ended up getting shots of Jameson (half off!) and gigantic glasses of Bud Light... the prices were surprisingly reasonable.  We played a bunch of games, poorly, since the Jameson was awesome.  My only complaint is that they only have the DDR-like game with the diagonal arrows, which I'm sure I would have noticed prior to paying for it if I could see straight at this point.I'd definitely recommend taking advantage of some of the specials they have here.  I don't know if they still have it, but I got the $10 card on a dinner special that made a full meal come out to only $5 when you subtract the value of the card.  And you can't go wrong with the aforementioned liquor specials!", "Date": "2011-02-01", "Author_Location": "Portland, OR"}, {"Author": "Shenika T.", "ReviewID": "UD42XOaQ5BBO8MpvYqULhg", "Overall": "3.0", "Content": "I love their cajun chicken pasta. The last time I went there, I had their chicken burgers and a beer for under $15. The only complain is the loud crowds. Its too noisy at times to stay long.", "Date": "2010-01-18", "Author_Location": "Hollywood, FL"}, {"Author": "Kimberly P.", "ReviewID": "WB8I3WeblCVqrt9BRdV8pg", "Overall": "4.0", "Content": "I love going here! I always enjoy the food and drinks. The games are so much fun. A good place to hang out with family and friends!", "Date": "2013-05-22", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Elizabeth P.", "ReviewID": "w9HWTBuKHqzkOJa3PUYj9g", "Overall": "2.0", "Content": "Has a lot of games but didn't find many games for 6 year olds. And a bit on the pricey side for the game tokens. As for the food, it was ok for the price and given the convenience.  Typical pizza, sandwiches and chicken nuggets menu for kids but it also had some decent options for adults. Not very impressed over all but ok if you want to kill some time with the kids, especially on a cold and gloomy day.", "Date": "2013-02-18", "Author_Location": "Miami Lakes, FL"}, {"Author": "Lindsay J.", "ReviewID": "J_aANX61-h7quB1XQ29uPw", "Overall": "2.0", "Content": "Where to start. The only good thing I can honestly say was the arcade. We went on a Monday night, just my boyfriend and myself.  We sat down in the sports bar section. It took about 20 mins to be acknowledged by the waitstaff, mind you there were only 2 other tables in use. Food was ok, typical bar food. Small portion sizes and the fries were cold. Waitress only came around once. We had to find another staff member to get our check. A 16% gratuity is added to the check.  While I didn't believe she deserves it,I left it and wrote a note on the slip that service was below average. The arcade was enjoyable. Not sure if we will be  returning", "Date": "2013-05-21", "Author_Location": "Miami Beach, FL"}, {"Author": "Peter M.", "ReviewID": "AThO3pZiO-sdQYFJNd-opg", "Overall": "3.0", "Content": "I guess my kids would give this place five stars because they always want to go there, just like any other kid I guess. I do not mind it since they have a bar with tv's to occupy my time. Although at the bar they have like 18 tv's, but can never figure out how to show more than two different programs at the same time. I have to agree with Natalie, the food is not very good and the service, even at the bar is often lacking. I do not understand the restaurant portion of this place, do people really go there just to eat? I guess they do, because of often see groups of older adults sitting there eating and never playing the games. And ,they actuall offer takeout food, some people just don't get good food I guess. I guess I will continue to go there for a few more years until the kids out grow it and then they will never see me again.", "Date": "2009-04-16", "Author_Location": "Gainesville, FL"}, {"Author": "Jennifer F.", "ReviewID": "fnVYCol8tkr8WU_a0JNSkw", "Overall": "5.0", "Content": "Love it.. Our favorite road trip spot for a day trip!.  We go atleast a few times a year!.. Wish we had one on our side of the Sunshine State!", "Date": "2012-12-21", "Author_Location": "Cape Coral, FL"}, {"Author": "Scott E.", "ReviewID": "PxboK8DgS0zrgLb6Zivvxg", "Overall": "1.0", "Content": "Worst experience in a long time at any resturant. 10 minutes to get sodas. 20 minutes to get cold food and 10 more to get it back cold again!. Took me asking for a manager twice to get one to the table.  Unbelievable!", "Date": "2013-12-22", "Author_Location": "Owings Mills, MD"}, {"Author": "Gina H.", "ReviewID": "hNe4M3bZlz2m-ONdtDLzlg", "Overall": "3.0", "Content": "Upscale Chuck E Cheese for grownups...LOUD!!!!  I don't really mind going here but its so friggin LOUD...I feel like I am 80 years old because I can't hear a word anyone is saying so I nod politely and smile a lot....the service absolutely SUCKS...last time I was there anyway it did.  It was ages before our waiter came to us, then the drinks took forever and forget about the food....it all came at different times, and the food is not all that great.  I am talking about eating in the game room.  I have only eaten once in the main dining room a long time ago and thankfully the last time I went there it was for a drop off birthday party so I gleefully spent an hour at Oakwood Plaza shopping in peace at Home Depot without worrying about some burly beer bellied builder running one of the kids over with a trolly full of drywall.....BUUUUUTT  the kids love it, they can run amok and spend my money freely but thankfully they are restricted to whatever I put on their card.  Exhausting for parents with kids (mine are 11 and 4).  I can imagine it would be great fun for grown ups who don't have to run around the place after kids to make sure a molester doesn't abduct them.", "Date": "2008-06-27", "Author_Location": "Miami, FL"}, {"Author": "Cara S.", "ReviewID": "Oq8r5RuqK9_yheTzhSsVfg", "Overall": "3.0", "Content": "If you are there for a few drinks and games its a great place, however I do not suggest eating there. The food is highly questionable and the general smell of the restaurant really doesn't help make their food better. Was recently their on a Saturday night and it was very busy, so be prepared for a bit of a chaotic night. You just have to kind of take it for what it is", "Date": "2011-11-10", "Author_Location": "Pompano Beach, FL"}, {"Author": "Mari S.", "ReviewID": "VpbliZ0AA8wazwW0baDjvA", "Overall": "1.0", "Content": "Not even worth one star!! I had a TERRIBLE time at this place.  Not a family oriented place.", "Date": "2010-07-21", "Author_Location": "Hollywood, FL"}, {"Author": "Mike G.", "ReviewID": "hbs25nxnSGq9kG-UUqU7_A", "Overall": "2.0", "Content": "Monday night came in to watch the Heat game and eat dinner & have a beer.  16 TV's around the main bar and none on the Heat game.  2 customers at the bar and had to wait 10 minutes for them to get the Heat game on a TV.  Bar was empty and service was terrible.  But the food was very good.  Had the slider & wing combo that came with fry's.  The food was great, but as I sat there for 2.5 hrs I could not believe how bad the bimbo bartender Melissa was.  She was gone for long periods of time most of the time.  Customer came and went without ever getting waited on at the bar.  WTF?????  Some how was able to get fed & watered and even had a great cheesecake with carmel & nuts.  When it was time to cash out I asked for the check and the bartender went in the back coming back 10 minutes later with my check.  As I looked at the check there was a 16% service charge added to my check.  I am guessing that is the only way this bimbo could make any money as her service sucks!Having been a bartender for over 15 years and working as a Hospitality Consultant for over 10 years I have never been to a place that had such balls!I was invited to the Grand Opening party when this store opened in the mid-90's and even met Dave & Buster.  I am guessing it is now run by a bunch of corporate penny pincher's and soon to be run right in the ground.  My opinion and many people have paid for my opinion, is to stop this service charge policy and get some hospitality industry professional bartenders and can the bimbo's!Might still be a nice place but avoid the bar and definitely avoid the bartender Melissa.", "Date": "2012-01-03", "Author_Location": "Lehigh Acres, FL"}, {"Author": "Todd W.", "ReviewID": "jGCpP0Jp1qUBCCRO1m3TeA", "Overall": "3.0", "Content": "I can't say anything about their food as we went just play some games and have a few adult beverages.  They have a good amount of games available but I've been to other Dave n busters where they have more of a selection.  We still had fun and the drink prices were no different than any where else in south Florida.", "Date": "2012-11-19", "Author_Location": "Hollywood, FL"}, {"Author": "Rachel M.", "ReviewID": "pQu77mDY6CWEaiGE3OKQKA", "Overall": "3.0", "Content": "I've been here a couple of times and no... this is not the place to come if you are looking for a great meal...However, if you are looking for an average meal and wanting to get back to your youth with a variety of games, then yes, do stop in... enjoy some average tasting... slightly pricy food but then head into the next room and show those pre-teens and adolescents how to really DDR!!!", "Date": "2011-03-12", "Author_Location": "Boynton Beach, FL"}, {"Author": "Alex S.", "ReviewID": "uHYmBBpwqQu0RS8LQlg_lQ", "Overall": "3.0", "Content": "Yes, it is a fun place. But I can't stand it more than 1 hour. It is too dark for me. I also find it expensive. My kids love it, and I don't blame them. Surprisingly the bar is very good and finger food at a good price and", "Date": "2008-01-09", "Author_Location": "Miami, FL"}, {"Author": "Cheryl C.", "ReviewID": "DDArBDl11fh2oVWpWP0Q0w", "Overall": "4.0", "Content": "Remember the 80's?  Remember going to the arcade to play Ms. Pac-Man or Donkey Kong?  Dave and Buster's is the perfect place for dinner when you want to have fun and forget your troubles for a night.  It's like a grown up version of Chuck E Cheese Pizza.  Reasonably priced dinner menu, arcade  available, pool tables, sports on big screen TV's...there's something for everyone here!  Also great for \"dinner and a movie\" as the restaurant is conveniently located near  the Oakwood 17 theater.  This is a great place to \"feel like a kid again\".", "Date": "2008-01-13", "Author_Location": "Hollywood, FL"}, {"Author": "William V.", "ReviewID": "SKC-hs2pmXaazh3U_ZFNQQ", "Overall": "3.0", "Content": "Have been to other Dave and Busters and they are pretty consist ant,  good amount and choice of games for all ages.  Prize selection ranges from cheap and junky to so many points needed almost unreachable unless you live nearby and go regularly.  Food is good considering the atmosphere.  The fried shrimp dish is my favorite.  Overall a good place to visit on a rainy day and blow some money.", "Date": "2012-08-10", "Author_Location": "Ormond Beach, FL"}, {"Author": "David F.", "ReviewID": "vmAaYVkxG2CedQ8Gkjqybg", "Overall": "2.0", "Content": "I went to Dave & Buster's for a corporate event this past saturday and I have to say, I am not impressed. The event was held in one of their \"private rooms\". This is not the place to have a corporate event people....very unsanitary.....food was below average.....but the only thing forcing me to grant them 2 stars is their efficient service. Not necessarily charismatic or charming (its Dave & Buster's....what do you expect), but very quick service. Its good to see servers with a sense of urgency.", "Date": "2010-12-13", "Author_Location": "Miami, FL"}, {"Author": "Amy L.", "ReviewID": "VfIRQZ-5leaTj9Swut6I6w", "Overall": "3.0", "Content": "Games of all types entertained my 4 1/2 yr old & his dad.  A few rounds of Pop-A-Ball for me.  Place was deserted on a Monday night.  Manager was extremely helpful as I tried to cash in gift cards and use very old PowerCards", "Date": "2012-05-07", "Author_Location": "Leesburg, VA"}, {"Author": "Realjamaican B.", "ReviewID": "LsaO1hPB2UQrjFEUSoRWzA", "Overall": "3.0", "Content": "I remembered how badly I wanted to go to dave & Busters ,that when my husband told me  'lets go' i was \"ecstatic \"!. We got their  at 8pm on a Saturday night, the line to get seated for dinner met us half-way thru the door, I was thinking;  \"wow, note to self, if  hungry don't come this late or eat b4 coming\". We finally got seated 1 hr and 1 beeper later, then we ordered. I had the Shrimp & chicken while my husband had the Salmon. The prices were very affordable and the restaurant was nicely designed and comfortable. The food came, and my face dropped, I asked the waiter with controlled features in my very upset face \"where is the rest of the food? I guess he was puzzled cause he replied \"what food, its all here\". I replied \"Ok then\". I was mad cause they gave me a super-sized plate with a kid sized meal, it was small but very tasty .  I was very disappointed and so was my honey. We  ended up ordering an extra plate of wings and chips jus to fill the still empty gap. Then I said quietly \" note to self, next time Red Lobsters for dinner no excuses\".   The game arcade was awesome, I won 1000 tickets the first night. I would definitely be going back, jus for the games thou .", "Date": "2011-03-30", "Author_Location": "Miami, FL"}, {"Author": "Dawn B.", "ReviewID": "zSkA3nnIm3gp5msrVBCeng", "Overall": "4.0", "Content": "Sliders & the chicken Mac n' cheese are good to eat. This is a good place to go and have some fun.", "Date": "2011-08-13", "Author_Location": "St Petersburg, FL"}, {"Author": "Disi O.", "ReviewID": "iWJa78AKkvTtZ-I4SCIkIw", "Overall": "4.0", "Content": "Great place to hang upp", "Date": "2012-07-06", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Frank H.", "ReviewID": "vJges_H4TT1WJdQeev1FAw", "Overall": "3.0", "Content": "The food and service was acceptable considering that we had a group of 11.  The noise level was too high for us and even louder outside the restaurant.  We went outside to try and hear a phone message but it was harder to hear outside until we walked far away from the place.  Also, they must have been stiffed by snowbirds in the past from Canada as they have an automatic 16% gratuity, not just for large parties.  If one doesn't catch it on the menu, they might accidentally overtip.", "Date": "2012-12-26", "Author_Location": "Brentwood, CA"}, {"Author": "Paul W.", "ReviewID": "oX1TbtBYGXGBNK2J6UHGVg", "Overall": "4.0", "Content": "Every time I'd see the the large \"D&B\" sign from the I-95, I always thought this was a grocery store for some reason.  I can't believe I never knew this was here..What a fun place!  I was meeting a few friends for dinner and drinks on a Tuesday night and they suggested this might be a fun place to try.   On the night we went, only about 5 of the tables had people seated at them, so it was pretty dead.  The service was good for the most part (except for when we were ready to leave and we waited about 5 minutes before we could track down a server to give us our bill for some reason).  The food was good and the prices weren't bad when compared other restaurants with similar menus in this area.  I'd imagine it may be a touch on the expensive side if you had an entire family to bring here though, especially by the time you paid for your meals, then paid for them to play games for an hour.  The menu was OK, but I wasn't very hungry the night we went and all of their appetizers were either deep fried or bathing in cheese it seemed.  I ended up going for the Philly Steak Rolls which were good, and a Blue Moon.  We played a few games after we ate and had some laughs, I'd imagine this would be a lot of fun with a large group of people.  Another reviewer mentioned going here for a team-building event for work.  This would be a good place for that, or possibly a fun Yelpers night out!", "Date": "2008-12-03", "Author_Location": "Miami, FL"}, {"Author": "Rob C.", "ReviewID": "dTX1v8dFTgTioyGp91g8aQ", "Overall": "2.0", "Content": "my overwhelming impression (of the arcade area): this place smells...like one too many spilt drinks -- well, at least more of the games are working here compared to boomer's", "Date": "2009-06-21", "Author_Location": "Palo Alto, CA"}, {"Author": "Lor L.", "ReviewID": "XGkUsR7pGMQ-s659OD-4IA", "Overall": "2.0", "Content": "This review is written from strictly a food and bar experience. I have heard their games are fun, but we went for a quick drink. We sat ourselves down at the bar, and waited about 10 minutes till our server showed up. She was friendly, but not an attentive server. My Husband ordered a Lynchburg Lemonade which came out PINK (normally yellow) and very weak. Also, the cup was filled with 80% ice, and 20% drink. Gone in 2 gulps. When she brought it, she called my Husband \"Sweets\" (what's up with that?) I ordered a Mudslide, which was completely weak and tasteless. The ice cream was so watered down, it wasn't creamy anymore, and they put just 1 squirt of chocolate.The drink was white instead of the normal brown color. Our friend had a decent piece of cake. The bill ordeal took about 20 minutes, as our server disappeared. Then once we gave her the card, it took another 10 minutes. Service=stinks. Drinks=stink. Games=have yet to try.", "Date": "2009-01-20", "Author_Location": "Mantua Township, NJ"}, {"Author": "Michelle L.", "ReviewID": "ipMleplGkD7cZRHwZbx0Dw", "Overall": "4.0", "Content": "I came onto yelp yesterday since my family wanted to go here...It had pretty bad reviews but the kids instisted on giving it a try. We had been years ago to play pucks but we havent been in years. We purchased a $10 card for 60 Minutes of games for each kid. They had a wonderful time and loved it. It didnt include the ticket games but it really was perfect for an hour of fun! We sat at the bar and had a couple drafts. They have large drafts. We also purchased the Nachos. Those had been amazing. Very very good! They came out in about 4 minutes. We had a minor issue while we had been there and the manager came over and took care of us. We received very good customer service. I felt like they really wanted to do right by the customer. The bar staff was very friendly. The rest of the staff had just been doing their jobs and really not making an effort to be helpful. I guess if you go before 7pm and get that $10 card, it is a great deal. I dont think I would go here for a meal but they do offer lots of drinks and a full menu of appetizers.", "Date": "2013-01-19", "Author_Location": "Hollywood, FL"}, {"Author": "Alex D.", "ReviewID": "BjaBTHMTC2PjiLCcKSW1BQ", "Overall": "1.0", "Content": "I went with 12 people for a birthday celebration. Food was disgusting! My steak tasted like a shoe, my gf got sliders and they were undercooked and cold and another friend returned hers. We returned 4 meals. I ended up paying $66.00 for crappy food. The only thing good was the mai tai and the chocolate fondue. The cooks need to go... Dont spend your money here go to friday's it's in the same shopping center.", "Date": "2012-03-03", "Author_Location": "North Lauderdale, FL"}], "RestaurantInfo": {"RestaurantID": "_jSb3JjhZECkj9EwRM3HDQ", "Name": "Dave & Buster’s", "Price": "$$", "RestaurantURL": "/biz/dave-and-busters-hollywood", "Longitude": " -80.16227700000000", "Address": "3000 Oakwood BlvdHollywood, FL 33020", "Latitude": " 26.040151000000002", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/Ke6Bm6RRtSrTzN6osYQ82Q/90s.jpg"}}