{"Reviews": [{"Author": "Gresham H.", "ReviewID": "JUqSNIG4umD6VBkxHAUOfw", "Overall": "4.0", "Content": "My wife and I had a wonderful dinner on our anniversary here.  The food was 4 to 5 stars for sure.  My wife had fried green tomatoes for an appetizer and I had the crawfish potato skins.  Both delicious.  For the entree, we each had a different steak.  Both were prepared very well.  And for desert, we ate the cheesecake.  Again, amazing.  And our service was great.  They are under brand new management and have hired all new servers as of this week so apparently, the other bad reviews we've read about the service are no more.The only downside is paying for parking which could be cured by a valet.  Unfortunately, they had almost no business on the Tuesday night we were there which might explain why valet wasn't an option.This place has such good food, they really should be packed every night.  Even their prices are reasonable. However, I'm going to make a few suggestions in case management reads their reviews:1)  Print off new menus every day or laminate and clean the ones you have.  Menus should look amazing.  Go to Marche and you'll see that they print off a new menu every night.  It's not enough to lower the star rating of this restaurant but it is a bad first impression.2)  Train your servers to greet and present your restaurant like it's a 5-Star experience.  I think the food is so good and so unique that they should share about their chef and about what makes Aura unique.  Give your guests the feeling that it's an \"experience.\"3)  Have your staff dress color-coordinated.  All black might work for this kind of restaurant.  It helps you spot your servers and it raises the overall value equation for what you'd expect to pay.4)  Have the chef provide a complimentary taste of an appetizer, desert, drink, or shrimp.  Something unexpected that delights your customer and makes them want to right a rave review!I hope this helps.  We will come back some time but I do hope more people try it out.  Their chef is truly very gifted.", "Date": "2014-06-27", "Author_Location": "Franklin, TN"}, {"Author": "Samuel E.", "ReviewID": "dyomI2UnWjLNPz3rwdMxTw", "Overall": "4.0", "Content": "This place has some of the best and most interesting food and is consistently fantastic. However, what keeps it from a five star is the service. The hostess/servers are very very nice, but they are very awkward/weird (can't quite put my finger on it), not exactly \"professional\" and are extremely slow at getting drinks and appetizers out.....Honestly, normally I'd give a a place like this two stars, but the food really is phenomenal and worth the wait if you have the patience. With all of that said, I will continue to come back because the food is some of the best I've had...TL;DR: Been here 10-15 times. AMAZING food, very nice but not very good/professional staff.", "Date": "2014-06-20", "Author_Location": "Pleasant View, TN"}, {"Author": "Michelangelo S.", "ReviewID": "ZuxyV0r6ptrltWLWccNOSw", "Overall": "4.0", "Content": "A Night of R&B & Lite Hip-Hop In.....NASHVILLE!  (Really!) ;)SITREP..because Nashville is where you would expect to get down & jiggy with the MC crowd, right?  Right!We were doing a bar crawl through Midtown Nashville, and this was truly the \"left-turn\" of the night considering the Rock & Country theme of the Night.  But that doesn't it was not all in fun and that a good time didn't happen, because it DID!THE SETUPAnd honestly, of all the places that we enjoyed throughout the evening, Aura had the most gorgeous bar & lounge, replete with a beautiful & swanky vibe that made you feel you were in a sexy den of iniquity!  OH yeaH!  We are talking about:*  Stunning art;*  Lovely furnishings such as matching loveseats & couche sets;*  In one area, roomy conversational booths for parties of 4-6; and,*  More intimate nooks for a coupleThe floor plan to AURA is very assymetrical, which made for a bit of a labyrinth in getting around, but that was not a bad thing if you are someone who enjoys a playful layout.THE DRINKSDefinitely the most pricy of the night.  So if you don't mind paying $8 for a basic Rum & Coke (my litmus test for cost at any venue), then you may want to steer across the street to the raw rough energy of Red Door Saloon across the street.But if you enjoy a suave, calm, sensual evening of fun, then you get what you pay for:  cheap & tawdry (Red Door) or sexy & elegant (AURA) - different strokes for different folks.THE LOWDOWNA very enjoyable stop for smooth refreshment and beautiful surroundings in Midtown Nashville. At this point in our evening, we were joined by the illustrious local Nashville Yelpvinity Sheena T. who just bedazzled me with her knowledge of guitars and music and Karaoke (hence why SHE is the lead for tonights UYE Karaoke event tonight!).The music here was more R & B with some light Hip Hop, as was the caliber of the crowd, an enjoyable marked contrast from the previous location.  When we soaked up as much as we wanted from this stop we moved on.Just as we were leaving, our contingent of San Diego Yelpers arrived, and so we grabbed them to the next stop....", "Date": "2014-05-28", "Author_Location": "Saint Helena, CA"}, {"Author": "Jenifer G.", "ReviewID": "FYeZlRfvVIX6rFXCLl5ynA", "Overall": "4.0", "Content": "Aura should be called Aaaah-ra because it's so relaxing.I went with 3 other generations of family and all of us found things we liked. And I plan to go back to have what I didn't. Some fusion restaurants make me feel like the chef throws up ingredients and create a recipe from what falls in the same place, kind of like top chef. In this case, the mix of flavors is intentional. I was so excited about the menu and it didn't disappoint. The roasted salmon deserves to be on a runway, it was so pretty. The braised kale was so great, and the collards were almost as exceptional. I am not a crawfish fan but the potato skins were an intriguing taste, and the potato croustard would have been delicious without the shrimp. The mac and cheese had a medley of cheeses, so it was too mature for my 6 year old, though she ate it. My main goal was getting to the bread pudding. It was an absolute delight. I was amazed at how the chef married orange and praline and they both maintained their independence while blending well. The fresh berries allowed me to share a bit of my dessert with my daughter because she was not getting the bread pudding!", "Date": "2014-05-05", "Author_Location": "Nashville, TN"}, {"Author": "Veronica S.", "ReviewID": "2pB2KuIgdT4KNc4eFNsM0w", "Overall": "2.0", "Content": "Im very disappointed with the outcome of my night...I was told I wasn't being charged for my meal only to find out indeed I was charged. I have called the restaurant several time and still not a call back! I really hope they get it together cause this sucks!!! I don't plan to ever go there again. Not on my own dime!!!", "Date": "2014-06-18", "Author_Location": "La Vergne, TN"}, {"Author": "Mary D.", "ReviewID": "5LiVaudAcUp8lZIVW93SLg", "Overall": "2.0", "Content": "Pretty bad. Servers completely confused, cocktails taste premixed and horrible presentation. Lots of chaos among staff, general lack of attention to the customers.The chicken flatbread nachos, however, were pretty good.We won't be back ever.", "Date": "2014-04-26", "Author_Location": "Washington, DC"}, {"Author": "Kris C.", "ReviewID": "ZBYn_2SfXsDNSSkYGXBVoQ", "Overall": "4.0", "Content": "My family and I came her for my sister's birthday on April 4.  Since my Granddad was in the hospital, we wanted a place close by where we could celebrate my sister's birthday without slightly here because we were concerned about my Granddad.OH MY GOD, this place was amazing.  Our waiter, I'm sorry I can't remember his name, was great!  As a family, we shared a bottle of Tannen and split the spiced cheesecake and ginger chocolate cake.  Yummy!!  For dinner, I had the chicken torta and it was AWESOME!My sister definitely had a happy birthday and I'll definitely be coming here again!", "Date": "2014-04-13", "Author_Location": "CANE RIDGE, TN"}, {"Author": "Sarah A.", "ReviewID": "C2T2SibEV0ehtP2SmXJjWQ", "Overall": "1.0", "Content": "Hands down the worst overall dining experience I've ever had. Ever. In any genre of cuisine, in any city - this wins the award for being the worst. I wish there was something redeeming, but alas, there was nothing. Start to finish - from the menu, to the service, the bar, food & environment - just absolutely awful. I'm skeptical about anyone who is raving about this place, because it's not even slightly redeemable. This is the closest I've ever gotten to a real life Kitchen Nightmare. So there's that....A dirty vodka martini that tasted like a jar of old olives. Potato skins that tasted microwavedA salad that was more dull than grocery bag saladA steak that half way through revealed some truly 'funky' tastes (clearly frozen and reheated)And wrong wine pours all night. The menu is that of a confused chef (although I would be very surprised if there is an actual chef running the kitchen). Fusion doesn't mean you just mish mash two random things together. It's not fusion by using Hawaiian fish and Indian rice. The server couldn't even tell me if the salmon was farmed or fresh caught. She also poured us the wrong wine several times. The best past was when she came back to our table long after we finished our appetizers to say she had forgotten what we wanted for our mains. *sigh*And the best part was towards the end of our meal when we learned that the people milling about with a bunch of lighting and equipment were setting up for their COMEDY SHOW. Why in the world would I pay $200 for a dinner just to be interrupted with fart jokes? Seriously, this was abysmal. Everything here is wrong and I hope I can save at least one other person from wasting their time & money on this mess of a place.", "Date": "2014-02-05", "Author_Location": "Seattle, WA"}, {"Author": "Meagan G.", "ReviewID": "wbVf4MHyykNSDPIRvAv58w", "Overall": "1.0", "Content": "Well, I have to say I'm pretty bummed that I have to even write this review. Despite the other poor reviews, my husband and I decided to give this place a shot for dinner. I usually take bad reviews with a grain of salt, but this time those reviews were unfortunately correct.My husband and I had reservations for 6pm on a Friday night. We got there at about 5 after, and the restaurant was still pretty empty. After a minute or two, the hostess (who was very friendly) seated us at a table in the main room. The couple who had been seated prior to us received prompt attention from their waitress who took their drink order. We, on the other hand, were not greeted by a server. No big deal - it was still early. Maybe they were still getting into the swing of the evening.Nope. We sat there for about 25 minutes. 25 ENTIRE MINUTES elapsed, and not a single server had graced us with his/her presence. I also noted that the couple who had been seated prior to us had JUST received their drinks and had given their order. I would have left sooner, but my husband wanted to give them the benefit of the doubt...to no avail. We finally just got up and left. No waters, no cocktails, no how-de-do. Nothing. If I could give this restaurant zero stars, I would, because that's the amount of service we received. :(", "Date": "2014-02-14", "Author_Location": "Nashville, TN"}, {"Author": "Kristen M.", "ReviewID": "XaoWklJ-kbvUkZCu0AeYhA", "Overall": "5.0", "Content": "Fantastic little bar! It's set up is very classy, laid back, and spaced out. The staff was incredibly friendly and food was fantastic!! I got a Brooklyn brown ale on tap and the tacos with chicken. The tacos were so good I found myself scraping and eating whatever feel out of it. Highly recommend this place! Will be taking out friends there when they come up to visit!!", "Date": "2014-06-05", "Author_Location": "Brennan, Memphis, TN"}, {"Author": "Zach G.", "ReviewID": "FPVoZC0pQh_h6b1h_cjhrQ", "Overall": "1.0", "Content": "I would call this place the TGI Fridays of Trendy restaurants in Nashville.  Strong statement I know.  We had a $25 gift card for this place so we gave it a try recently.First we arrive at 6:30pm (we are parents we have to eat early cause of babysitters, shush!)Literally.  We are the only people in the place.   Possible we outnumbered the entire staff (not really but if it came down to a knife fight of Patrons vs Staff we could of held our own)Server was great.   He did a great job and was very attentive (I would hope considering we are were his only table).We ordered Crab Cakes as an appetizer.   Which was standard run of the mill crab cake with some interesting pickled vegetables on top.Then I tried a Blackberry Old Fashioned mixed drink which was a solid drink, but who can mess up a good drink...So on to the entrees.   I ended up getting the Filet Mignon with some run of the mill mashed potatoes and 5 or 6 roasted garlic cloves for one piece of meat...while the steak was solid it wasn't mind blowing especially for $29 bucks.Wife ordered the Grouper and Scallops entree with Basmati Rice and Edamame and other stuff.Her food tasted like salt and salt.   Literally they could have poured her a bowl of salt and it would of tasted the same.   She politely said it was not edible.   They promptly offered us something different for her (ended up with some pasta dish that had some unique flavors but nothing special).   Since I had been done eating for a few minutes now and the meh experience overall, we passed on dessert and went on home to a very bland experience that will have me never returning to this place.", "Date": "2014-01-16", "Author_Location": "Nashville, TN"}, {"Author": "Chris P.", "ReviewID": "Uc6Dvmpo29SH15NV7yuTsw", "Overall": "3.0", "Content": "Granted I ordered something that was not in the same vain as the theme of the fusion restaurant, I did not like my tacos. The menu was really pricey and after looking for 15 minutes I really didn't see anything that I wanted to try. Asian fusion is usually a great restaurant concept because it westernizes some Asian dishes that people otherwise wouldn't order but I just found that the menu fell short and the prices were too high.The atmosphere was also really strange, because it was full of 40 somethings who were getting liquored up. It's neither wrong to be 40 something or to be liquored up, but I would rather not see some 40 something dude feeling up his liquored-up online date under the table while I am trying to eat. Just my opinion.", "Date": "2014-01-21", "Author_Location": "Franklin, TN"}, {"Author": "John R.", "ReviewID": "TLK0PggrcdUjzloQcf0LRg", "Overall": "3.0", "Content": "I'm torn between 2 stars and 3.  First it was an empty restaurant I felt like a Kardashian! With that being said with it being empty I would of thought we would of gotten speedy service. However that wasn't the case.We got our water when we were sat. After that it went down hill.  15 minutes went by before we were asked if we wanted any drinks, after we put our alcohol drinks in it was another 15 minutes before we were asked for our orders. Thirty minutes into it, and it was still another 25 minutes before we even got our appetizers. After 1.5 hrs spent at this restaurant we were done. Ridiculous Now they say in their name \" world fusion cuisine\" , but everything on their menu was  something I could get at any American restaurant. Don't call yourself world fusion if you're nothing but American food. Now onto the food. The food was superb. We had the lavender goat cheese fondue, and crawfish potato skins for appetizers. These two items made the wait worth it! It was pleasure factory in my mouth. Entrees wasn't anything special. I had the NY strip, and my friend had the salmon. Not much world fusion in these two dishes.  The ending was spiced cheesecake that was a little dry, and  tasted like pumpkin cheesecake. Over all I'm a little on the fence on this place. For a location in midtown I would think it would be more energetic. Needless to say I'll go back for special occasions but no thing else. 113.00 bill wasn't justified!Make your own decisions", "Date": "2014-04-10", "Author_Location": "Antioch, TN"}, {"Author": "Brielle H.", "ReviewID": "HsY9NjXcTnAufA6bhfoRBQ", "Overall": "5.0", "Content": "How much do I love you Aura? Let me count the ways. Aura is my go to spot when i want to throw on a sexy cocktail dress and have a mixologist (note, NOT a bartender) combine flavors and spirits in what is nothing short of  an artistic experience. and the food: AMAZ-ing. I don't impress easily, but their quesadillas nearly made me faint they were so good. And you know what's even better than good drinks and good food? EXCELLENT service. You can tell the owner/head chef is passionate about food. He's an artist. He combines flavors in a way that reflects his respect for the different flavors and textures of food. I sure hope that Aura makes it, because going in there is like taking in fresh breath of air each time.", "Date": "2014-01-11", "Author_Location": "Nashville, TN"}, {"Author": "Trista D.", "ReviewID": "_2Ufw-FBMqStcv5YLRbr7A", "Overall": "4.0", "Content": "After meeting the chef/owner at an event, I knew I had to come try Aura. I looked at the reviews first and even though quite a few were negative, I still decided to give it a try. I made late reservations (9:30pm) and in the note asked them to do something special for dessert. They were so excited that I had asked, which was great.We were seated quickly as the restaurant want really really busy and or waiter, Brad, greeted us and gave us a quick rundown of the menu and specials. He was so personable and set us up for a great time early. After ordering drinks (try the Brazilian Beauty), we decided on the salmon and the grouper with scallops.The dishes came out within a pretty good time and looked phenomenal! The great part is that the dishes tasted even better than they looked! After we finished, Brad brought out the dessert right away. I was so happy I didn't have to remind him as that would have ruined the surprise.Overall, I wiuld definitely return. The ambiance, service, music, and food and drinks were all great and left us with n9 complaints. Give Aura a try!!", "Date": "2013-09-23", "Author_Location": "Nashville, TN"}, {"Author": "Karen H.", "ReviewID": "-Te4ucVBCFVMucUFPRV3_w", "Overall": "4.0", "Content": "My husband and I are new to Nashville, so we had never been to Aura. We decided to give them a try, since we had a gift certificate from restaurant.com. First off - we did read many of the past reviews on Yelp, so we knew what foods and drinks we wanted to try. I'll start with the good: The things that we liked, we REALLY liked. First off, our waiter was excellent. The place was fairly empty, since we came in on a Tuesday night. Regardless - he did a wonderful job taking care of us. The edamame hummus was amazing. We also ordered the crawfish potato skins,  which my husband really enjoyed. (I'm sure they were great, I am just personally not a big crawfish fan,) Our main dishes were both \"good,\" but the thing that really blew us away, was the side order of macaroni & cheese. PHENOMENAL! We ordered it plain, without any of the meat choices. I highly recommend the mac & cheese!I wouldn't say that anything was \"bad,\" so I'll say the next part was \"okay\": We each ordered a cocktail, before we had our main dish. The were both good drinks, but neither one of us were blown away - and, they were definitely more expensive than most restaurants that offer a similar quality cocktail. All in all, we had a very nice evening at Aura. I agree with some of the past reviews that there is something missing that keeps me from giving them a better review, but I can't put my finger on it. The bar was packed when we were there, but the restaurant was fairly empty. Maybe they need to somehow incorporate the atmosphere or the bar area, more into the dining room...I'm not sure. To sum it up, we had a very nice experience, and we plan to go back again!", "Date": "2013-11-13", "Author_Location": "Nashville, TN"}, {"Author": "Jennifer E.", "ReviewID": "9IC_qoB7qRAl02jjvprBEg", "Overall": "4.0", "Content": "My husband and I visited Aura on our post-Christmas date night. Since it was just 2 days after Christmas, business was slow. But that didn't keep the kitchen from turning out a wonderful meal!Our drinks: Blackberry Fashioned (mine) and Mad Hatten (hubby's). Both were great! We are bourbon whiskey drinkers, and these were just far enough from your typical his key drink, but not too crazy!Appetizer: Goat Cheese Fondue. Delicious! I have no other words!Mains: Roasted Salmon (mine) and Filet Mignon (hubby's). I can't remember the details on my husband's filet, but my salmon was perfect! It was atop a shrimp potato Croustard and surrounded by mushrooms in a truffle garlic oil. I do not like mushrooms, but I tasted a bite to sample the sauce. Still don't like mushrooms, but re sauce was tasty!Dessert: Ginger Chocolate Cake. Seriously, you can't go wrong with chocolate!Our server was great. His timing was spot-on...probably easier since there were only 4 occupied tables! Nevertheless, all the staff was friendly.Great experience!", "Date": "2013-12-27", "Author_Location": "Smyrna, TN"}, {"Author": "Cynthia O.", "ReviewID": "oBS8Js6HZGg8h-_S6_4thg", "Overall": "1.0", "Content": "Terrible, slow service, happy hour prices confusing, and what I ordered I sent back.  The other entree was good, but this place needs a new manager and new servers.  I will not go there again.", "Date": "2014-06-10", "Author_Location": "Nashville, TN"}, {"Author": "Jamil M.", "ReviewID": "UrMxEUM1YP8dVF9mx6TiTw", "Overall": "4.0", "Content": "Aura is a great restaurant. Took my fiancee there on a date last Friday. It was really empty for a Friday night, which initially made us a little nervous. I mean when the hosts desk says \"Yay! People!\" on the busiest date night of the week, it doesn't inspire confidence. But this place is awesome. Our waitress Kelsey (or Chelsea, I can't remember) and she was excellent. She gave us some really great recommendations. We had the craw fish potato skins at her recommendation and they were fantastic. My fiancee had the salmon and ordered two sides, the kale and the lobster mac and cheese. I had the grouper with diver scallops. Lobster Mac and cheese can't be bad ever, and the sauce with the grouper was perfect. My only compliant is I didn't have enough! But everything was excellent and it was a great date restaurant. Quiet, good food and an expansive drink menu.", "Date": "2014-01-20", "Author_Location": "Nashville, TN"}, {"Author": "Mia B.", "ReviewID": "PU0rmY_4ijnahF1LQYketQ", "Overall": "1.0", "Content": "I would give 0 stars if it were possible. Hands down the worst experience I've ever had at any restaurant anywhere.My boyfriend and I went to Aura for Valentine's dinner. We waited 15 minutes to be seated even though we had a secured reservation. We sat down in the middle of the main dining room  at a table with no silverware, centerpiece or even salt and pepper.It then took 15 minutes to be acknowledged and brought menus and water. It then took another 30 minutes to be acknowledged for drink orders, even though there were multiple servers circulating our area. We were forced to order all of our food when we ordered our drinks as it was already 9:45 pm at that point.Our salads arrived before our drinks. The drinks arrived 30 minutes after we ordered them and were not what we had ordered.It then took another HOUR for our entrees to arrive. The food was COLD, inedibly cold. Both the steak and chicken were over-salted. Meanwhile, we could see servers drinking on the job at their station.Terrible experience overall and though the restaurant looks nice from the exterior and interior decor, it is a complete waste of time and money. STAY AWAY!!", "Date": "2014-02-15", "Author_Location": "Chicago, IL"}, {"Author": "Todd D.", "ReviewID": "BcuP59ut8wsi3Kcg7HUUuA", "Overall": "1.0", "Content": "Terrible experience!  We waited over an hour for our food, asked the waiter 3 times for bread, second drink was half the size of the first one, $30 steak came out cold........the owner was nice and comped our entire meal.", "Date": "2014-05-08", "Author_Location": "Nolensville, TN"}, {"Author": "Jamie A.", "ReviewID": "_o5cUnqB-vb3MWKBAL1Phw", "Overall": "4.0", "Content": "Endless...Mimosas...for less than the cost of 3, you can have as many as you like.  I'm strictly curbing my alcohol consumption, but I made an exception for Mother's Day Brunch.  And I picked the perfect spot for said exception!Enough about the alcohol.  What really impressed me was the delicious food.  While waiting for our table at the bar, we enjoyed a complimentary (they had an extra) blackened chicken appetizer served over a delicious corn cake.  At our table we shared the Lavender Goat Cheese Fondue.  The garlic and shallots in the goat cheese were so sweet and tasty.  My mom had a Chorizo/sweet and purple potato dish that she loved.  I tried a bite, and also enjoyed it.  Her husband had the Eggs Diane that he seemed to enjoy.  I mixed some sides:  Garlic Cheese Grits (not so good, dry and lacking in flavor), Praline Bacon (OMG sinfully good) and Fresh Berries w/ Citrus Yogurt (you know, to offset the bacon...).  I was happy with my order, though next time I'll skip the grits.  For dessert, we shared the Prickly Pear Cheesecake.  It was very light (for cheesecake) and the perfect end to a great meal.Our server was really nice and kept the drinks flowing and our meal flowed nicely.  I only wish everyone hadn't been so apologetic.  I realize it is Mother's Day.  I expected a few bumps in the road.  Apparently they were short handed; but had no one mentioned it, we probably wouldn't have noticed.", "Date": "2013-05-16", "Author_Location": "Belmont/Hillsboro, Nashville, TN"}, {"Author": "Beth C.", "ReviewID": "cK0mLLLlNS3k9Nsd5e3aMA", "Overall": "2.0", "Content": "On a Saturday night at 7:30 the place was empty. A glass of wine took 20 minutes to get. Did not have two drinks my party ordered. Food also took a long time & although the server was nice, he was not familiar with the drink or food menus. The fish that was delivered to the table had a strong fish scent. No toilet paper in the bathroom. You would have a much better dining experience at so many other restaurants in Nashville. Go to any number of restaurants in German Town, East Nashville, or 12 South for similarly priced menus with a much better ambiance, service, and quality cuisine. I will not be going back and quite frankly do not know how this place has managed to average 3.5 stars.", "Date": "2014-05-17", "Author_Location": "Nashville, TN"}, {"Author": "Will H.", "ReviewID": "mMOyiudFScYCRWcTEehnmA", "Overall": "1.0", "Content": "We had a truly terrible experience at Aura this past Saturday night, and we will not be returning.  We were out and about, saw they had tables available on a reservations app, and showed up around 9.  The place was dead; at least half of the tables were empty in the main part of the restaurant, but they seated us in the bar, which was even more vacant.  We waited fifteen minutes for a server to visit us; lest you think we were oddly passive, I assure you that I got up and walked to the host station twice during that fifteen minutes to request a server.It would be generous to describe staff behavior as disorganized, but it would be ungenerous to call them rude; let us just say \"unusual.\"  Our waitress, though enthusiastic, was largely clueless about the menu.  Other people delivered drinks and food to our table; one poor guy handed me a drink, said \"Your mojito,\" and when I told him I hadn't ordered a mojito, he immediately launched into a tirade:  \"It's only my second day!  I don't know what any of these drinks are!\"  We are unsure whether he was trying to be funny.Drinks were pretty good, if typical cocktail-craze fare.  Food was mediocre to bad except for a tasty appetizer of curry coconut mushrooms.  The barbecue chicken flatbread was completely lacking anything that could be construed as barbecue; the ginger chocolate cake came out cold as ice and hard as a bagel.  To add the final touch, when checking in on Yelp gave us a coupon for 15% off the total bill (I know, because I saved it to my photos), the restaurant chose to interpret that as 15% off food only.  We decided not to appeal that decision and escaped, stunned and vaguely hungry, into the cool night air.", "Date": "2013-05-02", "Author_Location": "Nashville, TN"}, {"Author": "Sarah A.", "ReviewID": "i_zx0JW2AW0Dfd9weRwYMA", "Overall": "4.0", "Content": "I was surprised to see it so dead in there. I mean, maybe it's more of a night spot, I'm not sure, but there was nothing happening at 7:30 when I showed up for appetizers and drinks. Their cocktail menu looks amazing, all fresh juices and fruits paired with good liquor options, but I couldn't help myself - I just needed a beer. So maybe next time I'll try a mixed drink. I'm a draft girl, and they had a decent selection of craft brews on draft, but an enormous list of bottled stuff, so you'll probably find something you like regardless. The coconut curry mushrooms with toasted flatbread was out of this world. And I sampled the not-so-typical bread pudding and it was amazing. Our server was very attentive, so overall I'd say we had a great experience. Down side: the music was not great, but we were there to catch up, not cut a rug, so I would still recommend it.", "Date": "2013-06-21", "Author_Location": "Nashville, TN"}, {"Author": "Geoff T.", "ReviewID": "wuYJiJFbdioiTe1eCrsZhQ", "Overall": "4.0", "Content": "This is not my usual restaurant scene, but I've suddenly been here several times for drinks, twice for lunch and once for dinner in the last three months. I wish I had the budget to come here more often.For lunch, I've twice had the Chicken-Tasso Gumbo and Greek Salad. Both were filling and tasty, and I was pretty happy with the price. For drinks, I recommend the Mad Hattan. This is a great take on a traditional Manhattan, with the added bonus of Absinthe. I like a good, stiff drink from time to time - especially when I'm at a fancy place - and this was exactly what I was craving. I will warn you to be careful, as I underestimated the potency on my first visit.I had a great Groupon tucked away for dinner, so I took my date here for Valentine's Day. The experience was one of the best I've had in Nashville in some time. First, the server was very professional and perfectly attentive - not too chatty, but good-spirited and knowledgeable about the menu. He almost had me sold on the evening's Salmon special. If only I was a fan of Salmon...We started with cocktails. I had my earlier-mentioned Mad Hattan, and my date choose some white wine. We started with the Beef Chimichurri appetizer. The thin strips of steak and the chimichurri sauce could have been a delicious meal unto themselves.I picked the Seared Ahi for my meal. It was seared perfectly, with the rare center warm but not hot. The Bok Choi accompaniment was good, but a little gritty. My date selected the Filet Mignon, medium. The steak was flavorful, but a little more on the medium rare side than we expected. The ginger mash potatoes that accompanied her dish made up for it, though. I really wish they'd share the recipe...We splurged on dessert and ordered the Apple Fritter with house-made frozen mango yogurt. The fritters had the flavor and texture of classic state fair beignets with a pleasant, subtle apple undertaste. The mango frozen yogurt was a great pairing for the apples - one I would never have picked out on my own. The mango flavor was dominant, with the yogurt taste on the finish. I am withholding the fifth star for two nit-picky reasons. First, the bok choy that came with my Seared Ahi was a little gritty. At one point, I bit unexpectedly into something a little bit hard (still not sure what) what made me pause to make sure I hadn't hurt a tooth. I was fine, and I moved on. The second reason was the pacing of the courses. Our server took the initiative to promise our appetizer and entrees would be spaced well (we didn't bring this up as a concern at all, but he volunteered it), but this proved not to be the case. Our entrees came out while we were still half way through our appetizer. My fiancee and I eat fast, so there was something off about the timing despite the server's assurance. We did get an immediate apology from the server when this happened. Again, this is a little nit-picky, but when I spend over $100 on a meal for two it's something that will keep me from giving a perfect review.Despite a couple small hiccups, Aura is worth a visit.", "Date": "2013-02-25", "Author_Location": "Nashville, TN"}, {"Author": "Tommy S.", "ReviewID": "I0gckGXevW0HjfsS3Yws2w", "Overall": "1.0", "Content": "Aura was the worst dining experience I've ever had in my life. I was vacationing from Chicago to Nashville, and thought to try Aura. Worst mistake I could have done. To begin with, we went on a Saturday, and the server took 15 minutes to greet us. After greeting us, I started noticing my surroundings. The table next to us had issues with food and was talking to the manager. Then, a server dropped a dish on a table on the other side of me. I thought I was in some alternate universe. After that, another two top table was sat next to us, and ultimately walked out because they never had anybody come greet their table. Our server forgot appetizer plates, when delivering our appetizer. Everyone seemed nervous and disorganized. It was painful to watch.However, I was hoping the kitchen would redeem my experience. I was very wrong. My spouse and I ordered identical orders. Filet, medium. My steak was extremely overcooked and his came out raw. The potatoes were grainy, which made me suspect if they were from a box. At this point, I wanted to cut my losses and leave. The manager was apologetic and seemed surprised, when I explained everything that was wrong. She wasn't even aware of the table walking out next to us! She insisted on giving us free dessert, which was nice. However, our server seemed irritated, so we paid our bill and left. We took our desserts home. They looked like they had been regurgitated into the box. We opted to forgo on dessert, and warmed up our left over food from Tavern at Midtown. Obviously, communication is lacking between everyone that is employed at Aura. Save your self the time and money and skip Aura.", "Date": "2013-02-24", "Author_Location": "Chicago, IL"}, {"Author": "Bob S.", "ReviewID": "K58STRMQCXPA0uglkaOv5w", "Overall": "3.0", "Content": "I been here twice now. So, it wasn't bad, but they do not hit the mark. I really am struggling what this place is all about. Yes we had the crawfish potato skins and that was the best part of the meal. One of us had the Chicken Torta and I had the special blue corn encrusted pork tenderloin with shirmp and scallop fried rice.  It was covered in some kind of brown gravy sauce. Really I do not understand what this dish was all about. There was no theme to the flavor and way to much sauce. We also had Mac and Cheese which was one of the better items we had. The Torta, Well last time i saw a mexican torta it was a sandwich.  There was not even a piece of bread on this plate. How was this a torta, no avocado or cilantro. Where is the world fusion here. Sorry, too much other great restaurants in town to go eat at for the same price!!! Will not be returning.", "Date": "2013-07-27", "Author_Location": "Nashville, TN"}, {"Author": "Jennifer M.", "ReviewID": "DzFWAE_WaMrkQrybehd1_g", "Overall": "5.0", "Content": "Husband, Picky-eater Friend, and I had dinner at Aura last night.  What a great experience! The first thing I noticed was free parking--awesome!  The next thing I noticed was that we weren't greeted by any super-b$%#hy hostesses---thus, we knew Virago had vacated the premises! We were quickly seated at nice, big table.  I ordered a couple of gwines on tap (how cool is that?).  The guys immediately fell in love with the beer list.  I don't know what Red Rock is, but apparently, it's amazing.  My husband commented several times that it's unusual that a place has beers he's never tried, but Aura does!We tried the goat cheese appetizer and the hummus.  They were both good.  Not crazy-amazing, but good.  For our entrees, we had the Chicken Torta, Ahi Tuna, and the Filet Mignon.  All three were great!  Friend couldn't stop raving about how great his steak was.  He commented it was the best steak he had had in a long time.  Considering this guy orders steak everywhere he goes each and every time he grabs dinner, that is quite a compliment!What really blew me away was the service!  I hate to admit it, but we were a pretty high-maintenance table. We kept asking for beer tastings, I kept having questions about the wine, Friend had to ask for explanations of several menu items. There were extraneous requests for steak sauce and hot sauce, etc. Each of our numerous requests was quckly met with a smile.  The service was phenomenal!I really want to check out Happy Hour!", "Date": "2013-02-06", "Author_Location": "Nashville, TN"}, {"Author": "Katie-Rose D.", "ReviewID": "m2AG8TRyBoBf85fdl114XA", "Overall": "5.0", "Content": "Aura was AWESOME! We used their private room for a meeting. It was great and so was Chris, our host and server. We did a bunch of apps and LOVED every single one of them, particularly the Mac n cheese, nachos, mushrooms and fried pickles. We had the Mango BBQ Chicken Flatbread for dinner (YUM!!!!!) and then shared all the desserts. Seriously, you HAVE to try the pumpkin cheesecake and the apple bread pudding. Honestly, you just can't go wrong here! Plus, parking is so easy (uncommon in that area) and free after 6pm!", "Date": "2014-02-05", "Author_Location": "Raleigh, NC"}, {"Author": "Brenda W.", "ReviewID": "q9I-3Htv0lq4UXfj_V9uIQ", "Overall": "5.0", "Content": "My new favorite restaurant. The chef is brilliant. We ate there for brunch and ordered  the  Goat Cheese Fondue,  Grilled Ceaser, Burger with fries and Ginger Chocolate Cake. Great service but we found out the reason we had great service was because Chris, the mixologist from New York, stepped up when our server didn't.  Thank you Chris for a great experience and drinks. I hope the owner/chef make the adjustments with staff to be successful. Great food!", "Date": "2014-02-15", "Author_Location": "Nashville, TN"}, {"Author": "Sheena T.", "ReviewID": "8uicjhyvoatdvVL1U61KFg", "Overall": "3.0", "Content": "Sigh.Aura, I'm sad. My friend and I have been loyal customers, coming to your restaurant despite being the only ones there, having shoddy service, and dealing with a new bartender almost every time we visit, but now you've gone and taken the two best appetizers off the happy hour menu and I just don't appreciate it. I love almost all of the food served here but have consistently seen food quality diminishing and the service has no chance with constantly having new staff members. I really really wanted you to make it, but I feel angry that two of my favorite things no longer are offered during happy hour at a discount. I am seeing less and less reasons to come here...", "Date": "2013-05-22", "Author_Location": "Nashville, TN"}, {"Author": "Tara D.", "ReviewID": "zWhrej_cenXDABSPytiTsQ", "Overall": "4.0", "Content": "I recently held a business dinner training at Aura.  They have a spacious room in the back of the house where we were able to set up a screen and projector with plenty of room. The service was top notch (Thank you AMY!) as was the food.  I highly recommend the rainbow kale salad and the roasted salmon....oh!  and for dessert, don't forget the bread pudding.  AMAZING!  The ONLY negative thing I noticed is it smells a bit like a bar.  I could maybe understand if it was a Saturday night or Sunday morning, but it was a Wednesday evening.  Kind of a turn off for a nice restaurant, but I would definitely recommend Aura for a great meal and great service.  Give them a shot!", "Date": "2014-01-10", "Author_Location": "Nashville, TN"}, {"Author": "Philippe R.", "ReviewID": "LVDwv5kaNEMu34yaqLKNFA", "Overall": "3.0", "Content": "I was invited for a business dinner so I had the chance to not realize if it was expensive or not ;)After a very good tropic mojito,  I tried aligator ribs (that was new to me), there were good although a bit dry. I then had the salmon, same story.Then fritter apple which was... too fried for me ;)The ambience was quite (in a good way) and the waitress was nice.3.5 stars would be fair.", "Date": "2013-07-13", "Author_Location": "Paris, France"}, {"Author": "Mike J.", "ReviewID": "LRwjKxxoQ3AKvMGdDY434w", "Overall": "1.0", "Content": "Aura is the worst dining experience we've had in Nashville.   The gator appetizer was inedible - gamey (?spoiled?) meat drenched in out-of-the-bottle sweet and sour sauce.  The entrees were below average,  the scallop entree contained 2 medium scallops and a bite of monkfish, the duck was dry and flavorless.  I tried two mixed drinks, neither was acceptable, one so bad that the bartender came over and apologized (but still charged us for it) . Our bill was $130.00.  Besides us, only one other table was occupied - and this from 7:30 to 9:00 on Thursday night.", "Date": "2012-11-28", "Author_Location": "Nashville, TN"}, {"Author": "Thomas G.", "ReviewID": "Ks5CvC9vxPaflDaqhwD8yA", "Overall": "5.0", "Content": "We finally got a chance to try this interesting restaurant near Music City Center area of Nashville.  Definitely a fusion of different world cuisine. In one meal we had French, Latin, Southern, English and Asian flavors.   Lobster Tacos are great.  Corn Cakes were very tasty.  Grouper and scallops super.  For dessert the shortbread was light and not filling.  Only negative which almost cost a star was noise.  Not sure why restaurants these days like that high level of background sound.", "Date": "2014-02-02", "Author_Location": "Paris, TN"}, {"Author": "Marcia M.", "ReviewID": "4d8wrsybqEcYmtWY1qrxAA", "Overall": "5.0", "Content": "I'm sure that some of you have been just as curious as I have been about the \"old\" Virago space on Division Street. I was thrilled to receive the news a couple of months ago that a promising new restaurant would revive the space. Last Friday, Aura World Fusion Cuisine opened their doors to the Nashville public but this broad was lucky enough to score an invitation to the \"soft-opening.\" Trust me when I say that I have attended many pre-openings and not been impressed to the level that I was this past week...Let's talk food first, shall we? The innovative menu pleased not only my palette but also my friend's carnivore instincts as well. From starting with invigorating Lemon Miso soup (chilled Asian dashi - white miso - fresh lemon) and Arugula/Frisee salad (root vegetable chips - spiced pumpkin seeds - and mint vinaigrette) to the Angel Hair Pasta (veganized with a delicious assortment of veggies) and concluding with the custom fruit dessert, everything was thoughtfully concocted and presented. Between two diners with four courses (he ordered the NY Strip, Beef Chimichurri, and Crawfish Potato Skins amongst other things) and two libations each, our bill came out to around $150. This would not be a hefty price to pay for a special evening out. Don't fret as you don't need to \"go all out\" to dine here. Bites are reasonably priced and I look forward to hitting Aura up for lunches and late night bites too (they serve food through midnight).Pertaining to libations, the cocktail list is sprinkled with interesting crafty cocktails and the wine list offers up a nice assortment. The standout feature is the Darcie Kent Vineyards Wines powered wine tap machine at the bar! I was tempted to do a pseudo keg stand but was able to restrain myself. The Pinot taste that I had was just okay but the Cabernet ticked my fancy. Give it a swirl at around $8 a glass.The beautiful  and moody renovated space offers up beautiful nooks, private dining area, spacious bar area with lounge, and spacious main dining area that all offer a different perspective throughout. I loved the look and feel just about as much as I did the fabulous customer service. Our server was full of personality and suggestions throughout while still giving us enough space to enjoy conversation too. I look forward to enjoying Aura in the very near future!", "Date": "2012-10-15", "Author_Location": "Nashville, TN"}, {"Author": "Blair S.", "ReviewID": "rh6Ya8Y_7Qwz0s0JH1dOFQ", "Overall": "3.0", "Content": "The service was good and the food was a little mixed - some good, some OK. The atmosphere is nice but it still feels like the new operations are being ironed out. Aura has lots of potential, but hasn't yet reached it.First the appetizers. The crawfish potato skins are delightful and a good portion, worthy of five stars. We also split a grilled Ceasar salad upon recommendation from our waitress. There was a nice smokey flavor to the romaine lettuce, but parts were over-dressed with otherwise good dressing.For an entrée, I had the mahi mahi. It was covered in a crab sauce and nicely presented. The middle of the fillet was delightful, but the edges were chewy. It was hard to tell if it was over-cooked or over-frozen. The crab sauce had more salt than it needed, but was otherwise delightful. My fellow diner had the seafood pasta, which she loved. I sampled a couple bites and would rate it 4 stars. Fresher seafood would be great ratings boost here too.There's a nice signature cocktails, craft beer, and wine list, including the wine on tap, which I highly recommend. I'll probably be back for happy hour or the new brunch.", "Date": "2013-03-30", "Author_Location": "Nashville, TN"}, {"Author": "Matt M.", "ReviewID": "_hWNqf0C2Optt3mRZrDIdg", "Overall": "4.0", "Content": "We decided to check out Aura for happy hour last week and I was pleasantly surprised. A friend of ours had attended a Yelp Elite event here the previous week and raved about some of the food she tried, so we decided to give it a shot.Since we were there for happy hour, let's start with the drinks: wine on tap. Odd concept to me initially, but I'm a total fan now. We tried three of the four kinds they had on tap, and I was  extremely surprised that the chardonnay was my favorite. I usually can't stand chardonnay, but the one they had on tap was phenomenal. I'm very thankful for that $5 happy hour special and the generous pour - it definitely went well with our dinner. Now, on to the food...We stuck with the small plate items, ordering some from the happy hour menu and some from the regular small plates menu. First, we tried the edamame hummus. Is it wrong that I'd like to be buried in that stuff and have to eat my way out? There were so many complex flavors for a hummus and the only issue was that we needed more bread to eat every bite of it. We also tried the crawfish potato skins, the fried pickles and the seared beef chimichurri. Each dish was just as good as the last. Although the potato skins look to be made with fingerling potatoes (which means it's smaller than your average potato), it was still enough to satisfy three of us. The fried pickles were delicious as well, and I'd have to say their recipe is one of the best that I've tried. I enjoyed the seared beef chimichurri, but probably wouldn't order it regularly.From the regular small plate menu, we ordered the pork belly flatbread, and that was the only disappointment. All other pork belly I've tried fell more into the bacon category, but theirs was reminiscent of pot roast or shredded pork. It wasn't bad, but it wasn't what I was expecting. The service was exceptional the night we visited. Our waitress, Cindy, made sure we were taken care of and several other staff came by and visited as well. I would have given them a full five stars if it weren't for an issue with our bill. At the restaurant, there was no problem, but when I later checked my bank balance, there were multiple authorizations from Aura. Our bill (with tip) was $89, but there were over $180 in authorizations. From what I gathered, they screwed up when running the card, but it didn't actually clear as a purchase. We called them the next day and no one answered, so we had to leave a message. Now, one week later, they still haven't called us back. At least everything worked out with our bank, but it would have been nice to have a return call from Aura with some sort of explanation. Since they're new, I'll give them a pass this time around and I still look forward to trying Aura again in the near future.", "Date": "2012-11-30", "Author_Location": "Nashville, TN"}, {"Author": "Sara L.", "ReviewID": "c_5nhoHyOXaJ8NsrDtej7g", "Overall": "3.0", "Content": "Some things were great, some things were just ok, which leads to the 3 stars.The great: the service. Super prompt attention and staff, v friendly and helpful waiter. The drinks and drinks list were extensive, inventive, and well mixed. Also loved our appetizer, the lavender goat cheese fondue. The caramelized onions and shallots balanced well with the goat cheese, and the lavender was perfectly proportioned to the dish, not overwhelming at all. Our main courses, the New York strip and the salmon were both good--but not great. There was a bit too much salt for our taste. However, the desserts were again great. The shortbread with lemon was exactly what I wanted and the chocolate ginger cake was a new take on flourless chocolate cake. Takeaway? I'd definitely come back for drinks, appetizers, and dessert, but maybe think twice before trying the entrees.", "Date": "2013-03-16", "Author_Location": "Nashville, TN"}, {"Author": "Jonathan S.", "ReviewID": "0j0comWCPUs-0NEt0DinkQ", "Overall": "5.0", "Content": "Our server was very friendly, attentive and knowledgable about everything on the menu. Food was all amazing. Ordered a fresh lemonade, since I'm a bit of a lemonade connoisseur, and it was incredible. We will definitely return sometime.", "Date": "2013-12-14", "Author_Location": "Aurora, CO"}, {"Author": "Michelle M.", "ReviewID": "jZsjhPaUlk7DTOtE3ORZgQ", "Overall": "5.0", "Content": "I went to Aura last night and enjoyed every second of it. I am a big fan of fusion food, and I thoroughly enjoyed at all the surprising flavors. The edamame hummus was delicious as was the crawfish potato skins. The salmon was also yummy. Our waiter, Mark, was incredible. He was extremely knowledgeable about everything and we ordered the food/drinks he recommended, much to our delight. Someone in our party has a milk allergy and he asked the chef to make a dessert without milk  (NOT an easy task) just so we could all have dessert. He was fabulous! I definitely felt everyone at Aura went above and beyond to make our dining experience magical. I cannot wait to return", "Date": "2013-11-17", "Author_Location": "Nashville, TN"}, {"Author": "Terri H.", "ReviewID": "_9LcNdcjMEiQfINWYdwYrQ", "Overall": "5.0", "Content": "Great Sommelier = TravisYes restaurants are supposed to be about the food but I must first discuss the sommelier.  He is the best I have ever had the pleasure of meeting.  We have been to several wine classes and I learned more from him while sitting at the bar waiting for a table.  How awesome would it be if he did wine classes here?  Hope to see that in the future.The range chicken torta with asparagus and peruvian potatoes sounded so tempting so I had to take a chance on it.  The reason it is taking a chance is because I find that 85% of the chicken that I eat is dry.  My chance paid off.  This chicken was so tender that I ate slow and savored every bite.  What completes a meal?  The wine pairing of course so I asked Travis what wine he recommended with the chicken.  He recommended the d'Arenberg \"Hermit Crab\" Viognier.  This was my first Viogner and I'm so glad for the experience.  This was the perfect wine with this chicken dish.Everyone at Aura made our evening amazing and we will be making return visits.  There are so many unique dishes and wines to experience.@auranash", "Date": "2012-11-18", "Author_Location": "Centerville, TN"}, {"Author": "Burke W.", "ReviewID": "xe2GVYvx85qcoQcs-CM6Qg", "Overall": "4.0", "Content": "I was a bit apprehensive going to AURA after seeing the negative reviews, but most seemed to center on the service (not the food), so i figured I would give it a try (I can deal with bad service).I AM GLAD I WENT (and we will be going back)!  Went on a sunday night, and we were one of two tables at 7 PM (i did expect it to be dead based on reviews, so that wasn't a surprise).  More tables sprinkled in throughout the night, but it was never busy.Service was excellent - we never waited long for anything, our server explained things very well, our water glasses were always refilled on time.  No issue with using the yelp 15% off check-in coupon.  Maybe service would be worse at a busier time, but i'm not sure it even gets too busy...  But even then, our server seemed like he'd be able to handle it.Drinks were very good - wife got a cosmo, I got a mad hattan.  Food was very good - The Goat cheese fondue was excellent, i almost licked the bowl clean.  My NY Strip was cooked perfectly, and the sides we got (Horseradish Mashed potatoes, Cheese Grits, Mac & Cheese - hey, i never said i was healthy) were all top notch.  Bread pudding for dessert - also delicious.The only real hiccup was that they were out of lobster for the lobster tacos - but our server was on top of it from the very beginning, and offered to substitute shrimp at a reduced cost, and it was still quite good.In summary, I think this place has gotten a bad rap from some of the reviews here, and is definitely worth a try.  Shame they're not that busy - makes me worry they wont be around too much longer.", "Date": "2013-12-31", "Author_Location": "Nashville, TN"}, {"Author": "Lindy B.", "ReviewID": "WyhUqQ4nOTuqUNt6j9XUcw", "Overall": "3.0", "Content": "As soon as I stepped foot into Aura at a Yelp Elite event I was in love. But Aura has quickly become like that friend you used to love to hang out with but they've inexplicably changed and now you avoid them but still miss the days when they used to be awesome and fun.I LOVE, LOVE, LOVE the atmosphere at Aura. The low lighting, the seating options, the bar, even down to the cool black and white wallpaper. The atmosphere and potential I KNOW Aura has is what keeps me pushing my friends to come back even though they had already given up on it. The times I've been in the past (with the exception of NYE) the service and food have been great. But this particular Sunday when we went I left feeling sad and disappointed. :(For starters the place was EMPTY. Yes, it was a holiday weekend, but still. It was Sunday around 6pm so you would think there would at least be a few people out enjoying the evening. There were us 4 in the lounge area and at most 2 tables being occupied in the dining room. There was no valet and no hostess greeting us at the door this time. Obviously those services aren't needed when you only have 10 patrons in the whole restaurant but those services were part of what made Aura inviting. There appeared to only be one waitress and one bartender working. Service was still friendly, but a little slow considering how few customers there were. We had a bottle of wine, which even on a half-price discount was still over $30. A little ridiculous. This DID NOT taste like a 60-something dollar bottle of wine. Not that ANY bottle of wine is worth that much to me considering I can get a cute little buzz off a $7 bottle of Turning Leaf. But we had a $100 gift card to burn (as a result of our terrible, but forgiven NYE experience) so we didn't really check the price of the wine before ordering so I guess that's our fault. We also each ordered a cocktail. My bf and 2 friends liked theirs and my Brazilian Berry tasted good but I seriously couldn't taste any alcohol in it. We ordered the edamame hummus and pita bread to snack on with our wine and cocktails and it was yummy but the portion size has been cut in half. The music has also changed since my last visit. It used to be chill, jazzy sounding music and this particular night it was some Kenny G sounding mess. Just weird. I'm almost positive my 2 besties will never step foot in this place again but I maaaay be able to convince some other friends to check it out. But I don't want you to let me down, Aura! I'm begging you! PLEASE change the music. PLEASE don't let the quality and portions of your food continue to diminish. PLEASE make your cocktails stronger. PLEASE do something to get more people in this place! I'm still holding onto my love for the atmosphere and my love for the wine on tap, but I need you to step back up your game, Aura!", "Date": "2013-09-07", "Author_Location": "Hermitage, TN"}, {"Author": "Jaclyn M.", "ReviewID": "pZ9a2hGIOZCjNkdfAyws7w", "Overall": "5.0", "Content": "I had not been to Aura since May and considering the recent reviews, I was a bit nervous about going back. I came in on a Sunday (when they have certain bottles of wine 1/2 off, but we decided to pass) and it was surprisingly busy for a random Sunday night at 8 PM. The wine on tap is always wonderful, so we had a glass of that each and shared the blacked chicken appetizer. Great wine and the appetizer had some kick but not too much spice-- really good. I got the Aura's delight (a must if you like kale root veggies) and he got the seafood pasta (it had a good helping of seafood, so no worries about that). We also got cocktails (I had one with grey goose, St. Germain and sparkling wine. He had the Portuguese Mermaid) which were both excellent. That's the food. The service was also really good. Our waitress gave her opinions on entrees and cocktails that we asked about. She also checked up on us regularly without being overbearing. Give Aura a try! I really love this place and wish I still lived in Nashville and could go more often.", "Date": "2013-09-17", "Author_Location": "Saratoga, CA"}, {"Author": "Paul K.", "ReviewID": "3OB-kEEk-MSJ1rvDs-sQrQ", "Overall": "4.0", "Content": "OK, full disclosure here, I've been there twice and I've not paid for anything - once was the Yelp event, and another time I won a contest. While both times were fabulous, they were also free so I'm not factoring in value here.Aura, as I've seen it, is still looking to find out who they are. From music that doesn't quite fit to a need to know that everything on the new menu is right, you've got a little uncertainty in the restaurant's confidence that is noticeable.While I do appreciate being checked in on, I was checked in on by three different people when I went to lunch. That's a bit too much checking in. Task one person or two even.In all cases where I was there, the food was marv. My wife's food was reportedly great as well. The flavors and presentation of a quesadilla as prepared by them were amazing. I had something else but it was overshadowed by my overwhelming desire to take the veggie quesadilla and roll around in it. Did I mention it was good?For alcoholic beverages, I can only harken back to the Mad Hatten I had during the Yelp Elite event. I often think of that night and how tasty that was. I've not purchased one mind you, but man... when I get some money I'm seriously contemplating waking up in a gutter from those.I haven't had a bad experience here, I've read some bad reviews, I won't dispute them, my sampling of the place is still relatively un-detailed. I think the place is still getting its feet and, at least from the severe amount of checking in I had, I think they want to work with the customers.Your mileage may vary.", "Date": "2012-12-06", "Author_Location": "Nashville, TN"}, {"Author": "Chris V.", "ReviewID": "vtad38Jt7KUt28MJPTOEhA", "Overall": "4.0", "Content": "I had the opportunity to check out this new spot during it's soft opening, which was such a treat! The plus side was I got to try a TON of their sophisticated menu offerings and was quite pleased with everything I tried. The downside was there's so much more on their full menu that I want to try. I suppose they hooked me. :) The space - which used to house Virago - has a great feel, with a lot of great options for seating. The menu was interesting and diverse and the price point was budget friendly. A lot of the appetizer options were hearty and could serve as a full meal. The Honey Bee Fashioned was a delicious take on an Old Fashioned and the wine from the tap was well received. You'll likely see Marcia M. and I doing keg stands on any given night... look out Aura bartenders! Seeing that it was their soft launch, I will give it a few more tries before giving it a full 5 stars, but they are well on their way! This place is officially open for business, so check it out!", "Date": "2012-10-12", "Author_Location": "Nashville, TN"}, {"Author": "Sophie S.", "ReviewID": "2WGbCbQBVJvMjDr-MVZFfA", "Overall": "2.0", "Content": "The food here was very disappointing. I went to dinner here with a friend. The bread for his goat cheese fondue was burned, although the goat cheese itself was burned. My steak was ok, but his fish tasted awful. We got a dessert to split-pumpkin cheesecake- and neither of us ate more than one bite. It was terrible. Our waitress was quite lovely, but she would let me use the 15% off discount from Yelp because my friend had a gift card for the restaurant. She said that even though we were paying two separate bills, they allow only one discount or gift card per table.", "Date": "2014-02-16", "Author_Location": "Nashville, TN"}, {"Author": "Heather B.", "ReviewID": "37xXiF_S61hqHjFFn8ugEg", "Overall": "4.0", "Content": "We had a coupon for $50 Off a bill of $75 or more, so my two friends and I tried a few different things. Between us, we had praline bacon, goat cheese fondue, blackened chicken, chorizo melange, Waffles, eggs a la creole, and the burger with fried green tomato, Cheddar, and Bacon. Not many complaints about the food. The goat cheese fondue with lavender and shallots was amazing. There were several other things on the menu that I would've liked to try. As far as drinks go, the bellinis are quite tasty, and the southwestern margarita (Milagro, cilantro, poblano goodness) will bring me back for more. We did have to ask our waiter to have the music turned down a bit; our booth housed one of the speakers, and the Sade was blaring. It took quite a while to very our food, but Clay (our server) was attentive. This is the second time I've been here, and as long as this place stays open, I'll new back for sure.", "Date": "2014-02-09", "Author_Location": "Warrior, AL"}, {"Author": "Emily C.", "ReviewID": "MmK3mfguj9sS4jLfOPP_ZQ", "Overall": "3.0", "Content": "First of all we didn't eat there. We wanted to have some drinks and visit with our out of town family. Patterson House had an hour wait just to get in so we walked over to Aura's lounge area that was doing a relatively slow business, considering it was a Saturday night and the area businesses were hopping. The biggest problem in the lounge for us was the sound system. Loud cheap sounding speakers with a high tinny sound that was inescapable at any seating location. Don't turn the volume up so loud if your speakers can't handle it. The drinks were good, but expensive. The bartender had to come out from the bar to serve us, which made things hard for him. He forgot my drink order once, remembered after a long time. Apologized and didn't charge us.", "Date": "2013-11-10", "Author_Location": "Nashville, TN"}, {"Author": "Cindy W.", "ReviewID": "dbe0BiFZKACev97qywCpUQ", "Overall": "4.0", "Content": "I'm always excited for a new Nashville dining establishment. Always. My first visit to Aura was a perfect \"storm\" of delight. Wine and snacks at the friendly bar, with the requested baseball game on the TV (a subtle TV...this is NOT a sports bar). A grown-up wine list with good price points (I love a little bubbly -- and though champagne can be very expensive to serve by the glass, a smart sommelier addresses that by including a good prosecco -- which Aura has). In the light fare category, I loved my semi-Cajun spicy soup with prawns (though a tad less salty would make it even better). All in all, such a great space that needed a renaissance for sure. Aura's just the rebirth that was needed.", "Date": "2012-10-21", "Author_Location": "Nashville, TN"}, {"Author": "Rachael S.", "ReviewID": "fVapO7AWGKJCUQtoZMjfZA", "Overall": "1.0", "Content": "My partner and I had booked a dinner reservation at Aura before a big event the night after Valentine's day. We arrived promptly at the time of our reservation and was sat by the hostess. The menus were cheap and covered in food particles from previous patrons and the restaurant was nearly empty. I was dressed in a gown and my partner in a feminine suit. We waited so long for service that we already had all of our drinks, apps and entrees picked out before we even received a table greet. After over 15 minutes of waiting the hostess sat a couple at the table right next to us and they were served immediately. We were never served. We got up from our tables and left to spend our money elsewhere. My partner and I are both managers in Hospitality and  know this was inexcusable. I am not 100% sure they intentionally meant to discriminate against us because of who we are, but I will let you be the judge...maybe we weren't welcome...", "Date": "2014-02-19", "Author_Location": "Nashville, TN"}, {"Author": "Anna W.", "ReviewID": "TQFcHZrC_mAfkG8I0ujgcA", "Overall": "3.0", "Content": "This is the second time I've been to Aura. The first was for a party type thing and I sampled a little of everything; it was good enough for me to want to come back.I went recently for drinks and appetizers with friends. The drinks and food were very good: attractive, flavorful and appropriate portions. It's a little on the pricey side to me at about $11 per cocktail. One of my friends ordered a bourbon on the rocks and it was $9. So the food and drinks are tasty for an every now and then thing.I would likely not go back because of the atmosphere. The music was awful and while not overly loud it was loud enough to notice every terrible song.  Gin Blossoms, Taylor Swift, Matchbox 20. I had a 15% off Yelp deal to use but couldn't because I only got drinks on my ticket, even though the \"deal\" does not note any exclusions. And then there's the parking. There's a lot right next door, super convenient, but there's confusing signage. One sign says \"Aura Patrons Only\" and the other says something like \"$5 Public Parking\" only there's no one there to determine if you're going to Aura or just parking there. I heard someone that I assume was the manager tell another patron that if she got a ticket \"just bring it in\" and he would handle it.  Guess what was on my car when I left the restaurant? I mean I appreciate that I don't have to pay the ticket or deal directly with the parking company but it's totally unprofessional to put your customers in the position to manage that problem.If I'm going to pay $25 after tip for two drinks I'll likely go somewhere else next time.", "Date": "2013-06-21", "Author_Location": "Nashville, TN"}, {"Author": "Bridgette C.", "ReviewID": "c-thNNgNXdIL5odOa_OJEA", "Overall": "4.0", "Content": "I was lucky enough to get to try this place at a Yelp Elite event, and unlucky enough to not get to come back until recently.  And I'm reminded as to why that was still my favorite Elite event...Aura has some fantastic food.  They have a lot of fun playing with flavors with great results.  I would recommend the edamame hummus, the coconut curry mushrooms, and their rainbow kale salad from their appetizer list.  Actually, I recommend you have anything they make with kale.  I know its good for you, but it can be so bitter and gross when its not done right, and Aura has managed to take a green I am forcing myself to eat and make me love it.  I even ended up getting their Aura's Delight for my entree, which was roasted root vegetables with crispy kale.  It was delicious.  Filling without making me feel gross.  And I was lucky enough to smaple my friend's dishes as well.  They have a great mahi mahi dish with a spicy crab sauce that is to-die-for good.  The space is intimate, kind of dark, and its not too loud in here, making it a greta place to catch up with friends of have a first date.  They have a small but lovely bar area that does amazing weekday happy hours.  They have a lot of fun specialty cocktails that I recommend as well.Overall this place gives you a good dining experience with really yummy fusion food. I am looking forward to going back for either dinner or an after work drink and I would recommend it as a good start out to a night in Midtown.", "Date": "2013-03-19", "Author_Location": "Nashville, TN"}, {"Author": "Duke X.", "ReviewID": "ObaeF2TrntVCsbeyEkdQzg", "Overall": "1.0", "Content": "Sorry this place will probably be on the next restaurant impossible~ the seafood smelled like seafood not a good thing+ the service was very slow~ will not be coming back~ you guys need Robert Irvine.", "Date": "2013-04-16", "Author_Location": "San Francisco, CA"}, {"Author": "Mina K.", "ReviewID": "upnmjjdjFL-DHF29Nf-19w", "Overall": "1.0", "Content": "To say our service was horrible is perhaps to kind.  Our service (in my opinion) was stoned.  She completely messed up our order and it took 30 min to get our checks which was also completely messed up.  Not worth the time since the food is just so so", "Date": "2014-02-19", "Author_Location": "Nashville, TN"}, {"Author": "Kenneth D.", "ReviewID": "3SGrQC3HM_ltuAZ7k0tufQ", "Overall": "4.0", "Content": "For appetizer we had the crawfish potato skin.   That was delish!   Ordered the salmon dish and the grouper+scallops.  We were asked how we liked them cooked. That was the 1st time I was asked that for seafood dishes. The grouper was small but the scallops were huge. The salmon was ok but the shrimp potato cake like side that came with it was good.   Wished I went for the filet mignon.  Apple fritters for dessert was good but the frozen mango yogurt was very icy.  Service was very friendly.", "Date": "2013-04-20", "Author_Location": "Hendersonville, TN"}, {"Author": "Janet S.", "ReviewID": "hpXy_OzEEa7J2gCgxyfdzg", "Overall": "3.0", "Content": "After my original review I received a $25 gift card to come back and give it  a second chance.  We did our Ken's and Aura twofer last night.  Greeter was at door and smiles all round, still pretty empty.  We tried the Real Thyme Cocktail and Jack's Penicillin $12 and $11 respectively.   They tasted OK but Thyme really does not work too well for me and honestly these cocktails are just not up to snuff or worth the price compared to at least half a dozen other places in town.  We nibbled the alligator ribs $10 - three ribs was a nice snack and the mango barbecue sauce was delicious.Here's the thing - it's Sunday night and they are still playing techno music from Saturday, the demographic seems to be an older crowd on Sunday so maybe consider a more chilled out ambiance, heck we just came from Barry White night at Ken's and were so chilled it was an assault on the senses.  My over all feeling is the food is probably good though not our taste, the cocktails so -so and the ambiance great for Thursday to Saturday.", "Date": "2013-05-13", "Author_Location": "Nashville, TN"}, {"Author": "Anthony C.", "ReviewID": "INTLOABrLoEMlB14lGnEqg", "Overall": "4.0", "Content": "We tried Aura with a friend that had attended the Elite event held there the previous week. While at the event she sent me a text and said that we had to go there the next time we met for happy hour. All she had to say was \"wine on tap\" and I was convinced that it would be way sooner than later. The following Friday we arrived and were met by the friendly valet in front of the restaurant. He was very polite and friendly, and was quick to open the car door and welcome us. As we approached the door it was immediately opened for us and we were once again warmly welcomed into the entrance. So far, they are off to a great start. The interior was warm and contemporary, with red and black as the color scheme, and nice warm touches of exposed brick. In addition to happy hour, I would also recommend Aura for a romantic date considering the dining area was a little darker and moodier.... perfect with the jazz they had quietly playing throughout the restaurant. As they were seating us, we told them that we wanted to sit in the bar area since we were interested in the wine on tap and sharing a few different smaller bites on the menu. We were shown to our table and quickly introduced to our waitress. Cindy greeted us and explained the specials and wines on tap. She was very nice and went out of her way to make sure she was available to answer our questions. Once we decided, she quickly returned with our first round of wine and was very helpful in describing the wines and the dishes they would complement best. For the wines, we tried the Chardonnay, the Pinot Noir, and the Grüner Veltliner. In my opinion, the Grüner was the best. Slightly sweet and flexible enough to go with all of the dishes that we paired it with throughout the night. The servings were generous, and were actually served in small, individual carafes that contained two pours per order. This was great and made me feel that I was getting more wine for my money, which is always a good thing. I was initially a little skeptical about the wine on tap as far as freshness is concerned, but I was pleasantly surprised that not only was the wine fresh, it was perfectly chilled to the ideal temperature. Our small plates included beef with chimichurri, pork belly flatbread, fried pickles, potato skins with crawfish, and the edamame hummus. The beef chimichurri was my least favorite and was a little cold when it got to the table. It had pickled, or marinated zucchini strips on top and they were kind of tasty, but the overall impression was a little bland and overdone. Not horrible, just not much flavor. The pork belly flatbread was decent, but also didn't knock my socks off with flavor. I felt that the pork belly was a let down compared to other times I've tried it, where it is usually crispier and more flavorful. I also thought that the sauce on the flatbread was a little plain, but not that bad. The fried pickles were really good and had a nice pickle to breading ratio. They also came with a tasty dip that added a nice kick to them. The crawfish potato skins were also really good and were served on a creamy and spicy sauce and topped with small chunks of goat cheese. The edamame hummus was the absolute stand out and even though I love edamame, I was amazed at how incredibly delicious this dish tasted. Seriously. You have no idea. Edamame blended with honey, ginger, and sesame oil create a smooth, mildly sweet and nutty flavor that is like nothing I've had before. If you go you must try this, even if you are unsure about the combination of ingredients. Trust me, your taste buds will make sense of it all. Even though a few aspects of our meal were a little disappointing, I was really impressed with our service, the wine, and the majority of our dishes. Overall, I would say that Aura is worth a visit and the small bites during happy hour with friends are a great way to experience a variety of their offerings without being limited to a single dish. I will definitely be back to enjoy the wines on tap and the other small bites we didn't try the first time. They are also open for lunch and had some really good specials that were competitive with other nearby lunch options. I plan on getting back to try their lunch menu and see how it compares with what I've had so far and I can't wait to give their happy hour another try soon.", "Date": "2012-12-01", "Author_Location": "Nashville, TN"}, {"Author": "Allison B.", "ReviewID": "TxmPLjNi_FCWPECYoIg8Jw", "Overall": "4.0", "Content": "Time for an update, because brunch has earned Aura and extra star. I haven't had a bad dish at brunch. There is a chorizo dish that is the stuff dreams are made of. The waffles are also great; not too sweet just right. Great, now I want brunch!", "Date": "2013-05-14", "Author_Location": "Nashville, TN"}, {"Author": "Casey H.", "ReviewID": "TwIDUkbcfQYlU8J4WLcVJA", "Overall": "5.0", "Content": "I was thinking of giving Aura 4*s because of the aftermath... but that was all my fault. My boyfriend and I went here for last month's yelp event. Didn't have much to eat prior to going so after a Mad Hatten and a glass of cabernet sauvignon. I went home and rekindled my love with John (my toilet) and his friend (the bathroom trashcan). Anyway... you guys didn't need to know all of that. Back to the review of the restaurant.... love it! Nice and friendly service - great bar... nice ambiance and food was great. Loved their mushroom curry! That reminds me... bring your own ketchup for the sweet potato fries - they don't carry ketchup in the restaurant. :/", "Date": "2012-11-29", "Author_Location": "Nashville, TN"}, {"Author": "Patrick H.", "ReviewID": "CXA7tPUlYcL9ednRHXAjVQ", "Overall": "4.0", "Content": "I'm going to take the different approach on what I think about Aura World Fusion Cuisine. In my opinion, it's not one of those places that I would choose to eat, but a place I would most definitely chill out, have a few appetizers and  a couple of glasses of wine! The servers are really nice (shoutouts to Cindy)! They know what they're talking about and the give great descriptions about the different things they have to offer. The restaurant is very clean and very chill! If you're in the Midtown area and you're looking for a chill out spot for you and your friends (or a lady friend of yours), I highly recommend checking it out!", "Date": "2012-11-28", "Author_Location": "CANE RIDGE, TN"}, {"Author": "Vanessa G.", "ReviewID": "KUdOmVAmDc7v_no-GYGV3g", "Overall": "1.0", "Content": "My first visit was for lunch and it was disappointing. My friend is Gluten Free and the server was not versed in the lunch menu to offer suggestions but did check with the chef and came back with a couple of options. The aligator ribs were cold and the flavor was not what I'd hoped. There was nothing about the experience that would make me return for lunch or dinner.", "Date": "2012-11-06", "Author_Location": "Nashville, TN"}, {"Author": "Raja A.", "ReviewID": "-i5u_DK7bgZpTR2CDPhUvw", "Overall": "1.0", "Content": "Absolutely dreadful! Cold appetizers, then cold rice with the ducks and warm potatoes with the chicken. Never been to a restaurant like this", "Date": "2012-11-14", "Author_Location": "Lawrenceburg, TN"}, {"Author": "Carey James B.", "ReviewID": "43cC5oQusFbk47F90VoBRQ", "Overall": "4.0", "Content": "Ok, so we went back to give this place another chance. This time the service was great and our experience was TOTALLY different. Everything was great. I even tried the alligator again and it was great! Our main dishes were each really good and different.", "Date": "2012-11-03", "Author_Location": "Nashville, TN"}, {"Author": "Cheri K.", "ReviewID": "AaVfCQakCgyLDTEvgc9kOA", "Overall": "5.0", "Content": "Excellent food and service! Mark M was very attentive and really help us with our choices. The crawfish fingerling potatoes were amazing as was the edamame hummus. Very much enjoyed speaking with the manager, Jesse.  Loved the unique dishes.  Thank you for a wonderful evening. Fusion Cuisine is my new thing! We will definitely be back.", "Date": "2013-06-14", "Author_Location": "Downtown, Nashville, TN"}, {"Author": "Becky P.", "ReviewID": "4zj-AGjPwvMhsG2xKeQ09Q", "Overall": "4.0", "Content": "The food is great, but the drinks are WAY over-priced.", "Date": "2013-04-16", "Author_Location": "Nashville, TN"}, {"Author": "Carolyn M.", "ReviewID": "tEDls0wHVY7AZM8639vIhg", "Overall": "4.0", "Content": "We had a lovely meal here. It was almost entirely empty, which was a shame, but we were entirely fawned over which was nice. I had the ahi and my hubs had the salmon. The ahi was fantastic - inventive tomato drizzle and the quinoa and bok choy were perfect complements. The drink list was inventive although I had two mojitos and the first was much better than the second. Our server was well-versed in the menu and very very attentive. Fingers crossed their business picks up post haste.", "Date": "2012-11-22", "Author_Location": "Nashville, TN"}, {"Author": "snookie s.", "ReviewID": "tRNCRyaed0TquiyTBNzqqQ", "Overall": "4.0", "Content": "We tried it because we had a restaurant.com gift certificate. The food was delicious!! We had the kale salad, lamb wellington, crawfish potato skins, and mac n cheese.  The mac n cheese was pretty average but all other dishes were delicious.  It's your typical trendy spot with small plates. Nice to have a glass of wine (on tap) and some small plates. Expect to pay though... We went on a Wednesday night and it was dead. So sad because service was great. Hope they make it! The place looks the same as the old Virago--maybe if they changed the decor???? I would return with the discounted gift certificate only--the atmosphere was just lacking sorry to say.", "Date": "2013-10-02", "Author_Location": "Hermosa Beach, CA"}, {"Author": "Jamie G.", "ReviewID": "zahYsHkZi-0_HNX3IodGqQ", "Overall": "4.0", "Content": "Aura is a great dinner spot. It provides a nice ambiance for a date night or for a girl's night out! The staff was great and pleasant!! I would definitely come back again and I want to try out their happy hour! The only minor complaint was my food was a little cold, other then that pretty good spot.", "Date": "2013-11-24", "Author_Location": "La Vergne, TN"}, {"Author": "Thibaut d.", "ReviewID": "gLs_vojE2CF0HktpurKB7A", "Overall": "4.0", "Content": "The place is nice, we really enjoyed the decor. Unfortunately we have been pretty unlucky with the service that night (delayed drinks, mixed up apetizer order) but they really made it up to us and we ended up paying nothing for the food and drinks which were good. We'll have better luck next time", "Date": "2013-03-23", "Author_Location": "Nashville, TN"}, {"Author": "Seyi A.", "ReviewID": "EKhBn9zL6iRZuQ7DIKKxkA", "Overall": "4.0", "Content": "Date night, we had the Beef Chimichurri as an appetizer and it was good! We then ordered the Veal Ribs and the Diver scallops with grouper. Meals tasted good and the service was good. I would definitely come back here.", "Date": "2012-12-23", "Author_Location": "Nashville, TN"}, {"Author": "Susan B.", "ReviewID": "qYL9rQh19trqEu0wL1ZT2A", "Overall": "5.0", "Content": "Fantastic place. The owner/chef is wonderful and so is the food. The atmosphere is relaxing, especially after a long days work.", "Date": "2013-10-02", "Author_Location": "Franklin, TN"}, {"Author": "Chucky T.", "ReviewID": "5U6X0IksOQ6QztrdR5B00Q", "Overall": "4.0", "Content": "Went there on a date and everything was really good. We had the crawfish potato skins and the goat cheese fondue as appetizers. Both were impressive. I had the filet mignon and the girl I was with had the grouper with scallops. The Filet gets 5 stars but the grouper gets 4 because it tasted a tiny bit fishy. The scallops were perfect. For desert we had their special of the night which was home made pumpkin cheesecake. It was out of this world. The chef here does a really good job and the place wasn't too packed. I will go back for sure.", "Date": "2013-10-24", "Author_Location": "Nashville, TN"}, {"Author": "Lindsay W.", "ReviewID": "0sKvQE1llDYlcB6cyaWP8g", "Overall": "4.0", "Content": "Great restaurant...my friend and I visiting from out of town came across this place on grouping so we went for it despite the description of Latin Asian and southern flavors. It was a slow Thursday night when we walked in great ambiance low lit and \"swanky\" drinks pretty good I got the jacks penicillin thought it would be more of a smooth whiskey drink but was more of a spritzer... my friends drink relax thyme martini was amazing!!! We stuck w appetizers and salads which were more than enough (and we are big eaters) the alligator ribs were very very good not heavy in the sauce on them and fell off the bone...beer shrimp and grits w jicama slaw was also amazing a little heavy but super flavor punch.  The rainbow Kahle salad was sweet and refreshing and the Caesar. Which I usually never order was delish when topped with toasted capers and roasted peppers...I would absolutely recommend this place", "Date": "2013-04-11", "Author_Location": "Evanston, IL"}, {"Author": "Robert M.", "ReviewID": "r-Pq_tXdPBVjSbHQTJx_Lg", "Overall": "4.0", "Content": "Was in Nashville on business and had dinner here last week.  It's a great location on Music Row within easy walking distance of the major hotels in the area.  Good spot if you want a unique menu in a more intimate atmosphere, away from the crush of some of the restaurants farther down Division St.  Get the Crawfish Potato Skins as an appetizer!", "Date": "2013-08-15", "Author_Location": "Round Rock, TX"}, {"Author": "Kendra S.", "ReviewID": "Z1f1Oug9Jnlr_4Iew4zm6Q", "Overall": "1.0", "Content": "I've been here twice. The food is ok, but the ticket time and service is poor. During my first experience, the hostess was extremely rude. There was another woman at the door that was confused about seating so we had to wait for a hostess who was in a bad mood. Our server was new, so his lack of knowledge about the menu was excusable.  Still, when my friend and I ordered a drinks, he came back 10min later only to inform us that they didn't carry the liquor needed to make the drink (that was on their menu). I proceeded to order a different drink, and that liquor was out of stock as well. I didn't find that out until after I had waited quite some time. The second time we came, the food took 35-40 minutes and the restaurant once again, wasn't full. That's not terribly long, however I was a server for 3 years and I am pretty familiar with the time it takes to make certain items. After nearly hour, my friend received the side she ordered initially with the food that took 35 minutes. The place has more of a house feel than a restaurant and it's seeming run as one. I won't be back. It's a cute place, but not worth the time or money.", "Date": "2014-01-25", "Author_Location": "Nashville, TN"}, {"Author": "Vanessa L.", "ReviewID": "Ig2F5-zOB3oc9Dahspi78A", "Overall": "2.0", "Content": "This experience was disappointing on a few levels.  The service is amateur at best.  I arrived early for my reservation and wanted a cocktail at the bar.  The bartender saw me as soon as I sat down and said, \"What can I get you?\"  I have no idea what they have, so I asked to see the cocktail/wine list.  He handed it to me and then stood there staring at me while I perused it.  Very awkward!  I ordered the Revolution - which is very good by the way.  My friend arrived and we sat down.  Our waitress seemed friendly enough, but after taking our drink orders we had to flag her down to place an appetizer order.  When we said, \"Excuse me\" in order to get her attention, she responded in a totally frazzled frenzy, \"I'm really sorry.  I'm the only one here and I'm also tending bar.\"  And then she rushed away!  It was strange.  She then returned to the table and said, \"I'm sorry.  That was a stress response.  I'll be right with you.\"  Also very strange.  Eventually we ordered the scallops/grouper entree and the NY strip.  The scallops were fine, the grouper very dry, the Thai inspired rice dish mediocre at best.  My friend's steak was AWFUL. The flavor was actually good, but the consistency was TERRIBLE.  Having to chew a piece of meat more than 10 times in order to break it down is simply nauseating.  We sent it back (I try to never do that) and ordered the appetizer of steak/chimichurri instead.  The flavor, once again, was good, but the meat was - once again - tough.  I should mention that the manager came to the table, was very accommodating, and didn't charge us for either of the steak dishes.  All in all, I wouldn't go back.", "Date": "2013-01-20", "Author_Location": "Nashville, TN"}, {"Author": "Justin C.", "ReviewID": "7GXOAFaObEhgjnZ1pObYRQ", "Overall": "3.0", "Content": "This place was good, but not great.  I used a Groupon which  made it worth it.  The service was very good.  Off-street park is always nice.  The restaurant is kind of cool.  the food was decent, but I think there are better options out there for the price.", "Date": "2013-04-02", "Author_Location": "Nashville, TN"}, {"Author": "Al M.", "ReviewID": "oEsn_PVmym85c8xe4xvInA", "Overall": "4.0", "Content": "Great dinner and great service. Particularly enjoyed the edamame hummus. Our part of four all had different entrees and we were all very happy.", "Date": "2013-01-22", "Author_Location": "Nashville, TN"}, {"Author": "pepper f.", "ReviewID": "rlR_FsA0ge4c39E2ozZxqw", "Overall": "1.0", "Content": "i really wanted to like this place...the food was okay, but i must say the service was even worse. not only did it take 15 minutes for us to be greeted after we were sat, but our server was horrible.", "Date": "2013-10-17", "Author_Location": "Nashville, TN"}, {"Author": "AM D.", "ReviewID": "zgZmeUDSeTsvIX6i18r9tA", "Overall": "4.0", "Content": "Went to Aura for lunch today, great food, great service, lunch prices were comparable to Tavern. It's nice to finally have something in this building again. Not too many people in the restaurant for lunch, hard to tell if it's really \"open\" from the outside. Stop in to check it out!", "Date": "2012-12-04", "Author_Location": "Nashville, TN"}], "RestaurantInfo": {"RestaurantID": "_jvu5NahIlLFHdjR-5WywA", "Name": "Aura Restaurant Bar & Lounge", "Price": "$$", "RestaurantURL": "/biz/aura-restaurant-bar-and-lounge-nashville", "Longitude": " -86.79521080000000", "Address": "1811 Division StNashville, TN 37203", "Latitude": " 36.150643000000002", "ImgURL": "//s3-media3.fl.yelpcdn.com/bphoto/T9IB2ndZolzD4WE4Mgs6cg/90s.jpg"}}