{"Reviews": [{"Author": "Dana Z.", "ReviewID": "JHww8JVvN8zvKPW3WEDs-g", "Overall": "5.0", "Content": "I asked the amazing Dave H. for a recommendation on a restaurant near the theater district (and if you don't know Dave H, then shame on you!) and he recommended a few places - Becco being one of them.We were so glad that we went!  Our pre-theater reservation was on a Sunday at 5:45, and it wasn't too busy, although by the time we left the place was packed.  We were seated in the way back, at a table under a sky light.  The service was prompt, bringing out yummy bread and apps.  The $25 wine bottles were a great buy for NYC -- we got two for the table (hey, YOLOOOO -- haha i'm not still drunk while I'm typing this I promise)I had the pork with the strawberry rhubarb, which was so wonderful, although BEWARE if you get the pork CHOP, because it's about 5 lbs of meat.  Mmmm meat.I thought this place was fantastic and I'm glad Dave recommended it - now I recommend it to anyone else looking for a great dinner near the theater!", "Date": "2014-07-02", "Author_Location": "Falls Church, VA"}, {"Author": "Sharon T.", "ReviewID": "gprFpFiXXXVHSQrEsnHolQ", "Overall": "3.0", "Content": "I enjoyed my visit before seeing a show and glad I made a reservation through Yelp before going since I was on a tight schedule. I was seated almost right away even though I was about 10 minutes late. Not only was the restaurant packed, but the bar and waiting area were filled as well and barely found a seat to wait until our table was called. The wait staff was so-so. Took a long time to order but once I did, everything arrived as expected.  The poor patrons seated next to our section waited at least 20-25 minutes before they got water or menus.  It made me feel uncomfortable because I couldn't really enjoy my meal sitting so close to those poor souls and I felt like waving down the wait staff for them.  I'm not sure what was up except for maybe disorganization of the wait staff. At least they were offered a free app for their trouble.Bottomless pasta  (choice of ravioli, pesto penne, spaghetti) after a long day of traveling was great but I should have passed on the Caesar salad starter. My daughter's antipasto appetizer was a lot better and wish I hard ordered that instead. Enjoyed the ambiance somewhat but it is quite loud and a bit claustrophobic but I was warned by other Yelp reviews. I'm really glad they asked if I needed to get to a show before ordering, so I will say my order arrived just in time to enjoy it before rushing out the door. If I come again, I will do it on a non-weekend night and give myself more time to enjoy the experience.", "Date": "2014-07-10", "Author_Location": "Chandler, AZ"}, {"Author": "Nelly N.", "ReviewID": "4mf5njEJISsFDY4Du6P3gw", "Overall": "3.0", "Content": "Nothing tasted bad, but nothing tasted any better than dishes I can make at home. Two friends and I stopped by for a Sunday night dinner at Becco. The service was great, I'll give them that.I have to say, I can make a better pasta dish at home with store bought pasta. 2 of the three pasta dishes they served were homemade pasta. None of the three were impressive.It's not to say the food didn't taste good, it just didn't taste great. As much as I hate to say it, I've tasted more flavor in Italian chain restaurants. Not worth the money!", "Date": "2014-07-10", "Author_Location": "Houston, TX"}, {"Author": "Nikki A.", "ReviewID": "0QaLliqmxnC3VPxU4ARi3A", "Overall": "3.0", "Content": "Fine choice for the area and interesting concept. It is so hard to find a good place to heat in the theater district, so my standards are definitely lower. Becco has an option for $22.95 where you get either a Caesar salad or a plate of grilled vegetables and then an unlimited amount of three different types of pasta. The pastas were okay--one potato gnocchi, one linguine with tomato sauce and basil and one with bacon. I do not like cheese and asked one of the waiter's if the bacon pasta had cheese and he rudely said \"All pasta has cheese.\" That is just not true--in fact, one of the pastas they were serving did not have cheese!The restaurant is shockingly huge-they have indoor and outdoor seating, as well as upstairs and downstairs seating. I would never eat here if I were elsewhere in the city, but if you're in a rush before seeing a play then it's ok.", "Date": "2014-07-10", "Author_Location": "New York, NY"}, {"Author": "David C.", "ReviewID": "frZVZ4CmY4xdqoxNFADoGQ", "Overall": "3.0", "Content": "Went here after theater and it was inevitably full of tourists.  All entrees come with an OK ceaser salad and the pasta menu is made daily where you get a taste of 3, which are then all you can eat.  The pasta is brought around from a big pan and served to the whole restaurant.  The food here is good, and so in the service, they also have a wine list of bottles under 25$.I guess I just hate getting treated like a visitor who is looking for all you can eat pasta and free ceaser salad (sounds a bit too much like the olive garden to me...)", "Date": "2014-07-07", "Author_Location": "New York, NY"}, {"Author": "Russ H.", "ReviewID": "xqktQyADif62127cgapstA", "Overall": "1.0", "Content": "My wife and I went here for our 12th anniversary. We went with another couple and had a good night because they we were with good friends but the restaurant didn't help. The waiter was very snooty, we asked for a wine recommendation and he laughed at us.  We had chicken Parmesan it was less than average. Red Sauce was bland and chicken was over cooked. Also had the roasted chicken that had nice crisp on the skin but was also dry and over cooked.As mentioned before it was our anniversary so they brought as a gelato with a candle for this. Thought it was nice until I saw they charged us for it.  Overall I won't be going back. Plenty of great places at much better prices. Way over priced for what it was.", "Date": "2014-07-14", "Author_Location": "Marrero, LA"}, {"Author": "Brian P.", "ReviewID": "VWwjJOEyx6rjwjyvxSKHOQ", "Overall": "2.0", "Content": "Blah Italian in the NYC theater district. They make a big deal about their ceasar salad and multiple-pasta options. Both were so mediocre. Would never come back here.", "Date": "2014-07-08", "Author_Location": "Chicago, IL"}, {"Author": "Elizabeth S.", "ReviewID": "gAkJxi_Q8VF3EXoqgyP15g", "Overall": "4.0", "Content": "Just went here for the first time and am definitely going back! We loved every part of this meal.Although you can order off the menu, we opted for the appetizer and trio of pastas, and are so glad we did. The Caesar Salad was excellent -- not fishy in the slightest, no extra anchovies, which is usually my beef (or fish, as it were...) with some restaurants' versions of Caesar Salad. And I love that I got experience three kinds of pasta -- a basic tomato and basil, which was fresh and delicious; a ravioli with a butter and marjoram sauce that was light but flavorful, and a bolognese made with veal that was truly excellent.We had food issues at our table -- one person didn't want the veal so got a vegetarian option; I'm allergic to seafood and they were very cognizant of that. I read in a review below that someone asked how pasta can be fresh if it's sitting around in pots -- you basically sit at your table and the servers come around with the pasta -- and the answer is, \"I don't know but they do it.\" I was pretty full so didn't get dessert, but tried my friend's chocolate mousse cake, which was to die for. Someone else got the cheesecake and really enjoyed it as well. Above all, the service was so great. It's crazy downstairs when they're first checking you in because of all the pre-theater people, but once you're at your table, the servers are knowledgeable and fun -- and we were not rushed in the slightest. Can't wait to return!", "Date": "2014-06-29", "Author_Location": "Montclair, NJ"}, {"Author": "Meg H.", "ReviewID": "LGF0X7q0EiokK6W5pTAzrA", "Overall": "5.0", "Content": "I hear people describing al dente pasta, but I never really understood exactly what it meant until now.  Upon my first bite, I was like llliiigght bulb!  This is what they mean by al dente pasta!!I had the all you can eat pasta and chicken limone, all of which were really good.  The all you can eat pasta comes with three pastas of the day: ravoili, spaghetti with shrimp and penne pesto.  All of the pastas tasted fresh and the respective sauce for each was perfect.    As for the atmosphere, it felt as if I were in Italy.  The music, the people, the food...the server even had a thick Italian accent.  Stupendous food and service.  Would definitely come back and highly recommended if you enjoy Italian food.  Oh, and great wine options too.", "Date": "2014-06-17", "Author_Location": "Brooklyn, NY"}, {"Author": "Tameka K.", "ReviewID": "zkq09qPNrfqSJlBRpWewfA", "Overall": "4.0", "Content": "Took my Mom for a birthday supper (we hit the restaurant at around 4pm on a Sunday) so the place wasn't crowded at first. By the time we left, there was a full on theater crowd and it was quite loud. **TL;DR version**This is a great \"fancy\" restaurant to go to when you have a group of widely ranging tastes and eaters. Some people who want simple, traditional flavors (aka non-adventurous eaters like my Mom) and others who are willing to play with less familiar flavors and textures (like me!)**Extended version**The bread plate was interesting. White bean paste and olives were both deliciously savory ways to whet the appetite. The crostini sticks had good bite, but the actual bread (two kinds) was a bit hard for my taste. (The better to spread with white bean paste, said my Mom). Ceasar salad was pretty damn good. Leaves were nicely coated with dressing (not drowned or dry) and fresh, crunchy croutons. LOVE, LOVE, LOVE that they have a simplified wine list. A page full of $25 bottles. Reds, whites, roses and sparkling included. We picked a prosecco. It was crisp and fruity, without being terribly sweet. Mom had the lemon chicken breast. Succulent and fragrant. I had the try it all pasta special. It did not disappoint. Penne with short rib ragu (NOMLICIOUS), spaghetti with red sauce and the standout winner (which I wasn't expecting) was the vegetable canneloni with bechamel sauce. Decadent. Rich. And perfectly seasoned. Not mushy vegetables. Pasta with bite. So. Freaking. Good. Service was nice, too. The wait staff could've been a tiny bit more attentive, but honestly, they kept out of the way so Mom and I could eat, drink and be merry. Highly recommended for a non-hipster, non-pretentious upscale dining experience if you're in Midtown and randomly want some Italian.", "Date": "2014-06-23", "Author_Location": "Los Angeles, CA"}, {"Author": "B L.", "ReviewID": "UbXF-SjlOjYj_kwmSZy2VQ", "Overall": "2.0", "Content": "Extremely, extremely disappointed to be in New York and read so many positive reviews on the pasta here which was awful!!!  How can anyone expect to be served great pasta when 1) its not served fresh...its sitting on a large heated pan being brought back and forth...which overcooks the pasta(not at all al dente) and say the shrimp in this case gets overcooked as well.  2) all three pastas lacked flavor - this coming from someone who likes limited garlic, onions, salt, condiments...The Caesar salad that comes with your meal (served at your table) is average at best - tasted like a mediocre Caesar you are served at a wedding or buffet!Bread is weak 2/5, bread sticks too salty, bread slices not terribly exciting.Osso bucco was the only reasonable plate to me 4/5Service from Monica was off the charts good-  but Im sorry Monica, you need some help here.  And I may be crazy because of your restaurants success and reviews... but I can not believe this is a 4 star pasta experience in NY.I will not come be coming back!!Btw, we ordered one 'custom' freshly made penne pasta and that was weak as well!", "Date": "2014-06-22", "Author_Location": "San Diego, CA"}, {"Author": "Ellie B.", "ReviewID": "UjBhdDWeji2m-bB-GAjAwA", "Overall": "4.0", "Content": "My visit here with friends was decent. From the outside the place looks small and cozy but it's actually huge and has two floors. We were seated on the second floor and the main negative I had about that was that it was FAH.REEZ.ING. Freeeezing cold! It was a lovely warm night, around 80, but inside it had to have only been 55. Ridiculous. At least the food was pretty good. I got the special - salad and unlimited pasta. The Caesar salad was fine and the pasta was good. The three served were pasta with a red sauce, mushroom ravioli, and pasta with a clam sauce. They made a special batch of the third with no clams, which was very thoughtful. Service was attentive.", "Date": "2014-06-19", "Author_Location": "Milwaukee, WI"}, {"Author": "Nicole A.", "ReviewID": "DXkFe7aK4HWg3DXyq4TA1Q", "Overall": "3.0", "Content": "Ordered apps and bottle wine, antipasti which was good and nice size.  Very tasty cheese (homemade mozz and parm) and shrimp (supposed to be jumbo but rather small) were good, lightly breaded spicy sauce.  Dinner- 2 bell and Evans chicken with risotto.  It comes on the bone- skin was pretty salty but the meat was tender and good quality chix. The risotto was gross and cheesy and bland- barely touched it.  Veggies were good.  Swordfish was ordered by my friend and said it was good.  Portions were OK size we were full because we ordered apps.  Entrees come with. House Caesar which is a nice touch. Desserts- apple strudel homemade cinn gelato- OK. A little bland strudel but Keaton was tasty even though they barely give you a scoop.  It's like a taste.  Panna cotta was tiny and I'm not a fan of it in general so I didn't like it.  Service was good.", "Date": "2014-06-18", "Author_Location": "Bay Ridge, Brooklyn, NY"}, {"Author": "David L.", "ReviewID": "IxGFbPUw74AnJBtmcmskWQ", "Overall": "5.0", "Content": "This place has got pre-theater dinner down to a science. They pack it in and keep things moving, but in a really good way. $23 for their special of a really well stocked anti-pasti plate and then all you can eat fresh pasta selections waiters bring around to you. Very very good food and very inexpensively priced and a perfect pre-theater trip. We also had kids with us and pasta+kids = easy.The pasta our night was some paperdelle and tomato which was simple and ok for me. The mushroom ravioli were fantastic and my favorite was the short rib gemelli which had a very rich, unctuous sauce. Really great dinner and service.", "Date": "2014-06-18", "Author_Location": "Los Gatos, CA"}, {"Author": "Jacob H.", "ReviewID": "pzqfmIRk7QcFgmqNblNPtQ", "Overall": "2.0", "Content": "This place is overrated. Came in here for dinner with my boss and we had a reservation at 8, we arrived at 730 and didn't get seated till 830. What's the point of a reservation? The all you can eat pasta came out super slow but when it did it was just ok. I think if one person in the party gets the AYCE and the other another dish you can at least try a bit of each.Would I go there again? Probably not, but it sure is really packed there so people must love it.", "Date": "2014-05-30", "Author_Location": "San Gabriel, CA"}, {"Author": "Ron S.", "ReviewID": "ufulH0vHPpdcj8mP8qWvhw", "Overall": "2.0", "Content": "Came here after reading the positive reviews.  Over all an average experience.  The Caesar Salad was so so and the triple pasta next course was one out of three.   The veggie plate my spouse ordered was acceptable while my chicken parmesan tasted like it had been cooked the previous day and reheated.  Service was attentive but I expect there are better meals to be had.  After all, this is the Big Apple!Added later:  upon reflection the bread was excellent.  Add half a star.", "Date": "2014-06-18", "Author_Location": "Calgary, Canada"}, {"Author": "Patricia C.", "ReviewID": "8Q41rsJGkBd7ZyzqI49jng", "Overall": "5.0", "Content": "Delicious Italian food and great service. They don't make places like this anymore. The decor is nothing fancy but it is what  makes it charming.  In this world filled with cookie-cutter restaurant chains, It is so nice to find a place that is truly one of a kind.   There is no way this place deserves anything less than a 5.", "Date": "2014-05-29", "Author_Location": "Jersey City, NJ"}, {"Author": "Pl L.", "ReviewID": "IpsRNOjTuoR3m4p145WnYw", "Overall": "1.0", "Content": "This place is so overrated! Just a bunch of tourists spilling over from Times Square. The waiter we had was so rude that when we ordered a (already overpriced) bottle of wine he suggested that we order something more expensive. People go here for the unlimited pasta but a can of Ragu and Barilla at home has the same taste and less of the tourists.", "Date": "2014-06-14", "Author_Location": "Manhattan, NY"}, {"Author": "Danielle S.", "ReviewID": "QpYVmy_KNfICUn-Yn8ej7Q", "Overall": "4.0", "Content": "Stopped in here today with my mom. It is a small, cramped and busy little restaurant. A little too cramped. They reeeeeallllly squeeze you in there. The service was quick, kind and attentive. Once seated you are given a white bean dip and some mixed marinated olives to snack on. They also place a wonderfully rustic wooden box filled with very thin and crispy bread sticks (grissini), focaccia with a few olives inside and a hearty traditional Italian type bread. The breadsticks are my favorite. They are light, crispy and salty little sticks of satisfaction. If they sold them, I'd buy them. The touristy or very hungry thing to do is get the all you can eat pasta trio which includes either a Cesar salad or an antipasti misto. As a vegetarian my choices here are limited. You either get the trio of pasta, spaghetti with pomodoro sauce or a sampling of all the vegetarian sides. I opted for the pasta trio and antipasti misto. Today's pasta selection included a ravioli with oregano sauce which was very light and tasty, although it was not served very hot. Spaghetti pomodoro which was great with fresh basil and grated cheese on top. The other pasta was a penne bolognese. Since I am a vegetarian they brought out a special pasta which was penne with broccoli. It was very good. While I enjoyed the pasta, I feel like the best part of my meal was the antipasti misto and the mozzarella en carrozza my mom and I shared. First, the mozzarella is wonderfully fresh and gooey. The bread was light and airy, more of a delicate pastry than a bread. It was served with a bit of sundried tomato pesto and traditional basil pesto. It is the best basil pesto I have ever, ever tried. So fresh and well seasoned!The real star was the antipasti misto. Typically is comes with a bit of seafood, but since I am a vegetarian I was offered the most wonderfully creamy ricotta drizzled with honey and flecked with fresh cracked black pepper. It was heavenly. This came with fresh peas simply dressed in some olive oil. The plate had offerings of a variety of tasty morsels. A small chunk of pickled carrot, eggplant and zucchini in a tomato sauce (caponata?), string beans with a spicy horseradish sauce, marinated mushrooms, ball of mozzarella, slice of the most delicious sundried tomato, a slice of grilled zucchini and a salad of beans.  I would come back for the antipasti misto alone.Definitely give Becco a try if you haven't. If you're not a vegetarian, I'd suggest staying away from the trio of pasta and ordering something else. You can always add a tasting of the three pastas to any entree for $9!", "Date": "2014-05-17", "Author_Location": "Mt Holly, NJ"}, {"Author": "Juliet P.", "ReviewID": "NbOXRplBdWCgOjeMmX6kPA", "Overall": "5.0", "Content": "I am definitely a fan of this place.First time in New York City and I have to try the restaurants in Hell's Kitchen. My BF and I and our friend were on a hunt to find a decent good restaurant. Well actually I was the one on a mission and they just went along with it since I am a yelp addict and a Foodie. Thanks to trusty yelp, I was able to locate this Italian Restaurant.So we walked in, nice ambiance, and a bit crowded. Honestly I thought we were going to wait a while for a table. The wait was actually not bad. We probably waited 20 - 30 minutes. The host was super friendly, and greeted us right away. There is a bar area were you can grab a drink or 2 while you wait for a table. Now here comes the fun. Once seated, the bread basket with spread and olives was served, the menus was handed to us, water glasses were filled. The waiter starts letting us know of the specials. Being indecisive,  I needed another minute but my boyfriend was quick to order the \"Three Daily Pasta Special.\" Finally,  I was set on the lemon chicken and we ordered calamari to start. Everything was fast paced and waiters were super friendly.I hope you're not on a diet because this place will just break you. Literally speaking.  After dinner, we were stuffed. Let's talk food!  The 3 pasta special was amazing. You get unlimited amount of 3 different types of pastas which changes everyday. The waiters come around with big pans and will serve it directly on your plate. I would get a taste here and there from my BF and everything was delicious.  The spaghetti, ravioli,  and the 3rd dish which I can't recall the name but just remembered that they were all very tasty. The lemon chicken that I ordered was absolutely devine. I loved it. Chicken was made to perfection. It was juicy and tender and mixed with the lemon sauce just complements the whole dish.Overall, we had a great dining experience in NYC! Portions are huge and it will overfill you at a reasonable price. TRUST!Better to make a reservation because this place fills up fast.", "Date": "2014-05-11", "Author_Location": "Los Angeles, CA"}, {"Author": "Kate T.", "ReviewID": "HYHlyLeHgoM0lSKXsmc72Q", "Overall": "4.0", "Content": "Skip the whole prix fixe and $25 wine bottle (unless you're not a wine snob) schtik -- you'll miss out on their best dishes and the serious wine; Their Osso Bucco and lamb chops are to die for. Their complimentary bread offerings are impressive, with grissini and two selections of fresh bread, white bean dip, and oil to tide you over while you wait for THE MEATS.Seriously, don't bother with the endless pasta -- it's so Olive Garden and touristy! You can eat a ton, yes, but they pump it out in cheap quality and it's too simple. Their house Cesar is pretty excellent, though. Service gets hairy sometimes, towards the later part of the week.", "Date": "2014-05-11", "Author_Location": "New York, NY"}, {"Author": "Eva C.", "ReviewID": "ZmFXgRIcvI-fHKpjSlUHkw", "Overall": "3.0", "Content": "Extremely crowded on theater nights. I came here before a show and they were really nice about asking us what time our show was so they could plan accordingly for the timing of our meal. I would not recommend the pasta tasting here, none of it was very good even for the price wasn't worth it. My bf got the salmon and loved it and it seemed the table next to us got other entrees they loved too. So I'm guessing their entrees are good but pastas are lacking. I may return one day to give this place another try.", "Date": "2014-05-11", "Author_Location": "Queens, NY"}, {"Author": "Dennis M.", "ReviewID": "1zD7-V5mTAYSxLbB1dsHZQ", "Overall": "4.0", "Content": "I had a quick meeting in NY and wanted some good Italian pasta.  I checked Yelp and found this place.  I sat at the bar and enjoyed three different pasta's.  And they keep giving you more if you want more at no additional cost.  Pasta and atmosphere was very nice.   I would stop here again.", "Date": "2014-06-24", "Author_Location": "Leesburg, VA"}, {"Author": "Mark Z.", "ReviewID": "aAuGaRwsVbRm5C7plgUT4w", "Overall": "2.0", "Content": "Our third or fourth time here: regrettably, it simply isn't what it used to be. Very poor service now. The veal chop parmigiana--my very reason for coming here--was dry and overcooked. The dessert sampler was a big disappointment, too. Stay away from the mint gelato--awful.", "Date": "2014-06-30", "Author_Location": "Scotch Plains, NJ"}, {"Author": "Kris M.", "ReviewID": "fy4wLpOsWGqOzakMz3Gwsg", "Overall": "5.0", "Content": "Always packed and super loud but the food is great. The unlimited pasta special is perfect for those who want to sample multiple pastas made fresh each day and they have a wine list which includes bottles $30 and under. Superb for those looking to have a meal that's a bit lighter on the wallet but still carries the weight of an authentic Italian eatery. This restaurant has been a staple on restaurant row for years and still delivers each time we go.", "Date": "2014-07-09", "Author_Location": "New York, NY"}, {"Author": "Toni D.", "ReviewID": "061it355dhdYPRUBMPBYdA", "Overall": "5.0", "Content": "Great restaurant. We had few courses of meals and few bottles of wine. Their $.25.00 wine selection it's fantastic idea. Service was very on top if it and super friendly. I'm very impressed and can't wait to go back there. I loved their dessert selection simple and delicious !!", "Date": "2014-06-29", "Author_Location": "New York, NY"}, {"Author": "Moshe A.", "ReviewID": "17sAQN0EgkdZ6AksWcTWJQ", "Overall": "5.0", "Content": "Amazing Italian restaurant , the food are really good and fresh , also I like the wine collection , if you want a good dinner  this is the place .", "Date": "2014-06-11", "Author_Location": "Theater District, Manhattan, NY"}, {"Author": "Juan M.", "ReviewID": "dJSCSU4Beixr2vCfNoiysw", "Overall": "4.0", "Content": "A restaurant row classic. There were a group of us of us at Becco for lunch. The Sinfonie de Paste is terrific value. 19.95 for an unlimited amount of three pasta choices. I don't like artichokes but the artichoke ravioli were terrific! Decent Caesar salad and the bread basket was lovely.....the salty, cheesy pretzel sticks were addictive! An amazing and lengthy wine list....we went for the Bastianich Vespa Rosso...so good we ordered a second bottle. Tables are close together and it can get a bit noisy but that's part of the atmosphere. Our server was only two weeks on the job and stated this up front so we all had a bit of fun with him. Thoroughly enjoyable and would definitely visit again.", "Date": "2014-06-09", "Author_Location": "East Haven, CT"}, {"Author": "Chun M.", "ReviewID": "1GsVq92oFaE78ZXXTQzdAg", "Overall": "4.0", "Content": "Had an **awesome** dinner on a special occasion and would do this again for pre-theater or just to have a nice homey Italian meal.  We arrived a little early for our 7:30 reservation and were seated immediately as our table was already set up and waiting for us.  The space is deceptively large with lots of intimate tables stashed all over the place in different rooms.  Our server was very enthusiastic and explained the specials and specialties of the house.  I was looking forward to the house pastas of the night.We started traditionally with the antipasto misto, a mix of grilled veggies & special fish of the night accompanied by a box of crusty homemade bread & parmesan breadstix (more please) and a dish of olives.  All entrees include the house Caesar salad and mine was dressed perfectly with parmesan & rustic croutons.  You can also have the 3 special pastas del giorno that are served table side from giant pans.  These can be your main meal or as an accompaniment to your main course.  Choices last night were basil & tomato rigatoni, artichoke ravioli and my favorite, fettuccine bolognese.  The fettuccine had that perfect al dente pop when you bite into the noodle.  Have as much as you want because it feels like an Italian mother is urging you to have another helping.  All this and your meat/fish course is still on it's way.For our main course, we had the wild striped bass special, the 24hr pulled pork and the porterhouse d'agnello lamb chop.  I was stunned and jealous when they brought out the monster bone-in double-cut pork chop for my wife.  The chop was sitting on top of a bed of mixed peppers & onions and was easily 5 inches above the surface of the plate.  She pitiously sliced a thin piece for me to try.  It was juicy, flavorful and the hot peppers went well with it.  I know what I'm having next time.Dessert was promising as we ordered the apple strudel to share with mixed gelati.  The strudel was none too inspiring, but the mixed gelati of espresso, almond & walnut flavors were rich and I wished I could have had some more.So here's the kicker.  4 courses for 4 people (less wine) was just over $200.  What a great value for an extremely satisfying meal!  We'll have to come back to sample more of the different kinds of pastas.", "Date": "2014-03-31", "Author_Location": "Fresh Meadows, NY"}, {"Author": "R K.", "ReviewID": "GkQtapyspzfFQaDYpmRDBg", "Overall": "4.0", "Content": "Becco is at the mercy of its success.Walking across Restaurant Row on 46th Street toward your 12PM lunch reservation you immediately notice that there's only one restaurant with a line - Becco. Quickly seated among tables for 2 - which are tightly lined up sidebyside - things begin to move fast. Here comes the bread with spread, the olives, the menus. Waiters fly by as water spills (on my shirt) and glasses fall. All this is somewhat understandable as these table's occupants have shows to see. Don't expect too relaxed a meal - it's not happening.The Food:Appetizers (Fried Mozzarella w/Bread & An assortment of marinated & grilled  vegetables with seafood) were acceptable but not standouts.For Mains we selected and shared the \"Three Daily Pasta Preparations\". 1-Pene w/tomato sauce, Nothing special here as we kept adding parmigiana cheese.2-Artichoke Ravioli - Very good and thoroughly enjoyed.3-Pasta w/Veal Bolognese - The best of the three - extremely tasteful - a gem.What's also wonderful about this choice - waiters refill your pastas when done.Hey - Keep it coming...Also selected and shared - Beef tenderloin grilled rare & sliced over arugula with freshly shaved Grana Padano. Excellent as the Beef was perfect and the arugula w/cheese couldn't have worked better with the dish. What was surprisingly special. An extensive wine list with all bottles $25. How often do you come across this option at a fine restaurant? Price wise for quality dining you simply can't beat Becco (our bill $115 including tip). Certainly not on \"Restaurant Row\" where this place is probably your top choiceAll these people on line must know something...", "Date": "2014-05-04", "Author_Location": "Valhalla, NY"}, {"Author": "Ameena D.", "ReviewID": "DMLLEF5f8_upxZ392Xt4bQ", "Overall": "5.0", "Content": "Sometimes, when the stars are aligned and everything is right with the universe, you stumble across the most amazing restaurant and have one of the most magical meals of your life.Lunch at Becco last week was one of those meals.* The service here is top notch. Food takes a while to come out but it's definitely worth the wait.* The food is fantastic! From the shrimp to the salmon to the never-ending pasta to the olives to the bread basket to the contorini. Everything was just delicious.* The ambiance is welcoming and warm. I felt like I was in someone's living room.* Prices are VERY reasonable.I'm debating returning here with my husband, despite the fact that he is SUPER picky and may just ruin the experience for me. Bottom Line: I'll return for sure, with or without the picky husband.", "Date": "2014-04-04", "Author_Location": "New York, NY"}, {"Author": "Helene R.", "ReviewID": "9IkR8PfGBsOY26ExoyKJfA", "Overall": "3.0", "Content": "Came on 5/6/14 for diner. Solid Italian food in Hell's Kitchen.  The home made pasta is excellent and the $25 wine selection good enough to proceed.  There are plenty of other main courses to select from which makes this restaurant a go to place in the theater district.But, the way the hostess \"welcomed\" us was outrageous... Absolutely no sense of  customer service. She either needs a new job or some urgent training... What a shame given the quality if the food!", "Date": "2014-05-06", "Author_Location": "Manhattan, NY"}, {"Author": "Elizabeth P.", "ReviewID": "VLSEmOoYXd_GwF7UBhVSFg", "Overall": "2.0", "Content": "Well this is my very first online review and I'm very sad it's negative considering this is (was) one of my favorite restaurants.. I've never been so miserably hot while trying to eat- NEVER! I was using my napkin to wipe my head instead of my mouth. I was told it was \"because the place gets so busy before the broadway shows start\" WELL NO JOKE! Your Becco your always busy so set the air appropriatly. Esp on a day its 91% humidity. I've been working in midtown many years and constantly recomend this place, don't get me wrong the food is GREAT, mind blowing great but not when your so hot you cant enjoy it. Im a hot natured person but the 6 top next to us asked if we were dying as well and everyone on our floor was fanning themselves. Just sucks to spend that kind of money and not enjoy it. You can afford air Becco.", "Date": "2014-05-29", "Author_Location": "New York, NY"}, {"Author": "Adam S.", "ReviewID": "mzwk35O_Zphf3IMhWQEYMw", "Overall": "4.0", "Content": "Becco is a Restaurant Row institution, having been around for many, many years.  Keeping theater-goers happy, as well as locals and tourists, Becco has a great ambience and reasonable prices.  While they focus on wine with an extensive wine list, they do have a full bar (no sangria, though) and can basically make whatever you crave.  We started with the Bresaola (thinly sliced beef), which was great, and the Tonnato di Vitello (veal loin topped with tuna aioli)...really my cup of tea.  Both were on the Seasonal Menu additions part of the menu.However, their main entree is where they shine.  They are very popular for their UNLIMITED pasta offerings, which are different every day.  On our day, they offered a four-cheese fusili, veal bolognese fettucinne, and a penne with vegetables and tomato sauce.  With any entree, you get a Caesar salad.  Their Caesar is delicious, along with their pasta.  If you're not into pasta, they have various menu options including roasted chicken, braised short ribs, and various fish options.  I also want to make a special callout on their service.  We had a party of 5 with a latecomer or two.  Our server, Leighton, was truly exceptional from beginning to end.   He did have to run on a break for some unknown reason, but informed another server who took care of us until he was able to return.  The GM, Jim B, really does a great job managing Becco, and is worth giving it a try if you never have.I would definitely come back to Becco again - if only there weren't so many carbs in Italian food.  ;)", "Date": "2014-04-07", "Author_Location": "New York, NY"}, {"Author": "Winston G.", "ReviewID": "v8ssmJy2DVN1J3e4Bwrpyg", "Overall": "5.0", "Content": "Pretty awesome lunch deal (not sure if it's also available for dinner) but you can have unlimited pasta (3 choices, all of which you can have unlimited portions of) for under $20.  Looks like based on other reviews it is also available for dinner!  While I did not eat any of the pasta (my friend said it was excellent), I had the fish of the day (branzino) which was perfectly prepared whole, presented tableside, and then filleted in the back.  Very tasty.  While I went here for lunch and did not drink, I am also told that the wines here are only $25 a bottle, which is pretty amazing when you consider how expensive everything in this city is.", "Date": "2014-04-03", "Author_Location": "La Jolla, CA"}, {"Author": "Gina A.", "ReviewID": "aTStXY86l3O62BsT8zmzTw", "Overall": "5.0", "Content": "How have I not reviewed this yet?! We have been here countless times. I have been to Italy and this is some of the best Italian food I have had in America with some of the nicest servers. ESPECIALLY for the amount of food you get for the price. I'm sure the food on the regular menu is wonderful, but we never even look at it. We always without a doubt order the \"pasta special.\" All for only $22.95!!! You get the choice of a cesare salad or their mixed antipasto. I'm sure the salad is great...but get the antipasto!!! You get an assortment of grilled veggies and some seafood...DELICIOUS. Now at this point if you haven't filled up on the appetizer and enormous bread basket they bring you, get ready for some fun. With the pasta special, you get an UNLIMITED amount of three different kinds of pasta. They bring it around in big pans and serve it directly on your plate. It's rare that I even ask for seconds because of how much they pile on for your first helping--but it's perfect for when I just want one or two more ravioli...you know the feeling.  Once you're done with your pasta, if you're not ready to explode, they have wonderful deserts. Desert isn't included in the $22.95 but I find that a good thing because I would motivated to eat it when I am 99% of the time way too full to even think about desert! But not only do they offer a great deal on delicious food, but also on wine. They have a normal wine list but they also offer a rather large $25 per bottle wine list with very lovely wines on it. All in all, this place gets 5 stars for food, service, decor and the amazing price for all you receive. Just one tip: MAKE A RESERVATION!!! This place fills up fast and is always crowded, even on weeknights. But after what I just explained in my review it makes sense right?", "Date": "2014-04-19", "Author_Location": "Queens, NY"}, {"Author": "Lori L.", "ReviewID": "w9t38xQiHp4h5_Mpymt3Bg", "Overall": "3.0", "Content": "It's difficult to love Italian food (especially pasta) and not know of this restaurant or the family behind it. Lydia Bastianich has made her dent in the world of Italian food, and over 20 years ago, opened Becco with the help of her son, Joe. Since then, it's happily served tourists, theater-goers, native New Yorkers, and Italian food lovers alike.A few friends and I met up at Becco during a weekday evening and made our way inside just a few minutes earlier than our reservation. What greeted us was a bright, clamorous dining room; two rows of tables were lined against the side of the room and each and every seat appeared to be filled. Even the bar area was completely packed, with some patrons opting to have their dinner there instead of waiting for a table. We waited for about 10 or 15 minutes until our table was ready and were led past the kitchen to the second dining room, which thankfully had a slightly less chaotic ambiance.There was pretty much no need to look at the menu, as we'd already decided beforehand on our orders. Becco's known for their unlimited tableside pasta service, an option that allows diners to choose between a salad or antipasto misto appetizer, followed by a hypothetically unlimited amount of three different pastas. I opted for the Insalata Cesare, the Caesar Salad, while my friend got the second option. The salad is pretty typical - crisp romaine lettuce, crunchy blocks of croutons, a sprinkling of grated Grana Padano (a cheese that falls in the same family as Parmigiano-Reggiano), and lightly mixed with a dressing that was not timid with its use of anchovies and garlic. For the more adventurous, the antipasto misto offers more variety, including a selection of cheeses, marinated and grilled vegetables, and seafood.The pastas are brought out in huge pots intermittently by servers who will stop by tables and ladle out a serving (or two) of the desired pasta onto plates. On the evening we went, we able to try a  spaghetti pomodoro, a mushroom ravioli topped with a cream sauce, and a fusilli alla bolognese. The least favorite of the night turned out to the ravioli; the pasta was served at a lukewarm temperature and the liberal amount of cheese in the filling completely overwhelmed any mushroom flavor. Surprisingly, the simplest pasta of the night was the standout; the pasta had a good chew to each bite, and the pomodoro sauce was fresh and well-balanced, with a generous helping of oregano and basil to compliment the acidity. The servings are fairly generous, and we were stuffed by our second plates; you will not leave here hungry.The overall quality of restaurants on Restaurant Row isn't particularly worth noting, but amongst this selection, Becco clearly has its strengths. While it may not be worth a separate trip out, it's a solid option for a pre or post-theater meal, especially when there are few other options on the horizon.", "Date": "2014-03-13", "Author_Location": "Jersey City, NJ"}, {"Author": "Reggie M.", "ReviewID": "q2aLs0Ay76eVSN6k2bWZXQ", "Overall": "3.0", "Content": "The restaurant is located on a tourist lane and for many New Yorkers is considered a tourist trap. However, maybe that was a misconception.We came without reservation on a Thursday night and was impressed that the group of 6 were seated in no time at all.The restaurant is quite tight (you can eavesdrop if that's your business) not the best place to discuss serious stuff over dinner.I chose the unlimited eat-all-you can pasta for dinner, it didn't disappoint for its price.Over all it's a great night to hang out while entertaining a friend from Europe.The staff are cordial.", "Date": "2014-03-12", "Author_Location": "Brooklyn, NY"}, {"Author": "Emma W.", "ReviewID": "EeN_aCIPuc6BKSEyWzNu3w", "Overall": "1.0", "Content": "The food is ok but the service is awful. The waiters looks like they don't even want you there, we had to keep asking for a few more minutes to look at the menu but they kept coming over every 30secs. We felt so rushed and seemed like they wanted us in and out as fast as possible. I did not like the waiters all hanging around the bar area downstairs watching us and talking non stop to each other. The noise was unbelievable for a place that only had a few tables with customers, the kitchen, the bar, the till, and the gossiping waiters!! Far too noisy. We did not enjoy our experience here at all and will never return!", "Date": "2014-05-27", "Author_Location": "Financial District, Manhattan, NY"}, {"Author": "Hannah B.", "ReviewID": "glmrbZbXCa_1CZJGRWvgIw", "Overall": "1.0", "Content": "No No No!!!!Before going here i was told there was alot of celebrities the 'old new yorkers' from the theater world. Italian which i love, but i knew obviously in theater district so you know could be busy.WOW chairs and tables on top of one another, rushing to make you eat, rude service. I went with my aunt as well so it wasn't like a young group. She had been recommended it but HELL NO never again. VERY EXPENSIVE and no reason to be. we got the trio pasta .... they come over with a pan of pasta ... now i don't eat meat (odd occasion but not a lot at all) and do not eat fish and the waiter put both on my plate even after me saying no! then it took me 10 minutes to get the attention of the waitress to change my plate. wouldn't mind but in all of this we are sitting on top of a family hearing there whole life story. Do not recommend this!", "Date": "2014-03-26", "Author_Location": "Liverpool, United Kingdom"}, {"Author": "Karen M.", "ReviewID": "V0v9TzJ-VJqvxg_c4tAY4Q", "Overall": "5.0", "Content": "Came here with my boyfriend before seeing a musical. His parents suggested the place for their food and because we were seeing the musical and I'm so glad we picked this place. They were really accommodating and nice - they knew how to work the timing well. I loved my veal parmigiana and my boyfriend's short rib special was also amazing. I had some left over from the huge portion so I got to take it home for later in a cute bag with a logo.Can't wait to go back at some point and try their pastas!", "Date": "2014-04-14", "Author_Location": "Dobbs Ferry, NY"}, {"Author": "Besnik Q.", "ReviewID": "zLowVUsRNQonBcG4KSQsYg", "Overall": "4.0", "Content": "Exelent v chop Milanese Goode service", "Date": "2014-05-28", "Author_Location": "Lincoln Park, NJ"}, {"Author": "Barbara M.", "ReviewID": "v_3HLAxwuOf0T6R-uLImhg", "Overall": "1.0", "Content": "I wanted so much to have a memorable and beyond satisfying dining and culinary experience and instead I had very poor service and with the exception of the clams and linguini in the so called pasta symphony, the food my friend and I ordered was subpar Italian cuisine.  On at least three occasions we should have left the restaurant.  Perhaps we could have walked out at the wilted Caesar salad drenched in tasteless dressing, or when we were told by one if our many servers that we couldn't have a side order of pasta and red sauce to accompany three bland  meatballs that cost $12, when moments later, our neighboring table did in fact get an a la carte serving of pasta in red sauce; or when we were placed at a table where the plates were bussed and routinely were exposed to the backsides of the staff, the clanking of dishes and the foul odor of piles of dirty dishes.  What a lovely wafting ambience that created for us. Long story short overpriced, poor service, incompetent  managers, underwhelming food with gross unisex bathrooms. We spent $75-- never again. We regret we didn't walk out.  I hope you don't walk in.There was nothing about the experience that ranks even one star.  Ok , the water and cappuccino was good.I expected so much better.", "Date": "2014-02-08", "Author_Location": "Jersey City, NJ"}, {"Author": "Sandy L.", "ReviewID": "rXbf0b4oeEtt7gp8FTKK5w", "Overall": "3.0", "Content": "I came here on a Friday night with two other friends. The space is a bit small so people walking back and forth would bump into us occasionally.We tried their unlimited pasta. You get a selection of ravioli, penne and other pesto pasta. I thought the shrimp penne pasta was the best, the other two were just okay. Nothing special really, but the prices were pretty decent.", "Date": "2014-03-06", "Author_Location": "Manhattan, NY"}, {"Author": "Tim E.", "ReviewID": "h-Bpgvv3ZA0aiBljyp4gzg", "Overall": "5.0", "Content": "We originally were going try to get a \"light bite\" for lunch as we had dinner reservations at six before the show we were seeing, but after sitting for a bit and watching the food that was being served around us, that strategy died a quick death. The paste trio is a key component to enjoying the entire experience. It is different daily but the ravioli, spaghetti with calamari, and penne with pesto were amazing.   My salmon \"lunch size\" fillet was in danger of being the biggest fish I've ever eaten. Often times, however, restaurants will serve large salmon but over or under cooked but not at Becco. Spot on and delicious. Since we had thrown \"eating another meal later out the window we slit a fantastic piece of cheesecake that was not super sweet like it can so often be. So good it almost turned into a fork fight for share! Service was pristine. Never hovering but seemingly always right there when ever it was right. almost spooky! Celebrity chef's eateries are up and down Times Square and the theater district but Becco holds their own and then some with all of the more \"well known\" names.Becco is a truly a NYC Italian experience that is not to be missed, but don't wear skinny jeans!", "Date": "2014-03-23", "Author_Location": "Round Lake, IL"}, {"Author": "Jennifer G.", "ReviewID": "JLdRLOAS0W64ZRlQjEtcgg", "Overall": "5.0", "Content": "Came here for my birthday right before watching Once. I'll be the first to admit before this place I hated Italian food and was actually hesitant to go to Becco- Italian food was way out of my comfort zone.Upon initial arrival I immediately assumed it would be the type of restaurant that served ridiculously small portions that left you starving- I was very WRONG!We were seated immediately and our waiter was really nice- not stuck up at all. He mentioned all of these specials- so many that I actually stopped listening after some time. They bring out this bread basket with two types of bread, cheesy bread sticks (yummy), olives (wish I tried them) and this yellow bean dip. To start we got the fresh mozzarella and roasted peppers (mozzarella Lavorata)- mouth watering! It had golden raisins which gave it such a subtle sweetness.I ordered the stuffed cabbage with veal, pork and meat. I tried to find it on the menu that's posted online, but couldn't find it now. Anyhow, it came with spinach spetzle (YUMMY- I need to learn how to make this) which I'm currently craving. It was crispy, but soft all in one bite. It was one of the best things I've had in a while. It changed my view of Italian food- guess I didn't hate it after all.He got some type of pork chop and all I can remember was that it was a very large portion- like I didn't think they came in that size kind of large! While I may have been stuffed to the brim, we did get dessert. The tiramisu was very delicious, but I thought it was a tad strong for my liking. The panna cotta was better for me as it was smooth and creamy without an overabundance of sweetness. I normally cringe at the thought of an Italian restaurant, but I am so glad we came here. I would definitely want to go back at some point.", "Date": "2014-02-01", "Author_Location": "Bronx, NY"}, {"Author": "Khe R.", "ReviewID": "i3TOExWkzBej8jATS8VX_g", "Overall": "4.0", "Content": "Just a plain nice gem in the middle of restaurant row, it might sound like a tourist trap but its not.This restaurant is always packed even on a Monday night which tells you how good this place is .At first you would think that this place has one room, but it actually is like a maze, so many little rooms and a bar on each side, definitely small and intimate, if you don't mind having people sitting close to you and  hear everyone conversations.The menu is pretty decent with the pasta special that is worth having with a choice of Cesar salad or a seafood appetizer , but the most important thing is the wine list which consists of a full list of 25$ bottles of wine all Italian wines, from every region including Sicilian wines .Pasta is served directly from the pan,still hot !!!Definitely be back again.!!!!", "Date": "2014-03-27", "Author_Location": "Clifton, NJ"}, {"Author": "Matt C.", "ReviewID": "1TSK5CwUzPWAak6oVOmE6g", "Overall": "4.0", "Content": "What a wonderful way to spend a lunch meeting. The great selection of wines by the bottle for $25 and an excellent selection of fresh pastas made to order made this my favorite meal during my short stint in NYC. The service was elegant yet the atmosphere felt casual and welcoming. The little plate of various types of olives with cracked red pepper and fresh bread sticks were fantastic when it comes to \"freebies\" on the table pre-meal. I had the fresh spaghetti with a perfectly balanced bolognese. It was overwhelmingly delicious and filling for the price. Thanks for making work seem easy.", "Date": "2014-03-10", "Author_Location": "Buffalo, NY"}, {"Author": "Zakiyyah S.", "ReviewID": "si4jrxTWV-tZ3PdrzNTxKg", "Overall": "2.0", "Content": "This place is for people with no tastebuds. Completely overrated. Reservations were timed great because the place is very small and the tables are too close, very cramped (typical NYC restaurant). I have never been to a Italian restaurant where you need to add salt to your food so you can eat it. First we ordered the hot antipasto, eggplant rolatini had no flavor couldn't even finish it and eggplant rolatini is a fav of mine, the rest platter was just as bland. And I never use salt and my dish was so suppose to be spicy (what a complete joke) - ordered the center cut pork chop pizzaola. There were literally two quarter pieces of hot cherry peppers on my plate. Complete let down. Sorry Lidia I will not be returning again.", "Date": "2014-06-09", "Author_Location": "Parsippany, NJ"}, {"Author": "Scott H.", "ReviewID": "FFg2gZGEOQ2oyCx0kgT0vQ", "Overall": "4.0", "Content": "My second time there, and I'm as much of a fan as the first time.  We all had amazing main dishes for about $22-25.   Fish, pasta, short rib, all sorts of great options.And the $25/bottle - every bottle - list was wonderful.   Had a blast, a few bottles of wine, amazing food, enjoyed a loud and festive and energetic atmosphere, and excellent service.   A very fun place, indeed!", "Date": "2014-02-28", "Author_Location": "New York, NY"}, {"Author": "Sylvie S.", "ReviewID": "OeYw-T_XjEWrv5_HYLHSCg", "Overall": "3.0", "Content": "I stopped by on a Friday night on a whim at about 8pm for a table of two.  We were put on a waitlist for 30 minutes and were led back to a table after waiting only 10.  The place was packed and the tables are close very close to each other.  If you are bigger than a size 4, you'll find it difficult to squeeze into the booth side without ass swiping someones bottle of wine or bread off the table.I went with the pasta special that offers three unlimited pastas for $22.  The night I arrived there was a marinara bow tie pasta, a beet and goat cheese ravioli, and a clam linguine.  I thought the pasta was good as it is handmade and quite enjoyed the perfect al dente cook.  I defin thought the sauces were weak and on the bland side.  I believe the beet and goat cheese was the strongest of the three.I felt the bread in the basket seemed old and service was rushed.  I understand it is busy, but I don't think the waiter looked me in the eye once and generally was walking away before he was even finished talking.  I also asked for a bottle of red but was brought a bottle of white.  Fortunately, I'm wine versatile and hunkered down with the white even though I was in the mood for red.  I do think the entire page of wine bottles for $25 was cool.  The page had at least a dozen and a half bottle selections... Overall, I think it was pretty awesome we were able to get a table so quickly on a Friday night.  I thought the food was decent enough and very affordable although nothing in particular really stood out to me.", "Date": "2014-02-04", "Author_Location": "Washington, DC"}, {"Author": "Harriett T.", "ReviewID": "xMpO_zE04G9SwSo7P4i8lw", "Overall": "4.0", "Content": "Excellent pasta--excellent appetizers--excellent sauces.excellent prices (for NYC!)Nice large glass of house Pinot Grigio---at a decent price.Been there twice on theatre trips--very impressed.Delicious desserts.If you don't want to be ripped off by a tourist trap restaurant when you visit NYC--try this place.Nuf said!", "Date": "2014-05-02", "Author_Location": "Vincentown, NJ"}, {"Author": "Joe A.", "ReviewID": "IV4bcNFEQRHm5tRbo8VM4g", "Overall": "3.0", "Content": "This is a good restaurant if you looking for a meal and show. The service is good and the food is decent depending upon what you order.The are very accommodating to your requests. Table are little to close for my liking and the ventilation is only adequate depending upon your table location.In a pinch this a good place to grab a bite before a show. If you have more time you can do better.", "Date": "2014-02-16", "Author_Location": "Milford, CT"}, {"Author": "Peter V.", "ReviewID": "df-v1qlv47LLHN9dFbn6PQ", "Overall": "4.0", "Content": "Becco is very reasonably priced for NYC and a very good Italian restaurant. Try the polentina di prosciutto appetizer.The Bronzino was amazing.", "Date": "2014-04-11", "Author_Location": "East Hanover, NJ"}, {"Author": "Cathy H.", "ReviewID": "UePnxaqAkyO3JWJ6gFYtMw", "Overall": "3.0", "Content": "Our table was SMALL. It was a table suitable for a coffee bar only not a restaurant. I don't know whether it was because the waiter saw two asian girls and thought we were going to eat that much or what, but we did not have enough room at our table and had to put some of our dishes and cups on a side table the entire time. My friend got the prefix antipasto and we shared the calamari. The order of calamari was the biggest order I have ever. It is enough calamari appetizer for 6 people. My friends trio of unlimited pastas as part of the prefix looked pretty good. I got to try her gnocchi and it was absolutely delicious. For my entree, I got the pulled pork and I was a bit disappointed. Not too tasty. For dessert we got the panna cotta, which was so yummy. Overall, the experience was mediocre but did not wow me.", "Date": "2014-02-19", "Author_Location": "FLUSHING, NY"}, {"Author": "Mary O.", "ReviewID": "EAJpOEJ2IjDIb9Y1JGkHJg", "Overall": "5.0", "Content": "The Sinfonia allows you to sample three pastas made fresh and different each day. The service is excellent and the $25 wine list a deal. Great breads and olives accompany every meal. Desserts, especially the panna cotta and cannoli are generous and delicious!", "Date": "2014-05-29", "Author_Location": "Forest Park, Portland, OR"}, {"Author": "Chris C.", "ReviewID": "YelVk3EMz0Qw-kXokBzJoQ", "Overall": "5.0", "Content": "One of the best restaurants I've ever eaten at. My family went here after a Broadway show to celebrate my grandparents' 50th wedding anniversary and we had one of the best meals ever. It's a small place but they managed to accommodate our large Italian family of about 14 people. And, completely by surprise, Lidia was there to dine at her own restaurant! She was so nice, and was pleasant whenever someone came up to her to pay complements. She also wished my grandparents a happy anniversary, which made my Nana's day.The food is delicious. The unlimited pasta is the way to go - for about $20 bucks, you get unlimited portions of the three pastas they serve that day. The pumpkin ravioli were the best I've ever had. The wine list has selections for $25, so even though it's a top-notch restaurant, you can enjoy one of the best Italian meals you'll ever have at a very reasonable price.The atmosphere is fancy but relaxed, with white table cloth linens and soft warm lighting making the place feel nice and romantic, but the wait staff wear dress shirts and jeans so the place feels comfortable and not stuffy.I have nothing but praise for Becco and I give it the highest recommendation.", "Date": "2014-03-14", "Author_Location": "Astoria, Queens, NY"}, {"Author": "Michael G.", "ReviewID": "X2ojMKPXOCBQokOkNzobdQ", "Overall": "5.0", "Content": "We had been relatively frequent diners at Becco for quite a while. Then the Rack of Lamb disappeared from the menu and dining at Becco became so hectic that we gave up and found couple of other suitable places. Just recently on a Friday night we went back to Becco.  Had to take a 5 o'clock reservation as nothing else was available and we made that reservation at least two weeks prior to our dining date. So...still no rack of lamb but that said...the excellent bread, olives, $25 bottle of wine [great selection with good recommendation from waiter] remain in place. Entering at 5 PM made the meal somewhat less rushed and hectic. Both of us had Caesar's Salad; super - as usual. Main dishes. My wife described her Veal Picatta as superb. I had the Osso Bucco, which was as sensational as I remembered it being (but was priced about $8 more than I remember (still worth it, though). Quite large portions of each too. Service was excellent with frequent \"checkbacks\" by waiter and manager(s). On the negative side, a tad noisy, tables too small and too close together but it was always thus at Becco. Still, quality prevails. We'll return.Nightly pasta specials are still on the menu; favorable price, unlimited amount, and interesting dishes are offered. We don't typically do pasta, but the folks next to us did and the linguine and clams in white sauce looked super. So for cost, it's 2/3 dollar signs; price range 20-45 bucks.", "Date": "2014-04-21", "Author_Location": "Towson, MD"}, {"Author": "Chuck C.", "ReviewID": "8rHxtKBlj5KcW7wDwHTkew", "Overall": "5.0", "Content": "Warning; this review comes to you from a snowy sleepy night in manhattan-I've been to Becco more times than I can remember, and have never been disappointed. The pasta dinner is tried and true, makes me smile just thinking about it. Start out with prosciutto, it will make you think about what is possible with ham, and you may never think about it the same way again. All the bottles of wine on the dinner menu are 25$ (amazing), and carefully picked to complement the freshly made (like hand made this morning) pasta.Oh that pasta. I can honestly say it is some of the best I've ever had. It's Sicilian grandma hand spun good- because it is (minus grandma). Touristy, yes no doubt about it. But sit at the bar and enjoy the sounds that are New York pass by you while you eat pasta you will never forget - unless you drink too much wine ; )", "Date": "2014-01-21", "Author_Location": "Brooklyn, NY"}, {"Author": "Steve N.", "ReviewID": "sLQeyNJzeVRICKZ4Vlk65w", "Overall": "4.0", "Content": "Had not been to Becco in a long time and forgot how good it really is!! Service was wonderful even on a crowed evening!  We were not heading to the theater so we enjoyed a leisurely dinner with good wine from their 25.00 listing.  Had a wonderul medley of fish iwith linguine and it was fabulous. I will not wait so long to return!  Thanks for a great night!", "Date": "2014-05-19", "Author_Location": "Canton, NY"}, {"Author": "Nick C.", "ReviewID": "GdUbO2Fhs7s6FvG6ngw_DA", "Overall": "4.0", "Content": "I don't happen to be a big fan of Italian cuisine. If I ever happen to be in the mood for Italian, Carmine's is the place to go. But since everything at Carmine's is meant to feed a family, it's not the best place to go with just one other person.So I checked out Becco for an early dinner last night, made reservations about an hour in advance over the phone. It's small, but it does have 2 levels for dining. My waitress was very accomodating, and able to answer any questions we had concerning the menu.I ordered the Sinfonia di Paste, table side service of 3 different pastas.  It came with Antipasto Misto as an appetizer. The grilled vegetables and seafood were tasty and well presented. A waiter soon arrived with the pasta and served me. The first was rigatoni in a tomato basil sauce. The main reason I don't love Italian food is because I don't love tomato sauce. This was good though. It was not too sweet, the basil was very noticeable, and the rigatoni was cooked perfectly al dente. Fettuccine in a veal based sauced came next. Once again, the pasta was al dente. I liked it a lot. The third serving was ravioli, but I can't remember what the sauce was. Also good. Forgot to mention this was limitless pasta, you can eat as much as you'd like. I was full after the first plate though so making it limitless wasn't really necessary. I'd come here over Carmine's depending on how many people I'm with.", "Date": "2014-01-13", "Author_Location": "Bergen County, NJ"}, {"Author": "siobhan f.", "ReviewID": "kEs8nq7rMXJYEkQnPs_LDw", "Overall": "3.0", "Content": "The reasons for 3 stars and not 4 stars are as follows:1. PACKED! Servers bumped my chair all night trying to get to other tables and this happened to many guests. I should not have to move my chair every time to allow someone to pass my chair. 2. Wine pricing - do not order single glasses of wine. They are extremely overpriced, including a $20 glass of chianti. A friend asked our waiter for a glass of chianti and he brought it. I had no idea until I saw the bill that it was $20. The waiter SHOULD HAVE said \"the glass is $20 but for just $5 more we have our $25 a bottle wine list and I'd recommend you have the.....\"3. NOISY - see #1 for the reason why.That's the bad...now here's the good:1. Two-course for $22.95 is a nice deal. Your choice of a salad or very nice antipasti plate with veggies and two little seafood offerings. Then you get endless, yummy pastas, choice of three, to fill you up for the rest of the night. 2. Pasta is really delicious. I rarely make a meal of pasta, so this was a real treat. Overall, in a city as big as NYC, there are just too many restaurants to choose from at any given moment. I don't think I'd return to Becco.", "Date": "2014-05-23", "Author_Location": "Brewster, NY"}, {"Author": "Curtis H.", "ReviewID": "ASLsTnjCej53c4isR1Owzg", "Overall": "5.0", "Content": "I work at the highest grossing restaurant in the States. I eat at Becco four or five times a month. This is my favorite restaurant in the city. They have wines on their 25$$ list that I sell at 80$$. The food is outstanding. The wine is excellent. And the service some of the best in the city. I tell my tables to go here and drop my name. I cant get enough if Becco. I had veal parm yesterday and I want it tonight. I wasn't satisfied with just in eel serving.", "Date": "2014-05-08", "Author_Location": "Astoria, Queens, NY"}, {"Author": "Mark B.", "ReviewID": "yvlWiKPVF_WV0mGIrTghuQ", "Overall": "5.0", "Content": "Ok, I rarely give 5 stars but I have now been back to Becco 3 times equating to 6 meals and every one has been great.  The additional trio of pasta is always absolutely fantastic.   I will go back every trip and I don't like to do that because I like to try new places.  The food is great, the service is great, and the location is perfect.  Give this a try, I think you will really like it.  I had a special tonight that was potato-encrusted halibut and loved it.  My wife got the lemon chicken and it was great.", "Date": "2014-06-06", "Author_Location": "Los Angeles, CA"}, {"Author": "Chris N.", "ReviewID": "Kq0k2RNNrdp6yq0Gl_68Zw", "Overall": "4.0", "Content": "Ambience and food were excellent waiter a little slow busboys more tentative but overall very good experience", "Date": "2014-06-24", "Author_Location": "Gretna, LA"}, {"Author": "Raymond W.", "ReviewID": "2Jmba1dIWvgQt3UDnc5zLA", "Overall": "3.0", "Content": "First time to try Becco after being in the city for so many years, and of course I'm a sucker for the Sinfonia di Paste (all you can eat pasta for $23), which also came with a choice of antipasto misto or caesar salad.  The three pasta of the night were Spaghetti with Marinara sauce - bland but el dente pastaGemelli Bolognese - Favorite of the three, flavorful with thinly sliced of unknown meatGiant gnocchi covered in cheese sauce - Very filling and heavyBefore my dining experience at Becco, my impression of the unlimited table side service pasta was a chef cooking the pasta next to your table.  However, I realized that moment I walked into the restaurant that it will be impossible because of the tightly packed tables.  Not recommended if you are looking to have a private conversation.  The table side service is more like the Italian pasta version of Brazilian barbecue.  The waiters will bring by a skillet full of pasta and serve them on your plate.  Overall, the pasta was good but it didn't knock it out of the park for me.  Imagine a better version of the Tour of Italy from the OG.  They did serve everything very fast and it's ideal for the theater goers looking for a quick dinner.  What's more interesting is that the pasta special was the only pasta dish served on the entire menu, the remaining dinner menu is made up for various types of protein. The highlight of the evening was that our waiter looks like Colin Kaepernick, if you ended up having him as a server, ask him for an autograph!", "Date": "2014-02-07", "Author_Location": "Jersey City, NJ"}, {"Author": "Sheila D.", "ReviewID": "8s1_68HRHAjBLNUd9D8aMg", "Overall": "5.0", "Content": "Visited here back in December after getting a recommendation.  We received free champagne from the chef when we arrived.  Enjoyed the delicious food, atmosphere and company.  Tables are a bit close together but that is to be expected in the city.  Highly recommend for a romantic dinner!", "Date": "2014-06-22", "Author_Location": ""}, {"Author": "David D.", "ReviewID": "hTriC-RX-sn6fIMPXJHaww", "Overall": "3.0", "Content": "Our visit to this popular and cramped establishment was a bit less than a great dining experience. We all chose to get the Sinfonia Di Paste, a choice of two salads followed by unlimited amounts of three pastas of the day. The salads were colorful, generous and very flavorful. However, the three pastas were a mixed blessing. The ravioli was the high point, delicate little works of art that we all greatly enjoyed. The farfalle had a delicious tomato sauce but were somewhat too firm for our liking. However, the linguine and clams were a disappointment. Served in the shell, the clams were very chewy and rubbery. We were also served clams that had not opened, something that should never be done. We may come back and try something else on the menu, but will not order the Sinfonia Di Paste again.", "Date": "2014-05-19", "Author_Location": "Cape May, NJ"}, {"Author": "Mario R.", "ReviewID": "Q_hxF7WhKyPWO-zuzRKqhg", "Overall": "3.0", "Content": "Ok, this one was very difficult to rate because of the night we had, We were in times square our first night in NYC from Cali and wanted something good to eat we got out our yelp app to guide us to some Italian cuisine.  We saw this place was a 10min walk from us and proceeded to head over there. When we got there we handed our coats to the German? Attendant he was very nice. We walked into the actual restaurant and got seated promptly by the host. Our waiter who's name I forgot sadly came ask what we wanted to drink. We ordered a martini that was amazing wish I could recall the name but it was really good. As he went on to explain the specials and the unlimited pasta he gave us a few mins to decide.When he came back my gf had decided to order the unlimited pasta with the anti-pasta and I ordered the porterhouse lamb this is where the problem started.We received our salad and our anti-pasta as we finished up we waited for our entry and after a good 5-10mins our waited came to our table to inform us that the kitchen was closed due to the health inspector coming in to take a look at what was going on.Now here where i was a little bewildered, working in the restaurant industry for a good 5 years during my lifetime and my father being a manager of a restaurant for the latter part of 25 years I found this odd. Usually how it works is that the health inspector checks if everything is good while the kitchen is in OPERATION!I had never heard of closing down the whole place to check everything out! How ridiculous is this? Luckily we had no where to go and lots of patients to hope that the food at the end would be worth it after 30-40min wait for this health inspector to be done our food came out. The pasta was good, delicious and my lamb was tasty to say the least but waiting almost 1 hour for our food was a bit to much even for good tasting food. That why I knocked it one star instead of four. If you are in the area try it out, just hope the health inspector doesn't show up and ruin your night! Props to our server had it not been for him, I probably would have gotten up and left. Thank for the free martinis.", "Date": "2014-02-08", "Author_Location": "Anaheim, CA"}, {"Author": "Amanda M.", "ReviewID": "_KmFZqLzGS_zuJ3tCK8myg", "Overall": "4.0", "Content": "Two reasons why I love yelp1) a cool NY yelper  told me to go here (I forgot your name man, I'm sorry!) 2) I made a reservation on yelp the SAME afternoon, and it worked out really well!The restaurant is located on a street (probs famous for it's many restaurants, idk) with many other restaurants but it really stands out with it's beautiful front entrance. Once you're inside you're whisked away to a different, cozy, dark Italian world. No really, it seems like your in an intimate cafe in Italy. The guys working there had thick accents. We were greeted with a really cool variety of breads and two dipping sauces.... yummmmmm!Anyway, I really wanted to try the pasta special (thanks again NY yelpers)- all you can eat of their three chosen pastas that night. It also came with a choice of caesar salad or antipasto misto (a variety of grilled and marinated vegetables and seafood).The antipasto misto was really interesting. I liked what they had done to them, and their seafood was unique and totally not what I was expecting. The pastas were really different as well. One was a wheat, long flat pasta with tomato sauce,another was curly pasta and sausage,and the third was a gnocchi made from cornmeal. Odd... different... but quite delightful! The one with sausage was my favorite and most \"normal\". The cornmeal gnocchi was cheesy and almost reminded me of potatoes au gratin, and the wheat pasta was almost a little \"healthy\"... if you know what I mean. But I really liked the variety. Boyfriend ordered the Galleto al Forno- a chicken dish with roasted garlic, vegetables, and risotto. It was a yummy chicken dish, but nothing insane. Our waiter recommended a delicious wine that we both enjoyed. He was also very attentive and friendly. The food was good, don't get me wrong, but it didn't make me want to jump on the table and dance. BUT the experience did! It was so pleasant and sweet. It really felt like a European restaurant because our waiter let us take as much time as we wanted. The place was cozy with an absolutely beautiful interior, and the food had a lot of different and unique tastes that I wasn't expecting.", "Date": "2013-12-10", "Author_Location": "Austin, TX"}, {"Author": "David K.", "ReviewID": "G9pzJaX8qilyWOu8XcJUFw", "Overall": "4.0", "Content": "This place is really unique, in the combination of good food, good service, amazing staff and really reasonable prices.22 dollars for three different Pasta choices? $25 wine list? Totally worth it.We both ordered entrees, and took advantage of the option to add the pasta courses to the entree's for only $10. The only downside to the evening was that we were so full after the pasta and salad, that we did not have much room to enjoy the large and delicious entrees.", "Date": "2014-02-10", "Author_Location": "New York, NY"}, {"Author": "Elizabeth B.", "ReviewID": "prfMEOY-Hk-Q4pr9VGuKhQ", "Overall": "4.0", "Content": "I was in search of a highly rated Italian restaurant for a pre-Broadway show dinner on Friday night and stumbled upon Becco while searching on Yelp. I made reservations via Open Table approximately one week before, and reservation times were already very limited. Only 5:00 and earlier and 7:30 and later were still available so make sure to book reservations relatively far in advance if you want to dine here!We were quickly greeted, had our coats checked, and seated. The restaurant looks very small from the front but really keeps going and going back. We were seated in the very back corner, which was nice to not have couples crowded on both sides of us. Yes, as a Pittsburgh resident, I do enjoy my space!Our waiter was fabulous! Though the food was very tasty, he was the best part of our experience at Becco. I wish I could remember his name to give him credit here on Yelp.Becco has an extensive list of $25 wines, which is absolutely genius. I'm sure most people order at least one bottle. However, I was already quite tired and was concerned about falling asleep during our Broadway show, so I sadly turned down the tempting offer.A little box of bread was quickly delivered to our table along with olives and some sort of delectable spread. It was a great way to start the meal.The hubby and I both started with the Insalata Cesare, which was good but not mind blowing. I ordered the Sinfonia di Paste, a trio of pastas that changes daily, and my husband ordered the Costolette di Maiale etc., or the double cut pork chop for those of us non-Italian speakers. The pork chop was cooked very well. The pastas were tasty. Two of the three were OK - a linguine with clams and a simple pasta with a marinara sauce. However, what made the trio for me (and why I ordered it in the first place), was a goat cheese and beet ravioli. Mmm... very good!Overall, I enjoyed Becco and thought that the cost for what was delivered was very fair. Though I would dine here again, I think that I may want to try a less traditional and more innovative Italian restaurant next time I'm in NYC.", "Date": "2014-01-05", "Author_Location": "Pittsburgh, PA"}, {"Author": "S M.", "ReviewID": "EqI_LKsrULVHdaEfkJda0A", "Overall": "5.0", "Content": "My favorite Italian restaurant in the city. Reasonable and good bottles of wine, amazing food. If you go with someone and you can share have Someone order the pasta special its always different and its unlimited.  And the other peraon order any of there meat dishes. The hanger steak is amazing. I can't stress how much I love this restaurant.", "Date": "2014-05-08", "Author_Location": "Oceanside, NY"}, {"Author": "Jerry C.", "ReviewID": "dm4AMItlBjx4bh7VvdUDqQ", "Overall": "4.0", "Content": "Becco is our go-to Italian restaurant in Hells Kitchen. Unfortunately, we always decide at the last minute, and get worried that without reservations the table wait will be forever due to the hordes of tourists hoping to catch a glimpse of Joe and/or Lidia Bastianich. By timing for the pre-theater crowd to exit, so far we've been lucky never having to wait more than 5-10 minutes.Without a doubt, their best value is the Sinfonia di Paste, $23 for dinner. It comes with either Insalata Cesare or Antipasto Misto, both of which are very good, and all-you-can eat Chef's selection of three pastas served by passing waiters. If one of the pasta selections is Linguini with Clams in the shell, I don't even look at the menu because it's THAT good. When I feel like splurging, their Osso Buco is consistently one of the best I've ever had. A huge piece of veal shank over a bed of farro, Grana Padano and zucchini. I only know Grana Padano is the king of cheese because of Joe Bastianich on MasterChef LOL. The meal is so savory and flavorful!Becco is a noisy, crowded restaurant, but the ambience is comfortable and dinner pace is nice. The service is efficient, humorous and knowledgeable. Plus, their wine binder has a whole page of $25 bottles. It's a great deal and smart of the restaurant to offer it.", "Date": "2013-11-27", "Author_Location": "Brooklyn, NY"}, {"Author": "Kelly F.", "ReviewID": "9Hz5gk0WUsWbNybGM-0yLQ", "Overall": "4.0", "Content": "We went on a Monday night so it was easy to get in. I had the roasted chicken with risotto.  I thought it was very good. The prix fixe pasta was very good and unlimited.  Also Salad included very good. $25 bottles of wine. You can't go wrong for the price", "Date": "2014-05-08", "Author_Location": "Boston, MA"}, {"Author": "Patrick G.", "ReviewID": "HYRQ-wkKh_6FB24xh4AmTg", "Overall": "4.0", "Content": "I do like this place, and have very little that is not positive to say about it.  The food for the most part is excellent, & the wine is a great deal.  I usually get the Calamari Fritti; which is the best fried calamari I have ever had, & the incredible Osso Buco.  The olives & breads are fantastic, the deserts... awesome!  My only complaint is their pasta.  I don't think they do pasta in a truly memorable fashion.  It's ok, but it leaves me short of... Wow!  It's the reason I don't hang a fifth star here.  The wines are great.  You can always find a $25 bottle to pair very nicely with your meal.  What a deal for Manhattan.As in my other NYC reviews, parking is ok as far as NYC is concerned.  Street parking is brutal, but plenty of garages close to your meal.  Public transportation is a short walk from the A,C, or E lines (Off of 50th ST or 42nd ST stops).  Taxis are always cruising by as you are right in Hell's Kitchen just outside the heart of the Theater District.The restaurant has many feels to it.  Not crazy about the front entry dining room, as it is really too busy, too bright, and the traffic is non-stop; as this is a very popular place!  The upstairs has a great Manhattan feel & it is great for even a bit larger crowd.  I have had several business dinners here and I like being upstairs.  The bar area is congested, but manageable.  Eating in there is also crowded, but you understand you are really in a pub.  If you are going for a dining room, hold out for it.  But, if you don't mind that more casual atmosphere, it has a cool rustic feel to it.This is tremendous NYC value in my book.  The food is on the whole very good, and not overpriced.  They offer specials that are convenient, and I can say with certainty you leave full, & not feeling ripped off.  Again, the wine prices per bottle are the way to go.I like the service here.  A hard working group always.  I enjoy that most everyone has a wonderful Italian accent; it adds a great charm.  I have found the Becco staff to go out of the way to be creative in order to let you have a very pleasurable dining experience.I Give Becco a B", "Date": "2014-03-17", "Author_Location": "Marblehead, MA"}, {"Author": "Jaclyn L.", "ReviewID": "zGZlZXwsaBikTMzb3-v7yA", "Overall": "4.0", "Content": "Becco is well known in this Theater District area to tourists and locals alike for the most beloved thing on their menu, that changes seasonally - their three pastas option for approximately less than $25!  THAT is amazing to anyone's ears and wallet!We held our annual friend's Christmas dinner here; everyone unanimously agreed that Becco would not only be able to accommodate the six of us, but we could enjoy ourselves without feeling rushed in the heart of the holiday season.  I would highly recommend the upstairs seating; it feels more intimate, and the noise level is much less then the overall chaotic ground level.  We were tucked away in a little corner, to the left of the stair case; it couldn't have been more perfect.We started the night with a glass of wine in hand, as Lidia would have intended it, and waited the arrival of the three pastas.  First to arrive was the beet ravioli in a light mint sauce; this turned out to be the fan favorite of the night.  Me, personally, their pumpkin ravioli in the autumn months is beyond addicting; keep that mentally in the back of your mind for 2014.  Next pasta was the linguini with Long Island clams in a very simply perfect garlic and oil sauce.  This was absolutely divine!  Lastly, as always, was Lidia's house tomato sauce in a paperdella pasta.  Make sure you don't have the waiter take your plate before you've had your fill!  A waiter tried to take my plate away after one round, and I nearly bit his head off; true story.The decor was a tasteful explosion of Christmas; garlands and wreaths to be seen throughout.  One star was removed because we felt that service was not 100% based on the fact that we were not nearly as liquored up as the table of twelve next to us.  But hey, we did get what we wanted, and the night was memorable.  See you in the warmer months Becco to see your menu changes!", "Date": "2013-12-29", "Author_Location": "Brooklyn, NY"}, {"Author": "Stephen I.", "ReviewID": "JaW4PY_BNYQCySsct0txNw", "Overall": "5.0", "Content": "Becco is amazing! This is one of the best Italian restaurants in the city and I can't wait to go back.The cons: it's crowded, noisy and you're sitting shoulder to shoulder with other diners at many of the tables, but this is the case in most NYC restaurants.", "Date": "2014-01-10", "Author_Location": "Brooklyn, NY"}, {"Author": "Tina Y.", "ReviewID": "zvzpxHZGGg1oJtJQRfDA2Q", "Overall": "3.0", "Content": "This is a perfect place for out-of-towners to enjoy food, wine, good vibes, and a brand name experience in the big apple. My husband and I decided to go there on a recent evening after watching the play \"The Commons of Pensacola.\" This place was so packed and loud, and every diner looked so happy. I heard the waiters kept explaining to different tables about Lydia, the number of her restaurants, and how she and her son are \"related\" to Mario Batali....I was really hungry, so I ordered the unlimited pasta, but I only finished 1/3 of the first round. During the meal, I missed the pasta of my neighborhood joint Celeste so much that I almost wanted to cry.My husband ordered the pulled pork, and it tasted no different from what we got from Trader Joe's. The only satisfying thing was the black & white panna cotta.Still, it was quite an experience for refreshing what it felt like being a visitor to NYC. I will still take my visitors there though.", "Date": "2014-02-07", "Author_Location": "New York, NY"}, {"Author": "Wendy W.", "ReviewID": "Zxxm18VFB-nyBRKHzXT6cQ", "Overall": "3.0", "Content": "Everything I know about cooking pasta, I learned from Lydia.  From watching her shows, I've been able to extend my repertoire beyond spaghetti and meat sauce so I was all too excited to try one of her restaurants.  Becco is located conveniently in the Times Square area and easily walkable to most of the theatres.  The restaurant is beautifully decorated in an upscale rustic look.  We were seated in the \"garden area\" which was nice for a Saturday afternoon.I opted for the unlimited 3 pasta special.  Waiters come around to your table with a large pan spooning huge portions of the day's pasta onto your plate.  I wimped out and was done after round 1.  My little stomach could not consume past 2000 calories of starch and cream.  ::bows head in shame::Becco's wins special points for their price point.  Becco's remains affordable in this often overinflated dining district with many of the dishes priced under $20.  They even have a selection of $25 bottles of wine which is a big perk.After sampling everyone's dish it was clear that the food was well seasoned and used good ingredients albeit a bit heavy.  We all walked away with full bellies and a lethargic look in our eyes.  It's highly recommended as a date spot or when you are taking your parents out, but the food is too heavy for an everyday night out.", "Date": "2013-12-06", "Author_Location": "Fairfax, VA"}, {"Author": "Mark L.", "ReviewID": "tjDj4ZU7Ud2NoeBSDlCokQ", "Overall": "5.0", "Content": "Had a great dinner at Becco. Tatiana our waitress was amazing.  If you are not going to a show let them know so you can take your time. I had the Branzino and my wife had the Beal Piccata.  Also great wine list for only $25.", "Date": "2014-04-10", "Author_Location": "Greenwich, CT"}, {"Author": "Quaker W.", "ReviewID": "ZOoNgrioPDkil4yeDP0tXA", "Overall": "3.0", "Content": "UPDATE: I am raising this rating to 3 Stars after Becco's manager read the review below, contacted me and asked me to return to the restaurant to give them another chance. I give them high praise for wanting to hear about their shortcomings and for reaching out when I complained. The food was indeed better. Still, after our last experience we weren't eager to trust the kitchen with more than the pasta special, and a dessert of sorbets. Our conclusion: the service is still great, and the \"trio of pastas\" special remains a fine value worthy of a pre-theater meal in New York. I can't say anything about the menu beyond that. On this visit, the hostess and waiters no doubt we're told to fawn over us, delivering complimentary prosecco, biscotti, and muscato, in addition to a nice credit. Can't complain about the service. And the food? Once again, the bread basket and olives are nice and generous, and once again the best thing we had was the spaghetti. It's fresh and properly cooked, though on this visit the special spaghetti with julienne vegetables was under-seasoned. Thank goodness a server was right behind with penne in vodka sauce. The dish featured small, vapid gulf shrimp (I wouldn't expect more for this price), but a sauce that managed to rescue the spaghetti that shared the plate. Mushroom ravioli were the 3rd pasta and better than last time -- tender, rich and flavorful, though the sauces were all watery.  When piled together on one plate, everything runs into everything else. Those photos on Yelp showing three distinct little mounds of pasta on one big plate? I haven't seen that at Becco. The watery sauces all form more of a soupy mess. My solution: you can just tell the waiters to slow it down and tackle one or two pastas at a time. Bottom line: I appreciate good service and responsive management. I'm no longer in the \"never again\" camp. If you do go to Becco and aren't happy, you should let them know before you leave. ORIGINAL REVIEW IN ITS ENTIRETY:Never Again.Perhaps it was a bad night for the kitchen. Perhaps my standards have gone up. Or more likely this place has just gone downhill fast. We've been to Becco as a pre-theater restaurant 3 or 4 times in the past, but will never go back. At this point, the only good thing I can say is they do get you out in time for your show. Veal: Overcooked, dry, and chewyMeatballs: Baseball sized, dry, and flavorlessBurrata: Tiny portion disguised by a huge greasy slab of bread with chopped, bitter, under seasoned rapiniPulled pork entree: Underseasoned and cooked until it was bone dryCaesar salad: Respectable, not over-dressed, a fine way to start the mealOrecchiette with pancetta and cabbage: Watery and flavorlessMushroom ravioli in butter: OK if you trim the edges (90% pasta, 10% filling)The best thing on the menu was the spaghetti in a simple fresh tomato sauce. At least the pasta was al dente and the Parmesan on the table gave it flavor. The Sangiovese wine we selected was barely drinkable, but at least it was cheap. The same can't be said for our meal overall. $320 for 7 people and nothing memorable. If you are on a budget but want a sit down dinner experience with reservations, and you are satisfied with just pasta for dinner and aren't too discriminating, I would still say you might want to consider Becco for the $23 unlimited pasta. But don't stray.", "Date": "2013-12-27", "Author_Location": "McLean, VA"}, {"Author": "Sakshi G.", "ReviewID": "_Q-jP90dPxaDNCANdloKyA", "Overall": "5.0", "Content": "So many reviews and a great rating, totally justified. So we went here on a weekday since it is so hard to get a reservation on the weekend. So place was totally packed even on the weekday. We had to wait approx 20min even after having reservations. Bt no worries. We sat on the bar and had a drink while we were waiting. We were seated upsrairs. Nice, cute, charming and intimate are the words that come to mind. U can tell that this place is rustic and authentic as soon as u enter in. So me and my friend ordered their all u can eat pasta menu for 23 bucks. Great deal given that they were giving and appetizer and unlimited 3 kinds of pastas. For appetizer they served grilled veggies which were the best grilled vegetAbles we have ever had. So flavorful and perfectly cooked. For pastas they had raviolli, spaghetti and a fusilli. They even substituted one of the unlimited pastas to suit me as I am a vegetarian. In all we were more than full at the end and totally worth the money. I dnt remember what we ordered for the dessert but i remember there was none left so u cn tell that i was super tasty. In all i will totally recommend this place.", "Date": "2014-06-13", "Author_Location": "Washington Heights, Manhattan, NY"}, {"Author": "Eva L.", "ReviewID": "u42DqEnt0_1fL2NwFVh68Q", "Overall": "4.0", "Content": "Went to Becco with a friend today at around 4:30pm. It was packed! We luckily got  a table to sit down cuz we only had 2 people. This place is very cozy. Great ambiance and cute wall decorThen we start going through the menu. I always have problems/language barriers ordering stuff in Italian restaurant. But today our waiter was extremely helpful. He was very patient as well. Now, the food. Every table get a little box of bread. 3 types. All very good.  Then we got  caesar salad -- OMG. It was probably the best caesar salad I ever had! And it was big! I ordered salmon with cauliflower, and my friend ordered a whole fish dish (forgot the name..) I enjoyed my salmon very much. Again, the dishes were big. The salmon was very well done. 4.8 stars on flavor and texture (a tiny little bit over cooked), 5 stars on plating/presentation. We also got the pasta sampler. I'm not a pro on pasta but I know this is much tastier than most other pasta I tried before. Will recommend this place to everyone. Just make sure you make a reservation before.", "Date": "2013-11-23", "Author_Location": "Jersey City, NJ"}, {"Author": "M K.", "ReviewID": "0qKxt_p6pqwMt_wHUJs7JA", "Overall": "3.0", "Content": "I had the \"package set\" which allows you to order one appetizer and 3 different types of pasta. While great for saving money (as you are allow to refill), I was like meh. There aren't obviously strict quality control over this as the pasta can be refilled and everyone around us were ordering them too --- therefore, the chef just massively produced them and I'm guessing they let it sit and warm them with faint heat if no one is ordering yet. But again, like a i said, it's a great deal. The Panna Cotta was DROP.DEAD.AMAZING -- this is a must order! Perhaps when I have the chance to come back I should order their main course and see if it'd actually be way better.", "Date": "2014-05-09", "Author_Location": "New York, NY"}, {"Author": "Quinn E.", "ReviewID": "Dbr1CO8Rh-3KIYzamRpGmQ", "Overall": "4.0", "Content": "My mom took me to Becco for lunch before a show. I hadn't researched this dining choice at all. Good choice, mom! Even though the location is very convenient to the theaters, this place isn't just coasting. I was a little worried that they'd just rely on the tourists to come, regardless of quality. But these folks provide a very good meal, for not too much coin, super convenient to the theater. And even though there are certainly tourists in here, it still feels classy. Mom and I didn't go with the popular pasta special, since we wanted something lighter, but what a deal. All you can eat, 3 different pastas, less than $20. Anyway, mom got a nice salad with walnuts, pear, and Gorgonzola. It was generously sized and super cheap, like 8 bucks. I got the Caesar. Classic, crisp, delicious. We shared the escarole soup, which delicious, almost as good as grandma's. It's hard to share soup, but whatever, we're weird.", "Date": "2013-11-07", "Author_Location": "Jamaica Plain, MA"}, {"Author": "Stephanie K.", "ReviewID": "io53GzYgByg20yUZYGoNiA", "Overall": "3.0", "Content": "The place was very small and very busy the Sat night we went. I was very impressed with our waitress who was covering at least 6 tables and was on top of all of them.We of course knew Becco was the restaurant of famous Lydia and Joe Bastianich. When you walk in right on the bar and shelfs were Lydia's cookbooks. I found that a little self promoting and classless.I had the Joes veal chop and it awesome. My mom had the pasta with the over priced white truffle. For how much the truffles were I would have expected there to be a lot more pasta.", "Date": "2014-01-07", "Author_Location": "Riverside, RI"}, {"Author": "Mary M.", "ReviewID": "HKO5pEUjw3l15MF8jZ6dRg", "Overall": "4.0", "Content": "Food was superb!I had shaved steak with arugala and tried some of the 3-pasta special, which is bottomless and a great bargain! Good service for the most part, sometimes we had to flag busy waiters down for tea or dessert or whatnot but a wonderful dining experience overall for sure!", "Date": "2014-02-27", "Author_Location": "Manhattan, NY"}, {"Author": "Nick C.", "ReviewID": "i3M5Zms33Nga0nIMxVvj3g", "Overall": "4.0", "Content": "I saw a play recently and had always wanted to go to Becco's-My friend decided to run errands so i went alone. Even after the matinee the place suddenly became packed. I had a garden salad and then for my main course had osso buco-it was excellent!I would recommend and return. if you bring guests, make them aware that it is a little pricey but a good meal.", "Date": "2014-02-02", "Author_Location": "Manhattan, NY"}, {"Author": "Anthony S.", "ReviewID": "_GBp3_K_OGW3k77lP5Cbxg", "Overall": "4.0", "Content": "We arrived a little early and went to the bar.  We were called within a few minutes for our table.  Once seated, the pace was quite fast. Wife ordered the three pasta special and only got two. She had to ask to get the third.  I ordered the fish of the day which was quite good. moist and light. We were in and out within an hour and 1/4 and had no problem making our show.I would return again.", "Date": "2014-05-06", "Author_Location": "Cedar Grove, NJ"}, {"Author": "L L.", "ReviewID": "7RCClAzerAEI1S-PQMbeug", "Overall": "5.0", "Content": "I just had my wedding reception at Becco this past weekend, and it was a huge success! They did an amazing job setting up our room and it looked beautiful. The service was amazing, and all our guests loved the food and wine. I've been going to Becco for over 10 years, and having our reception at Becco was a no brainer. They did a fantastic job, and their special events Coordinators, Marica & Joe, are a dream to work with. Whether it's a casual dinner for 2, or an event of over 60 people, Becco delivers each time with a careful eye for detail. You won't be disappointed. Thank you, Becco, for helping to make our big day so special!", "Date": "2014-05-05", "Author_Location": "Brooklyn, NY"}, {"Author": "Jen N.", "ReviewID": "5eRN2nj_D5LVyk0r414dww", "Overall": "5.0", "Content": "We ate at Becco on 11/6 prior to seeing Romeo & Juliet at the Richard Rodgers theater down the street. Everything was delicious. There was fresh warm bread brought to the table. Our meals were both piping hot. My husband had the stuffed peppers and loved them. I had the Symphony of Pasta and it was delicious. You try 3 different pasta's of the day, and its unlimited service at your table. The candy popper ravioli was particularly good. They also have over 30 different bottles of Italian wine for $25 a piece which is a great deal. Try to make a reservation. We went in at noon on a Wednesday and it was packed solid. This is a very popular place!Definitely recommend!", "Date": "2013-11-08", "Author_Location": "Media, PA"}, {"Author": "Carolina S.", "ReviewID": "pFf4oTT2s_b6BNa_Cr8BIg", "Overall": "5.0", "Content": "My older brother use to work in Time Square. My husband and I would come meet him for lunch at Becco. We always love getting seated in the back room to the right. Right below the skylight. That warm light coming down almost gives you that sense of being outside. They welcome us with a lovely array of breads in a wooden box, a sort of bean puree and a mixture of olives. It's always the loveliest way to start our meal. My husband always gets the lunch pasta special. Which is the all you can eat, in house made delectable pastas. I can never stay away from the salmon. Being from the Northwest I always so impressed by how perfectly cooked and flavorful the salmon at Becco is. They sometimes give the lemon in the yellow mesh to squeeze over my fish. The edges of the salmon are cooked to a mouth watering crispness. Yum! It makes me drool a little just writing about it. This is an amazing Italian restaurant. Bastianich is the queen of Italian cuisine.", "Date": "2013-12-24", "Author_Location": "Brooklyn, NY"}, {"Author": "Ankit C.", "ReviewID": "sfpH0t16CbAUgfQ6sERxnw", "Overall": "5.0", "Content": "If you're a foodie, then the Hell's Kitchen neighborhood is for you.  Within that area, Becco's is definitely one of the best restaurants.So we were visiting NY for a few days and walked in to Becco's. We were greeted very politely (in NYC, what!) and were walked to our table.  The table had barely enough space to host two plates and one menu, there was no elbow-room at all.Then why does it get a 5-star review:  because of the food and our waiter.  Our Italian-understanding is as good as it gets and the waiter was quick to notice that and suggested the three-pasta combo (Still don't know what it's called).  We got tomato-spaghetti, mushroom-ravioli and beef-sauce-pasta as a part of that combo.  All three were delicious!!  So good that I had at least 3 servings of all of them!!Unfortunately, we didn't have any room to try out the desserts.  Next time for sure.If you like Italian food and would like not to think about the portion sizes, then go to Becco's and order the three-pasta combo.PS: It's futile to even try and pick the best one out of those three pastas.  Just order the thing and enjoy!  :-)", "Date": "2013-12-04", "Author_Location": "Milwaukee, WI"}, {"Author": "Lisa D.", "ReviewID": "MdW6bQbjJnl7vLUcL9RN6g", "Overall": "5.0", "Content": "On a trip to NYC we caught an early show and at 9:30 or so ended up wondering around for a place for late dinner.  WOW!!!  This is the most amazing Italian I have ever had.  Hubby and I had the antipasto to start, both had the unlimited pasta special and shared a bottle of wine and a dessert sampler for two.  Let me just say that the past was just stupid good!  We both ate so much that we were still full and skipped breakfast the next day!  I just can't do justice to this little Italian spot - it was so quaint and full of character.  Definitely put Becco on your must-eat list!!  No one could possible leave here hungry or unhappy.", "Date": "2014-06-09", "Author_Location": "Virginia Beach, VA"}, {"Author": "Joyce T.", "ReviewID": "otYQmnY-MREpT6cb6DYDag", "Overall": "3.0", "Content": "Service: 5 starsFood: 4 starsSeating: 1 starAmbiance: 1 starThis is probably the noisiest restaurant I've been to in a long time. I was drawn by the great reviews on yelp but at the end of dinner thought I should've spent the same amount of money somewhere else. This place is so popular that we were seated by the door at the bar even we had a reservation. Every time someone swung open the door, a gust of wind blew over our food. The passage between the tables and the bar is too narrow.Food was great. The bread and olives were phenomenal. The Caesar Salad was fresh and the parmesan cheese was awesome. For entrees, we ordered a flounder and a salmon. Both were simple and exceptional. My salmon was panfried crispy on the surface and tender inside. Their service made me feel pampered. I don't know how the manager does that but even the restaurant was packed, they never kept us waiting at the table. Once we finished the last bite of Caesar Salad, our plates were immediately taken away and entrees served. I couldn't stop wondering if someone spied on us eating?My mojito was a flop coz the mint was not fresh. How come the bartender didn't see the mint leaves had withered and turned black?We didn't have pasta that night. I saw the waiter holding a big bowl of pasta moving around to fill up customers' plates. It smelled really good. I might go back to try the pasta when the restaurant is not so busy if there is a slow time.", "Date": "2013-11-19", "Author_Location": "FOREST HILLS, NY"}, {"Author": "A N.", "ReviewID": "u5mtj5fJhd612rNq8NeaHA", "Overall": "5.0", "Content": "You know it's a good Italian restaurant when they have Osso Bucco on the menu. And, this one is to die for! Whenever I come back to NYC, I will always eat here. Food was fast, everyone was friendly... Is it too soon to say perfect?", "Date": "2014-04-06", "Author_Location": "Los Angeles, CA"}, {"Author": "Cindy M.", "ReviewID": "dyTcq5-CtaQ-nUApwqOe9w", "Overall": "4.0", "Content": "Becco, (355 W. 46th Street, between 8th and 9th Ave.) is a very good Italian restaurant in the theater district. It's one of Lidia Bastianich and Mario Batali's restaurants. The sauces are all excellent, (the standard by which I judge Italian restaurants). Some of the dishes are authentic to certain regions of Italy, and all made with fresh produce and home made pastas. The specialty of the house is a 3 pasta lunch or dinner including a salad or antipasto for about $23. You can't beat that price, becasue they come around with the pasta and refill your plate as many times as you'd like. Having a 16 year old pasta loving son, I can tell you, it's a real bargain. The a la carte menu is pretty extensive and the prices are average for NYC. The atmosphere is comfortable and the service is attentive.", "Date": "2014-06-13", "Author_Location": "Eastchester, NY"}, {"Author": "Peter B.", "ReviewID": "bEllZ-ncwGMkYEcyPBOpcg", "Overall": "3.0", "Content": "I live in Hells Kitchen and have eaten at Becco many times.  It is a nice restaurant, but the tables are close together and it could get noisy, especially near the two bars.The food is good.  My favorite are the meatballs (one negative is they alway run out) and the double pork chop.  The unlimited three pasta meal for $20 is also a great valueThey offer a value wine list for $25 which is great!Try to avoid seating in the little bar room  ( front left) they should not be serving dinner in there, it is very tight and noisy!", "Date": "2013-11-23", "Author_Location": "Manhattan, NY"}, {"Author": "Eric J.", "ReviewID": "7RllnbpNVV9NyvW0OTrMQg", "Overall": "4.0", "Content": "I'm a huge fan of Lidia's Italy in the Strip District of Pittsburgh, and when I found out that it was modeled from Becco and had the same AYCE pasta special, I knew I had to come. The special always makes me feel like I'm getting my money's worth. It's only slightly more expensive than in Pittsburgh, which says something because the cost of food in Pittsburgh is much, much lower. Also, it's very much a touristy restaurant, but it doesn't really change the mood or vibe of the restaurant, so it doesn't really make a huge difference.Pasta is always fresh, and even if one of the dishes isn't to your liking, there's two other types of pasta dishes, so you're bound to have a pasta you like. The most memorable dish was a mushroom ravioli that was just outstanding. The mushrooms were just perfectly earthy and the cheese was just sharp enough to create a pretty unique flavor profile. That's what it's all about. Again, fresh pasta definitely has a better chew and that difference goes a long way here at becco. Even though they'll likely serve a pretty basic spaghetti, linguini, or cavatappi, it's always somehow better than any pasta dish that I've ever made. Beyond the pasta special, the choices are definitely authentic and delicious. The polenta with crispy speck is unreal and the calamari is just your standard crispy, fried, and delicious. I actually don't know how authentic that really is, but regardless, the ingredients are high quality and you can tell.Service is great here, and the waiters are very knowledgeable and attentive. I've never had a bad time, and even though they automatically charge gratuity for large groups, it's never been undeserved.I don't know if I'll go out of my way to come back here anymore now that I don't live nearby, unless I'm seeing a show or something, but definitely worth a try if you've never been before. The value here just cannot be beat, and it's likely the best pre/post-show dinner option on restaurant row, in my opinion.", "Date": "2014-03-13", "Author_Location": "New York, NY"}, {"Author": "Neal A.", "ReviewID": "-y79tf6QCsgresh0Z5CU1Q", "Overall": "4.0", "Content": "We had a party of eight with reservations.  we all arrived 15 to 20 minutes early. We were seated upstairs promptly at the time of reservation. However, there was really no place to sit down to wait before seating. The bar area was extremely crowded, mostly with people eating. There was a high noise level both upstairs and downstairs. I would say there about 20 % too many tables for the space.Service was generally quick and attentive.  My only issue was that there too many specials that were not printed, and with the background noise I couldn't absorb any of the 8 to 10  specials except one or two that the the waiter rattled off. I wished they had just printed out the specials. They did do a good job getting us through in time to see a show,  which was only an hour and half after we were seated.I had the 3 pasta preparations. The pumpkin ravioli was  a real standout, but the other two were  not distinct at all. The antipasti misto was a pleasant combination of vegetable favors and seafood morsels. My son did really enjoy the Bronzino which was  the fish of the day, especially how he could finish it himself with sea salt and olive oil. Pulled pork  was another interesting choice at our table.  There were no flops.", "Date": "2013-11-24", "Author_Location": "Bloomington, IN"}, {"Author": "Alex C.", "ReviewID": "1sDn-qoSCfdjKtod2VgePg", "Overall": "5.0", "Content": "My absolutely favorite Italian restaurant in NYC. I would frequently take friends, family, and out-of-towners here for the wonderful food, ambiance, and unfailingly great service. A great pre-theater spot and the waitstaff is very accommodating when you let them know.The bread service before the meal even starts is amazing! 3 different kinds of bread/breadsticks with a sort of spiced chickpea spread. So yummy!By far the best deal is the daily special, their \"sinfonia di pasta,\" which is all-you-can-eat of three pasta dishes, which change every day! Usually one tomato-based sauce, one more creamy, and one more pesto-ey. One dish has meat, one has a plain pasta, and one has a stuff pasta. All are delicious! What really impressed me one time I took a vegetarian friend here and she ordered the trio and declined the one with meat, saying she was vegetarian. The waiter came back with a specially prepared veggie version for her! I thought that was just fantastic and super classy, above and beyond my expectations. I would recommend getting a reservation here ahead of time--very easy to do online and then you can get seated more quickly. They do pack a lot of tables in the restaurant, so it may be that you're stuck in a bit of a cramped place. But still, I've found the experience worth it every time.", "Date": "2014-04-23", "Author_Location": "Houston, TX"}, {"Author": "Fred L.", "ReviewID": "sKKSI07ZOQi-zUpO2MHyFw", "Overall": "5.0", "Content": "On a recent trip to NYC, staying at the Marriott Marquis for the Thanksgiving Parade I was looking for dining options for a few nights. The original game-plan was Carmine's but they were booked solid on Wednesday, November 27, 2013. Yelp helped me to find this gem in the Hell's Kitchen section of Manhattan. We liked it so much we actually went back a second night, the last night of our trip, November, 29, 2013. The first time we were upstairs, the second time downstairs. The main level is very loud, although we were there during prime time and seems a bit more contemporary. The upstairs is darker, and a bit more quiet although we were there for a very early dinner. The second floor has a private unisex single bathroom which is rundown and has wires for the register tacked to the wall. Not great but at least the bathroom seemed well stocked and clean.Without a doubt, their best value on the menu is the Sinfonia di Paste, $23 for dinner. It comes with either Insalata Cesare or Antipasto Misto. I had this special both times and the Cesare salad instead of the Antipasto. The pasta is an all-you-can eat Chef's selection of three pastas served by passing waiters.One of the pasta selections on the second visit was the Linguini with Clams in the shell. Being a New Englander I have high standards for this dish and it was fantastic. They gave me loads of pasta and only 2 clams. On the next trip around I asked for more clams and they gave me 6 of them. They were fantastic. The first night my daughter loved her bowl of pasta which was reasonable for $12.00. Night #1 was gemelli and night #2 it was linguine. Both nights they were willing to stain the sauce so she didn't have \"chunks\" in it. She ate the entire bowl both nights. My mom have the chicken parm the first night and it was fantastic. The second night she had the veal chop and it was thick and cooked to perfection.", "Date": "2013-12-01", "Author_Location": "Newton, NH"}, {"Author": "Congzhou L.", "ReviewID": "yZg5iErhvNANkeYLoqw4bA", "Overall": "4.0", "Content": "Quite good for group.", "Date": "2014-04-16", "Author_Location": "Manhattan, NY"}, {"Author": "J D.", "ReviewID": "bbVcBa0LGugL-K33y29FRw", "Overall": "4.0", "Content": "I will preface this review with saying that I was running late and was on a time constraint because I needed to catch a show after dinner.  So this review is probably not 100% fair but close enough.  I thought the staff and the service was excellent!  Very friendly and very attentive.  I did make our waiter aware that we had to be out of the restaurant at a certain time and he was accommodating. Being in a rush, I ordered their special, which was unlimited house pastas that came with a soup or salad as well.  The night I went, the pastas were fettuccine shrimp in a garlic sauce, penne pasta is a red sauce, and mushroom ravioli.   First, you get the soup or salad you ordered, I had the caesar salad which was pretty good.  And then the bring over a full cup of Parmesan cheese that sits at your table.  Your first plate will consist of all the three pastas. They serve each one table side so you start with an empty plate and servers come around and put as much or little of each pasta on your plate.  I pretty much only enjoyed the ravioli so I probably had 4 services of that.  The other pastas just sat on my plate.  I think if I wasn't so rushed, i may have given the other pastas more of a chance, but since I only really wanted to eat what I really like, I stuck with the raviolis. I do have to mention that they had a great $25 bottle wine list!  I went with my mother who doesn't drink so I didn't order a bottle but if I had more time and was with friends, I would've have hesitated to order a bottle or maybe even two!All in all, I would like to go back here and give the restaurant a fair chance.  I enjoyed my experience but nobody likes to rush through dinner (which was the fault of my own)", "Date": "2014-04-10", "Author_Location": "Los Angeles, CA"}, {"Author": "Thaisa L.", "ReviewID": "1SvkwoYytF60qtubtdrZeg", "Overall": "3.0", "Content": "The $22.95 pasta special is ok. The pasta is tasteless, but at least service is good, and they're really accommodating in case someone has allergies. The day we went, one of the pastas had shrimp. Since my husband didn't want the pasta, the server was quick to ask him if he wanted another pasta without shrimp. Nice touch. Servers were also coming to our table every few minutes to check if we wanted more pasta.Overall, service is good and it's open late (good for after a show). Food is ok... only worthy if you're not craving italian food.", "Date": "2013-11-06", "Author_Location": "Manhattan, NY"}, {"Author": "Melissa H.", "ReviewID": "uJkDMwgIcj1k-7DSBYSCFA", "Overall": "2.0", "Content": "It was good not great. We went for a late night dinner after a show, and were seated right away for our reservation. That was kind of the highlight....My husband got the steak special which was very good. I got the pasta special, with which you get to try the three pastas of the day. The first came with shrimp and as a non-seafood eater, I was promised a serving of that sans shrimp which never came. The other two, I found to be very bland with watery, runny sauces. The mushroom ravioli had potential if the sauce had been better. For as many reviews, and as high of an overall rating as this place had, I expected much, much more. Would not go back, especially for the price.", "Date": "2013-12-29", "Author_Location": "Austin, TX"}, {"Author": "Kyle N.", "ReviewID": "AKGdFkcNv59Y2BicVihKQA", "Overall": "5.0", "Content": "Excellent food, great $25 wine list, best tiramisu I've had anywhere. Tiramisu was a special that night, not on the regular menu.", "Date": "2014-04-26", "Author_Location": "Manhattan, NY"}, {"Author": "Bbq B.", "ReviewID": "tjfzEt_W1xr9Gvq_QqDdzA", "Overall": "3.0", "Content": "Superior meatballs appetizer.Very good roasted BranzinoSkewed wine selection because it is totally Italian.  No other regions were represented in the wine list.Even though this is a premium restaurant,If you like Macallan Scotch, forget it.  They don't carry that either.This place is so busy, I was exhausted just waiting for our with all the other people at the bar not to mention just trying to get to the table.", "Date": "2013-12-17", "Author_Location": "Short Hills, NJ"}, {"Author": "Rudia L.", "ReviewID": "57qDqWkmLO3xA0SDV2zDpw", "Overall": "3.0", "Content": "I'm such a italian food snob/princess... and I have been known to be very VERY picky.  I had the tasting pasta dish and it wasn't what I thought.  I wanted to try what they featured and the price wasn't bad... but it wasn't what I had thought or imagined Italian food.  The staff was professional and upbeat and attentive.  The wait wasn't long and the food came at a leisurely pace.", "Date": "2014-04-09", "Author_Location": "Englewood, NJ"}, {"Author": "T V.", "ReviewID": "6dm9by_As8ugWjwAtyGHnQ", "Overall": "1.0", "Content": "We decided to carb up right before our bike ride tour.  We came right at the time of opening.  My husband ordered the lasagna while I ordered the three pasta special.  Our waitress was disappointed that we did not order any wine.  We can tell from the tone of her voice and her asking us more than once.  Besides that, she wasn't a very good waitress.  We didn't get the welcome vibe from her.  The food was just OK.  My husband's lasagna was a huge portion.  I suppose that was worth the $17?  My pastas were nothing special.  The clam linguini was super salty.  For the prices that are charged, I would pass on this and go elsewhere.  You don't even get your money's worth from their service.", "Date": "2013-09-09", "Author_Location": "Chicago, IL"}, {"Author": "Monica J.", "ReviewID": "cuI2jUXCKGTaTOdVnq23_g", "Overall": "4.0", "Content": "Went for the 3 pasta lunch menu- did not disappoint. Penne marinara, mushroom ravioli and scallop linguine were our dishes of the day, and not too heavy for a pre matinee lunch. The makers mark mint iced tea was fantastic as well. Only points off were for the waiter, who seemed either new or completely stoned. Assistant staff made up for this by being very attentive and filling in the holes.", "Date": "2014-04-23", "Author_Location": "Blacksburg, VA"}, {"Author": "Anne S.", "ReviewID": "KjDFDv5bOYktWk9Fs_So-Q", "Overall": "5.0", "Content": "If you are looking for a restaurant pre-theater, this is it. I've tried most of the restaurants in this area, Becco, is my favorite. It's also a perfect spot for a large group. If you can get all at your table to indulge in their '3 pasta special' is all you can eat of 3 daily special pastas, salad or app choice, amazing bread selections & olives at $23/ per person & $25 bottle of wine, it is an inexpensive treat for NYC. Front dining near bar areas offer more ambiance. Wait staff is a delight. Food is served quickly, promptly, on time so you can get to your theater destination.", "Date": "2014-02-07", "Author_Location": "Fair Lawn, NJ"}, {"Author": "Kori F.", "ReviewID": "7k6uWqqYTkrwH9vZeVs7kA", "Overall": "4.0", "Content": "Four words: $20 bottles of wine.That's right. You can get a wide assortment of wines for $20. Not only that but this place is great for Italian food. To start they have amazing bread and salad. I've been a few times, they have a pasta specialty where you can get three different kinds of pasta, they change every night, and it's bottomless. Really delicious.My boyfriend doesn't like this place as much as I do because he's lactose intolerant and they have a lot of dairy in many of their dishes, but I think for Italian, it's hard to find better in HK.", "Date": "2013-10-19", "Author_Location": "Manhattan, NY"}, {"Author": "Aparna K.", "ReviewID": "C97l4zpH9Tdfi2f1M-7EYw", "Overall": "4.0", "Content": "Ended up here late at night after having some drinks with friends. Even at 10.30 at night,the place was bustling with people.I ordered the Sinfonia di Paste so as to get to sample three different kinds of pasta.It came with a choice of Insalata Cesare or the Antipasto Misto.I ordered the Ceasar salad while the hubby ordered the other one (which was a veg and seafood platter)..so got to taste both.I liked the antipasto one better( I mostly end up liking what the other person orders more than mine).The 3 pastas were  linguini with clams,a pasta with marinara sauce and ravioli.The linguini was ok(I had mine without clams since I am allergic),the marinara one was good and the ravioli was delicious. The service was great!", "Date": "2014-03-05", "Author_Location": "Jersey City, NJ"}, {"Author": "Mary Anne M.", "ReviewID": "tedteUnk8pNbvCgkyYh0Xg", "Overall": "4.0", "Content": "Amazing food, phenomenal service. Perfect wine recommendations, generous portions. 4 instead 5 stars because tables a bit too close, limited privacy from louder than desirable neighbors.", "Date": "2014-03-28", "Author_Location": "Broomfield, CO"}, {"Author": "Milena F.", "ReviewID": "tGnnOf02r4vXZWmnvL7TOA", "Overall": "5.0", "Content": "The food at Becco was authentic and delicious! I had the Pollo al Limone which was so delicious I had to get it to go. The ambience felt a bit like eating at an Italian family's home. Comfy and so satisfying. I would definitely go again.", "Date": "2014-03-19", "Author_Location": "North Hollywood, Los Angeles, CA"}, {"Author": "Bean K.", "ReviewID": "IfLwV_QxgXNWVGCtfBuOug", "Overall": "5.0", "Content": "In a part of town where it's tough to not get hustled, Becco is the real deal. Been multiple times, and it has been consistently very good. Very good food, hostesses are amazingly efficient (this place know how to handle volume like pros), and reasonable prices (a whole wine list w $25 bottles?! That's hard to beat in the theater district let alone the city). Highly recommend", "Date": "2014-06-05", "Author_Location": "Pelham Manor, NY"}, {"Author": "Shadel L.", "ReviewID": "evro0XVx604DWAHScIpx3A", "Overall": "5.0", "Content": "Came here last Thursday because we heard rave reviews which I have to say are well founded. We orderedFrom the wine list right away, any bottle is $25. I had the grilled lemon chicken which was delicious and my boyfriend had the salmon. For $9 you can add bottomless pasta. I did so. Servers come around the restaurant and serve you pasta straight out of the pan, it was so delicious and you get a variety to choose from. That night they offered gnocchi, papperdeli, and riggatoni. The experience was very delightful, and we also went for the dessert, my boyfriend had the gelato which tasted very fresh and delicious, I can not remember the name of my dessert but it was an italian cream custard, it was also very good. I will definitely be back. Also the restaurant is high inside with three large dining rooms from what I could tell in the heart of Hell's Kitchen and they were rocking on a Thursday night .", "Date": "2014-04-13", "Author_Location": "Port Chester, NY"}, {"Author": "Lauren S.", "ReviewID": "OeuhG8GLd06Vw3J9hK8hjw", "Overall": "2.0", "Content": "Ended up here b/c we were going to a show, like everyone else. Unfortunately dining in the Theater District is almost always disappointing, of course.Becco is really just a more expensive Olive Garden, which includes:- all-you-can-eat pasta-huge portions with too much sauce/dressing- a list of cheap wines in case you're \"intimidated\" by a real wine list- way too many tables crammed into the restaurant (which of course results in the restaurant being too loud to converse with anyone at your table)- a meat-filled menu; if you're vegetarian or just not in the mood for meat, you can get a couple of appetizersOur server was great though so I'll give them that.If you're looking for an Italian TD restaurant I'd suggest Trattoria Trecolori or Dopo Teatro instead.", "Date": "2013-09-07", "Author_Location": "New York, NY"}, {"Author": "Greg D.", "ReviewID": "eOw2jBtHOF2lRP9ppqW5yg", "Overall": "4.0", "Content": "Great bargain waiting for you in Hell's Kitchen.  Go, bring the family and treat yourself!", "Date": "2014-03-30", "Author_Location": "Mount Pleasant, SC"}, {"Author": "Rj M.", "ReviewID": "PZ-5LfVy9q5rRgrQ12QT3A", "Overall": "5.0", "Content": "Great pre-theatre spot. Make a reservation and expect to get table 15 min late. Very crowded always but it because it's so good. Many great $25 wine bottles and $25 salad plus all you can eat pasta. Gets you in and out quick, if need be. Good service and menu items are great.", "Date": "2014-04-19", "Author_Location": "Riverside, CT"}, {"Author": "George A.", "ReviewID": "Zu24Y7in2ix2AjJazGpjeQ", "Overall": "5.0", "Content": "Becco is a fine restaurant, especially if you're a theater goer.  The staff is attentive to your need for timeliness.  However, if you just want a relaxing, take your time dinner ordered on a course by course basis, Becco is great too! the wine list is wonderful with many bottles below $25.  The food is fantastic.  My fiancee had the Bronzino and loved it.  I had the Sea Bass over spinach which was equally wonderful.  The mushroom ravioli was grand too!  We promised each other that we will be back every time we visit the city.  Try it and I'm certain you will do the same.", "Date": "2014-04-18", "Author_Location": "Gainesville, VA"}, {"Author": "Jenny A.", "ReviewID": "NkWjDzTS5tccg0QJthbZjg", "Overall": "4.0", "Content": "Very nice! Authentic Italian. I got the two course dinner for $22 that includes your choice of salad or appetizer and all you can eat pasta. Amazing! Friendly helpful staff.", "Date": "2014-03-10", "Author_Location": "Austin, TX"}, {"Author": "Mario M.", "ReviewID": "RvVcRiI5MX6lI8XoVf7z2A", "Overall": "5.0", "Content": "Place is great, this is the 3rd time I've been (latest visit in 1+ years) and still fantastic. Great food, had the pasta symphony (3 plates of pasta all you can eat for one price) and a bottle of wine. Overall wasn't too expensive either. Must make reservations because it's always full. Good service, bartenders are super nice too.", "Date": "2014-03-13", "Author_Location": "Wayne, NJ"}, {"Author": "Salvatore F.", "ReviewID": "i3p3WGajsgdsTTG7HRUIYA", "Overall": "4.0", "Content": "Definitely one of the better restaurants near the theater district. My martini was strong, the waiter knowledgable though a little bit too wordy in his descriptions, and the food was solid as well. The four of us shared the veal for two and port house for two. Both were well seasoned and tender. The porterhouse was cooked excellently. I was impressed and I usually dislike eating steak. Their fried cheese appetizer wasn't the usual restaurant fare. It had a strong aftertaste and they used the edges of the cheese wheel. I totally approve. Good atmosphere though a little loud. If you're in the neighborhood you can definitely do worse, this place wins a spot on my list.", "Date": "2014-03-16", "Author_Location": "Manhattan, NY"}, {"Author": "Jane H.", "ReviewID": "lF2qLXWEtRT9jM09GAMN9A", "Overall": "5.0", "Content": "I visited this restaurant again to celebrate my parent's anniversary! The time just flew fly and the I would say this restuarant is a must go whenever I visit New York.", "Date": "2013-12-08", "Author_Location": "Saratoga, CA"}, {"Author": "Michael P.", "ReviewID": "fttBGgb90UCRCazZQ4J55w", "Overall": "4.0", "Content": "One of my favorite restaurants in Manhattan. The cuisine is great and moderately priced for NYC. The seats are small and little elbow room between tables. As for the pasta dish I had, absolutely to die for.", "Date": "2014-04-05", "Author_Location": "Norwalk, CT"}, {"Author": "Ralph M.", "ReviewID": "8PsqoxzdL0buIhHKQwIvPg", "Overall": "5.0", "Content": "This place is as top notch as it gets for me. My martini was perfect. They shook it and poured it at the table. I got kettle one but they have all the top shelf vodkas. I was with a party of twelve and everything was on time and right. We may have drank 12 bottles. My uncle got the ossobuco. I had a few bites and it was perfect, melted in your mouth. I have a horrible heart burn issue so I got the pasta dinner including the linguini and clam sauce. Incredible. Get staff is beyond friendly. And that's hard considering the little space they have to work with. My hats off to the place. Perfect Italian. From the anti-pasta to the breadsticks and hummus. Just everything. 5 stars.", "Date": "2013-11-10", "Author_Location": "Hackensack, NJ"}, {"Author": "D. W.", "ReviewID": "WKy3Yp9ZIbbHupvsdiFJ0w", "Overall": "4.0", "Content": "Nice restaurant close to Times Square.  We had 7:00 PM reservations but waited 40 minutes due to popularity.  It seemed that they would let the tour busses unload and seat them before us.  Food was great.  My family got the three pasta sampler and it was excellent.  My wife got the fluke fish, light white fish, with mashed potato.  It was excellent.  The people next to us got the veal parm and it looked amazing.  Veal still on the bone.  I wish I had gotten that!Give Becco a try.", "Date": "2013-12-24", "Author_Location": "Saint Charles, IL"}, {"Author": "Leslie D.", "ReviewID": "3tBmh_7DG9-ZCRSkiZYQIg", "Overall": "4.0", "Content": "Gimme mo pasta!!As a pasta lover, I had to try Becco's famous AYCE pasta dinner special for $22.95. I specifically chose to dine here before seeing a musical just for that special. Plus it's conveniently located on Restaurant Row in the Tourist I mean Theater District. Now I might be slightly biased to all things Italian but there is nothing more comforting nor delicious than freshly made pasta covered in a homemade sauce. That's exactly what you get at Becco's but instead of one dish you get three, over and over and over again! If you ever need an excuse to eat pasta (and really, who doesn't have one?), you should definitely haul ass and come here.I need to come back to Becco Restaurant the week before the Marathon in November to start carbing up; the idea of eating pasta until I can't button my pants seems appropriate and beneficial for my glycogen reserves. I could make a large dent in their inventory, fo sho!", "Date": "2013-07-31", "Author_Location": "New York, NY"}, {"Author": "Erin P.", "ReviewID": "RNvJnl_HlxVU7qAXucgCmg", "Overall": "5.0", "Content": "This winter, I have revisited and rekindled my love for becco. My goodness, do they make a mean trio of special pasta. To start, I have to say that the staff is always friendly and willing to chat if you are, so if you're sitting at the bar on a snowy winter night you've got a friend in the bartender. We have a system when coming here. We come in to check our coats, sit at the bar and order our first bottle of $25 wine, usually prosecco. We already know that we will be having the pasta special no matter the choices so we sit back, care free, and enjoy that bottle of bubbly to the end. The second bottle, usually a medium bodied red begins our journey into the first course: bread, bean dip and olives. There are three types of bread served. The small crisp breadsticks, a rustic crusty bread and a focaccia. All three are delicious but don't fill up (and when you finish, be sure to ask for more when your pasta service begins). Next you can get either antipasta or a heavenly Caesar salad. I've always opted for the salad, with home made croutons and dressing. Once this has been cleared, tuck in and prepare. Three very kind and generous men bring full serving dishes of fresh, hand made pasta right to your table or counter. The first serving is a mix of all three. Try them all, even if you believe you won't like them. There is usually a vegetarian option with simple tomatoes and basil. The next pasta usually is fish or cream based. The third is well likely be the most delectable ravioli you will ever eat. The last two times, I only got refills of them. The most recent time, they had an oxtail ravioli. The gods must have been smiling down on us because I don't think I've ever stuffed myself with so much pasta. The time before that was a truffle pumpkin ravioli. Same happy gods, same filling scenario. I left the restaurant with tighter pants. We usually finish it all off with a cup of coffee to help us digest. The espresso is strong and delicious. I can't attest for dessert because I don't think I've ever left room. Maybe one day!", "Date": "2014-01-30", "Author_Location": "Brooklyn, NY"}, {"Author": "Jeremy T.", "ReviewID": "fU7d1lmNn3Gk-o2T2IWwzg", "Overall": "2.0", "Content": "The food was mediocre and the service was slow, but the drinks were strong. I got the three pasta special with antipasto.  The antipasto was alright. The three pastas were five cheese, tomato basil & bolognese. I was disappointed because I heard New York was supposed to have superb Italian food, but I found the pasta to be pretty mediocre.  It's all you can eat, but I didn't have a second serving - the first is pretty filling!  I also had the Strudel di Mele for dessert and I didn't really care for it either. The service was so slow.  We waited about an hour between the antipasto and the pasta being served. I also ordered a drink during the meal, and had to check on it three times before the drink actually came.  I also ordered dessert, which took a long time to come. I had a Peach Bellini, which was really delicious!  I also ordered a Pumpkin Pie Martini and tried my friend's Peach Martini. Both of the drinks were EXTREMELY strong!  It gets the job done, but if you are looking for a fruity cocktail, be careful. Also all of their shots are double shots, so take note of this before you order anything!All in all, I probably would not return again.", "Date": "2013-11-12", "Author_Location": "Honolulu, HI"}, {"Author": "Josh d.", "ReviewID": "yWCzfvc_cUmvw2vJjEbvXw", "Overall": "3.0", "Content": "Pleasant service, Good Osso Bucco - Their pasta special (all you can eat, 3 types of pasta) is something that everyone seems to love.That being said, it wasn't mind blowing.  It was good, just not that special - Though, Becco, is perhaps the best restaurant on Restaurant Row.  A good find on a tourist trapped street.", "Date": "2013-10-04", "Author_Location": "Denver, CO"}, {"Author": "Katherine M.", "ReviewID": "B64hRCZxmvJqnb9DaKCMkg", "Overall": "4.0", "Content": "I had dinner here this evening with my cousin. We arrived a few minutes before the reservation and stood in the very crowded bar area before being seated. It was like a sauna, partially because I basically ran from Penn and partially because the bar is the size of my bedroom. We were brought into a back room where it was like the fresh air gods descended upon us! We sat, were brought menus, bread, and bean dip,and waited a few minutes to order drinks and food. It took us a while because we were talking and catching up, and they asked us quite a few times before we finally answered.We each ordered a glass of wine, and we both got specials-- my cousin the striped bass, and I the short ribs. We both thoroughly enjoyed our meals, and as a cook that's not something that comes often to me (especially in a more touristy area). We finished by sharing the \"eggless panna cotta\" (which was strange simply because I'm used to egg yolk in my custard) but was super tasty.After we paid the check, we sat a bit longer with the intention of leaving shortly... Until a manager (who's name I regret not getting!!) came over asking if we would mind moving to the bar as they were looking to use our table and surrounding tables for a large party, and she offered us a free drink. No problem!! She could have said \"get the fuck up because we need to turn over\" and I would have left, but this was nice. The bar was crowded so we sat on some small couch-benches, and they ended up giving us a whole bottle of rosé prosecco! It probably wasn't a huge loss to them but it was a very nice gesture. Shortly after we moved to the bar as a spot opened up. We stayed probably an extra hour as we enjoyed our (free!) bottle and the manager came to thank us again and again for moving (which like I said was no problem but was clearly a huge help for them).Overall I would definitely return, even if I didn't get a free bottle, because the experience was very nice and the food was great. The negative one star is simply because of how crowded and noisy it was in there, and also how often they asked if we were ready to order/pay the check. I understand that they were looking to turn tables though, but the noise and crowd was definitely my biggest issue.", "Date": "2013-09-26", "Author_Location": "Valley Stream, NY"}, {"Author": "Tom A.", "ReviewID": "YMd_-XhVoNFJedTRoSQ2JA", "Overall": "5.0", "Content": "Went for moms birthday with most of the immediate family(14) and we had a great time. Food and service is always perfect.", "Date": "2014-03-30", "Author_Location": "Yorkville, Manhattan, NY"}, {"Author": "Adam K.", "ReviewID": "bmo5clRJFfaEhHorNYz4GA", "Overall": "3.0", "Content": "Pretheater Sunday afternoon and Becco was packed to the gills. Luckily we had reservations and were promptly seated.My second time here and frankly it just wasn't the same experience I had in the past.Our waiter was inattentive and we sat for a long of time before we were acknowledged.We both ordered the pasta special which  included ceaser salad or a veggie/seafood appetizer and three different pastas.I went with the veggie/seafood app and was  disappointed.  A few scraps of octopus a piece of dry tuna (I think) along side some marinated veggies, eh.The pasta dishes were just ok. There was a linguini carbonara, a ravioli with some sort of cheese and a fairly (maybe too much) al dente ziti in red sauce. Timing was not great, service was slow and I just got that \"your just another table to serve\" feeling. The waiter did come around to ask if we wanted seconds however I was just not into it anymore.  Of note, too many different waiters, busboys, servers, dessert and cleaning people coming to the table. It made for a very confusing meal.We did an apple strudel with cinnamon gelato which was delicious.Can't put my finger on the whole experience other than it just wasn't the Lydia B type of meal that I'm sure she would expect it to be.Maybe next time.", "Date": "2013-10-02", "Author_Location": "Long Island, NY"}, {"Author": "J C.", "ReviewID": "ADTRiIuIkskf4Cvgj8f8Kg", "Overall": "2.0", "Content": "Bottom line: All the food was disappointing and the waitstaff was disinterested.  I had gone to this block of Manhattan's West 46th St. looking for a restaurant recommended in a 2012  tourist guide, and it was no longer in business. Looked on Yelp for ratings of other restaurants on the same block (there are many). Quite a few had 4 stars. I settled on Becco because I was right outside its doors. I was seated immediately, even though they were busy, and was approached for my drink order very promptly. So far, so good.But I wish I had taken the time to read beyond the 4 stars and actually check some reviews. I didn't read further until I had ordered the same $22 Sinfonia Di Paste that David D.'s group (5/19/2014) had been disappointed in. I settled on that after seeing a warning about \"$18 minimum food order per customer\" on the menu. Otherwise, I had been aiming for a light supper of antipasto or salad. I was served the very same trio of ravioli, farfalle and clam linguine David D mentions, and it was all nearly tasteless. There was no spoon offered to assist in winding the slippery linguine around my fork. Except for bringing food, the servers -- a different one for every item -- paid no attention, never once asked if I needed anything, never asked if the food was all right, never checked on anything. The caesar salad that preceded the pasta trio was the most tasteless I've ever eaten. There were a few delightful details. They stock a German non-alcoholic beer that I've seldom seen offered (Einbecker), and the thin, crunchy breadsticks with a basil-y white bean spread were delicious.But the breadsticks and a $7 beer could not salvage a disappointing meal that set me back $36. Surely I could have done better at one of the other dozen or more restaurants on the street.", "Date": "2014-05-23", "Author_Location": "Bismarck, ND"}, {"Author": "Cynthia N.", "ReviewID": "eg7ZBoyKz1Y8_jg7eVECOw", "Overall": "4.0", "Content": "I'll disclose that I've been here twice and both times I've had their pasta special. Pros:- amazing pasta sampler followed by an all you can eat dish of it- I got full from the pasta sampler with the three different types. It was made aldente, flavorful and delicious. - great ambiance and good service- wine selection menu that costs $25.00 each bottle. Loved that we can just select one and they're all the same costs- restaurant is bigger than you think. There's a back space through the kitchen for additional seating - bar area to sit while waitingCons:- they have us a time frame from 5:00-6:30. They said we must leave by 6:30.- the place is a bit around tourist central so it gets crowded at night- make your reservations early. Will definitely come again in the future.", "Date": "2013-11-16", "Author_Location": "Manhattan, NY"}, {"Author": "Cris C.", "ReviewID": "uS5Gg80DfkMGH961DaVQkw", "Overall": "3.0", "Content": "I first heard about Becco from my pasta-loving Italian parents, who called me raving about the all-you-can-eat pasta special. When I finally paid a visit, I was seated in an unbelievably hot and cramped room and told the specials. Seeing as everything on the menu seemed ordinary for their price, I went for the (unlimited) pasta trio: cavatappi bolongese, gnocchi with a cream sauce and spaghetti with a plain tomato sauce.  The pastas were all just okay, but the gnocchi confused me a bit- it was actually an overcooked polenta cake, which would have been absolutely delicious had it been properly cooked. My cousin ordered a chicken dish which was served over polenta, and I wish she were the kind of woman to pull an \"ol' switcheroo\" because it was freaking amazing. The chicken was succulent, beautifully presented and cooked to perfection. A personal suggestion: don't get the pasta unless you've studied the menu and see nothing else more appealing. The pasta dinner is more of a \"hungry man/woman's\" thing.", "Date": "2013-08-30", "Author_Location": "Old Westbury, NY"}, {"Author": "John R.", "ReviewID": "RJFhkAearHWNM6qqDl-svQ", "Overall": "4.0", "Content": "Under $25 bottle of wine while we waited helped because the place was packed and I hate getting bumped into. We got a table in the back and our waiter was attentive. Apps. were good and I should've order the prix fix because everyone around us had it and it looked goooood. I ordered the calf's liver and as much as I like  liver a full meal was too much for me. Both meals were delicious and the price was reasonable. Need to try this place again and Gallo Nero and see who wins!", "Date": "2014-04-13", "Author_Location": "Staten Island, NY"}, {"Author": "renje g.", "ReviewID": "_78bzv025zpm52klG3UMRw", "Overall": "3.0", "Content": "This place should be  probably be listed as 3$ instead of 2, but that is neither here nor thereThis place is cool, the price fixe special didn't have any meat options so we ordered off the menu. It apparently wasn't that memorable because I forgot what we ordered.What I do remember was the ambiance. It is very impersonal. Its the kind of place u bring ur mom when she comes to town. Its the kind of place a stuffed shirt goes after a play. In going there, I felt as if we were just and in and out job like the rest of em.", "Date": "2013-09-20", "Author_Location": "Brooklyn, NY"}, {"Author": "Jerry E.", "ReviewID": "l8de-Ef3ExUfo6_fZi9Njg", "Overall": "4.0", "Content": "Recently had dinner here on a Thursday night @ 8pm. Reservations were made and we were seated promptly. Our dinner was Simply Excellent!!Appetizer: Calamari Fritas, absolute PERFECTION! And served a generous portion for our group.Dinner: Pesce Spada (grilled swordfish) the entree is fairly small but delicious. Highly recommend the Costolette di Maiale alla Maniera dello Chef (double cut pork chop) the entrée was LARGE and AMAAAZZZING!!I recommend ordering the wine by the bottle, it's not much more than ordering by the glass which can Add up. And the Mixed Drinks are AMAZING!NOTE: The restaurant serves its food, family style so don't come here for dinner if you're in a rush, our group took about 2 hours from start to finish. Remember to bring Good Company!", "Date": "2013-08-21", "Author_Location": "Austin, TX"}, {"Author": "Gary T.", "ReviewID": "-63VozfUJZUxURp-zBnLJw", "Overall": "5.0", "Content": "We have been here many times and I never wrote a review don't know why I guess because we have been coming here for a long time as a regular and always seem to write about new places. My mistake as I just made reservations to go again next week I thought to write a review. Well I keep going back so is that enough said and we will keep going it is my wife's and my favorite restaurant in NYC and when ever we go to a show or are in mid town we always make it a point to eat at Becco. Always good service and always a good meal have tried many different things on the menu and never disappointed. Thank You Becco for always being consistent.", "Date": "2014-03-23", "Author_Location": "Ossining, NY"}, {"Author": "Alicia V.", "ReviewID": "09WLQwW9ka0KYGYtMYxS1A", "Overall": "5.0", "Content": "Perfect!  Unlimited pasta (today they had handmade artichoke ravioli, marinara with basil over handmade spaghetti and veal over penne).  Came with antipasti plate which included octopus and fish.  So wonderful.  Elevated pasta to a whole new level for me!  You can't go wrong here by ordering this menu item.", "Date": "2014-05-26", "Author_Location": "Newark, NJ"}, {"Author": "James G.", "ReviewID": "dWZFZRxqt40AZohbyEwx3w", "Overall": "4.0", "Content": "After seeing a play, I stumbled on this place.  As I walked in and saw the stacks of Lidia's cookbooks, I realized who's restaurant this is.  I had the caeser salad and the three pastas.  I actually wasn't thrilled about two of three pastas that were being offered but when I tried it I was suprised thta I loved all three.  Service was very good and I would have given it a 5 except for one reason. I went with a friend who has a very hard time walking.  He uses a cane and you can tell he struggles.  We were taken to the very furthest table possible and the Maitre D who was racing through the restaurant kept having to stop to let us catch up.  If he had been any closer I would have grabbed his arm and said, \"Did you notice the cain?  Do you think we could possible get something a little easier to get to?\"  I thought the host could have been a little bit more sensitive to someone with a disability.", "Date": "2013-10-06", "Author_Location": "Los Angeles, CA"}, {"Author": "Brandon M.", "ReviewID": "Sx66ST0ouNf3kdZ4dX2NpA", "Overall": "5.0", "Content": "This was much better than my first time here. I was 5 minutes late for my reservation but they sat us right when we lakes in. I told the staff I have theater tickets and they said we get you out in time. The service was amazing are waiter I forgot his name was sing and really nice. This time the food was amazing. I love becco and will always come back.", "Date": "2014-05-09", "Author_Location": "Plainview, NY"}, {"Author": "Rob D.", "ReviewID": "CsGm2a7N9oFOVBJqPP03uQ", "Overall": "4.0", "Content": "I went for dinner. They have a solid wine list. Caesar salad was good. I had the fish special of the night, breaded fluke over mashed potatoes, topped with asparagus, which I enjoyed. My friend had Osso Bucco. She felt it was a bit dry, but said it had good flavor. We also tried the 3 pasta samples for the additional $9. The Bolognese was the best of the three, but all were good. We had the chocolate mouse cake for dessert, which was fantastic. Unbeknownst to me, my friend had included that fact in her Open Table reservation that it was my birthday. My friend felt a bit cheated that I didn't quite get the birthday greeting that the older woman two tables over got (she had 4 employees stand around the table singing \"Happy Birthday,\" whereas our food runner delivered the dessert and quickly escaped), but I didn't mind at all. I don't need a song, just a delicious dessert.  The atmosphere isn't anything spectacular, but I found it quite comfortable. The service was very good. I would recommend.", "Date": "2013-08-17", "Author_Location": "New York, NY"}, {"Author": "Jim C.", "ReviewID": "d9QtNOUHggObpQVp1H0eqg", "Overall": "4.0", "Content": "Great pre-theatre Italian restaurant in the heart of it all. Classic NYC experience even though they cater to tourists a little. Portions are HUGE, Caesar salad was classic and you can get a decent bottle of wine for $25.", "Date": "2014-02-05", "Author_Location": "Manhattan, NY"}, {"Author": "Michael F.", "ReviewID": "B3DvS5REB2dNYaosoQ7G0w", "Overall": "4.0", "Content": "Love Becco. My go to restaurant when I'm in the Theater District. Great staff and food. $20 wine bottles are a great deal.Affordable and quality", "Date": "2013-11-14", "Author_Location": "Merrick, NY"}, {"Author": "Misty S.", "ReviewID": "dFGrBRV4Og0Qw1MOl4DsOA", "Overall": "4.0", "Content": "I was in NYC recently for a Salesforce event with colleagues, and a bunch of us had decided to go out for dinner after the event. A local colleague recommended Becco and I'm so glad she did!We had a party of 7 and we were seated within 10 minutes at a cute little corner table in the back room. We all got the all you can eat pasta.. the chef even made me some vegetarian substitutions! Everything was amazing, especially the Antipasti. The $25 wine list was awesome too! I can't wait to bring my husband back here next time we're in the area.", "Date": "2013-09-02", "Author_Location": "Melrose, MA"}, {"Author": "Pedro R.", "ReviewID": "zD9H1sb4Y5WB8ALbUPnjlA", "Overall": "5.0", "Content": "We had an absolutely fantastic experience! We sat at the bar for a short time while our table was set and in that time, we were consulted by the bartender about the broad yet accessible wine list. He definitely made it less intimidating especially since I am a novice. When the table was ready we were seated in the back area which I was happy about because there is way less walking traffic. We had the good luck to have David attend to us and he delivered impeccable service from beginning to end. I'm vegetarian so he made a variety of suggestions but I ended up going with the 3 courses of pasta which was perfect. A relaxed ambiance, the best Waiter (David), great wine, and delicious huge servings, equal a phenomenal date. This is one place I will go back to often and recommend to others in search of great Italian cuisine in NYC!", "Date": "2014-02-26", "Author_Location": "Bayonne, NJ"}, {"Author": "David L.", "ReviewID": "E6LKr6Yh9c-Em9Y79JSVaw", "Overall": "4.0", "Content": "Love Lidia!Great spot. Great vide - it was packed and everyone was laughing and carrying on.The servers were fast - buzzing around like bees.We had the meatballs to start - YUMMY! Great tomato sauce with these giant balls of tasty meat. Mmmmmmm.As my main I had the pasta special, which was 3 types of pasta and it was (get ready)  ALL YOU CAN EAT!They had to roll me out - I was such a pig...but it was just too good.", "Date": "2013-07-06", "Author_Location": "Toronto, Canada"}, {"Author": "P J.", "ReviewID": "tHwkazKjkx1omxFMjd5mIA", "Overall": "3.0", "Content": "I would give this restaurant 5 stars except I felt ignored by the front staff - she barely greeted me at the door and when she did finally say something it was with disdain that she pointed at the table for one.  I almost left but glad I didn't - food was excellent - lovely presentation and a great mix of flavours!", "Date": "2014-03-13", "Author_Location": "Vancouver, Canada"}, {"Author": "Jonathan H.", "ReviewID": "QeXvR80DEDxoXN6Y22aIKA", "Overall": "1.0", "Content": "Becco has now been added to my \"never return\" list. I went there for a pre-theatre dinner and was disappointed. To start the meal our waiter didn't even take our drink orders. Only 2 people in our party of 10 got a drink order in by the end of the meal. I ordered the 3-pasta special and they brought out a small portion. They said it was \"unlimited\" but I never saw our waiter again after I got 3 small samples on my plate.Also, another person in my party needed to eat gluten-free. They had only 2 options on the menu and were not willing to make reasonable accommodations that almost every other NYC restaurant makes. This was after we called ahead to inform them of the dietary restriction. Allergies and dietary restrictions are to be taken seriously not scoffed at by a smug server.    The space itself is cramped. I'm not claustrophobic but I started to feel some come on by the end of the meal. Also, the bathrooms (single water closets) are by the kitchen so I had to dodge waiters as I waited in line in a narrow hallway. The space is not well-suited to handle large crowds or even small groups.I look forward to dining somewhere else next time.", "Date": "2014-01-02", "Author_Location": "Hoboken, NJ"}, {"Author": "Leo L.", "ReviewID": "c2JoigqYsVlR-pLoI4qHdg", "Overall": "5.0", "Content": "How many times do you drool while watching Lydia cook on Tv? All the time? Well I do!After looking up Lydia's restaurant on Yelp and reading all the great reviews and looking at all the food porn, I mean  yummy food pics, I had to stop by.I stopped by for Lunch, the restaurant itself is very nice and quaint with lots of natural sunlight, the staff is very nice and you definitely feel welcomed.I ordered their Lunch special which is an all you can eat pasta including appetizer for like under $20. The food is amazingly good, fresh and taste just like how it looks on Television. You get a complimentary Bread and olives basket with high quality Olive oil for dipping, trust me this is no ordinary bread or olives.The lunch special included 1 appetizer and all you can eat from 3 available pastas of the day, you can be served each pasta one at a time and try them all as I did or mix and match which ever pasta you like until your belly cant take no more. Tip: The pastas available for the Lunch special change everyday.I recommend stopping by for lunch and trying their all you can eat Pasta Special, it well worth it and everything taste freshly made, this is not ordinary pasta and sauce so get ready.", "Date": "2013-05-23", "Author_Location": "Brooklyn, NY"}, {"Author": "Mark H.", "ReviewID": "U3G7KyOo96VTA_77v2Lc6A", "Overall": "3.0", "Content": "Always looking for Italian when I'm back in the city so this one popped up close to the hotel. I got the stuffed peppers (very tasy just like grandma's) and the pasta sampler. I definitely left full.Place was beyond packed, literally packed like sardines. Awkward to sit so close to your neighbors that it's hard to have a conversation sober, wine fixes that :) The tunnel vision will enhance your experience if it's a party of 2. Speaking of wine, $25 blend bottles!!! Tons to choose from as well.Not bad for Times Square area, and larger parties might have a better time.", "Date": "2013-09-19", "Author_Location": "Aurora, CO"}, {"Author": "Chris C.", "ReviewID": "3PuzIYi72MTC8v65u3075A", "Overall": "1.0", "Content": "Had their unlimited pasta trio, way overrated.  It is too salty, not al dente, and, with all due respect, it is just simply disappointing from all these great reviews I read about their pasta.  Since it does not taste good, it is deemed overpriced.I might try to go back if I ran out of eating options, of which is very unlikely to happen.Nice and cozy environment though.The End.", "Date": "2013-05-29", "Author_Location": "London, United Kingdom"}, {"Author": "Corinna M.", "ReviewID": "nqFRMhbkDHVAJtJDEkwOjg", "Overall": "2.0", "Content": "Even considering that restaurant row can be complete chaos, I still expect better service and much better food from Bastianich.Server was rude. We asked several times for our food, and apparently he had never put in the ticket. Ten minutes of waving when our bottle of sparkling water was empty. More than ten minutes for the second bottle. We asked our server why there were so many delays and his responses (all within about a rapid fire 30 seconds of shouting at us) were that we had never ordered that dish, then he said it was the kitchen's fault, then he snarled that if we \"had so many questions,\" we could talk to the manager.Lamb was good. Osso Bucco the worst I've ever had.Manager Liz was apologetic, professional and polite.", "Date": "2013-07-01", "Author_Location": "Manhattan, NY"}, {"Author": "Gina Marie B.", "ReviewID": "3kXm4yUi5uY1vJFXfvYFmA", "Overall": "3.0", "Content": "So i guess the people that rave about this place are tourist or not from NY... or Italian culture?A-Ok is a good way to describe this place... not great.. not bad... but just in the middle! The pasta was nothing exceptional. We got the special all you can eat pasta deal... where you sample 3 pastas... and then you can get as much as you want of those three choice for the rest of the night. However only one of the pastas we really liked... the others we did not care for. But still... it was nothing sensational... My whole family was rather disappointed....", "Date": "2013-08-17", "Author_Location": "Plainview, NY"}, {"Author": "Dana Z.", "ReviewID": "JHww8JVvN8zvKPW3WEDs-g", "Overall": "5.0", "Content": "I asked the amazing Dave H. for a recommendation on a restaurant near the theater district (and if you don't know Dave H, then shame on you!) and he recommended a few places - Becco being one of them.We were so glad that we went!  Our pre-theater reservation was on a Sunday at 5:45, and it wasn't too busy, although by the time we left the place was packed.  We were seated in the way back, at a table under a sky light.  The service was prompt, bringing out yummy bread and apps.  The $25 wine bottles were a great buy for NYC -- we got two for the table (hey, YOLOOOO -- haha i'm not still drunk while I'm typing this I promise)I had the pork with the strawberry rhubarb, which was so wonderful, although BEWARE if you get the pork CHOP, because it's about 5 lbs of meat.  Mmmm meat.I thought this place was fantastic and I'm glad Dave recommended it - now I recommend it to anyone else looking for a great dinner near the theater!", "Date": "2014-07-02", "Author_Location": "Falls Church, VA"}, {"Author": "Sharon T.", "ReviewID": "gprFpFiXXXVHSQrEsnHolQ", "Overall": "3.0", "Content": "I enjoyed my visit before seeing a show and glad I made a reservation through Yelp before going since I was on a tight schedule. I was seated almost right away even though I was about 10 minutes late. Not only was the restaurant packed, but the bar and waiting area were filled as well and barely found a seat to wait until our table was called. The wait staff was so-so. Took a long time to order but once I did, everything arrived as expected.  The poor patrons seated next to our section waited at least 20-25 minutes before they got water or menus.  It made me feel uncomfortable because I couldn't really enjoy my meal sitting so close to those poor souls and I felt like waving down the wait staff for them.  I'm not sure what was up except for maybe disorganization of the wait staff. At least they were offered a free app for their trouble.Bottomless pasta  (choice of ravioli, pesto penne, spaghetti) after a long day of traveling was great but I should have passed on the Caesar salad starter. My daughter's antipasto appetizer was a lot better and wish I hard ordered that instead. Enjoyed the ambiance somewhat but it is quite loud and a bit claustrophobic but I was warned by other Yelp reviews. I'm really glad they asked if I needed to get to a show before ordering, so I will say my order arrived just in time to enjoy it before rushing out the door. If I come again, I will do it on a non-weekend night and give myself more time to enjoy the experience.", "Date": "2014-07-10", "Author_Location": "Chandler, AZ"}, {"Author": "Nelly N.", "ReviewID": "4mf5njEJISsFDY4Du6P3gw", "Overall": "3.0", "Content": "Nothing tasted bad, but nothing tasted any better than dishes I can make at home. Two friends and I stopped by for a Sunday night dinner at Becco. The service was great, I'll give them that.I have to say, I can make a better pasta dish at home with store bought pasta. 2 of the three pasta dishes they served were homemade pasta. None of the three were impressive.It's not to say the food didn't taste good, it just didn't taste great. As much as I hate to say it, I've tasted more flavor in Italian chain restaurants. Not worth the money!", "Date": "2014-07-10", "Author_Location": "Houston, TX"}, {"Author": "Nikki A.", "ReviewID": "0QaLliqmxnC3VPxU4ARi3A", "Overall": "3.0", "Content": "Fine choice for the area and interesting concept. It is so hard to find a good place to heat in the theater district, so my standards are definitely lower. Becco has an option for $22.95 where you get either a Caesar salad or a plate of grilled vegetables and then an unlimited amount of three different types of pasta. The pastas were okay--one potato gnocchi, one linguine with tomato sauce and basil and one with bacon. I do not like cheese and asked one of the waiter's if the bacon pasta had cheese and he rudely said \"All pasta has cheese.\" That is just not true--in fact, one of the pastas they were serving did not have cheese!The restaurant is shockingly huge-they have indoor and outdoor seating, as well as upstairs and downstairs seating. I would never eat here if I were elsewhere in the city, but if you're in a rush before seeing a play then it's ok.", "Date": "2014-07-10", "Author_Location": "New York, NY"}, {"Author": "David C.", "ReviewID": "frZVZ4CmY4xdqoxNFADoGQ", "Overall": "3.0", "Content": "Went here after theater and it was inevitably full of tourists.  All entrees come with an OK ceaser salad and the pasta menu is made daily where you get a taste of 3, which are then all you can eat.  The pasta is brought around from a big pan and served to the whole restaurant.  The food here is good, and so in the service, they also have a wine list of bottles under 25$.I guess I just hate getting treated like a visitor who is looking for all you can eat pasta and free ceaser salad (sounds a bit too much like the olive garden to me...)", "Date": "2014-07-07", "Author_Location": "New York, NY"}, {"Author": "Russ H.", "ReviewID": "xqktQyADif62127cgapstA", "Overall": "1.0", "Content": "My wife and I went here for our 12th anniversary. We went with another couple and had a good night because they we were with good friends but the restaurant didn't help. The waiter was very snooty, we asked for a wine recommendation and he laughed at us.  We had chicken Parmesan it was less than average. Red Sauce was bland and chicken was over cooked. Also had the roasted chicken that had nice crisp on the skin but was also dry and over cooked.As mentioned before it was our anniversary so they brought as a gelato with a candle for this. Thought it was nice until I saw they charged us for it.  Overall I won't be going back. Plenty of great places at much better prices. Way over priced for what it was.", "Date": "2014-07-14", "Author_Location": "Marrero, LA"}, {"Author": "Brian P.", "ReviewID": "VWwjJOEyx6rjwjyvxSKHOQ", "Overall": "2.0", "Content": "Blah Italian in the NYC theater district. They make a big deal about their ceasar salad and multiple-pasta options. Both were so mediocre. Would never come back here.", "Date": "2014-07-08", "Author_Location": "Chicago, IL"}, {"Author": "Elizabeth S.", "ReviewID": "gAkJxi_Q8VF3EXoqgyP15g", "Overall": "4.0", "Content": "Just went here for the first time and am definitely going back! We loved every part of this meal.Although you can order off the menu, we opted for the appetizer and trio of pastas, and are so glad we did. The Caesar Salad was excellent -- not fishy in the slightest, no extra anchovies, which is usually my beef (or fish, as it were...) with some restaurants' versions of Caesar Salad. And I love that I got experience three kinds of pasta -- a basic tomato and basil, which was fresh and delicious; a ravioli with a butter and marjoram sauce that was light but flavorful, and a bolognese made with veal that was truly excellent.We had food issues at our table -- one person didn't want the veal so got a vegetarian option; I'm allergic to seafood and they were very cognizant of that. I read in a review below that someone asked how pasta can be fresh if it's sitting around in pots -- you basically sit at your table and the servers come around with the pasta -- and the answer is, \"I don't know but they do it.\" I was pretty full so didn't get dessert, but tried my friend's chocolate mousse cake, which was to die for. Someone else got the cheesecake and really enjoyed it as well. Above all, the service was so great. It's crazy downstairs when they're first checking you in because of all the pre-theater people, but once you're at your table, the servers are knowledgeable and fun -- and we were not rushed in the slightest. Can't wait to return!", "Date": "2014-06-29", "Author_Location": "Montclair, NJ"}, {"Author": "Meg H.", "ReviewID": "LGF0X7q0EiokK6W5pTAzrA", "Overall": "5.0", "Content": "I hear people describing al dente pasta, but I never really understood exactly what it meant until now.  Upon my first bite, I was like llliiigght bulb!  This is what they mean by al dente pasta!!I had the all you can eat pasta and chicken limone, all of which were really good.  The all you can eat pasta comes with three pastas of the day: ravoili, spaghetti with shrimp and penne pesto.  All of the pastas tasted fresh and the respective sauce for each was perfect.    As for the atmosphere, it felt as if I were in Italy.  The music, the people, the food...the server even had a thick Italian accent.  Stupendous food and service.  Would definitely come back and highly recommended if you enjoy Italian food.  Oh, and great wine options too.", "Date": "2014-06-17", "Author_Location": "Brooklyn, NY"}, {"Author": "Tameka K.", "ReviewID": "zkq09qPNrfqSJlBRpWewfA", "Overall": "4.0", "Content": "Took my Mom for a birthday supper (we hit the restaurant at around 4pm on a Sunday) so the place wasn't crowded at first. By the time we left, there was a full on theater crowd and it was quite loud. **TL;DR version**This is a great \"fancy\" restaurant to go to when you have a group of widely ranging tastes and eaters. Some people who want simple, traditional flavors (aka non-adventurous eaters like my Mom) and others who are willing to play with less familiar flavors and textures (like me!)**Extended version**The bread plate was interesting. White bean paste and olives were both deliciously savory ways to whet the appetite. The crostini sticks had good bite, but the actual bread (two kinds) was a bit hard for my taste. (The better to spread with white bean paste, said my Mom). Ceasar salad was pretty damn good. Leaves were nicely coated with dressing (not drowned or dry) and fresh, crunchy croutons. LOVE, LOVE, LOVE that they have a simplified wine list. A page full of $25 bottles. Reds, whites, roses and sparkling included. We picked a prosecco. It was crisp and fruity, without being terribly sweet. Mom had the lemon chicken breast. Succulent and fragrant. I had the try it all pasta special. It did not disappoint. Penne with short rib ragu (NOMLICIOUS), spaghetti with red sauce and the standout winner (which I wasn't expecting) was the vegetable canneloni with bechamel sauce. Decadent. Rich. And perfectly seasoned. Not mushy vegetables. Pasta with bite. So. Freaking. Good. Service was nice, too. The wait staff could've been a tiny bit more attentive, but honestly, they kept out of the way so Mom and I could eat, drink and be merry. Highly recommended for a non-hipster, non-pretentious upscale dining experience if you're in Midtown and randomly want some Italian.", "Date": "2014-06-23", "Author_Location": "Los Angeles, CA"}, {"Author": "B L.", "ReviewID": "UbXF-SjlOjYj_kwmSZy2VQ", "Overall": "2.0", "Content": "Extremely, extremely disappointed to be in New York and read so many positive reviews on the pasta here which was awful!!!  How can anyone expect to be served great pasta when 1) its not served fresh...its sitting on a large heated pan being brought back and forth...which overcooks the pasta(not at all al dente) and say the shrimp in this case gets overcooked as well.  2) all three pastas lacked flavor - this coming from someone who likes limited garlic, onions, salt, condiments...The Caesar salad that comes with your meal (served at your table) is average at best - tasted like a mediocre Caesar you are served at a wedding or buffet!Bread is weak 2/5, bread sticks too salty, bread slices not terribly exciting.Osso bucco was the only reasonable plate to me 4/5Service from Monica was off the charts good-  but Im sorry Monica, you need some help here.  And I may be crazy because of your restaurants success and reviews... but I can not believe this is a 4 star pasta experience in NY.I will not come be coming back!!Btw, we ordered one 'custom' freshly made penne pasta and that was weak as well!", "Date": "2014-06-22", "Author_Location": "San Diego, CA"}, {"Author": "Ellie B.", "ReviewID": "UjBhdDWeji2m-bB-GAjAwA", "Overall": "4.0", "Content": "My visit here with friends was decent. From the outside the place looks small and cozy but it's actually huge and has two floors. We were seated on the second floor and the main negative I had about that was that it was FAH.REEZ.ING. Freeeezing cold! It was a lovely warm night, around 80, but inside it had to have only been 55. Ridiculous. At least the food was pretty good. I got the special - salad and unlimited pasta. The Caesar salad was fine and the pasta was good. The three served were pasta with a red sauce, mushroom ravioli, and pasta with a clam sauce. They made a special batch of the third with no clams, which was very thoughtful. Service was attentive.", "Date": "2014-06-19", "Author_Location": "Milwaukee, WI"}, {"Author": "Nicole A.", "ReviewID": "DXkFe7aK4HWg3DXyq4TA1Q", "Overall": "3.0", "Content": "Ordered apps and bottle wine, antipasti which was good and nice size.  Very tasty cheese (homemade mozz and parm) and shrimp (supposed to be jumbo but rather small) were good, lightly breaded spicy sauce.  Dinner- 2 bell and Evans chicken with risotto.  It comes on the bone- skin was pretty salty but the meat was tender and good quality chix. The risotto was gross and cheesy and bland- barely touched it.  Veggies were good.  Swordfish was ordered by my friend and said it was good.  Portions were OK size we were full because we ordered apps.  Entrees come with. House Caesar which is a nice touch. Desserts- apple strudel homemade cinn gelato- OK. A little bland strudel but Keaton was tasty even though they barely give you a scoop.  It's like a taste.  Panna cotta was tiny and I'm not a fan of it in general so I didn't like it.  Service was good.", "Date": "2014-06-18", "Author_Location": "Bay Ridge, Brooklyn, NY"}, {"Author": "David L.", "ReviewID": "IxGFbPUw74AnJBtmcmskWQ", "Overall": "5.0", "Content": "This place has got pre-theater dinner down to a science. They pack it in and keep things moving, but in a really good way. $23 for their special of a really well stocked anti-pasti plate and then all you can eat fresh pasta selections waiters bring around to you. Very very good food and very inexpensively priced and a perfect pre-theater trip. We also had kids with us and pasta+kids = easy.The pasta our night was some paperdelle and tomato which was simple and ok for me. The mushroom ravioli were fantastic and my favorite was the short rib gemelli which had a very rich, unctuous sauce. Really great dinner and service.", "Date": "2014-06-18", "Author_Location": "Los Gatos, CA"}, {"Author": "Jacob H.", "ReviewID": "pzqfmIRk7QcFgmqNblNPtQ", "Overall": "2.0", "Content": "This place is overrated. Came in here for dinner with my boss and we had a reservation at 8, we arrived at 730 and didn't get seated till 830. What's the point of a reservation? The all you can eat pasta came out super slow but when it did it was just ok. I think if one person in the party gets the AYCE and the other another dish you can at least try a bit of each.Would I go there again? Probably not, but it sure is really packed there so people must love it.", "Date": "2014-05-30", "Author_Location": "San Gabriel, CA"}, {"Author": "Ron S.", "ReviewID": "ufulH0vHPpdcj8mP8qWvhw", "Overall": "2.0", "Content": "Came here after reading the positive reviews.  Over all an average experience.  The Caesar Salad was so so and the triple pasta next course was one out of three.   The veggie plate my spouse ordered was acceptable while my chicken parmesan tasted like it had been cooked the previous day and reheated.  Service was attentive but I expect there are better meals to be had.  After all, this is the Big Apple!Added later:  upon reflection the bread was excellent.  Add half a star.", "Date": "2014-06-18", "Author_Location": "Calgary, Canada"}, {"Author": "Patricia C.", "ReviewID": "8Q41rsJGkBd7ZyzqI49jng", "Overall": "5.0", "Content": "Delicious Italian food and great service. They don't make places like this anymore. The decor is nothing fancy but it is what  makes it charming.  In this world filled with cookie-cutter restaurant chains, It is so nice to find a place that is truly one of a kind.   There is no way this place deserves anything less than a 5.", "Date": "2014-05-29", "Author_Location": "Jersey City, NJ"}, {"Author": "Pl L.", "ReviewID": "IpsRNOjTuoR3m4p145WnYw", "Overall": "1.0", "Content": "This place is so overrated! Just a bunch of tourists spilling over from Times Square. The waiter we had was so rude that when we ordered a (already overpriced) bottle of wine he suggested that we order something more expensive. People go here for the unlimited pasta but a can of Ragu and Barilla at home has the same taste and less of the tourists.", "Date": "2014-06-14", "Author_Location": "Manhattan, NY"}, {"Author": "Danielle S.", "ReviewID": "QpYVmy_KNfICUn-Yn8ej7Q", "Overall": "4.0", "Content": "Stopped in here today with my mom. It is a small, cramped and busy little restaurant. A little too cramped. They reeeeeallllly squeeze you in there. The service was quick, kind and attentive. Once seated you are given a white bean dip and some mixed marinated olives to snack on. They also place a wonderfully rustic wooden box filled with very thin and crispy bread sticks (grissini), focaccia with a few olives inside and a hearty traditional Italian type bread. The breadsticks are my favorite. They are light, crispy and salty little sticks of satisfaction. If they sold them, I'd buy them. The touristy or very hungry thing to do is get the all you can eat pasta trio which includes either a Cesar salad or an antipasti misto. As a vegetarian my choices here are limited. You either get the trio of pasta, spaghetti with pomodoro sauce or a sampling of all the vegetarian sides. I opted for the pasta trio and antipasti misto. Today's pasta selection included a ravioli with oregano sauce which was very light and tasty, although it was not served very hot. Spaghetti pomodoro which was great with fresh basil and grated cheese on top. The other pasta was a penne bolognese. Since I am a vegetarian they brought out a special pasta which was penne with broccoli. It was very good. While I enjoyed the pasta, I feel like the best part of my meal was the antipasti misto and the mozzarella en carrozza my mom and I shared. First, the mozzarella is wonderfully fresh and gooey. The bread was light and airy, more of a delicate pastry than a bread. It was served with a bit of sundried tomato pesto and traditional basil pesto. It is the best basil pesto I have ever, ever tried. So fresh and well seasoned!The real star was the antipasti misto. Typically is comes with a bit of seafood, but since I am a vegetarian I was offered the most wonderfully creamy ricotta drizzled with honey and flecked with fresh cracked black pepper. It was heavenly. This came with fresh peas simply dressed in some olive oil. The plate had offerings of a variety of tasty morsels. A small chunk of pickled carrot, eggplant and zucchini in a tomato sauce (caponata?), string beans with a spicy horseradish sauce, marinated mushrooms, ball of mozzarella, slice of the most delicious sundried tomato, a slice of grilled zucchini and a salad of beans.  I would come back for the antipasti misto alone.Definitely give Becco a try if you haven't. If you're not a vegetarian, I'd suggest staying away from the trio of pasta and ordering something else. You can always add a tasting of the three pastas to any entree for $9!", "Date": "2014-05-17", "Author_Location": "Mt Holly, NJ"}, {"Author": "Juliet P.", "ReviewID": "NbOXRplBdWCgOjeMmX6kPA", "Overall": "5.0", "Content": "I am definitely a fan of this place.First time in New York City and I have to try the restaurants in Hell's Kitchen. My BF and I and our friend were on a hunt to find a decent good restaurant. Well actually I was the one on a mission and they just went along with it since I am a yelp addict and a Foodie. Thanks to trusty yelp, I was able to locate this Italian Restaurant.So we walked in, nice ambiance, and a bit crowded. Honestly I thought we were going to wait a while for a table. The wait was actually not bad. We probably waited 20 - 30 minutes. The host was super friendly, and greeted us right away. There is a bar area were you can grab a drink or 2 while you wait for a table. Now here comes the fun. Once seated, the bread basket with spread and olives was served, the menus was handed to us, water glasses were filled. The waiter starts letting us know of the specials. Being indecisive,  I needed another minute but my boyfriend was quick to order the \"Three Daily Pasta Special.\" Finally,  I was set on the lemon chicken and we ordered calamari to start. Everything was fast paced and waiters were super friendly.I hope you're not on a diet because this place will just break you. Literally speaking.  After dinner, we were stuffed. Let's talk food!  The 3 pasta special was amazing. You get unlimited amount of 3 different types of pastas which changes everyday. The waiters come around with big pans and will serve it directly on your plate. I would get a taste here and there from my BF and everything was delicious.  The spaghetti, ravioli,  and the 3rd dish which I can't recall the name but just remembered that they were all very tasty. The lemon chicken that I ordered was absolutely devine. I loved it. Chicken was made to perfection. It was juicy and tender and mixed with the lemon sauce just complements the whole dish.Overall, we had a great dining experience in NYC! Portions are huge and it will overfill you at a reasonable price. TRUST!Better to make a reservation because this place fills up fast.", "Date": "2014-05-11", "Author_Location": "Los Angeles, CA"}, {"Author": "Kate T.", "ReviewID": "HYHlyLeHgoM0lSKXsmc72Q", "Overall": "4.0", "Content": "Skip the whole prix fixe and $25 wine bottle (unless you're not a wine snob) schtik -- you'll miss out on their best dishes and the serious wine; Their Osso Bucco and lamb chops are to die for. Their complimentary bread offerings are impressive, with grissini and two selections of fresh bread, white bean dip, and oil to tide you over while you wait for THE MEATS.Seriously, don't bother with the endless pasta -- it's so Olive Garden and touristy! You can eat a ton, yes, but they pump it out in cheap quality and it's too simple. Their house Cesar is pretty excellent, though. Service gets hairy sometimes, towards the later part of the week.", "Date": "2014-05-11", "Author_Location": "New York, NY"}, {"Author": "Eva C.", "ReviewID": "ZmFXgRIcvI-fHKpjSlUHkw", "Overall": "3.0", "Content": "Extremely crowded on theater nights. I came here before a show and they were really nice about asking us what time our show was so they could plan accordingly for the timing of our meal. I would not recommend the pasta tasting here, none of it was very good even for the price wasn't worth it. My bf got the salmon and loved it and it seemed the table next to us got other entrees they loved too. So I'm guessing their entrees are good but pastas are lacking. I may return one day to give this place another try.", "Date": "2014-05-11", "Author_Location": "Queens, NY"}, {"Author": "Dennis M.", "ReviewID": "1zD7-V5mTAYSxLbB1dsHZQ", "Overall": "4.0", "Content": "I had a quick meeting in NY and wanted some good Italian pasta.  I checked Yelp and found this place.  I sat at the bar and enjoyed three different pasta's.  And they keep giving you more if you want more at no additional cost.  Pasta and atmosphere was very nice.   I would stop here again.", "Date": "2014-06-24", "Author_Location": "Leesburg, VA"}, {"Author": "Mark Z.", "ReviewID": "aAuGaRwsVbRm5C7plgUT4w", "Overall": "2.0", "Content": "Our third or fourth time here: regrettably, it simply isn't what it used to be. Very poor service now. The veal chop parmigiana--my very reason for coming here--was dry and overcooked. The dessert sampler was a big disappointment, too. Stay away from the mint gelato--awful.", "Date": "2014-06-30", "Author_Location": "Scotch Plains, NJ"}, {"Author": "Kris M.", "ReviewID": "fy4wLpOsWGqOzakMz3Gwsg", "Overall": "5.0", "Content": "Always packed and super loud but the food is great. The unlimited pasta special is perfect for those who want to sample multiple pastas made fresh each day and they have a wine list which includes bottles $30 and under. Superb for those looking to have a meal that's a bit lighter on the wallet but still carries the weight of an authentic Italian eatery. This restaurant has been a staple on restaurant row for years and still delivers each time we go.", "Date": "2014-07-09", "Author_Location": "New York, NY"}, {"Author": "Toni D.", "ReviewID": "061it355dhdYPRUBMPBYdA", "Overall": "5.0", "Content": "Great restaurant. We had few courses of meals and few bottles of wine. Their $.25.00 wine selection it's fantastic idea. Service was very on top if it and super friendly. I'm very impressed and can't wait to go back there. I loved their dessert selection simple and delicious !!", "Date": "2014-06-29", "Author_Location": "New York, NY"}, {"Author": "Moshe A.", "ReviewID": "17sAQN0EgkdZ6AksWcTWJQ", "Overall": "5.0", "Content": "Amazing Italian restaurant , the food are really good and fresh , also I like the wine collection , if you want a good dinner  this is the place .", "Date": "2014-06-11", "Author_Location": "Theater District, Manhattan, NY"}, {"Author": "Juan M.", "ReviewID": "dJSCSU4Beixr2vCfNoiysw", "Overall": "4.0", "Content": "A restaurant row classic. There were a group of us of us at Becco for lunch. The Sinfonie de Paste is terrific value. 19.95 for an unlimited amount of three pasta choices. I don't like artichokes but the artichoke ravioli were terrific! Decent Caesar salad and the bread basket was lovely.....the salty, cheesy pretzel sticks were addictive! An amazing and lengthy wine list....we went for the Bastianich Vespa Rosso...so good we ordered a second bottle. Tables are close together and it can get a bit noisy but that's part of the atmosphere. Our server was only two weeks on the job and stated this up front so we all had a bit of fun with him. Thoroughly enjoyable and would definitely visit again.", "Date": "2014-06-09", "Author_Location": "East Haven, CT"}, {"Author": "Chun M.", "ReviewID": "1GsVq92oFaE78ZXXTQzdAg", "Overall": "4.0", "Content": "Had an **awesome** dinner on a special occasion and would do this again for pre-theater or just to have a nice homey Italian meal.  We arrived a little early for our 7:30 reservation and were seated immediately as our table was already set up and waiting for us.  The space is deceptively large with lots of intimate tables stashed all over the place in different rooms.  Our server was very enthusiastic and explained the specials and specialties of the house.  I was looking forward to the house pastas of the night.We started traditionally with the antipasto misto, a mix of grilled veggies & special fish of the night accompanied by a box of crusty homemade bread & parmesan breadstix (more please) and a dish of olives.  All entrees include the house Caesar salad and mine was dressed perfectly with parmesan & rustic croutons.  You can also have the 3 special pastas del giorno that are served table side from giant pans.  These can be your main meal or as an accompaniment to your main course.  Choices last night were basil & tomato rigatoni, artichoke ravioli and my favorite, fettuccine bolognese.  The fettuccine had that perfect al dente pop when you bite into the noodle.  Have as much as you want because it feels like an Italian mother is urging you to have another helping.  All this and your meat/fish course is still on it's way.For our main course, we had the wild striped bass special, the 24hr pulled pork and the porterhouse d'agnello lamb chop.  I was stunned and jealous when they brought out the monster bone-in double-cut pork chop for my wife.  The chop was sitting on top of a bed of mixed peppers & onions and was easily 5 inches above the surface of the plate.  She pitiously sliced a thin piece for me to try.  It was juicy, flavorful and the hot peppers went well with it.  I know what I'm having next time.Dessert was promising as we ordered the apple strudel to share with mixed gelati.  The strudel was none too inspiring, but the mixed gelati of espresso, almond & walnut flavors were rich and I wished I could have had some more.So here's the kicker.  4 courses for 4 people (less wine) was just over $200.  What a great value for an extremely satisfying meal!  We'll have to come back to sample more of the different kinds of pastas.", "Date": "2014-03-31", "Author_Location": "Fresh Meadows, NY"}, {"Author": "R K.", "ReviewID": "GkQtapyspzfFQaDYpmRDBg", "Overall": "4.0", "Content": "Becco is at the mercy of its success.Walking across Restaurant Row on 46th Street toward your 12PM lunch reservation you immediately notice that there's only one restaurant with a line - Becco. Quickly seated among tables for 2 - which are tightly lined up sidebyside - things begin to move fast. Here comes the bread with spread, the olives, the menus. Waiters fly by as water spills (on my shirt) and glasses fall. All this is somewhat understandable as these table's occupants have shows to see. Don't expect too relaxed a meal - it's not happening.The Food:Appetizers (Fried Mozzarella w/Bread & An assortment of marinated & grilled  vegetables with seafood) were acceptable but not standouts.For Mains we selected and shared the \"Three Daily Pasta Preparations\". 1-Pene w/tomato sauce, Nothing special here as we kept adding parmigiana cheese.2-Artichoke Ravioli - Very good and thoroughly enjoyed.3-Pasta w/Veal Bolognese - The best of the three - extremely tasteful - a gem.What's also wonderful about this choice - waiters refill your pastas when done.Hey - Keep it coming...Also selected and shared - Beef tenderloin grilled rare & sliced over arugula with freshly shaved Grana Padano. Excellent as the Beef was perfect and the arugula w/cheese couldn't have worked better with the dish. What was surprisingly special. An extensive wine list with all bottles $25. How often do you come across this option at a fine restaurant? Price wise for quality dining you simply can't beat Becco (our bill $115 including tip). Certainly not on \"Restaurant Row\" where this place is probably your top choiceAll these people on line must know something...", "Date": "2014-05-04", "Author_Location": "Valhalla, NY"}, {"Author": "Ameena D.", "ReviewID": "DMLLEF5f8_upxZ392Xt4bQ", "Overall": "5.0", "Content": "Sometimes, when the stars are aligned and everything is right with the universe, you stumble across the most amazing restaurant and have one of the most magical meals of your life.Lunch at Becco last week was one of those meals.* The service here is top notch. Food takes a while to come out but it's definitely worth the wait.* The food is fantastic! From the shrimp to the salmon to the never-ending pasta to the olives to the bread basket to the contorini. Everything was just delicious.* The ambiance is welcoming and warm. I felt like I was in someone's living room.* Prices are VERY reasonable.I'm debating returning here with my husband, despite the fact that he is SUPER picky and may just ruin the experience for me. Bottom Line: I'll return for sure, with or without the picky husband.", "Date": "2014-04-04", "Author_Location": "New York, NY"}, {"Author": "Helene R.", "ReviewID": "9IkR8PfGBsOY26ExoyKJfA", "Overall": "3.0", "Content": "Came on 5/6/14 for diner. Solid Italian food in Hell's Kitchen.  The home made pasta is excellent and the $25 wine selection good enough to proceed.  There are plenty of other main courses to select from which makes this restaurant a go to place in the theater district.But, the way the hostess \"welcomed\" us was outrageous... Absolutely no sense of  customer service. She either needs a new job or some urgent training... What a shame given the quality if the food!", "Date": "2014-05-06", "Author_Location": "Manhattan, NY"}, {"Author": "Elizabeth P.", "ReviewID": "VLSEmOoYXd_GwF7UBhVSFg", "Overall": "2.0", "Content": "Well this is my very first online review and I'm very sad it's negative considering this is (was) one of my favorite restaurants.. I've never been so miserably hot while trying to eat- NEVER! I was using my napkin to wipe my head instead of my mouth. I was told it was \"because the place gets so busy before the broadway shows start\" WELL NO JOKE! Your Becco your always busy so set the air appropriatly. Esp on a day its 91% humidity. I've been working in midtown many years and constantly recomend this place, don't get me wrong the food is GREAT, mind blowing great but not when your so hot you cant enjoy it. Im a hot natured person but the 6 top next to us asked if we were dying as well and everyone on our floor was fanning themselves. Just sucks to spend that kind of money and not enjoy it. You can afford air Becco.", "Date": "2014-05-29", "Author_Location": "New York, NY"}, {"Author": "Adam S.", "ReviewID": "mzwk35O_Zphf3IMhWQEYMw", "Overall": "4.0", "Content": "Becco is a Restaurant Row institution, having been around for many, many years.  Keeping theater-goers happy, as well as locals and tourists, Becco has a great ambience and reasonable prices.  While they focus on wine with an extensive wine list, they do have a full bar (no sangria, though) and can basically make whatever you crave.  We started with the Bresaola (thinly sliced beef), which was great, and the Tonnato di Vitello (veal loin topped with tuna aioli)...really my cup of tea.  Both were on the Seasonal Menu additions part of the menu.However, their main entree is where they shine.  They are very popular for their UNLIMITED pasta offerings, which are different every day.  On our day, they offered a four-cheese fusili, veal bolognese fettucinne, and a penne with vegetables and tomato sauce.  With any entree, you get a Caesar salad.  Their Caesar is delicious, along with their pasta.  If you're not into pasta, they have various menu options including roasted chicken, braised short ribs, and various fish options.  I also want to make a special callout on their service.  We had a party of 5 with a latecomer or two.  Our server, Leighton, was truly exceptional from beginning to end.   He did have to run on a break for some unknown reason, but informed another server who took care of us until he was able to return.  The GM, Jim B, really does a great job managing Becco, and is worth giving it a try if you never have.I would definitely come back to Becco again - if only there weren't so many carbs in Italian food.  ;)", "Date": "2014-04-07", "Author_Location": "New York, NY"}, {"Author": "Winston G.", "ReviewID": "v8ssmJy2DVN1J3e4Bwrpyg", "Overall": "5.0", "Content": "Pretty awesome lunch deal (not sure if it's also available for dinner) but you can have unlimited pasta (3 choices, all of which you can have unlimited portions of) for under $20.  Looks like based on other reviews it is also available for dinner!  While I did not eat any of the pasta (my friend said it was excellent), I had the fish of the day (branzino) which was perfectly prepared whole, presented tableside, and then filleted in the back.  Very tasty.  While I went here for lunch and did not drink, I am also told that the wines here are only $25 a bottle, which is pretty amazing when you consider how expensive everything in this city is.", "Date": "2014-04-03", "Author_Location": "La Jolla, CA"}, {"Author": "Gina A.", "ReviewID": "aTStXY86l3O62BsT8zmzTw", "Overall": "5.0", "Content": "How have I not reviewed this yet?! We have been here countless times. I have been to Italy and this is some of the best Italian food I have had in America with some of the nicest servers. ESPECIALLY for the amount of food you get for the price. I'm sure the food on the regular menu is wonderful, but we never even look at it. We always without a doubt order the \"pasta special.\" All for only $22.95!!! You get the choice of a cesare salad or their mixed antipasto. I'm sure the salad is great...but get the antipasto!!! You get an assortment of grilled veggies and some seafood...DELICIOUS. Now at this point if you haven't filled up on the appetizer and enormous bread basket they bring you, get ready for some fun. With the pasta special, you get an UNLIMITED amount of three different kinds of pasta. They bring it around in big pans and serve it directly on your plate. It's rare that I even ask for seconds because of how much they pile on for your first helping--but it's perfect for when I just want one or two more ravioli...you know the feeling.  Once you're done with your pasta, if you're not ready to explode, they have wonderful deserts. Desert isn't included in the $22.95 but I find that a good thing because I would motivated to eat it when I am 99% of the time way too full to even think about desert! But not only do they offer a great deal on delicious food, but also on wine. They have a normal wine list but they also offer a rather large $25 per bottle wine list with very lovely wines on it. All in all, this place gets 5 stars for food, service, decor and the amazing price for all you receive. Just one tip: MAKE A RESERVATION!!! This place fills up fast and is always crowded, even on weeknights. But after what I just explained in my review it makes sense right?", "Date": "2014-04-19", "Author_Location": "Queens, NY"}, {"Author": "Lori L.", "ReviewID": "w9t38xQiHp4h5_Mpymt3Bg", "Overall": "3.0", "Content": "It's difficult to love Italian food (especially pasta) and not know of this restaurant or the family behind it. Lydia Bastianich has made her dent in the world of Italian food, and over 20 years ago, opened Becco with the help of her son, Joe. Since then, it's happily served tourists, theater-goers, native New Yorkers, and Italian food lovers alike.A few friends and I met up at Becco during a weekday evening and made our way inside just a few minutes earlier than our reservation. What greeted us was a bright, clamorous dining room; two rows of tables were lined against the side of the room and each and every seat appeared to be filled. Even the bar area was completely packed, with some patrons opting to have their dinner there instead of waiting for a table. We waited for about 10 or 15 minutes until our table was ready and were led past the kitchen to the second dining room, which thankfully had a slightly less chaotic ambiance.There was pretty much no need to look at the menu, as we'd already decided beforehand on our orders. Becco's known for their unlimited tableside pasta service, an option that allows diners to choose between a salad or antipasto misto appetizer, followed by a hypothetically unlimited amount of three different pastas. I opted for the Insalata Cesare, the Caesar Salad, while my friend got the second option. The salad is pretty typical - crisp romaine lettuce, crunchy blocks of croutons, a sprinkling of grated Grana Padano (a cheese that falls in the same family as Parmigiano-Reggiano), and lightly mixed with a dressing that was not timid with its use of anchovies and garlic. For the more adventurous, the antipasto misto offers more variety, including a selection of cheeses, marinated and grilled vegetables, and seafood.The pastas are brought out in huge pots intermittently by servers who will stop by tables and ladle out a serving (or two) of the desired pasta onto plates. On the evening we went, we able to try a  spaghetti pomodoro, a mushroom ravioli topped with a cream sauce, and a fusilli alla bolognese. The least favorite of the night turned out to the ravioli; the pasta was served at a lukewarm temperature and the liberal amount of cheese in the filling completely overwhelmed any mushroom flavor. Surprisingly, the simplest pasta of the night was the standout; the pasta had a good chew to each bite, and the pomodoro sauce was fresh and well-balanced, with a generous helping of oregano and basil to compliment the acidity. The servings are fairly generous, and we were stuffed by our second plates; you will not leave here hungry.The overall quality of restaurants on Restaurant Row isn't particularly worth noting, but amongst this selection, Becco clearly has its strengths. While it may not be worth a separate trip out, it's a solid option for a pre or post-theater meal, especially when there are few other options on the horizon.", "Date": "2014-03-13", "Author_Location": "Jersey City, NJ"}, {"Author": "Reggie M.", "ReviewID": "q2aLs0Ay76eVSN6k2bWZXQ", "Overall": "3.0", "Content": "The restaurant is located on a tourist lane and for many New Yorkers is considered a tourist trap. However, maybe that was a misconception.We came without reservation on a Thursday night and was impressed that the group of 6 were seated in no time at all.The restaurant is quite tight (you can eavesdrop if that's your business) not the best place to discuss serious stuff over dinner.I chose the unlimited eat-all-you can pasta for dinner, it didn't disappoint for its price.Over all it's a great night to hang out while entertaining a friend from Europe.The staff are cordial.", "Date": "2014-03-12", "Author_Location": "Brooklyn, NY"}, {"Author": "Emma W.", "ReviewID": "EeN_aCIPuc6BKSEyWzNu3w", "Overall": "1.0", "Content": "The food is ok but the service is awful. The waiters looks like they don't even want you there, we had to keep asking for a few more minutes to look at the menu but they kept coming over every 30secs. We felt so rushed and seemed like they wanted us in and out as fast as possible. I did not like the waiters all hanging around the bar area downstairs watching us and talking non stop to each other. The noise was unbelievable for a place that only had a few tables with customers, the kitchen, the bar, the till, and the gossiping waiters!! Far too noisy. We did not enjoy our experience here at all and will never return!", "Date": "2014-05-27", "Author_Location": "Financial District, Manhattan, NY"}, {"Author": "Hannah B.", "ReviewID": "glmrbZbXCa_1CZJGRWvgIw", "Overall": "1.0", "Content": "No No No!!!!Before going here i was told there was alot of celebrities the 'old new yorkers' from the theater world. Italian which i love, but i knew obviously in theater district so you know could be busy.WOW chairs and tables on top of one another, rushing to make you eat, rude service. I went with my aunt as well so it wasn't like a young group. She had been recommended it but HELL NO never again. VERY EXPENSIVE and no reason to be. we got the trio pasta .... they come over with a pan of pasta ... now i don't eat meat (odd occasion but not a lot at all) and do not eat fish and the waiter put both on my plate even after me saying no! then it took me 10 minutes to get the attention of the waitress to change my plate. wouldn't mind but in all of this we are sitting on top of a family hearing there whole life story. Do not recommend this!", "Date": "2014-03-26", "Author_Location": "Liverpool, United Kingdom"}], "RestaurantInfo": {"RestaurantID": "_K_DDfTa15-vetK0WkG8SA", "Name": "Becco Restaurant", "Price": "$$$", "RestaurantURL": "/biz/becco-restaurant-new-york", "Longitude": " -73.98980699999999", "Address": "355 W 46th StNew York, NY 10036", "Latitude": " 40.760827900000002", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/vmc3mTvHIJWcK_zWiQtscQ/90s.jpg"}}