{"Reviews": [{"Author": "Liana F.", "ReviewID": "PpWQ1AtUwxdoxpuEn2_09Q", "Overall": "5.0", "Content": "Favorite Thai restaurant in town! They are located next to Foodland in Market City. I'm here once a week and I'm a fan of their Pad Thai w/ pork. The service and food is excellent. Most places uses so much msg in their cooking, it overpowers the real flavor & ingredients -- and this restaurant is the only thai place I've tried that doesn't give me the numbing after taste. I hate having to drink tons of water after eating a meal because the msg. Legit thai food here! 1) deep fried whole flounder with garlic chili sauce 2) stuffed chicken wings 3) pad thai with pork 4) chicken red curry 5) springs rolls 6) sticky mochi rice 7) evil noodlesnever can go wrong with any of these!", "Date": "2014-06-25", "Author_Location": "Honolulu, HI"}, {"Author": "Nixxie P.", "ReviewID": "-MjzMZmZb2HLV1SV8HQTmw", "Overall": "1.0", "Content": "The first time I ate here, I enjoyed myself the food was good. Maybe because I was with a bunch of friends I didn't notice how horrible this restaurant really is. The second time I visited, while we were waiting for our food, the waitress was sitting at one of the tables CLIPPING HER NAILS....it was disgusting. Let's just say I lost my appetite. Today, I decided to give them another chance, I was craving Thai food...so I ordered take out. When I got home there was a small roach in my soup! I should have stuck with my instinct and gone to eat at a different restaurant. I know a lot of people like this restaurant but I would not recommend this place to anyone.", "Date": "2014-07-06", "Author_Location": "Ewa Beach, HI"}, {"Author": "Savannah P.", "ReviewID": "vSicEjs6tb6GdJU4HZG0Ig", "Overall": "2.0", "Content": "I got mixed feelings about this place. The food was just okay, but the service sucked.We ordered tom yum pineapple soup,  stuffed chicken wings & a spicy seafood dish with a small order of rice. When we walked in the waitress didn't bother to say hi, or anything, just placed two menus in front of us didn't ask us if we had any questions, & took about 20 minutes to take our order. Definitely felt like we got cold shoulder from the waitress and set for a poor dining experience. On to the food: the chicken wings were HUGE had a nice crunch to them on the outside, but not enough flavor on the inside with the stuffing. Just some carrots and cabbage. The soup was good and probably had the most flavor. And the spicy seafood dish was also juat okay, I wasn't \"wowed\" by it.I'd like to go back and perhaps try something different,  but not with that kind of service.", "Date": "2014-04-27", "Author_Location": "Honolulu, HI"}, {"Author": "darrin k.", "ReviewID": "oTte-MPlvOfEX7UW8zQAlw", "Overall": "3.0", "Content": "First time in the restaurant. Ordered Summer Rolls for an appetizer and pad thai (w/ beef) and an eggplant tofu dish for lunch.  Food was good and pricing very reasonable.  The only problem I had was service. (The food did come out quickly)  Our server mumbled the name of the dish then dropped it on our table. Very low on the friendly meter.  I know it may not be that important to most but for me it factors in to the overall restaurant experience.  Would I come back? Maybe.  I would give it another shot.", "Date": "2014-07-15", "Author_Location": "Honolulu, HI"}, {"Author": "Jess T.", "ReviewID": "HnQo6c1i-nuGpjkRV3NorA", "Overall": "5.0", "Content": "Favorite thai restaurant!  Hands down best thai fried chicken and (pad kee mao) drunken noodle!", "Date": "2014-07-20", "Author_Location": "Honolulu, HI"}, {"Author": "Leslie M.", "ReviewID": "d5GZ3FDmQ6Jog7r8G-Nr7A", "Overall": "3.0", "Content": "Make sure to check your order if you do take out.  They have a tendency to mess up.  I wish they knew how to handle the situation better when the mistake is theirs.  A sincere apology would do the trick.  I come here because its quick and close to where I live.  The food is good but they could have earned more stars for better customer service.", "Date": "2014-06-22", "Author_Location": "Honolulu, HI"}, {"Author": "Ashley K.", "ReviewID": "HhGDdrMwTnZQljMDPKG3Wg", "Overall": "4.0", "Content": "Thai Issan is probably my second favorite thai place on the island, but we don't eat thai very much so not sure how accurate my  comparison is.I like their tom yum soup and fried chicken! Usually I also enjoy their pad thai but yesterday's order was sweeter than usual. So I guess you could say there are some inconsistencies.Their thai spicy papaya salad is authentically spicy! Hehe. Loved it!The service is very good and efficient. They did not mind giving us extra plates and utensils since we were celebrating a birthday and wanted some cake.Would recommend and return!", "Date": "2014-04-17", "Author_Location": "Honolulu, HI"}, {"Author": "Myong C.", "ReviewID": "0mCDSk5hd82VALMj397r7g", "Overall": "4.0", "Content": "I didn't even know this restaurant existed until a friend very nicely offered to take me out for dinner last week. I hadn't had Thai food for a while so was really excited to check it out.First of all....BYOB. Winner! After ordering our food, walked into Foodland for a six pack of beer and when we returned, voila! Our first order was already on the table.We didn't get too crazy with our orders, just the usual Thai staples everyone's familiar with.Started with the stuffed chicken wings, 4 pieces per order. Nicely stuffed and flavored, a great start to the meal.Then came the pad thai, ordered with chicken. I thought it was seasoned perfectly - not too sweet...not too rancid...but jus' right, ya! We finished this dish clean.Last was the curry. I forget exactly which one we ordered but again, very tasty. We asked for medium though and I think there was a mistake cuz it was a lot spicier than I thought it would be. Good reason to polish off the beers! Or maybe that's just how spicy they make their food.Service was acceptable and they even let us borrow a bottle opener for the beers.I would not mind going back for another meal.", "Date": "2014-02-18", "Author_Location": "Honolulu, HI"}, {"Author": "Melissa C.", "ReviewID": "DIESyFCZM_OrAQ3SeQcYAg", "Overall": "4.0", "Content": "Tried this place on a whim and what a surprise. Probably the most tastiest pad Thai I've ever had.  We also ordered the fried chicken, and of course spring rolls. We ordered it from a delivery service but will definitely  try dine in.", "Date": "2014-02-15", "Author_Location": "Honolulu, HI"}, {"Author": "Sarah S.", "ReviewID": "OjlhYYp6aj1oYcUX_MeXRA", "Overall": "4.0", "Content": "BYOB : )  and that's an automatic winner in my books...of course, their food is really, really good!  I came here with some friends who recommended this place and I am so happy they did.  Everything we ordered was amazing - we had the green curry with chicken, spring rolls, deep fried calamari, panang curry with chicken, pad thai noodles, and sweet chili fish fillets and of course sticky rice.  The curries were very tasty and the dark horse winner was the deep fried fish fillets with sweet chili sauce - flaky, sweet and slightly spicy - a perfect dish with sticky rice.  The staff was friendly, helpful and hospitable - adding to a nice restaurant experience.  Please try this place and see for yourselff.  It's located in the Foodland Marketcity Shopping Center, free parking and since it's BYOB, Foodland is right next door.  How nice.  : )", "Date": "2013-12-05", "Author_Location": "Honolulu, HI"}, {"Author": "Anastasia A.", "ReviewID": "4glznxAdGYWvg7JBulk54g", "Overall": "1.0", "Content": "We never got a chance to eat here. We walked in, got a very cold attitude from a girl with fake eyelashes (we interrupted her lunch apparently). She threw (literally) our menus on the table, we said thank you - no answer, no smile - nothing! She went back to her table where she was having dinner with several other workers. And kept eating. And kept eating. While we kept waiting for our order to be taken. It never happened, therefore we left.Good luck with your business, treating your customers like scum.", "Date": "2013-12-01", "Author_Location": "Brooklyn, NY"}, {"Author": "Donna L.", "ReviewID": "tBbmYIr4r70xZuXq6S_-4Q", "Overall": "4.0", "Content": "Consistently good Thai food at reasonable prices and BYOB... need I say more? Hahaha! There is definitely a certain ambiance and charm to this little place that's tucked away in Market City next to Foodland. Really, the food is what makes keeps me coming back, even despite the crazy parking lot and hit-or-miss service. This has officially become my go-to place for Thai.", "Date": "2014-04-02", "Author_Location": "Honolulu, HI"}, {"Author": "Maria Shea A.", "ReviewID": "QzIgMSgNwP2JQBDkOkrJsw", "Overall": "5.0", "Content": "I've done both take-out and dine-in at this place and have never been disappointed in the flavor or quality of food.  The parking is a pain because it's right next to Foodland which tends to get pretty busy but be patient; you'll get a stall.Fried chicken is killer and so is the yellow curry.  Pad Thai is very tasty and the texture was just right.  I recommend this place.", "Date": "2013-11-10", "Author_Location": "Honolulu, HI"}, {"Author": "Rob I.", "ReviewID": "bTilKLD5t6H0i1vSUfbW7Q", "Overall": "5.0", "Content": "I just had their green curry lunch special.  soooo ono and for $12 I got tossed salad, fried chicken with chili sauce and the green curry with jasmine rice!!  The curry was one of the best I tried here.  It was spicy with eggplants and the sauce was was thick- not watery like other places.  Next time I'm going to try the Panang (my coworker got it and it looked better than mine).", "Date": "2014-05-02", "Author_Location": "Pearl City, HI"}, {"Author": "Yuwathida B.", "ReviewID": "xG8Ir7zcDtWCYDJR3Tek3Q", "Overall": "5.0", "Content": "My usual test for any Thai restaurant (especially one that specializes in Thai-Isaan food) is the Papaya Salad and the Larb Gai. Being from Isaan myself and having learned to cook from when I was a little girl, I can attest to the authentic taste and recipes at this little family run restaurant. If you are a Thai person and want a night off from cooking your homemade Thai food, come here! The only bad thing is that I discovered this place on my last night on Hawaii. Super tasty spicy food!!! It was so spicy that my farang husband drank a gallon of water to cool the flames - only because I asked for Thai hot ;-)", "Date": "2014-03-16", "Author_Location": "San Francisco, CA"}, {"Author": "Larissa I.", "ReviewID": "E8h98hZzn2QLeLOLYiBSDQ", "Overall": "3.0", "Content": "I went here tonight with a group of ten. The service was attentive, food was pretty cheap but not the greatest. Don't get the scallop plate. The sauce sucks and the scallops looked raw. The chicken curry and spicy papaya salad was pretty good though! We managed to get ten dishes and only paid 14 dollars each person, tip already included.", "Date": "2014-04-14", "Author_Location": "Honolulu, HI"}, {"Author": "I Crush Your Head C.", "ReviewID": "KsZI7RSOlPIEXxXANYDIZg", "Overall": "5.0", "Content": "Hey, Thai restaurants in town. You just got put on notice.Dis spot jams. PadKeeMao noodles, straight fire. Red & green curries, ferocious. Tried almost everyting on da menu and it's all G. Super onz.Check dem out. Place is official.", "Date": "2013-08-17", "Author_Location": "Honolulu, HI"}, {"Author": "Sophie S.", "ReviewID": "upw-2NEje62ZnLIDLkCmDw", "Overall": "2.0", "Content": "Thai food is usually very flavorful. This food was not. We ordered the chicken wings, yellow pineapple shrimp curry, sticky rice and tofu with chili sauce. We wouldn't order any of those dishes again and would not go back. I was extremely disappointed in the chicken wings. They were not crispy at all and it didn't even come with peanut sauce. Peanut sauce is very traditional in Thai culture. It didn't have much flavor either. The curry was okay but was not spicy enough and we ordered medium. The tofu was bland. The only thing that was good was the sticky rice- wow. I do not recommend.", "Date": "2014-05-23", "Author_Location": "Honolulu, HI"}, {"Author": "molly n.", "ReviewID": "yX7uztbAlCM-2MUoAMPEUw", "Overall": "5.0", "Content": "Thai themed dinner party.  I cheated and ordered Yum Woo Sen (glass noodle salad), green curry and shrimp summer rolls.  Everything was super good and everyone enjoyed the dishes.  We visited three times since then and always have a great meal. I always order it Laos style and Thai spicy! One of the best green curries I tasted.", "Date": "2014-04-07", "Author_Location": "Honolulu, HI"}, {"Author": "Melvin S.", "ReviewID": "4UVYjqGXofmnTD3JXgjo9Q", "Overall": "4.0", "Content": "Quick and tasty take-out tonight...stuffed chicken wings and yellow beef curry.", "Date": "2014-03-05", "Author_Location": "Honolulu, HI"}, {"Author": "Jim M.", "ReviewID": "0twtk9kCQc05QNmcUoHdRw", "Overall": "4.0", "Content": "Thai Issan definitely rates as one of my new favorite Thai restaurants.  They have been open almost a year and I have been at least 10 times.  My favorite dishes are the Pad Kee Mao Noodles and Pad Thai, but all of the beef and chicken dishes I have tried have been yummy.  The Tom Yum soup is good, though a bit spicy and hot for summer weather.  It is good on a chilly Hawaiian night.  :-)   One of my Thai friends loves the Pad Gar Pao and their Kahuku Shrimp dish. I have found the service to be friendly and consistent.  They are not super fast, but I have never waited more than 15 minutes to get my food either. Parking in this area is tough.  The mutants in the parking lot at Foodland making parking a challenge.  You might want to park in the lower parking lot and walk around the building rather than wait in the madness out in front of Foodland. They are BYOB, so bring your own wine or beer.", "Date": "2013-07-26", "Author_Location": "Honolulu, HI"}, {"Author": "Tracy K.", "ReviewID": "jw2BUSGuuW94DvWXh1ZaTw", "Overall": "4.0", "Content": "It was meant to be.After coming home from my South American vacation, I was craving rice dishes. Japanese, Vietnamese, Thai... You name it, it was going in my belly!I got my craving for Thai food and phoned in my usual go-to place, Phuket Thai in McCully Shopping Center. As luck would have it, no one answered the phone for a solid minute. Hmm, who else is open at 8 o' clock? I did what any self-respecting, intelligent, educated person would do. Yelp it, of course!!! :DSo I check out my bookmarks and whaddayaknow... Thai Issan was staring at me right in the face. When I triangulated where it was located, it could not be in a more convenient place. It was literally two minutes from my house! I briefly read the reviews and it seemed the general consensus liked the food but the service was a hit-or-miss. Not to worry, I was ordering take out anyway. The lady who answered the phone spoke good English, was very friendly, and patient to my questions and ordering. Hmm, so far so good!I picked up my green chicken curry and pork larb within ten minutes. The two ladies greeted me and were very friendly! They asked if I wanted sticky or regular white rice, chopsticks, and rang out the bill in an efficient manner. I explained that this was my first time, and I had originally wanted to go to Phuket Thai. They were ecstatic that I gave them a try! I anxiously brought my yummies back home and took my first bite...Heaven.Delicious. Heaven.Everything was perfectly seasoned, the portions were large, and I had enough leftovers to feed me THREE more meals! Perhaps the next time I try them, I'll dine in and upgrade them to five stars if their service is up to par!I am so happy I found this place. I will definitely come here again and recommend everyone try them at least once. You'll agree with me.", "Date": "2013-05-27", "Author_Location": "Honolulu, HI"}, {"Author": "Mary M.", "ReviewID": "BYZimVafluPJVVwfpu0Q2g", "Overall": "5.0", "Content": "I am here almost everyday!  I order the green curry, only vegetables and no MSG.  And it is perfect every time.  Also, I get USAirways dividend miles for every dollar I spend, an extra bonus.  It is really authentic so sometimes I don't understand the person who is answering the phone (I do take out only), but who cares... they know how to cook and they always get my order right!  Definitely check it out!", "Date": "2014-01-06", "Author_Location": "Honolulu, HI"}, {"Author": "Wesley C.", "ReviewID": "xsFAGyOoC84JeKuscBZ1-A", "Overall": "5.0", "Content": "My Monthly Thai fix;  fantastic food & service . You can't go wrong wIth their house fried chicken,  sPring rolls,  pad Thai, and grilled beef salad.  I love their curries", "Date": "2014-02-20", "Author_Location": "Honolulu, HI"}, {"Author": "Sam O.", "ReviewID": "9Dn4L-auK28JZE_OlRSvXw", "Overall": "4.0", "Content": "I walk by this place all the time and was skeptical until a friend said he'd finally tried it out and liked it...The pad thai is the best I've had in Hawaii.  I usually find that places skimp on the sauce and I end up drowning it in sriracha.  Not this place!  And the portions are good too.A word of caution: scale back your spiciness level on your order.  If you usually go for spicy, ask for medium.  Only go full-on spicy if you like Maharani-kine spicy.  My BF got the green chicken curry with sticky rice, which was excellent, but he asked for spicy.  And MAN did that have some serious heat!  He couldn't finish it and it made him kinda sick the next day.  The upside is that I got his leftovers for lunch!We also had their appetizer sampler:     Calamari -- very tender     Spring rolls -- meh     Fried fishcake -- I would order this again     Chicken satay -- meh (peanut sauce was good though)In response to those who complained about the service:  Was service great?  No.  Was it what I expect from a little mom-and-pop hole in the wall?  YES.  When you have one lady who is the entire FoH, who works there all day every day, and it's HER restaurant, you cannot expect the kind of service you get from someone who works part time and will loose her job if she's not friendly/attentive/etc.", "Date": "2013-08-24", "Author_Location": "Honolulu, HI"}, {"Author": "Serena F.", "ReviewID": "O6qjeP5T3Ala5TKkm4AVdA", "Overall": "5.0", "Content": "I love Thai food and I love eating at nice restaurants, but the only problem is many Thai restaurants price their entrees at $10-$14 and I'm not thai-ing to go broke. Thai Issan is a solid choice to enjoy a sit-down dinner at a clean place for good prices. Entrees are about $8-$12 and the rest of what you need to know are in the rap below.Thai Issan is located in Market City,If you don't know where then I'll take you with me,But chances are I don't have no money to pay,So just find Foodland and look on the right way.You want pad Thai? Chicken beef or pork?Only eight twenty-five, hold on to your fork,Not too sour not too sweet, bean sprouts on the side,\"Good, I hate bean sprouts!\" my boyfriend confidesTwo-fifty for Thai tea, we're dining like kings,Nine ninety-five for stuffed chicken wings These prices are crazy right? Yup they're niceAnd only two fifty for some Thai sticky riceAny Thai craving, they can fulfill it surely,Especially if you the type that likes curry,All the rasta colors red green and yellowLast thing now, just pick your spice level!The staff filled our water time after time,The restaurant is clean! Like they clean it with limesThe portions are good and they do take out\"BUT I FEEL LIKE A HEFFER\" I wanna shoutThai Issan, good job, I will see you next week,With your food and your prices, you cannot be beat,Good flavor, good people, now Yelp knows why,My love for you Issan, will never thai.", "Date": "2013-04-29", "Author_Location": "Honolulu, HI"}, {"Author": "Joe P.", "ReviewID": "Em0E0Kmpny3uztCjevu_Xg", "Overall": "5.0", "Content": "Tastiest Thai In Town !!! Lunch special $10.95 is awesome, includes Salad, fried ck, curry, & rice", "Date": "2014-02-11", "Author_Location": "Kailua, HI"}, {"Author": "Ariana M.", "ReviewID": "1Y6NIiteJh2ECif35ShORg", "Overall": "2.0", "Content": "So this place is located at market city where the old Quizzno subs used to be. Went here one day because I was craving some Thai food and wanted to try somewhere new. Just an FYI - Thai Issan Cuisine is BYOB! Luckily this isn't too much of a problem cause you can just run into Foodland and grab something. Walked in and it was practically empty. Only one couple was there. The service here was EXTREMELY poor. The waitress working obviously did not want to be there. Or she just didn't care about customer service. I really like how they keep a jar of crushed peanuts on the table so you can add as much as you personally like! Very awesome :) THE GRUB ---COMBINATION PLATTER $13.95 - This is a great appetizer for sharing! You get to try a little of everything so I definitely recommend this. PAD THAI  $8.95 - I thought it was really goodYELLOW CURRY (with sticky rice)  $8.95 -- Delish", "Date": "2013-05-28", "Author_Location": "Honolulu, HI"}, {"Author": "Lori I.", "ReviewID": "_VrcD0i3KXRSZYHmBoMIoQ", "Overall": "4.0", "Content": "Love the GREEN CURRY, PAD THAI and Thai Iced Tea here. yelp.com/biz_photos/thai…OPEN DAILY 10am-9:30pm!Sometimes I get hungry for lunch by 10am. This place opens early and the lunch specials are great! They are under $10 and include a green salad, one Thai fried chicken, your choice of curry, rice (brown or white) and a soft drink.  Don't be limited by the lunch special menu, you don't have to order the \"Wednesday\" special on Wednesday. You can get the Friday special on Tuesday or Monday or basically whenever you want...and you can get the Thai Iced Tea for $1 more (recommend). Take-out has been great every single time. They are quick and always have my order ready to go when promised.Dine-in sometimes requires more patience. Once the rice wasn't cooked yet when the curries came out so we had no rice for half the meal, and more times than not my water glass stayed empty for a while. However I have no problem grabbing my own pitcher of water and refilling it myself, so I will of course be back again soon. Thanks Nat for reminding me to cut out the 20% off coupon from the paper!!! I hope they run that coupon every week! Love this place.", "Date": "2013-01-21", "Author_Location": "Honolulu, HI"}, {"Author": "Krysten I.", "ReviewID": "oigAD2QiMBtEipz1J08ldg", "Overall": "2.0", "Content": "My mother has been on this United Airlines Mileage Plus dining streak....I have no idea why, it's not like she gets all that many miles from dining at restaurants on the list, but I tag along because I'm a poor college student and I won't turn down free dinner. I had actually dined here before (and I swear I wrote a review.....Idk where it went though). I remember not wanting to return because the service was non existant. Apparently they changed ownership since then, but I couldn't see any differences. The service was still lousy.Onto the food. Thai Issan serves pretty authentic thai food. In terms of the food, Thai Issan is probably one of my favorites for thai food on the island (behind Champa Thai and Pae Thai). Green Curry is a little spicy, but super flavorful. The fishcake was good, Pad See Ew (the noodle dish made with fat rice noodles) wasn't the best and the chicken sate is pretty hard to mess up. Thai Issan is BYOB, which is nice since Foodland is right next door, but you'll have to ask for glasses and an opener (asking if a place is BYOB and leaving to return with a bottle of wine apparently doesn't translate to needing glasses and an opener for the workers here).", "Date": "2013-04-21", "Author_Location": "Honolulu, HI"}, {"Author": "Jayson N.", "ReviewID": "ESpJpkdoMBy3AAi2SloWwg", "Overall": "4.0", "Content": "Definitely a fan of THAI ISSAN..  Been here quite a bit because its conveniently located to my work place, but even if it wasn't definitely one of the better thai food places i've been to in Hawaii..I definitely love the Stuffed Chicken Wings here.. I admit that this is the first place i've had them at and they knock it out of the park.. I call it my COCK-POP cause it is like a chicken popsicle, but much better! (wink)Had the pad see ew and pad thai, the spring rolls, and the papaya salad..  All were good, had great flavor, and definite reorders..  I do love that they come around often with water refills cause if you order anything other than \"NO SPICE\" or \"MILD\" you may be sweatin' balls, depending on how well you take your spice...My only worry about this place is that it's a bit like playing russian roulette with the spicy levels.  There are times where i specifically said \"NO SPICE\" to the waitress because my coworker cannot handle at all and it comes back SUPER SPICY.. Like leave the pitcher of water here spicy.. I heard from Lori I. that they do have two chefs that cook here and she had a similar experience but luckily the food tastes pretty damn good regardless of who is cooking..Thai food in Kapahulu or Kaimuki? Definitely roll the dice with Thai Issan. (Wink)", "Date": "2013-01-22", "Author_Location": "Honolulu, HI"}, {"Author": "Cin T.", "ReviewID": "tjR2-Kt-utSI8LUEvysWNQ", "Overall": "5.0", "Content": "Thai Issan is on hotdeals for only another 6 hours!hotdealshawaii.com/r/4nn…Valid only from Nov 28, 2012 through Nov 30, 2013.Oh mah gah......imagine how much House Fried Chicken ($8.95) I can get out of these coupons, lol! yelp.com/biz_photos/POYv…Get it while it lasts, my fellow Yeeps!! Thank you Kyle H. for letting me know about this awesome deal! You're the best!!", "Date": "2012-11-27", "Author_Location": "Honolulu, HI"}, {"Author": "Michelle L.", "ReviewID": "eKTsoNpf4oMIXmAteTrNyg", "Overall": "4.0", "Content": "Thai Issan Cuisine have been blowing up on Yelp lately and Hot Deals came to the rescue with an awesome coupon.  I was so excited to check it out!Walked-in on a weekday night with no problems getting a table.  We ordered the following: Marinated Beef Salad, $9.95 - This was so good!  Sliced beef tossed with cucumbers, onions, mint and lettuce in Thai spices.  I love that they include lettuce because most restaurants don't.  Lots of flavors and the mint made it refreshing.  One of the best Thai beef salads I've tried.Green Curry with Pork, $8.95 - Perfect consistency and lots of bamboo/eggplant and meat.  However, I found it very salty.  This was a must with some plain rice to cut the salt and it was delicious.  yelp.com/biz_photos/POYv…Pad Thai with Chicken, $8.95 - It was very good.  Reminded me of Phuket Thai's Paht Thai which is the style I like.  The sauce had just the right amount of tang and savory. yelp.com/biz_photos/POYv…Mixed Vegetables with Seafood, $11.95 - Lots of garlicky goodness in that sauce!  The seafood included calamari (lots of it), shrimp (3-4 pcs), and scallop (just one).  The seafood was a bit disappointing because I wanted more scallop but oh well, beggars cannot be choosers.yelp.com/biz_photos/POYv…Plain Tapioca, $2.50 - typical hot coconut flavored tapioca.  Upon first tasting, it had a funny chemical taste but it kinda disappeared after eating some more.  It was a good size for the price.Service was good.  I wished they came more often to refill water but the servers were patient when we took forever to decided on what to order.  I really enjoyed my experience and wouldn't mind coming again.  The food portions were generous and prices are reasonable.  PS: everything is ala carte for dinner.  white/brown rice $1.50 and sticky rice is $2.50", "Date": "2012-12-05", "Author_Location": "Honolulu, HI"}, {"Author": "Val Y.", "ReviewID": "D5qc37sL-w07NPNlGQaEDw", "Overall": "4.0", "Content": "October 24th, 2012 in my Yelp Message BoxLori I. - \"Are you free for lunch this week?  Thursday or Friday?\"Me - \"How about tomorrow at 12:00?  Just name the place.\"Lori I. - \"Thai House at Market City next to Foodland. See you tomorrow, Thursday at noon. They have great lunch specials.\"Me - \"OK!  See you tomorrow at Thai House ... 12:00.\"I start thinking:  Now why in the world does Lori want to have lunch?  OH NO!  I hope she's not selling Amway!!OMG!  I hope she didn't become a Jehovah's Witness and hands me a Watchtower when I see her!!Damn!  This better not be a New Hope recruitment lunch.  I hope I'm not eating with Pastor Wayne!  I'M BUDDHIST!!  I've had a good life!  I accept that I may be going to hell!!October 25th, 2012 in my Yelp Message BoxLori I. - \"Today Val...it's TODAY at noon, in 4 hours...I'm starving already, I might have to start without you if you're late...\"I'm thinking ...she sounds like the Lori I know.  That girl can pack the food away!!I get there about ten minutes to 12:00 and I can't find Thai House.  There's a Thai restaurant called \"Thai Issan Cuisine\" to the right of the Foodland entrance.  Maybe Thai House is on the Koko Head side of Foodland....no!  I walk back and then wait in front of Thai Issan Cuisine.Hey!  I see my buddy Vince B.!  What is he doing here?Vince B.:  \"Happy Birthday Val!!!\"Me:  \"Happy Birthday!!\"  Well surprise!  Surprise!!  Well at least this is not a religion thing and I can keep on sinning!!Vince and I go inside and wait for Lori.  Apparently the restaurant has changed its name.  Not sure but I think their is a new owner.We ask the receptionist if we can sit down.Owner:  \"Do you have reservations?\"Me:  \"Huh!  Reservations for Lori!!\"Owner:  \"Over there!  The table for six!\"Table for six!!  I start worrying again.  Oh no!  I'm having lunch with Pastor Wayne and before I leave I'll be saying ....\"Hallelujah!  Forgive me Father for all my sins!\"Lori walks in:  \"Happy Birthday Val!!\" ...she give me a lei!Lori is so thoughtful!  Lori knew I loved Thai food.  She and I had a memorable experience at Sala Thai and Chiang Mai last year.  That was the first time I met her.yelp.com/biz/chiang-mai-…Terry K. showed up:  \"Happy Birthday Val!!\"Jerrene T. showed up:  \"Happy Birthday dad!!\"Lary C. showed up:  \"Happy Birthday Val!!\"I was surprised and happy to see them all.  I wanted to stand up and do Psy's Gangnam Style!!youtu.be/9bZkp7q19f0I ordered the Evil Princess lunch special.  Everyone but Vince ordered the $9.95 lunch special.  The Thai food was to Thai for!  The restaurant was very Thai-dee.  The service like at a black Thai affair.I think the Evil Princess lunch special is a bargain.  You get a lot of great tasting Thai food for the price.The Thai-ming of this review is abit off but I just had to write a review to thank Lori, Terry, Jerrene, Lary and Vince for this surprise birthday lunch.I really have to go back to Thai Issan Cuisine again so that I can write a review specifically about the restaurant.  But in the mean Thai-mm....Thank you Lori I. for introducing me to Thai Issan Cuisine and organizing this surprise b-day lunch for me.  It was very thoughtful of all of you; and it was a Thai-tanic celebration for me.", "Date": "2012-11-01", "Author_Location": "Honolulu, HI"}, {"Author": "Kyle H.", "ReviewID": "OWeJ-tNf_SlXhtqfAG_uKg", "Overall": "5.0", "Content": "I am the type that needs to see, taste, feel, touch to believe.  I have finally confirmed that yes, Thai Issan's offerings are the same and just as good as when they were named Thai House.  Whew!  After drooling over all of the beef pad see ew pics, I broke away from my usual go-to dishes (pork pad thai and tom yum soup) and gave it a try... Definitely my new favorite!  Thai Issan has some of the most flavorful and consistently delicious Thai food.  It is a tad pricier than my usual quickie cheap go-to Thai (Bangkok Chef) but the difference in quality definitely makes up for it here.  Their lunch specials remain the same as it was prior to their name change, excellent place for a work lunch and for dinner - byob!", "Date": "2012-11-20", "Author_Location": "Honolulu, HI"}, {"Author": "Jhoren C.", "ReviewID": "KnmssjuM0dHh586wAJ6yJA", "Overall": "4.0", "Content": "This place is just as good as Champa Thai. My other Thai restaurant I love to eat at and it's close to home. The plus side is that they aren't like most Thai restaurants that open for lunch during a certain time and re-open for dinner. They are open until closing time!Oh and it's BYOB! First timers I recommend:Curry: Chicken panang or evil princess curry (w/ sticky rice)Noodle dish: Chicken or tofu pad ThaiTom yum soupAppetizers: Papaya salad, chicken stuffed wings, spring rolls and satehMain entree: Pad ped seafoodChicken Larb (ask for no cilantro and green onions if you are like me and don't like them on any of your dishes) Rad nar - beef", "Date": "2013-04-18", "Author_Location": "Honolulu, HI"}, {"Author": "Annie W.", "ReviewID": "zZad9jZJVEV8-Lby9Xfo0g", "Overall": "5.0", "Content": "At first I was not sure if I should give this place a 5/5 rating, but then I thought about the food I had tonight and I said \"yup, thats 5 stars!\". Ambiance & Cleanliness:This restaurant is small, quaint, and quiet; it really has an intimate type of atmosphere, but not really a lovers type of intimacy.... The lights were not too bright but bright enough to see your food and friends.The walls were decorated with (I believe) Thai paintings and some plants -- they really give the place a nice touch. The restaurant is very clean. I did not find any sticky grim on the condiment jars and my utensils, plates and cups were spotless.Food & Prices:We ordered (and I recommend) the following:1. Spring Rolls ~$6.952. Pad Thai ~$103. Yellow Curry ~$8.954. Evil Princess5. Ginger Pork ~$96. King of Chili 7. Thai Iced Tea $2Well, usually this is the part of the review where I would say \"lets start the critique!\", but there's nothing I can say! The food is SOOO good that its difficult for me to say anything needs improvement, and honestly, I am lying in bed right now trying really hard to think of something! I have had Thai food countless times before, and I have never had Thai food this good before! Koodos to the chef! I am definitely going back next weekend!NOTE: The above dishes are a la carte. You have to order the rice separately. The food was priced very well. Everything that I ordered was either under or slightly above $10/ dish. The prices I have above are approximate prices because I don't remember what the actual price was.Service:My first interaction with an employee was at the door. There was man who was at the door when we were about to enter...I think he was going to do something outside, but he dropped what he was going to do and opened the door for us, greeted us and brought us to our table. I don't think he is a host or anything...he was just at the door when I arrived.Once we were seated, the man brought us the menu and cups right away, and the waitress brought us water right away. I only saw one waitress. She is friendly and we did not have any issues with her. However, I think that because she is the only waitress, it took a little longer for some of our dishes to be cleared (but that's understandable since the food is SOOO delicious).Parking:There is a free parking in Market City, however,it can get quite busy around dinner time; we were there around 6:30 - 7:30 ish..I don't think you need to be there at any particular time to easily find parking; it only took me around 5 minutes or so to find parking in the parking lot.", "Date": "2012-11-18", "Author_Location": "Honolulu, HI"}, {"Author": "Anita C.", "ReviewID": "IlN0PPdueCZlw84y6esPoQ", "Overall": "1.0", "Content": "I grabbed lunch to go yesterday and I probably should have just stuck to plan A, eat at home.I ordered yellow chicken curry with sticky rice and beef pad thai which came out to be almost $22.  The pad thai was bland, there was hardly any sauce, the beef was overcooked and dried, and there was no crushed peanuts.  The yellow curry was a lot tastier however there was hardly any chicken.  There was a ratio of five onion slices to a small piece of chicken.What a disappointment.", "Date": "2013-01-24", "Author_Location": "Honolulu, HI"}, {"Author": "Kimo S.", "ReviewID": "s06A-uxt4lWpR8sAKf0XoQ", "Overall": "5.0", "Content": "Thai House, Thai Issen Cuisine... whatever you're called now, we're still big fans of yours!  Your pad thai is still one of my favorites and it always hits the spot, sticky rice + green curry is just another staple of our meals and is a crowd pleaser as well.The hardest part for us is squeezing in another item to try because whenever we come here we always have our cravings for what we know is a solid meal plan.Truth be told, their fish cake dish is still an excellent appetizer and the sampler plate is a great way to add variety while still focusing on the entrees you desire.You're at the top of the list Thai Issen, keep it up!", "Date": "2012-11-19", "Author_Location": "Honolulu, HI"}, {"Author": "Ha N.", "ReviewID": "Lfiod7NvzoRuC_-xnJst2w", "Overall": "4.0", "Content": "Holy c, the King of Chillies thai loco moco thing.I'm a seasoned thai restaurant eater, but this thing.... I've never had anywhere else. It's like a thai version of a loco moco, but without a pattie.  In its absence are pieces of meat, chopped super tinily, kind of like ground meat or larb.And a freaking egg.And onions. And the works.Doesn't taste totally unhealthy. At all... I get it with pork.TAKE IT OUT AND ENJOY THAT B!!Great place for lunch.The tomyum and papaya salad however is average at best.", "Date": "2012-11-20", "Author_Location": "Honolulu, HI"}, {"Author": "Janet K.", "ReviewID": "VReMY6sCY5h5OWyY2l3jEQ", "Overall": "2.0", "Content": "2.5 starsIf you order take out, you might wanna check your order before you leave. Just saying.We ordered the panang curry with chicken and the eggplant with beef. We went home all excited to find eggplant with NO BEEF! WTH!?! What a jip! I mean, maybe it was a mistake? There's no dish with just eggplant though. It would at least have tofu. Did the chef just forget to add the protein? Panang curry was good but they were stingy with the chicken too. Overall, the flavors were there but I'm not sure it was enough to make up for the missing and barely there protein. There are many other Thai restaurants in Hawaii with similar pricing that don't jip you.", "Date": "2013-02-13", "Author_Location": "Honolulu, HI"}, {"Author": "Jose M.", "ReviewID": "lNdFyVdnfnv1fYHNCY0EiQ", "Overall": "5.0", "Content": "My favorite spot to eat really good Thai food is here. You must have the Fried Chicken, Summer Rolls, Sticky Rice and Kao Pink Soup. All that with Thai Tea without milk and some lime. The best Fried Chicken I've ever had in my life... That takes a lot for me to say!", "Date": "2013-10-11", "Author_Location": "Pago Pago, American Samoa"}, {"Author": "Asia N.", "ReviewID": "6245YmuXt1Taivtv9NpwQQ", "Overall": "4.0", "Content": "I love this place! My favorite Thai restaurant. I always came here for papaya salad Lao style and the pad Thai. Love the sticky rice with coconut&mango dessert but they dnt always have it :(", "Date": "2013-12-17", "Author_Location": "Waikiki, Honolulu, HI"}, {"Author": "Thaila K.", "ReviewID": "TbttVCJdgUhMONeIkhAsng", "Overall": "4.0", "Content": "Rating on the take-out food and service. Only been here once for take-out...day before Thanksgiving 2012. Not sure what the place is called...this or Thai House (there were menus for both).My girls and I went to Foodland to grab some last minute stuff for Thanksgiving (the next day). I was tired and didn't wanna cook and saw the neon sign in the window and decided on doing a take-out. Friendly greetings, quick order-taking. The lady was personable and threw in a free spring roll. Ordered spring rolls, pad thai, seafood mixed vegitables and shrimp fried rice. Our order came within minutes.Took the food home and holy mint leaves Batman, the amount of food was overly generous to say the least. Darn...it was like my maka was bigger than my opu...too much for the three of us, had fried rice and pad thai for 2 more days (pretty nice when reheating Thanksgiving left-overs). The food was yummers. Would go back again and try eating there.", "Date": "2012-11-25", "Author_Location": "Honolulu, HI"}, {"Author": "T L.", "ReviewID": "I7l3ZMW9a3vOzAScIpJamw", "Overall": "3.0", "Content": "Don't come here if you expect good service all the time. Great food, but service pretty much sucks.I came in around evening time and there were no customers.The waitress/cashier wasn't exactly friendly. We finished deciding and it took a while for her to realize that we were done so she should come take our order. When she did come, there was no smile, no questions, nothing - she simply walked up and looked at us. My friend ordered for both of us and then she said \"Okay\" and then went off to tell the cook. When our food arrived, I said thank you and she actually said \"You're welcome.\" Amazing.Everything was going fine until our water was almost gone. We ordered two things - veggie spring rolls and pad thai. They didn't come at the same time so it's not like we were there for a short while. But our water was getting lower and lower and my friend actually finished his ice too. I took my cup and placed it near the edge of the table, took his cup and put it next to mines at the edge of the table. KEEP IN MIND THAT WE WERE STILL THE ONLY CUSTOMERS THERE! My water ended up being gone too. When we almost finished our food, a family came in and everything went normal. She filled up their cups of water(sitting two tables away) and seemed to have FORGOTTEN about us???? UM?I was talking at a normal volume telling my friend about how THIRSTY I was and how I WISH I HAD SOME WATER. Being that there was no one in there except for the family that just came in (they were pretty quiet), it wasn't that hard to notice me complaining. Every time I glanced at her, she was ALWAYS on her phone. Always. Every time.I am a girl who ALWAYS needs her water when eating!!! If I can't even get my water refilled without asking when there's basically only two customers on one table in your entire restaurant, you need to be fired. I hope to never encounter the same waitress with the same attitude or else she won't be getting a pleasant attitude from me!", "Date": "2012-11-25", "Author_Location": "Honolulu, HI"}, {"Author": "Inga S.", "ReviewID": "M99ZYAQN2i50xE_VCTsoPw", "Overall": "3.0", "Content": "The highlight of my meal? The waitress was super friendly, the sticky rice (nice portion)  and the thai iced coffee.I ordered the papaya salad in mild...it was spicy and lacklusterI ordered the fried chicken...and kept searching for the chicken. A lot of fried..batter...a lot of bones..but CHICKEN...WHERE WERT THOU?!My boyfriend's mom and boyfriend had the shrimp pad thai and said it was VERY good. I didn't try it so I couldn't speak on their behalf, but I trust my boyfriend's taste buds. He ordered the Evil Princess and gave it a 3 star, not the best, a little lackluster but nothing to complain about.I think I'll go to a different thai place but perhaps it's worth checking out if you get the pad thai.", "Date": "2012-11-25", "Author_Location": "Manhattan, NY"}, {"Author": "Ashley Y.", "ReviewID": "Dv3uFxT6Y5BHTunR21vjQg", "Overall": "3.0", "Content": "I like the food. Really, the pad thai is GOOD. And the summer rolls were very fresh! But the parking is kind of a pain, and the service isn't great. I'll definitely come back, but just for takeout.", "Date": "2013-11-11", "Author_Location": "Honolulu, HI"}, {"Author": "brenda m.", "ReviewID": "NVinLpMRyQg5juhozriFpw", "Overall": "4.0", "Content": "The service is so bad it's comical. We called to confirm it was open, and we got a yup followed by a click. When we walked in same craptastic service but the food is so good ill deal with it. The fried calamari is the best! No cheap pre frozen rings here. It was actually steak bits of calamari fried in deliciousness. The main dishes were also flavorful. I think the waitress just doesn't like being there but she wasn't that rude. So if service is a big deal to you don't go and just get to food for takeout but try it, it's delicious. Close to what we got in Thailand. Yum yum. It's located right next to the food land so BYOB.", "Date": "2013-08-25", "Author_Location": "Washington, DC"}, {"Author": "Cammie T.", "ReviewID": "uf7cZUaOn4fDot6ePbrRiA", "Overall": "5.0", "Content": "This place is one of my favorites for Thai food. The food is flavorful and delicious.  A word of warning they get really crowded for lunch so service may be a bit slow. Papaya salad is ono and the druken nooodles are a must! My fiance loves the fried chicken and panang curry.", "Date": "2013-12-08", "Author_Location": "Honolulu, HI"}, {"Author": "Aaron W.", "ReviewID": "gUbV9uyn7b7utoYHk0SVBA", "Overall": "5.0", "Content": "You must get the drunken noodles & Tom kha soup! Pad Thai & green curry are also great. Best Thai on the island & at a great price.", "Date": "2013-11-28", "Author_Location": "Rancho Cordova, CA"}, {"Author": "Kelly G.", "ReviewID": "4XPt0zvN6c5f8ERq3la1Gg", "Overall": "4.0", "Content": "Thai Issan is my new \"go to\" Thai place since Mekong closed ... It is a cute place to dine in and a even better place to take out .... They open at 10 am and stay open through lunch and dinner till 9:30 pm. I have never had a bad dish yet and appreciate that they honor my \" Thai hot\" request ;).... The owner is sweet and shared that she learned her Thai cooking from Keo back in the Kapahulu days... Very cool !", "Date": "2013-05-07", "Author_Location": "Honolulu, HI"}, {"Author": "Keith H.", "ReviewID": "5rmJ5ksx9b5YymedhC3cGQ", "Overall": "4.0", "Content": "So my GF finds a coupon for Thai Issan Cuisine in Market City (20% off!) and wants to go. Right away I could feel the heat receptors in my tongue yelling at me, \"Haven't you tortured us enough already?\" As it turned out, though, neither of us had really been to a Thai restaurant. (I had had some experience from the Thai place at Ala Moana, but stuck to safe stuff like satay.) And what attracted her initially was the fact that they offered lunch specials.Unfortunately, no lunch specials for us (they're Monday to Friday only; we went on a Sunday), but we still got a chance to sample their cuisine. We shared an order of chili fried rice and a yellow curry with chicken. Actually, it turned out to be a pretty good combination. The coconut milk in the yellow curry mellowed out the heat from the curry, while eating it together with the chili fried rice gave it a nice punch. We both liked it.Service was okay, and the water flowed freely from pitcher to cup, really a godsend when eating spicy stuff.All in all, a really good experience there at Thai Issan, and a good introduction to Thai food. Perhaps we may find ourselves back one day.", "Date": "2013-02-01", "Author_Location": "Kailua, HI"}, {"Author": "Juju B.", "ReviewID": "5EJwpHJVsBMdGnWrLt3X3w", "Overall": "5.0", "Content": "My boyfriend and I visited Hawaii recently. Unlike other tourists, we wanted to get away from Honolulu/Wakiki Beach and the touristy spots to try some local places and experience the Oahu lifestyle on a much more personal level. Being a tourist can be a little fake, so we jumped on Yelp in search of an authentic Thai restaurant outside of the immediate city. We tried Thai Herb Kitchen first, but they were closed on Sunday (Honolulu Festival day, go figure). We said to each other, \"Whatevs, let's find another place.\" That's when we came across Thai Issan Cuisine.  This place had some amazing reviews, so we decided to go with it and give it a shot. Well, I can guarantee that the reviews don't lie, THIS PLACE IS FREAKING AMAZING!!!!!!!!!!!!!!!!!! It has a local  or a \"small hole in the wall\" atmosphere; from the moment I stepped into this place, I was smacked with wonderful smells, friendly personalities, and bustling energy. My boyfriend and I took a seat and had a waitress help us out in a prompt fashion. Within 10 minutes of ordering, we got our food. OMG IT WAS SOOOO GOOD. We ordered Drunken Noodles and a Curry dish. We ate everything and enjoyed every bite. The food was satisfying, didn't leave me with an upset stomach or anything. Flavors were delicious. The only thing that bothered us AT FIRST- BUT WAS IMMEDIATELY CORRECTED-  was the food not being spicy enough. My boyfriend and I are Thai Food connoisseurs, and we love SPICE. Most Thai food restaurant owners don't understand this, and when my boyfriend orders \"super Thai hot x10,\" most of the time no one believes his request and they don't make it that hot. There is good reason, no offense to anyone, but the normal White American person does NOT know a thing about Thai food, and cannot handle Thai spice. Most restaurant owners expect this level of ignorance, and I can't blame them for assuming that. Well, that is not the case with us. When we got our food and we noticed it wasn't hot enough, we talked to the waitress. My boyfriend and I explained to the waitress that we were crazy Americans who could handle Thai hot. She was ecstatic to hear this, hopped away, and told another waitress to bring us chili peppers. The other waitress brought us dried flakes and set it at our table. Our original waitress came back, tsk-tsked, and called the other waitress over and told her to bring us REAL chili peppers. They came back with REAL freshly cut Thai chilis. My boyfriend and I started eating them raw, then we put some in our food and continued to eat. OMG it was HEAVEN!! We were so happy, and they were so accommodating. This was the first time in FOREVER that someone took us seriously. I loved the way they treated us here. We have gone to other Thai places and have asked for Thai hot, they fail to deliver and don't even offer solutions. There has been so many times people don't take our requests seriously, and it is mildly offensive. The people at Thai Issan were awesome, helpful, and offered us FRESH peppers.   We talked to the owner, she was a lovely older woman with a warm personality. Totally a family owned place. Get out of the drone mentality, step out of the tourist comfort zone, drive a little out and GO HERE, it is TOTALLY WORTH IT! :-D If you love Thai food, get your butt over there NOW. If you are a legit Thai food lover and love THAI hot spice, go here, let them know, and they WILL make it hot like the fires of HADES!! woohoo!! Lastly, heat isn't the only thing that matters in making Thai food, it's favors, textures , etc. Keeping all of this in mind, their food is awesome. I love curry, and they make some bombtastic GREEN curry! :-)", "Date": "2014-03-13", "Author_Location": "Harbor City, CA"}, {"Author": "Sunhee K.", "ReviewID": "y_i4mVJl3KSJcCE-4yTJog", "Overall": "3.0", "Content": "The first time I ever tried Thai food was when I was in Thailand. I had pad thai my first night there, and I even took a cooking class at a school in Chiang Mai. I loved the taste of the spices, and I couldn't believe all the different varieties of curry.I think Thai Issan Cuisine has a lovely selection of Thai food. However, I don't think it's great - just good. For one, I was disappointed to see oil dripping from my pad thai. I know that oil is a necessary ingredient, but it was a bit excessive here. My friend and I wanted shrimp with it, and we were kind of disappointed to see just 6 (small) pieces. The yellow curry we had was absolutely delicious, but the chicken portions in the curry were a bit measly as well. I like meat! Another thing was that after our waitress brought out our dishes, she never came back. We had to get up to ask for our check...and it wasn't like she was busy either, because we were the only ones there! No water refills too :(The prices were good, but I felt like there needed be 1) less oil, 2) more meat, and 3) better service. The yellow curry and rice were excellent, so I'll probably be back again, but not anytime soon.", "Date": "2013-02-03", "Author_Location": "Honolulu, HI"}, {"Author": "Mike Q.", "ReviewID": "jWst-oZUV7VtOXFnETlo3A", "Overall": "3.0", "Content": "Solid pad Thai and the Panang curry was ok.Service was ok.Always a good amount of people there when I go shopping at food land but I went an hour before we closed and it was not busy at allBeen to several other Thai restaurants on the island and this place was ok.", "Date": "2012-12-23", "Author_Location": "Honolulu, HI"}, {"Author": "Anon Y.", "ReviewID": "_J4a4214vY1Sv_mdk8X2pw", "Overall": "1.0", "Content": "If this is the place in Market City by Foodland, AVOID THIS PLACE LIKE THE BIRD FLU. Seriously my whole family got sick from this crazy place.The service was pretty bad, but that didnt really bother me. But I ordered garlic vegetables, now how hard is that? It was more like sodium soup. The name on the menu didnt match the name of the restaurant, and seeing as the server didnt know any of the numbers in the menu, my guess is they boosted the menus from some other thai restaurant!", "Date": "2013-09-12", "Author_Location": "Honolulu, HI"}, {"Author": "Anthony P.", "ReviewID": "2FklmVCUp-78q4__1Y0XIw", "Overall": "1.0", "Content": "I don't understand why this restaurant receives decent reviews. The service my girlfriend and I received was horrible! We sat down and one minute later were asked if we were ready to order. The waitress was obviously not interested in being there. She tossed our chopsticks on the table, didn't even crack a smile or make us feel welcomed. Her only redeeming quality was that she served us a lot of water. I think she would have preferred if we never came at all. The food was ok, however, it is not worth the crappy atmosphere. We couldn't wait to leave!", "Date": "2013-08-18", "Author_Location": "Honolulu, HI"}, {"Author": "Trevor T.", "ReviewID": "Zz6jwFB0UExaDvlTCg4c5g", "Overall": "3.0", "Content": "good sized portions, decent food, and fair pricing, but found the service \"meh\" at best.the pad sieew (sp???) was decent and the red curry was also fairly good, but nothing special. ended up coming here because it was the only thai place open on a sunday early-afternoon. i'd come back if craving thai and no one else was open, but this place isn't A-team.", "Date": "2013-06-23", "Author_Location": "Honolulu, HI"}, {"Author": "Dale H.", "ReviewID": "G-8OLzFDW11LrVs5JD4wuw", "Overall": "5.0", "Content": "Service was a little lacking but there was only one person in front and one cook in back. The food was so flavorful that it made the wait worth it.", "Date": "2013-05-31", "Author_Location": "Ewa Beach, HI"}, {"Author": "Mei-Lan C.", "ReviewID": "NBKWCX-H_n2rsU3DItzuAA", "Overall": "4.0", "Content": "bought a half of coupon for this place.ordered the thai house combination platter ( 13.95 $ ) , long rice salad with seafood ( 11.25 $ )  and pad gar pao ( 8.95 $ ) .the portions were generous and the food very tasty. the seasoning were right on the spot . will come here again to try more items.", "Date": "2013-01-15", "Author_Location": "Honolulu, HI"}, {"Author": "Brittni F.", "ReviewID": "E6rtLB1IgZcKa2SjK78V_w", "Overall": "3.0", "Content": "Pretty good Thai food.", "Date": "2013-05-20", "Author_Location": "Honolulu, HI"}, {"Author": "Lei D.", "ReviewID": "Iz8WpQbDUJl-7qQmZPMvHg", "Overall": "1.0", "Content": "My friend and I came out to this place a few months after their grand opening. The empty dinning room allured us to buy something for lunch to help support the new business in the area. First experience: the food was awesome. We ordered take out \"lunch special of the day\".. Includes 2 pieces of fried chicken, a hefty salad, choice of curry,  rice or sticky rice and 1 canned drink. The portion fed the both of us well and left us stuffed. Good first experience. Then we went again and again few more times soon after. Now today, 2013. the restaurant gained momentum and had quite a few dine in customers during lunch. Looks like business is going well. After my take out experience today.. Well you ain't seeing me Here again..heck NO! So, I got the take out order for the \"lunch special\" again. From past experiences, I expected the same portions. BUT THIS TIME, the 2 pieces of fried chicken turned out to be, \"1/2 piece\". They gave me FRIED CHICKEN \"SKIN\" and a piece of BONE WITH SOME MEAT on it...WHAT THE HELL!! I know I didn't come here to spend $10.00 for that! The salad was down sized, and the green curry was just okay, Not great. I also ordred a side sticky rice. The lady who took my order, scooped the sticky rice into the container, then used her bare hands in front of us to stove the rice into the container to force close it... Yea yea.. i know, many places do that, behind closed doors.. but not in front of the paying customer! thats really gross. its gross because she first took my payment, then immediately made the sticky rice. She did'nt wash her hands or anything. Well anyways. i guess she was having a bad day or something because it seemed like she didnt care for my business.. or money..TIP: Don't order the lunch special for take out! Because you'll be surprised when opening up that container. Not worth $10.00Such a waste of my money.. BTW.. as u stream thru the photos, you'll see the chicken skin picture.", "Date": "2013-02-12", "Author_Location": "Ewa Beach, HI"}, {"Author": "Lynn T.", "ReviewID": "1pA-tthA_oJM5TYfA0HChg", "Overall": "5.0", "Content": "Thai House's owners recently changed the restaurant's name to Thai Issan Cuisine. Same chefs and same good food. My experience at this place has been nothing short of spectacular. It's not fair to judge the food on whether or not the place looks busy. Unfortunately, I have to agree that business is quite slow, but that's how my love affair with Thai Issan Cuisine began. The first time I decided to try it out, there was only one person eating there. To be honest, I was a bit worried about the food, but I was in a rush and was hoping if there wasn't anyone else to feed, they'd work quickly for me. What a pleasant surprise! I haven't enjoyed another Thai restaurant as much since. After this place proved me wrong and impressed me so much, I'll be thinking twice before I turn my back on a restaurant for not being busy - because that does NOT mean the food is bad. It could just mean people are misinformed, may even be afraid to try something out of the norm, and/or  Thai Issan Cuisine chefs had an off day (we've all had those). This is authentic Thai food, people. Also, it's likely that the more traditional dishes may be different than what you're used to. I find a lot of Thai restaurants have gone local. Not here. And if you ask for hot, you'll be crying.. AND smiling at the same time. They don't mess around.  What's also different is they do not do plate lunches like everyone else. However, that is not a problem for me because I love to try a variety of things all at once and I have yet to come across a plate lunch big enough to fit everything I could possibly want to satisfy the foodie in me. They have daily specials which include rice, different curries, and fried chicken though. So yes, you'd normally have to order rice (available sticky or regular) separately if you're not getting the special. The prices stay true to the other Thai restaurants I've gone to. Not incredibly cheap, but not ridiculously expensive. The portions and quality is just right for the price. I have never felt cheated here. At Thai Issan Cuisine, the food gets to you quickly, servers regularly check up on you for water or just to see how you're doing, and always asks how you want the dish (mild, medium, or spicy) when taking your order. You can have almost everything spicy or not as long as you make sure to say so.I have my favorites here and have never been disappointed by the:- Pad See Ew (had it in chicken and beef - loved both)- House Fried Chicken (LOVE this)- Stuffed Chicken Wings (had a lot of different stuffed wings in my day - best so far)- Larb (beef is what I usually get, but pork is just as enjoyable)- Green Papaya Salad (Lao style is VERY spicy; more so than Vietnamese style)- Tom Yum (had the tofu version - winner)- Green curry with chicken (I put this in general terms because their curries are just awesome)- Spicy clams (the sauce is made of Heaven - drizzled it on other dishes because I just couldn't get enough)Don't write this place off! You'd be missing out!", "Date": "2012-11-04", "Author_Location": "Honolulu, HI"}, {"Author": "Tyler G.", "ReviewID": "2GAP2hLsx2uKuaRLlKgC3g", "Overall": "5.0", "Content": "We had a wondeerful meal. Bought a Hot Deals Hawaii Certificate. We started with the stuffed Thai Chicken Wings, They have a wonderful $10 lunch soecial and we both had the Panang Curry. The lunch soecial comes with House fried chicken, rice, salad, drink. Food is fresh, hot and excellent value.  We both got Thai iced teas.", "Date": "2012-11-28", "Author_Location": "Honolulu, HI"}, {"Author": "AlexCourtney V.", "ReviewID": "pMYThjS_9A_1hUAkSCXkcA", "Overall": "5.0", "Content": "Bomb ass food! Must try. Everyone tries the pad thai when they go to thai places. This place makes it the best. I have also enjoyed many of their currys. Chicken is Ono as well!", "Date": "2013-12-19", "Author_Location": "Honolulu, HI"}, {"Author": "Runbkk F.", "ReviewID": "625PB-CeN8qA_79c_QCveg", "Overall": "4.0", "Content": "Great tasting Pad Ga Pau Moo!  Just stopped in for a quick lunch before back to work.  Great!", "Date": "2013-01-22", "Author_Location": "Honolulu, HI"}, {"Author": "J Y.", "ReviewID": "qqmwHFveEW1cFf1DhlraqQ", "Overall": "5.0", "Content": "Ever since the food truck, OMG the Panang, OMG the Panang, OMG. Yes.", "Date": "2013-06-23", "Author_Location": "Honolulu, HI"}, {"Author": "Donna G.", "ReviewID": "4Saw9vPqMN4egGcvneIM6Q", "Overall": "5.0", "Content": "My favorite Thai Restaurant!  The food and service at this restaurant is excellent!  I am a vegetarian and there are vegetarian options, however, they will substitute practically anything on menu with tofu instead.  The owner is very attentive and accommodating.  I make it a point to eat lunch there once a week.  This week 4 of my collegues and I went to Thai Issan to celebrate a birthday.  WOW!!  We were blown away by the delicious food and stellar service.", "Date": "2012-11-10", "Author_Location": "Aiea, HI"}, {"Author": "Judy S.", "ReviewID": "Ce80zBtYGJzo-h5K31l_1g", "Overall": "3.0", "Content": "cute little place in the Foodland lot.  we ordered Panang Curry w/ chicken, it was delicious!  we're used to chicken breast but they use dark meat but the curry was very tasty.  the spring rolls were ok but the calamari was not.  it was so bready that that's all you can taste!  too bad!  the clams was really fresh & yummy.  the only real complaint I have is that they charge you $1.50 for rice, usually you get this free when you order curry!", "Date": "2013-02-16", "Author_Location": "Oceanside, CA"}, {"Author": "Eve P.", "ReviewID": "Poa2z97xlvhnfgfZf_Z8qQ", "Overall": "4.0", "Content": "I'm so glad I tried this place. Now I don't have to go all the way to Phuket Thai Ward ( very crowded and noisy) or Phuket Thai McCully ( horrible parking situation). I think this place is cheaper than Phuket Thai by $2-3 per entree!.  The evil princess  is the best I\"ve had and red curry is delicious as well. The house fried chicken is soo tasty! .They have a good green papaya salad as well I didn't give a 5 star because it's located in Market City nightmare and I had the  Pad Thai and the chicken wings and they were okay. I can't wait to come back to try everything else!", "Date": "2013-04-18", "Author_Location": "Honolulu, HI"}], "RestaurantInfo": {"RestaurantID": "_Kab0qoeMjRX3O3HakOy3g", "Name": "Thai Issan Cuisine", "Price": "$$", "RestaurantURL": "/biz/thai-issan-cuisine-honolulu", "Longitude": " -157.8150264999999", "Address": "2919 Kapiolani BlvdHonolulu, HI 96826", "Latitude": " 21.288274099999999", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/5wZ_thwobgh9XCp2-5OshQ/90s.jpg"}}