{"Reviews": [{"Author": "Lawrence P.", "ReviewID": "fuu4XqzLJFxNQB5faxFgGA", "Overall": "5.0", "Content": "Thai Spice how I love thee!!! We've been there multiple times.The first thing you notice about this place is how packed it gets.  There is literally nowhere to wait for your table. The bar gets jammed packed.  It's almost impossible to get a drink while there given the amount of people eating at the bar and/or waiting for a table and/or drink.  You will also wait for a table well beyond your reservation time. Some times weeeeeeell beyond!!!!So why the 5 stars?!?!?!  Because once you get through the fact that the parking lot is so tight it was made for people who drive yugo's (they do have valet thankfully!),  and once you get through waiting way past your reservation in a small tight area with nowhere to go, you will experience a meal to remember.I love this place's food!!! We had it all.  From the Bangkok Rolls to the Coconut Shrimp to the Chilean Sea Bass to the Lobster Pad Thai to the Ribeye to the Seafood Medley Soup to the Special Fried Rice to the White Chocolate Cheesecake to the Coconut Fried Ice Cream to the Chocolate Peanut Butter Mousse to the... you get the idea!!!!  And it was ALL so good!!!So be ready to be somewhat annoyed at first as this place is packed weekdays and weekends.  But get through it because once you are seated, it's on!!!!!!!  (PS: As if I needed a reason to go back, their corkage fee is only $15 so bring your wine and enjoy!!!)", "Date": "2014-06-11", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Sean M.", "ReviewID": "2nlQsRBDC7Q-RGbk0voR8g", "Overall": "2.0", "Content": "\"Way Overrated\"This place was an unpleasant surprise.One day I noticed Danielle B and Limuel Yelp checked-in at Thai Spice. After reading the reviews, I was generally impressed, so I decided to try it out. Once entering Thai Spice, I  immediately realized the interior was unbecoming of the restaurants location, it was quite alluring. I was greeted by romantic mellow lighting and the pleasant sound of live piano music. There was also a couple of large salt water fish tanks filled with moving bright colors of life.But that is where the pleasantries ended...Perusing the menu I could not help but notice everything was grossly overpriced, even for this enticing place.I ended up ordering  the Lobster Pad Thai ($26) bit.ly/Opzyh9 and an order of Thai Spring rolls ($5.50) bit.ly/1gBHx1r .The Lobster pad thai was served with a very small lobster tail, a scant amount of noodles and very little vegetables. The Thai spicyness was missing, the dish was blandish and the noodles were oily. STAR RATING 3.0The Thai Spring rolls were average at best, there was nothing impressive about the appearance, taste nor texture. STAR RATING 3.0The service was decent, but nothing to be dancing about. STAR RATING 3.5The live entertainment was impressive. I was familiar with the young lady singing & playing the piano from a previous Yelp Elite event. She is angelic! STAR RATING 4.5-SUMMARYFood ~3 STARSAmbiance ~4 STARSPrices ~1 STAREntertainment ~4 STARSService ~3.5 STARSTo me the food is not worth any price, much less the price they are asking for. Basically you are paying for the entertainment and the ambiance, which is not enough, you need good cuisine to match.", "Date": "2014-04-06", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Danielle B.", "ReviewID": "2azoER6hOXVfQR5ZwF-lDQ", "Overall": "2.0", "Content": "Apparently SoFlo Thai food and I are just not going to get along. Some things are just not meant to be, I suppose. Hate to go against the grain, but gotta share my experience.Now when you enter Thai Spice, it has a lot of promise. A dimly lit ambience that kinda makes you feel you're underground somewhere. There was live entertainment, a lovely lady on the piano. Incidentally, I have seen this pianist before so that was a pleasant surprise. As I take a look at the menu, I see all the familiar Thai dishes that I often crave. But then I get a not so pleasant surprise when I see that pad thai is $17, chicken curry is $17, any seafood dish is $20+...... what freaking alternate universe of fancy schmancy arm and a leg (and maybe even a kidney) pricing is this?! If they charge these prices, they must be serving the best damn Thai food EVER.Hate to spoil the ending, but it wasn't the best damn Thai food. It was pretty darn average. The pad see ew had nicely cooked noodles with a tasty sauce and veggies. Not a bad dish (still not worth the price). Our other entree was the samrod chicken which was forgettable. We also had the tom yum goong (seafood hot and sour soup). A few spoonfuls in, I find a hair. Not just a hair, but a questionably curly hair. Why oh why. I'll pass on paying high prices for being served hair in my food. Thanks, but no thanks.", "Date": "2014-03-24", "Author_Location": "Hallandale Beach, FL"}, {"Author": "Natalie L.", "ReviewID": "Ec7diKr62NUpNU4WOZdfng", "Overall": "5.0", "Content": "A friend brought us here for dinner. I'd never tried Thai food and wowwwwwwwwwwwww. AMAZING. Pricey, but so worth it. Great ambiance. Great service. I've tried thai food elsewhere, after going here, and nothing holds a candle to this place. Can't wait to go back.", "Date": "2014-07-21", "Author_Location": "Hialeah, FL"}, {"Author": "TheGirlWho L.", "ReviewID": "dAiBJJfjEUeCwCXjIO3_mQ", "Overall": "5.0", "Content": "Don't be surprised by the location and the appearance from the outside. When you walk inside Thai Spice, it's another story. I originally heard many great things about this restaurant and there was a deal on Living Social, so that's why I tried it out. I went on a Saturday night for dinner with my boyfriend. There was live music in the bar area and the restaurant was busy. We were greeted by a friendly waitress who was very helpful with suggesting items to order. We started with the sesame chicken wings. These were the best chicken wings I've ever had. The waitress mentioned her uncle came up with the recipe. I ordered the skirt steak that came with bok choy and jasmine rice. It was a house speciality, so you could either a soup or a salad. My boyfriend ordered the three buddies that came with jasmine rice. His order was also a house speciality. When my skirt steak came to the table, I was shocked to see how huge the portion was. The presentation was also really nice. Overall - the waitress was really great, the service was really on point, and the food was really delicious. This is going to be one of my regular restaurants I dine at. I was highly impressed and can't believe I waited this long to try it out.", "Date": "2014-07-20", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Brandon S.", "ReviewID": "LtEvdEpcgNy4YUBXxc12oA", "Overall": "5.0", "Content": "Omg the best thai food ive had!!! The green curry beef amazig! The skirt steak perfection! The drinks incredible! The only thing that was on the downside was the hostesses. They were super friendly but took awhile to acknowledge me and seemed a little overwhelmed. I will def make this regular restaurant to eat and drink at. Really Really enjoyed the music and atmosphere. Will be back soon", "Date": "2014-07-04", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Renee R.", "ReviewID": "xUB4Z_Vf_D4rnsKmvuNPuQ", "Overall": "5.0", "Content": "My boyfriend took me to Thai Spice to celebrate my birthday last night.  This place is wonderful.  The entree was amazing and the deserts were delicious!  This is a great place for a romantic night.  I cannot wait to return!", "Date": "2014-06-28", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Madhu K.", "ReviewID": "uwh6kutYCIiPAGN1mm2JkA", "Overall": "5.0", "Content": "I visit Fort Lauderdale regularly for business and frequent local restaurants during my stay there. This is one of my favorite places to visit for my Thai fix. The place is located in a strip mall and there can be waiting during peak hours. I love the appetizers especially their steamed dumplings. Most of the items taste good and service is prompt and attentive.Looking forward to visit the place in my next trip!", "Date": "2014-07-11", "Author_Location": "Princeton Junction, NJ"}, {"Author": "Lisa B.", "ReviewID": "b3KTrMeXlfuklNg0mSUAMA", "Overall": "2.0", "Content": "Compared to other Thai restaurants I've tried, this one tasted the least authentic. The nam sod had a strange taste and was full of long pieces of ginger root that were about 1 cm thick. While I do love ginger, it was way too much. Speaking of way too much, the prices of everything other than the Thai iced tea were WAY too much. Between my husband and me, we had three Thai teas, two appetizers, two entrees, and two desserts -- the same amount of items we typically order at our local favorite Thai place in Rochester -- and it cost twice as much as at our local place! (Specifically, it cost almost $100!) Two final downsides: FREEZING air blasted down on our booth during most of the dinner, and the noise level was DEAFENING mostly due to a large, boisterous group we were next to and enhanced by other nearby diners trying to compete.", "Date": "2014-07-06", "Author_Location": "Rochester, NY"}, {"Author": "Maryann C.", "ReviewID": "8tO6EHacQa9doT4ltQSP1w", "Overall": "5.0", "Content": "Wow! We know the food is good because we been there for dinner many times.  they've opened up the bar section and they have happy hour! And it Is extremely happy with half-price drinks and delicious appetizers. Call calamari is to die for spicy and sweet and tender. There's so many delicious appetizers on the menu can't remember them all now but you need to go there for happy hour Monday through Friday 5-7? They also have music on Friday and it was great...", "Date": "2014-06-04", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Richard O.", "ReviewID": "Dn5pzy1pqqmGSV4L23ak5w", "Overall": "2.0", "Content": "I only went once, and a friend took me.  All I can say is he NEVER raves about  anyplace, lives very close to this restaurant, goes there all the time, and loves it.  He took me as a 'reward' for helping him with a huge house project.  I love Thai food; my brother's wife is from Singapore and her family owns restaurants there, so I feel like my trips to CA to eat Thai food under her direction were educational.  This place is OK, but overpriced.  The regular Pad Thai is better at Sushi Thai in Boca.  The Nam Sod is not good at all, and the other things I tasted were good but nothing special.  Others love this, so go and make up your own mind.  I assume, since my friend is a regular, that we got the best possible everything. I guess you should go and make up your own mind, but it is NOTHING like the Thai food in LA, I promise you, but they charge LA prices.  Like I wrote, go and make up your own mind.  Cheers!", "Date": "2014-06-04", "Author_Location": "Boca Raton, FL"}, {"Author": "Jan N.", "ReviewID": "Lj9zR1wSTxeAvkDt4PNQ0Q", "Overall": "5.0", "Content": "Bed Thai restaurant I've been too.  I over stuffed myself on the crispy curry puffs, the green curry, and the lobster pad Thai.  I couldn't stop eating.  My wife also enjoyed immensely!", "Date": "2014-07-11", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Chloe' M.", "ReviewID": "H5fnok0cBBNv1lGGMrLqUQ", "Overall": "5.0", "Content": "Best Thai food I've had. Service was very good and everyone was extremely nice! A little pricey though, but not too bad.", "Date": "2014-06-12", "Author_Location": "Jacksonville, FL"}, {"Author": "Rob G.", "ReviewID": "u19zQvjcqSa45eFq9b8tCA", "Overall": "5.0", "Content": "For those of you that know me, you know I dont give out 5 stars that often, however Thai Spice really does deserve it.  I have been coming here on and off for over 15 years.  I discovered this place  when working close by and almost wrote them off, however I am so glad I didnt.  This place has really transformed lately.  They have physically expanded the restaurant (again) and added a grill which allows them to increase their menu options.  Ive had some of the best meals of my life here and last night was no different.  We arrived around 10pm and the 2 of us were seated immediately.  It wasnt too busy, most likely due to our arrival time.  My wife started off with a glass of the house merlot, and I had \"The King\", which was a vodka martini with ginger and cucumber.  Im not usually into foofoo drinks, but I wanted something different.  It  was good and I enjoyed it.  We ordered the crispy calamari and two house salads.  We were taking our time, enjoying the time alone (with no kids), sipping our drinks. Calamari came out and was awesome.  Lightly breaded, crispy with a nice sweet chili sauce.  Shortly after our salads came out and the waiter was nice enough to bring us both the peanut and ginger dressing.  I didnt bother with the ginger because I love their peanut dressing.  Its not as thick as other thai places Ive been too, but it has really good flavor.  As I said we were taking out time, so the waiter kindly reminded us that the kitchen will be closing soon, so he wanted to make sure our orders got in.  We ordered shrimp pad thai and green curry w/ fried tofu.  I normally order the panaang or red, but i do like green too, which by default is much more spicier than the others.  We sat enjoying the scenery, there was a nice fish tank in front of us, so really we just enjoyed every non-rushed second.  We could hear the singing of a girl in the \"Buddha Lounge\" in the background which was nice.  The waiter was very attentive, he saw we needed refills.  I went with a Jack Daniels on the rocks, but when you know him as long as I do, you refer to him as John Daniels (thanks Al Pacino).  Wifey had another Merlot.  Shortly after our food came out.  Pad Thai was good.  Not dry at all, nice flavor, and the shrimp was cooked perfectly.  These were nice size shrimp, not the small ones for sure.  The green curry was also done just right.  Spicy but not too much, sauce was thick, tofu was crispy on the outside and soft and creamy on the inside.  I asked for a side of crushed peanuts and got a small bowl.  Definitely not skimpy.  I guess the benefits of eating slow and taking you time is you get full before you are done with your food and have plenty of awesome leftovers.  Yep, cant wait for it.  Overall experience was fantabulous.  Thai Spice never disappoints.  If you have never been here, you must try it.   They really take the time to make your dining experience one that you will remember.  Dinner can get pricey, so if you want to try them out and not spend a lot of money, they have great lunch specials with the same quality and great service/atmosphere.  A true gem in South Florida.  What are you waiting for?", "Date": "2014-02-09", "Author_Location": "Miami, FL"}, {"Author": "Kevin C.", "ReviewID": "zf7QSsUse0fmVWoBrU0aYg", "Overall": "3.0", "Content": "I've been driving by this place at least 6 months and finally got a chance to try it out one night.  Very romantic place with dark lighting and ambiance.  The Service is top notch!  We never had half a glass because the staff was always there to fill it up.  As always at a Thai restaurant I get the Curry Seafood plate.  And I always ask for the hottest spice which will always be \"Thai Spicy\".  It was hot and it did make me sweat however the favoring didn't quite make it to my standards.", "Date": "2014-03-13", "Author_Location": "Hollywood, FL"}, {"Author": "Maria G.", "ReviewID": "ZVLsSeIoPGU5G7hrPZTeiw", "Overall": "5.0", "Content": "I have been to Thai Spice several times.   I have always been pleased with the food. Love the grilled calamari  & shrimp with vegetables. My friend ordered the Penang Curry and loved it. The yuca cake was very good. It is pricey but worth it. Can't wait to go back.", "Date": "2014-07-08", "Author_Location": "Dania Beach, FL"}, {"Author": "Jennie J.", "ReviewID": "tIwwmDTEzkfuQB4lGA8MSw", "Overall": "5.0", "Content": "The reviews of Thai Spice did not lie, this place was great!  They have a small parking lot but also offer valet.  There's outside seating available but since it was raining we dined inside.  The fish tanks and various dining rooms create an intimate atmosphere which is great for a date!My date and I decided to try some of the fun martini's (my pick-lucky him ha ha) so I started us out with the Appletini- which was made with Fireball creating a Cinnamon Apple taste.  They were delicious, even for a guy who normally doesn't like fruity martini's he said it was \"manly\" enough for him with the Fireball Whisky.  I ordered the Pad Thai and my date had the Panang Chicken.  Both were absolutely delicious and very big portions!  I had looked on Yelp before coming (obviously) and saw that someone had posted a Lemon Drop Martini...it was not on the menu but I ordered it- thanks to my VIP Yelpers ;)  It was delicious...if you like the typical Lemon Drop Shot you will defintely love this martini!  It was very strong!Overall, great experience, great food and drinks!  Our waiter could have been a bit more attentive, I hate when I have to constantly ask for more water...that should be one of the easiest parts of your jobs but other than that it was great and I highly recommend!", "Date": "2014-02-13", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Sach M.", "ReviewID": "2b_HEKumch9-9dz2jSbcRA", "Overall": "4.0", "Content": "Great food and great service! The staff was so friendly and nice. Absolutely one of the best thai places to go to in the FLL area. Unfortunately, we went there on the last day of our trip but we would be back.", "Date": "2014-06-30", "Author_Location": "Chicago, IL"}, {"Author": "Night Ryder I.", "ReviewID": "R9Us282RrRc0lg74nuT4MQ", "Overall": "4.0", "Content": "Expensive but good food & large portions, very attentive wait staff. Absolutely loved the chicken rice soup. Tasty Crispy calamari appetizer. Cheesecake very good. Nice live music, intimate indoor & outdoor seating.  But why the bring the extra spoons with my dessert?? I didn't plan on sharing!! (jk, not really.)", "Date": "2014-05-27", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "narisa s.", "ReviewID": "RpmjfCo12bbr-KsiIsXCiQ", "Overall": "4.0", "Content": "Beautiful ambiance. Food portions were very generous.  Gets very dark at night difficult to see menu and each other. good dishes were.chicken with basil and beef with garlic", "Date": "2014-05-24", "Author_Location": "Boca Raton, FL"}, {"Author": "Gary M.", "ReviewID": "JN3NXw0WgNaCgIGA-8Ruwg", "Overall": "5.0", "Content": "Thai Spice is an amazing dining adventure.Everything I have ordered is fresh and delicious and the happy hour is a great deal. Shawn is a wonderful bartender and always serves with a smile. Thank you, Gary", "Date": "2014-06-03", "Author_Location": "Pompano Beach, FL"}, {"Author": "Kristin C.", "ReviewID": "SEccfdthnvYTpjG2v5UKwg", "Overall": "4.0", "Content": "The atmosphere is so romantic and perfect outside, and it's almost always a lovely day in balmy South Florida.  Also, the day we came the talented and beautiful Joanna of Sweden was playing to my delight.We had the seafood red curry since it wasn't a combination we were likely to see at other Thai restaurants.  I wouldn't say it was outstanding, but it was a good solid dish.Overall, I'd maybe come back.  It seems a little pricey, and the parking lot is a little too crazy for my tastes, but it is a nice classy restaurant.", "Date": "2014-03-06", "Author_Location": "Hollywood, FL"}, {"Author": "Andrew L.", "ReviewID": "OaQai7VZFH_QtPvPZC60WA", "Overall": "5.0", "Content": "Thai Spice has been our favorite special occasion restaurant for many years now.  There are many Thai places in Broward County, but Thai Spice is the most authentic and simply the best Thai food I have ever had, and that includes two visits to Thailand!  Last night my friend Ray and I enjoyed their two-for-one happy hour at the bar along with half priced appetizers which are offered from 5PM to 7, first come, first served.  Our lovely barkeep mixed me up two delicious Lemon Drop Martinis, while Ray enjoyed two Tsing Tha beers.  For our starters I had their crispy calamari, my favorite, and Ray had the sesame chicken wings.  Moving into the warm, inviting dining room, I enjoyed my usual shrimp and scallop medley, while Ray had their Dreaming Chicken.  Both of our dinners were outstanding, as usual, and we left fully satisfied by our tasty, fresh Thai dinners served in gracious style by our attending waitress.  If you want the best Thai food in the States, this is it!", "Date": "2014-07-02", "Author_Location": "Pompano Beach, FL"}, {"Author": "Joe B.", "ReviewID": "w6JWG1HH2Z5HPwcZ8hFH2w", "Overall": "4.0", "Content": "Very good food the panag beef and chicken are great.  It is a little expensive for thai food and i would not go here without a promotion.  I like the feel of the restaurant and the nice decor.", "Date": "2014-06-25", "Author_Location": "Oconomowoc, WI"}, {"Author": "David W.", "ReviewID": "s03X8NFweciiYkScRKNnyg", "Overall": "4.0", "Content": "Food is consistently good. Always get stuck next to fish tank with dead fish floating by. I think I will tell the manager this time.", "Date": "2014-06-27", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jason G.", "ReviewID": "pcbSrcIRxXT_YEqVdW4uZQ", "Overall": "5.0", "Content": "After a few more trips to Thai Spice​ it was necessary for me to bump them up another star. As the the wise Nick A stated, happy hour is where its at. The calamari, straight out of R.I. like Lamar Odom, is the best Asian served calamari I've ever experienced. High quality, fresh and with just the right amount of sauce. It's impossible to order just one plate of this stuff.They've tweaked the restaurant a bit and installed a hipper sign out front, so it no longer looks like a rub & tug massage parlor. But speaking of that, once you're done with this TS (no Terror Squad), there are quite of few places a stones throw away if you truly need a happy ending.I know when I'm at Thai Spice, I don't have just a happy ending, I have a happy beginning too. All the entrees I've had from the lobster pad thai, shrimp panang or special fried rice is goes hard in the paint. Make sure you ask for the special hot sauce, I can't stress that enough, the sh*t is Paul Walker (fiyah).", "Date": "2013-12-03", "Author_Location": "Boca Raton, FL"}, {"Author": "Tracy A.", "ReviewID": "qfyieSxVxojl2jD0H3fHbQ", "Overall": "4.0", "Content": "It's been some time since i have been back to Thai Spice. They have done a TON of renovations. I'm happy to see the decor match the quality of the food. I was craving curry and bamboo shoots but I was tempted by the variety on the menu. We started with the grille octopus. I wasn't impressed. It was a bit too chewy and flavorless. I have had this dish elsewhere and like it. I will try a different appetizer next time.My husband had the seafood red curry and loved it. Lots of big pieces of shrimp and scallops. He had it Thai spicy and it was. Oftentimes its not spicy enough for him.I had the chicken green curry. I loved it. I forgot how much I love green curry when it's done well. They do it very well here. It was creamy and delicious. Not runny and flavorless. It was even good the next day for lunch. I think I'll be back for lunch and dinner more often!", "Date": "2013-12-08", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Sherry W.", "ReviewID": "rRwHakoxxSUFEyYsJ4yzrg", "Overall": "5.0", "Content": "This place is excellent for Thai curry. We ordered the green chicken curry and the red pork curry. Ordering it hot was too overbearing. Next time I will order medium. The veggies in the curry are fresh and crispy. The curries are served with unlimited white rice.The service was friendly and efficient. Waters were always refilled without asking.Ambiance is quiet and dark. Nice artwork on the walls. Great wine selection.", "Date": "2013-12-22", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Greg O.", "ReviewID": "gDW2DbL0B5ZSO6P1n11EXg", "Overall": "4.0", "Content": "I ate lunch here yesterday with one of my neighbors here in Florida. I have not eaten here since they renovated their lovely restaurant. I enjoyed walking by the tall trees/plants buffering the parking lot and entrance to the inside.I lived in Bangkok for two years and have been seeking real Thai flavors ever since in NYC, California, and around the world. I also lived in Japan and cook lots of Asian food. I know real Asian food from Americanized style.For some reason US-based Thai restaurants and Asian restaurants in general, will typically water down their authentic flavors, spice and heat. Please teach American's that original and authentic flavors and spice is better than pu pu platters!I love NE Thai style food the best. I love the spicy and sour flavors. I had authentic Gai Yang (roast chicken) with the same brown sauce you get in Thailand. The charcoal flavor on the chicken was delicious. We also ordered a crispy squid dish that was tender and really tasty that we shared. We both loved this dish. I'd like to see more Thai dishes on the menu like: Fried Morning Glory, Moo Manaow, and Laarb Moo/Gai. They have Nam Sod but I like to see both on the menu.I recommend this restaurant and encourage the chef's to trust we will eat real Thai food from your kitchen. I did think the prices were high though.", "Date": "2014-01-28", "Author_Location": "Brooklyn, NY"}, {"Author": "RM K.", "ReviewID": "LftYSYOzL94n_t5VWSrt_A", "Overall": "5.0", "Content": "Pro: 1.Great thai/asian food!' I'm Asian and i know whats right and meh with Asian food ;-)2.Interior!!!Love the fish tank and some Thai traditional pictures on the wall!3.Great live music! The singer(some young lady with dark blonde hair?) voice is great all the time! 4.Small bathroom but super clean! I saw employees check every single hour to make sure clean! Con: Small Parking lot..         The price? Actually I cant complain about the price.... When you go to restaurant in Thai... Some of Asia countries ... Pad thai is $1.... But when you go to fancy restaurants in south beach, Miami... Same pad thai will cost you $25!! This restaurant food price is pretty fair to me ;-)", "Date": "2014-01-22", "Author_Location": "Miami, FL"}, {"Author": "Aman P.", "ReviewID": "at7FCyNFJWuGC5yq1Cmp2Q", "Overall": "1.0", "Content": "I'm so disappointed with the food & service. Never coming back here again. Twice the messed up on my order. I been here twice and both time nothing but disappointing", "Date": "2014-04-02", "Author_Location": "Ceres, CA"}, {"Author": "Rick V.", "ReviewID": "AnDEB10ddbIYBgPMOGx8MQ", "Overall": "3.0", "Content": "Went again on a Sat night. .busy/packed.service was good and the food is always great.Try fried calamari app. Always a winner. First time I had a  steak here..says prime steaks well we raise cattle and ours are \"checked and marked prime from the processing\" wanted bone in ribeye...sold out..well ordered porterhouse. ..sold out...they did have a ribeye. Steak was good. .not great. Stick with the calamari. ..Always a winner.", "Date": "2014-02-06", "Author_Location": "Hamersville, OH"}, {"Author": "Johnny H.", "ReviewID": "ato8gxopf1MkZHLhroz1eg", "Overall": "5.0", "Content": "Thanks Yelpers...   This place was a good as the reviews claim.       My wife and I went here for lunch.  We got a grilled squid appetizer, which was really great.   The squid was flawlessly grilled -- tender and not at all chewy.   The dipping sauces were tasty and mad the dish.  The portion size was surprisingly large.For our entrees, I got the panang curry with beef.    The sauce was perfectly rich and tasty.   My wife got Pad Thai, which was also fantastic.Here's what we really appreciated; we always order our Thai meals \"Thai Hot.\"   Rarely do restaurants get it right.   It's either served way too mild or its so loaded with capsaicin that you can't taste anything else.    Thai Spice got it perfect -- enough to cause you to break a sweat without killing you.My only gripe is this meals are relatively expensive compared to other Broward Thai restaurants.   Our lunch was slightly over $50 with a single appetizer, two lunch-special entrees, and the tip -- that's with no drinks, just water.  Still, I'll definitely return.   Even with the price, it was worth it.", "Date": "2013-12-27", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Amy G.", "ReviewID": "KtJ060MGjpdixY0iyhmpPA", "Overall": "5.0", "Content": "What a wonderful find! I happily discovered this restaurant last year & I have been a frequent visitor since. An incredible aspect of this business is that not only is the food excellent, it's also consistent. Every time I have eaten here, it's always incredible. Even if I were to order the sane item more than once, it's consistently delicious. The service is good, the atmosphere is lovely. The only downside is sometimes there is a crowd waiting to be seated. But you certainly can't fault a restaurant for that, that just means that it's loved by many.", "Date": "2014-05-05", "Author_Location": "Miami Beach, FL"}, {"Author": "Nick A.", "ReviewID": "NQoGkkRr8vc_6sB1oiOk8Q", "Overall": "4.0", "Content": "If ur not here @ 1700 ur not doing happy hour justicespicy calamar is the best app no iphone south of fl georgia line & is 1/2 off come 5pmbartender from hawaii slings martinis like a matt harvey slidervariety is the spice of life & T.S offers all types of flavors & spicesask for the hot sauce plate & tell then trevor sent youcassava cake is the happy ending", "Date": "2013-12-25", "Author_Location": "Pompano Beach, FL"}, {"Author": "Kornika K.", "ReviewID": "yg3fHGOqpIfKxnEH7YtxXg", "Overall": "2.0", "Content": "Originally discovered this place back in 2008 (or maybe 2009) sometime and it had the most phenomenal Pad Siew ever. The other food was awesome as well and I'd like to think I know a thing or two about Thai food being that both of my parents spent a significant amount of time in Thailand as refuges from Cambodia; my mother cooking lots of Thai cuisine for us growing up. We frequently returned over the 6-years following. I even brought my brother and mother when they came down to visit. My brother raved about the fried rice and my mother extremely enjoyed the crispy duck. I think we've tried every appetizer on the menu and they're all superb with exception of the chicken satay which was rather bland and the coconut shrimp which was mediocre at best. However, our last experience this past Sunday was less than stellar. We had a reservation for 7:30 but did not end up being seated until 8:10ish. This was okay by us, we were there for prime dinnertime service. But it only went downhill from there. Our server never introduced herself. Then, when she took our order, she didn't go over the specials with us as is usually customary (at least it was every previous time we've been, the last only 6-months prior). We ordered the spring rolls, chicken bites, and coconut shrimp as appetizers. The spring rolls, while delicious, did not come with the lettuce for wrapping as they normally do. No bother. They were still yummy. The coconut shrimp, on the other hand, were, as stated before, mediocre. We did not even finish them. The chicken bites were awesome. But ...Then came our entrées. I ordered the pad siew with no bean sprouts. It came out and as I took my very first bite, I discovered what turned out to be a wadded piece of paper. It was sent back and a new plate was brought out, this time it had bean sprouts in it. Again, no worries, I just picked the bean sprouts out as, by this time, I was hungry. Someone, whom I'm assuming was the manager, came over to the table and pseudo-apologized. He stated that we'd be getting dessert on the house. Bleh. He didn't even stick around long enough for us to say thank you and decline, because I would have. We're not dessert people. At the end of our meal, a random dessert was brought out to us, without asking what we'd like.  It was flan. I detest flan. Luckily, I discovered, my daughter likes flan. But she's two. I only let her have a few bites (she had to go to bed at some point).Regardless, despite how hungry I was, I had some leftover and it was boxed up for us. Today, I attempted to eat the leftovers for a late lunch only to discover that the beef in my pad siew was covered with fat..I direct tweeted Thai Spice (along with a picture) and got the unsatisfactory response of it being a Groupon night -- whatever that means. Oh well, I suppose all good things must come to an end. It's such a shame because I really enjoyed them before, it seems, they got too big and important and acclaimed to focus on superior service and phenomenal food.", "Date": "2013-09-30", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Danny H.", "ReviewID": "fzkwwwwlXt38VOGIX2CsmA", "Overall": "5.0", "Content": "Excellent Thai! Ordered the pad Thai, so different from all the ones I've had and had Thai curry chicken, very spicy..but just the way I like it.. well deserved 5 star!", "Date": "2013-11-15", "Author_Location": "Hallandale, FL"}, {"Author": "Vishal P.", "ReviewID": "eR0vivfa236mqUfoYWgo5Q", "Overall": "5.0", "Content": "This place is great. The menu is large and really has a huge variety. The food is perfectly cooked and comes out on time. We had 4 dishes and all of them were out of this world. The atmosphere is new and authentic Asian. Service was some of the best I've had. Drinks are amazing and unique. Try the seafood curry, Rock-n-roll calamari, Thai curry chicken, or Pad Tai", "Date": "2013-12-20", "Author_Location": "Morris Plains, NJ"}, {"Author": "Meagan M.", "ReviewID": "K8WFcTYKaLCzaMID9Etg_g", "Overall": "4.0", "Content": "Very good Thai food. I always get the Pad Thai because it is great! They have a huge menu so there is definitely something for everyone whether you're in a large party, business meeting or there for date night. I have been there for all three of those occasions and everyone leaves happy. I have always had good service there, but it is definitely pricier than the other Thai places in the area and on the weekends they ALWAYS have a long wait. Unfortunately these two things usually keep me out.TIP- Don't sit outside, whatever those trees/bushes they have out there are bug magnets. We were eaten alive in about 10 minutes out there until we asked out waiter to please move us inside.", "Date": "2013-09-18", "Author_Location": "Central Fort Lauderdale, FL"}, {"Author": "Renee R.", "ReviewID": "-RYiL5FUFAZ4ANB_X5S7hA", "Overall": "5.0", "Content": "On Friday night I went to Thai Spice. It was my turn to choose for date night...and I was in the mood for Thai...but didn't want to go too far from my house. After my meals, I usually want to sleep - don't judge me. So I asked my foodie sister to recommend some places. She did, but in the end decided to try a place that came highly recommend on Yelp - Thai Spice. Because it was Friday I called and made reservations for 8 to make sure that we wouldn't have to deal with the Friday rush.We got there a little early...7:45 to be exact, but figured we would just sit at the bar until it was time to eat. As it happened though, they seated us immediately...a two seater in the hallway. The place is decorated well, dark, with reds and booths, lighting is very dark and dramatic. We found out later that the space is quite small, but they used mirrors at the end of the rooms to make it appear larger. Don't expect bright light in here. The tables were lit with candles...we actually asked for a bigger one so that we could see our food better.Anyways, they gave us a list of the featured meals for the night AND their regular menu. The wine list is HUGE! I had a Lycheetini and He ordered Mangotini. The Mangotini was good...but the Lychee tini - Simply amazing. Clean crisp and they did not skimp on the Tini Part. Strong! We had two of those. On Drinks - I win!For the appetizer, he chose Seafood Coconut Lemongrass Soup - Medley of fresh shrimp, scallop, grouper, calamari, blue crab.  I had the Fresh Rhode island mussels - Simmered in a slightly spicy lemon grass broth with fresh basil and served with crispy naan bread. My Mussels were great - the sauce was sticky and sweet but delicious [all our food was ordered hot] you have a choice for the degree of heat you can have your meals at Mild, Medium Hot, and THAI hot.  Our server Marshall [ask for him - well spoken, attentive] explained it to us.Anyways I won on the drink choice - he did on the soup. It was delicious! We couldn't speak for a fewminutes after the first sip. A True medley of flavors - where none overpowered the other. It was fantastic.  - So much so that we had to stop eating it to so we would have a fair chance with the entrees.For the main meal I has shrimp red curry - Jumbo wild caught white shrimp sautéed in red curry paste, coconut milk, zucchini, bamboo shoots, peppers, asparagus and fresh Thai basil.  He has the Sea Food clay pot - Jumbo wild shrimp, fresh diver sea scallops and Maine lobster tail simmered in a clay pot with exotic Thai herbs, garlic, wine, chili sauce and basil.We both won on these...but we couldn't finish!! We had to take most of it home. I had a double shot espresso afterwards just to give me enough energy to get to the car.Please, please try this place. The space is smallish, but the food more than makes up for it. There are booths outside too if you're interested in sitting outside in this Florida weather.  The place was packed the entire time we were there, but you didn't feel overwhelmed by the traffic at all.  Great for date night, but for groups too.  We could have shared a meal...and they let you. There's a sharing fee!", "Date": "2013-09-16", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Robert L.", "ReviewID": "8A_JajHQFjG-gC6D_qklmw", "Overall": "4.0", "Content": "Me and DaWife were craving for something very spicy. Since we pass this place everyday we figured the name was in our craving.We did not have any reservations and the place was packed but they did accommodate  us and fns us a table. this place was like a maze of rooms. and more rooms with aquariums everywhere. I love fish. Service was good, they seem to work in a team. Had steamed dumplings which were pretty good andI once again ordered the Chilean sea Bass with coconut, it was excellent. Great portion which came in a massive plate about 20\" wide which was crazy.  5 stars all the way.They brought us their spice jars which was cute and impressive. The kids ordered phadsew which is the fat noodles but they brought somehting more like Phadthai which was just OK. Not worth the $18 a pop. I have had $5 much better. For this reason I gave the 4 star. After all it is a Thai restaurant and they should be serving $18 worth but I guess most don't know the difference.Would I go back. Not sure!!!!", "Date": "2014-03-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Kristin W.", "ReviewID": "U4XpIg387cFCQhVfvDE9XQ", "Overall": "5.0", "Content": "I went there with my husband for our anniversary. We started with the rock-n-roll and grilled calamari as our appetizers. Both were really good.As my main dish, I ordered the lobster pad thai. It is honestly the best pad thai I have ever had.My husband ordered the Long Island crispy duckling. It was phenomenal! My only issue was the salad. I tried the ginger dressing and peanut dressing, neither one I really liked.Overall, great place and we will be back", "Date": "2013-11-19", "Author_Location": "Plantation, FL"}, {"Author": "Anita C.", "ReviewID": "jmsKx1_0rmhL7r4AQiKaqA", "Overall": "5.0", "Content": "The best!  Haven't gotten a bad dish here ever.  Let me rephrase.  Everything I've ever tried here has been excellent.  The atmosphere is nice, maybe a little upscale but jeans and a nice shirt work fine.  Food is a little pricey but worth it.  They've expanded since i was there my first time some 7 years ago.  Parking can sometimes be a bear but they have valet and you can also park in the back.  Make sure to treat yourselves to an appetizer or two.  The thai wings have incredible flavor and that's the best thing about Thai Spice, the flavors to all of their dishes.  Love it!", "Date": "2014-03-04", "Author_Location": "Pompano Beach, FL"}, {"Author": "Najah E.", "ReviewID": "wnJPVgMMuVb3vC3BCOg8eA", "Overall": "2.0", "Content": "The reviews on yelp helped. I had the shrimp Pad Thai. It wasn't as spicy as id want it. Also the shrimp was tasteless. I didn't even touch the shrimp. The Pad Thai was great. Just stay away from the shrimp if you're not into super fishy tastes. I could smell/taste the fish sauce and I found it repulsive. You won't find me here again.", "Date": "2014-03-03", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Savanna M.", "ReviewID": "USN_NqSzQMMJ1lccHZ-Pnw", "Overall": "5.0", "Content": "Thai Spice is as good as it gets - between the food, service and atmosphere there is nothing wrong.  The fish tanks are a nice touch and exude character.   The servers are great and somehow manage to remember a very extensive specials of the day list which changes constantly.   They've recently expanded which is nice and they've added a happy hour during the week.  I have yet to check it out, but those 1/2 price apps are calling my name! Since this is close to where I work, we frequently come here for lunch, which pricewise is the best deal.  There are lots of lunch deals available with all of the standard thai options with a soup or salad (soup of the day, or salad with peanut dressing or ginger dressing) - pad thai, pad siew, red curry etc.   I'm particularily torn between the pad siew (which is the best I've ever had) or the crispy calamari which is great and not offered many places.   It's rare for us to get dessert, we're usually getting boxes to go because the lunches are so big, but if you have room there are some great options!", "Date": "2013-08-15", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Keri H.", "ReviewID": "hZwgtcQjZk5PEpiYP0FoKw", "Overall": "1.0", "Content": "I just had one of the worst experiences at a restaurant ever. That is really tough to say as I have eaten at thousands of establishments all over the world.  To be clear, your food is delicious, your staff was incredibly kind to my 89 year-old grandmother, but the waiter who waited on us was one of the worst ever. First off, the waiter does not know the menu. Which is sad, when your job is to know the menu. My grandmother wanted to order soup w/ her Pad Thai and he told her she couldn't...when it clearly said it comes with soup on the luncheon menus. Then, my grandmother asks for a straw to share my tea, and he comes back with said straw and shoves it in her soup bowl. Because clearly, all old people want to sip up their hot soup from a straw. Just because she is in a walker, it doesn't mean she is paraplegic. She felt disgusted that he would generalize like that and that he would just plop the straw in her soup, without even handing it to her. Really weird stuff. Then, when *I* ask for the check, he makes a BIG DEAL to plop in front of her. Because clearly, as a  mixed-race black woman, I am either my grandmother's aid or too poor to pay. It was really uncalled for to have this waiter make an assumption of who was to pay. Usually, when the wait staff is properly trained, they place the check in the middle of the table. I leave my debit card with the waiter, and my grandmother watched as he swiped my card 3x in a row without a break. She couldn't believe it. And the he comes back and says that my card is declined...which is complete bullshit. I have plenty of money in my account and was just at the bank. I know my finances very well.  I asked for a read-out from the machine and he says the machine doesn't do that. I wanted proof that my card was declined and he just stared at me blankly. He said he ran it twice and it was declined and there was nothing he could do. Instead of giving access to any more of my cards, I pay cash and we leave. My level of trust is completely gone. On our way home, my bank calls to say that someone at Thai Spice/Tatton ran my card at least 3x. I have TWO charges of $27.40 deducted from my account. So I LOVE that he says my card is declined, while $27.40  went through twice. If I had no money in my account, clearly that wouldn't have happened. My bank says it would have gone through a THIRD time, but they halted the activity before the waiter could. I think your waiter needs to (a) learn the menu (b) take sensitivity training (c) learn not to generalize people and (d) learn how to use a credit card machine. He is not equipped to represent your establishment nor serve its guests.", "Date": "2013-07-19", "Author_Location": "Beverly Hills, CA"}, {"Author": "Tiffany H.", "ReviewID": "jt5QmaUhSlDCH-F0xZV-1w", "Overall": "5.0", "Content": "BEST THAI AROUND!!! I've been coming here for a few years now and am never disappointed. We had a reservation for Valentines Day and did not have to wait long once we arrived. Once seated the waiter come over and and introduced herself but did not come back for a few minutes. The owner (I think, or manager)happened to be there that night and when she saw us waiting she immediately ordered another waiter to attend to us. Very nice, but it was Valentines Day and we did expect we might have a little wait to order and get our food and we were fine with that. I do not recall the name of the drink we ordered but the rim was coated with Habanero  Salt. WOW! I didn't even know it existed! So needless to say I ordered extra on my next round. Good Stuff. We usually just get a dumpling appetizer which is delicious but the seafood Tom Ka Gai soup is also so good. The Entrees are huge and although I usually to stick the chicken panang, I have also tried the Three buddies, the seafood red curry, and the Sea Bass. ALL AMAZING. My boyfriend loves steak and tells everyone about the dry aged cowboy steak here. If you are a steak lover, definitely try that.  I have managed to steal a few bites of his and it really is tasty. He also had the duck once and loved it, but I'm not a duck fan so I did not eat it, especially given that there are ducks walking around int he back parking lot sometimes lol. Over all it really is my favorite place to dine, great ambiance and great staff.", "Date": "2014-03-04", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Ani S.", "ReviewID": "7xWT-70gT0pP_zqZylJ8Mw", "Overall": "5.0", "Content": "THANK YOU YELPers!! My honey and I dined at Thai Spice last night after some YELPers pointed out that Thai Spice had the elusive whole fried snapper my honey had been searching for.They definitely had it!!!  Thai Spice offers several options of fried fish, including choice of fish and choice of seasoning/sauce.   We were able to choose a choice of fish (Chilean Seabass, Salmon, Yellowtail Snapper, Sole, Key West Yellowtail, Whole Red Snapper, or Whole Hog Snapper) that could be prepared in two ways (crispy fried or oven roasted) then topped with a choice of sauces (Chili, Red Ginger, Red Curry, Hot Basil, Sweet & Sour or Thai Lemon Garlic Butter). We ordered a Crispy Fried Whole Red Snapper with Hot Basil sauce which turned out to be neither hot nor very basil tasting, good, but not great.   Next time we would probably try another sauce.   Note:   They accidentally brought out our fish with the Red Curry Sauce first and my honey sent it back for the Basil.  The Red Curry Sauce was much more flavorful, reminding us of a Penang Curry. Might try that next time.Nonetheless, this whole fish hit the spot!  My honey was thrilled!!!  Yay!!!We also ordered: - Bang Bang Beef - Volcano Shrimp- Spicy Ginger Carrot Chicken Soup Special- Fried Banana and Ice Cream DessertThe Bang Bang Beef was delicious and very flavourful.  Floured and Fried pieces of beef (skirt steak?) then drenched in a sauce.The Volcano Shrimp was tasty- whole large shrimp with a spicy chopped sauce smothered over it.  The sauce definitely had a bit of a spice and overpowered the shrimp itself, but was very good. The Spicy Ginger Carrot Chicken Soup was ok-- thick broth soup with minced chicken dumplings.   The Ginger and heat of the soup was a bit much-- I will not order again.  Fried Banana dessert was very good and typical of thai places.  Overall, a very good meal.  I don't even want to think about the calories!! ****Service was EXCELLENT!!  We brought our 1yo with us and they were sweet enough to seat us next to the fish tank which delighted him the entire evening!!! The bar had a lounge singer with an INCREDIBLE voice!!!   She sang a bunch of cover songs and I honestly thought the music was from the radio!!Prior Review:The skirt steak is DELICIOUS!!   Great place!If you seek delicious Thai, exotic foods, pairings and fresh seafood--- you FOUND IT!   Everything on their menu is amazing!   The food, atmosphere, service is all perfection! I have never had anything bad here!!!Takeout works well too!", "Date": "2013-08-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Son V.", "ReviewID": "zTBx_CZca30qDvvLsMZa-w", "Overall": "4.0", "Content": "This place is good. However, it is very expensive though. The service is excellent. We went on Sunday night and they offered live singers. It was very lovely. Try their GRILLED SHRIMPS and SPECIAL FRIED RICE.", "Date": "2014-03-15", "Author_Location": "Saint Louis, MO"}, {"Author": "Mariam D.", "ReviewID": "U0r88nCIWeZUk40s-ceybA", "Overall": "5.0", "Content": "I loved seeing the \"Yelp\" sticker in the window .. .along with the numerous plaques for the recognition Thai Spice has received over the years for its amazing food, intimate and chic ambiance, and excellent service.  The fish tanks are glorious ... step inside and you see the bar and Bamboo Lounge. Happy Boasts 1/2 price beer/wine/cocktails and 1/2 price appetizers with plenty to choose from.  I'll be back to try it out for sure, as my server said Thursday and Friday are their busiest Happy Hours of the week.  The dining areas continue, with high tops, booths, and table seatings in a warm and dimly lit setting ... an absolutely sexy ambiance that transports you to an exotic, tropical, faraway land.  The lunch menu is awesome and starts at just $8.50 for an extensive list of Thai specialties.  I have been wanting to revisit TS for lunch, and today was the day.  I had the Thai Beef Salad (from the salads section of the menu/third time ordering this) and the Red Curry with scallops and fried rice.  Delicious.  Tons of bamboo shoots, red and green peppers, green beans, and an amazing, creamy coconut curry sauce.  I have plenty left over for dinner later or lunch tomorrow.   There's outdoor seating and an outdoor booth. Yelpers: Thai Spice is so good!  You MUST try this Thai.", "Date": "2013-06-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Cherir C.", "ReviewID": "IKzq2dzWT9fJl_9WaKEjHQ", "Overall": "5.0", "Content": "This is a regular stop for us. Last week we used our groupon which was nice but not necessary because we've been going before Groupon(: My daughter always gets the satay. They bring a fire pot and cucumber salad with it. I try to order something new, but I ended up with chicken panang curry. It's the best I ever tasted. We did one thing differently this time! We had an amazing peanut butter dessert! Try it if you love peanut butter and chocolate!", "Date": "2013-11-20", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Fred S.", "ReviewID": "BqUe4eExYbEGKrg88Aaf9Q", "Overall": "4.0", "Content": "I would have given this five stars because everything was really good. But, some dishes a little less authentic, given the fact that my wife is from Thailand and we've been married almost 40 years! Nevertheless, the dishes that may have been less than authentic still tasted excellent. People may complain about high prices, but the dishes served had excellent portions which is unusual for these kinds of restaurants which typically have very small portions.  It's also pleasant to have a very nice atmosphere in Asian restaurant and enjoy it as an evening out and a special night out. Absolutely going back again.", "Date": "2014-05-25", "Author_Location": "Boca Raton, FL"}, {"Author": "Ashley S.", "ReviewID": "uyeEC_BQoFcJuXzc_BIXJw", "Overall": "5.0", "Content": "Best Thai restaurant in Fort Lauderdale.  Always great, friendly service.   Food is very consistent and they have good nightly specials.  Thai Spice heat has a great kick too!", "Date": "2014-03-16", "Author_Location": "Miami, FL"}, {"Author": "Michael S.", "ReviewID": "GXBng5oWvr-wnMwQAXY1MA", "Overall": "5.0", "Content": "My parents recently dined at Thai Spice for their anniversary dinner. They bragged for weeks, so I had to go myself. I arrived on a weekday lunch around 12:30 to find the small parking lot packed to the gills with other cars hawking for a spot. After circling a couple times I saw a sign stating that there was more parking in the back of the restaurant. In the back I found at least 10 free parking spots. Because they were so busy and I was dining alone, I sat at the bar so that I didn't take a table that they probably could use for a larger party. The bartender, Shawn, quickly greeted me and laid a linen napkin out on the bar before he brought my jasmine tea and silverware. He was very welcoming and helpful in choosing an entree. His impeccable service contributed to the five-star rating. I probably haven't had such great service in years, not to mention in the lunch hour. He explained the history of the restaurant and I now understand that it started as a small takeout restaurant that expanded by slowly buying adjoining store spaces over the years. Looking at the restaurant they have created, I would have never guessed that it started as a takeout. The restaurant is very cut up with many private nooks and tables all decorated in Asian inspired black and reds. There are so many beautiful fish tanks, you are certainly guaranteed a view of one wherever you sit. I bet kids would love it here. I ordered the ginger salad and red curry with steak and vegetables(lunch portion). The homemade salad dressing was awesome, although I haven't had iceberg lettuce in a long time. I would have much preferred a hydroponic or leaf lettuce, but the dressing made the salad enjoyable. The entree was the star of the meal with slices of steak so tender they seemed to partially melt in my mouth. The vegetables were cooked perfectly as they were hot,  tender, and still with a bit of crunch. The sauce was the best Thai curry sauce I have ever had. It had a very complex flavor in that I tasted different spices and ingredients as I enjoyed each bite. Light coconut milk flavor, with Thai basil that gave the hint of anise or fennel. The large square plate was portioned with just the right amount of sauce that I didn't have a dry bite or a drop left, hehe (honestly, I would have considered scraping the plate).Between the awesome service, the beautiful decor, and the sauce that made me want to smack my momma, this place ROCKS!!! I am really looking forward to a dinner here.", "Date": "2014-01-23", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Tully R.", "ReviewID": "w3-sA5BOJEO0E-pq8iB-EA", "Overall": "4.0", "Content": "Just west of Lauderdale by the Sea on Commercial, this well established Thai treat is worth a visit! The sesame wings are a delight as are the spring rolls, all the soups, and even the fried rice!", "Date": "2014-03-07", "Author_Location": "Millersport, OH"}, {"Author": "Cest L.", "ReviewID": "_ksBdUa-Z1gdTw0_zEZrOw", "Overall": "5.0", "Content": "We were crazy enough to show up here Valentines night around 9:30.  And much to our surprise we were able to procure two seats at the bar for dinner!They have a great wine list along with some unique specialty drinks. We started our meal with thai spice spring rolls. They had such a wonderful flavor, just the right amount of chewiness and crunchiness. And the dipping sauces were a nice accompaniment. I ordered one of the specials offered, a mix of seafood served over crispy noodles with broccoli and bok choy. The seafood was cooked perfectly and the green items had a nice bright color to them.My partner had the shrimp pad thai, I am guessing that it was good since he ate the whole thing and did not save me a bite!Overall a very excellent meal!Will eat here the next time we are in Ft. Lauderdale!", "Date": "2014-02-15", "Author_Location": "Breaux Bridge, LA"}, {"Author": "Bradley T.", "ReviewID": "9ifpzj1qLhZCUYnV2ZU3_g", "Overall": "5.0", "Content": "I feel like I've wasted the last 26 years of my life not eating at Thai spice. Thai spice not only serves the best Thai food in the history of my taste buds, but they sell seafoods and prime steaks cooked to perfection.Unfortunately my stomach has a spatial limit so I could only choose one dish. I had the seafood red curry with gigantic scallops, grouper fillet, calamari, and baby octopus. As a curry aficionado, I can tell you that it was the real McCoy and the seafood was cooked perfectly. My girlfriend tried the Siam duck with tamarind sauce and that was also otherworldly.The restaurant is expensive, no doubt, but the quality equals the high cost.I can't wait to go back and try the Lobster Pad Thai. Damn..", "Date": "2013-07-13", "Author_Location": "Miami, FL"}, {"Author": "Brenda P.", "ReviewID": "6z4hL4a0lG8KxO8eIhI3Lw", "Overall": "5.0", "Content": "Thai Spice you won me over!Nestled in a small, ordinary looking strip mall you cannot miss the giant RED signage calling your name as you drive by. Had I been alone I might have kept driving thinking it was a little overboard. The friends we were with were absolutely sure this was the place for me and they were right. From what I was told, it has recently been remodeled. It is obvious when you pay close attention. You enter through the swankier new area. If you make a right once inside you can see the difference in decor. It is a family owned restaurant with the owner, wife and daughter being all hands on deck. I did something I rarely do: I let others lead the way and order for me. I know, I know, I really need to do this more often. This was a great first step for me because everything that came our way, and I mean every little morsel was delectable. This is what I we tried:Bangkok RollsCoconut ShrimpChilean Sea BassLobster Pad ThaiRibeyeSeafood Medley SoupSpecial Fried RiceWhite Chocolate CheesecakeCoconut Fried Ice CreamChocolate Peanut Butter MousseYes, all of that was for just four of us. It was our own version of  a \"family style tasting menu\". The portions are pretty large for the entrees and regularly sized for appetizers and desserts. Some things are Thai hot and others milder. If this is not your thing, make sure to ask prior to ordering. I do love \"hot\" so I was very happy. It's hard to choose a favorite but I would say the Bangkok rolls and lobster pad Thai were the most memorable for me. The chocolate peanut butter mousse was spectacular as well. Service was wonderful throughout the night. I am already planning a return visit very soon because I can't stop thinking about it. And that, is how I know I have been officially swept off my feet!", "Date": "2013-04-29", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Mark B.", "ReviewID": "UZx7SH9RvrT7CgSv5f8bVg", "Overall": "5.0", "Content": "My favorite Thai restaurant. I have dined here a few a few dines and have not been disappointed. Everything I ate has been delicious. My favorite would be the skirt steak wow tasty. i", "Date": "2014-03-20", "Author_Location": "Boynton Beach, FL"}, {"Author": "Roland R.", "ReviewID": "RQDpz8qyyXOz-e0-xPU8ww", "Overall": "5.0", "Content": "As someone who has eaten an excessive amount of Thai food all over the US and in Thailand (fyi - they just call it food there), at hole in the wall joints and fine dining establishments, Thai Spice is easily ranked in my TOP 3 for Thai!Don't let the location fool you, (in a STRIP PLAZA with a CHECK CASHING place right next to it.  Yes, I know, nothing screams MORE GHETTO than a check cashing place, well maybe a gun store), but Thai Spice is THE REAL DEAL!!!The food here is DIVINE.  Each dish is a CULINARY ADVENTURE that will make you wish you had TWO STOMACHS!  My FAVORITE is THE DUCK!  It's basically where HEAVEN MEETS EARTH!  It's fried to a crispy perfection and it's drizzled with a sweet- tangy, thick tamarind sauce SO MAGICAL that it can end the Israeli-Palestinian conflict.Thai Spice is on the pricier side but IT'S WORTH IT!  They use top-notch ingredients and great quality meats and the service is fast and friendly to boot!", "Date": "2013-03-29", "Author_Location": "Los Angeles, CA"}, {"Author": "Charmie P.", "ReviewID": "XTk1oTMYcm8EggK4j0eFBg", "Overall": "5.0", "Content": "Well, to sum it up, everything is delicious.The fresh rolls, curry puffs, satays, wonton soup, my bf says the seafood tom yum is the best he's ever tried, I love the Tom Ka Gai soup, the skirt steak with jasmin rice, the pad thai...ok, if I continue I will just be listing the entire menu.  They are heavy on the spice so if you are like me and can't handle anything over medium make sure you tell them, they will season it to your request.  Also, they deliver which is a huge plus when you are looking for quality food from the comfort of your home.  I used to live close by and used to order delivery on a very regular basis, they were very constant on quality and freshness.", "Date": "2013-06-02", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Danielle R.", "ReviewID": "Szh28r-6Uu0hVw9g7iy1aA", "Overall": "5.0", "Content": "Great Scotts I'm in LOVE!This place rocks- just go!!!I met a friend of mine here for lunch last week, she suggested it, as she knows my love of anything spicy.  I was a little tardy for the party, so when I walked in the hostess was expecting me and sat me where my friend was.Waitress was on it, super friendly, ubber attentive, changed my drink napkin 3 times, made jokes, she was great!  5 stars for a kickass server. So rare these days!I ordered some spicy chicken dish w/ a sweet and sour sauce and fried rice, my friend ordered the crispy tofu with veggies, all 'medium white girl spicy' b/c we requested the spices on the side. And boy did they bring over the condiment mother load, 4 containers of varying degrees of spicy wholesome goodness to add to our meals. Sweet baby Jesus was I happy.Food was amazing, flavorful, not too hot, well not until I got a hold of some of their pepper sauces.  Going back for sure!  They have outside seating and inside seating. Great music, and it's dark and romantic in a classy Thai way!", "Date": "2013-03-24", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Samantha D.", "ReviewID": "ceb6-xvnOls4ysmtZqfgKw", "Overall": "3.0", "Content": "Thai Spice how my love for you wants to be there but just can't. First time going here we sat outside and it seemed as if our server kept forgetting about us and it seriously took an hour for our food to come out. This was forgiven because the food was delicious! Second time here my mouth was watering just to get in the door. We decided to sit inside this time to get a good feel of the restaurant. They sat us at a 6 top when it was just the two of us. Wasn't thrilled about it but now time to eat! My husband and I ordered the same thing as last time, the Vegetable Red Curry with Tofu and Beef Pad Thai. The servings are gracious but I just can't believe how expense it is. The ingredients are fresh and flavorful but you can get the same thing literally right down the road for half the cost! There just isn't anything I see that makes this Thai place any different than the other ones around town. The staff is friendly at best and the parking is super tight. Between our two visits this place just doesn't do it for us. Don't get me wrong the food is good and they have live entertainment but I would rather pay less for a family owned dining experience down the road that is much more cost effective, cozy and attentive!", "Date": "2014-03-25", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "S M.", "ReviewID": "mSSseJusM0UjHc0LK78Akg", "Overall": "3.0", "Content": "Have been dining at Thai Spice for over ten years! Busier now then it's ever been! Recently, there seems to be a new chef, they've cut back on the quality and quantity of their food, or all of the above. We have been disappointed the last 3 or 4 times we have gone, hoping that the next would be better than the prior. Unfortunately, it hasn't improved. Steak was tough, chewy and not cooked to specification. Crispy fish sauce was too thick and not as tasty. One out of the 6 of us enjoyed their meal!Salad (dressing)spring rolls and soup still good.Don't want to give up on this place, but it's becoming less desirable.", "Date": "2014-01-21", "Author_Location": "Pompano Beach, FL"}, {"Author": "Jamie A.", "ReviewID": "R8gRQ2qjNDl2ED4D2E1QTQ", "Overall": "5.0", "Content": "I had the seafood coconut soup, and whole yellowtail fish fried with a chili garlic sauce. Amazing!! This place is the best Asian food in Fort Lauderdale. You will not be disappointed. Alfred our server was professional and knowledgeable on all items on the menu. Don't miss a trip to this place. It is well worth every penny. Oh! And try the lychee-tini and mango-tini!!!", "Date": "2014-01-17", "Author_Location": "Reno, NV"}, {"Author": "Lena P.", "ReviewID": "_lO_lSN1eXxAYUBr1HixCQ", "Overall": "5.0", "Content": "Love my Thai food, and this place was amazing!Nice restaurant decor inside and they have a live band/singer as well. The waiters were really nice and always there when we needed them.Appetizers: Chicken Nam Sod: Delicious! It's minced chicken with great flavors, I took seconds!Yum kai Egg salad: good dish for vegetarians as an appetizerEntrees: Chicken Basil: chicken was seasoned really well and the basil flavor was perfect. I took seconds!Veggie Fried Rice: rice was cooked perfectly and we only asked for eggs, onions, and scallions in it which was delicious.Veggie Panay Curry: the coconut curry sauce is really good - not too strong which complimented the vegetables in it. Great to put over rice.Veggie Pad Thai: tasted sweet, but I like sweet so it was good to me!Dessert: Cassava: It's a potato dessert, which tasted like a flan but it wasn't. It was good, but the waiter brought out a whole tray of desserts for us to choose from and although everything looked really good, we were so stuffed from our meal. Maybe next time!", "Date": "2013-03-07", "Author_Location": "Ontario, CA"}, {"Author": "Brian W.", "ReviewID": "dRXLxFgFU8K4BV52HqvzIw", "Overall": "5.0", "Content": "The Thai green curry chicken and red curry pork are some of my favorite dishes.  I normally like things spicy.  I'd recommend medium on these 2 dishes.  The hot tends to be over powering.  The wine and bar selection are good.  The lighting and music make for great ambiance.", "Date": "2013-12-22", "Author_Location": "Houston, TX"}, {"Author": "Kim K.", "ReviewID": "giXc0lsPwoAfcFWyBhzzUg", "Overall": "4.0", "Content": "In town on business and really wanted Thai. Glad I found this place. Parked right out front and didn't have to wait. Service was very attentive and the decor and music were suitable.  I had a shrimp curry dish that was pretty good. I wished I would have asked for it spicier- my fault. I would go again, for sure.", "Date": "2014-01-09", "Author_Location": "Cuyahoga Falls, OH"}, {"Author": "Eve G.", "ReviewID": "ZoWbCWD9CB4QLn3-maV-5A", "Overall": "5.0", "Content": "I highly recommend this place. The food is amazing. The staff are all friendly and very accomodating. If you love Asian food this is definitely worth going to.", "Date": "2013-11-08", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Gil H.", "ReviewID": "vcjmHUGzJEx0ck523tgwww", "Overall": "5.0", "Content": "Found this place on yelp, it was amazing, some of the best Thai food I ever had. Going back there tomorrow, got to try some more dishes!", "Date": "2013-11-15", "Author_Location": "Pompano Beach, FL"}, {"Author": "Taylor Z.", "ReviewID": "Y_Q6o2hqwbov0Tp7iz-ULg", "Overall": "4.0", "Content": "I was super impressed with the food here. If you are not a meat/fish eater, the menu can look a little scary. However, I was reassured by our friendly waiter that most plates can be -veggie-ized. I had the best coconut soup in my life !! I got tofu instead of chicken. I also had an amazing sweet and sour tofu plate with lots of veggies.The service was fast and the prices were a little on the high side, but worth it.  I would definitely return here next time I am in Miami ... I can't wait!!", "Date": "2012-11-10", "Author_Location": "Florence, Italy"}, {"Author": "Bobi G.", "ReviewID": "qYQ69ugkyrSlCv0RNagijQ", "Overall": "2.0", "Content": "Been here six times over the last 5 years and the last two times have not been as good as I remember it. This used to be my favorite \"special occasion\" restaurant, but no more. Food the past two times is hit or miss, when it is a hit, it's great. A miss and it's so so. Last time I was here was for my birthday and the service made our whole table uncomfortable. My father gave our order to the waiter who brought us garlic chicken instead of beef, and missed an entire dish we all heard my father definitely order. Mistakes happen which is not a problem, however the waiter told my father he did not order it! We were all shocked and uncomfortable. The waiter was such a jerk it really ruined our meal. Also, on our way out a mgr saw an unhappy look on my moms face and asked how everything was, my mom said a little disappointing. The waiter then told my mom, away from the mgr, 'you know I can lose my job for that\". He should.", "Date": "2014-03-23", "Author_Location": "Pompano Beach, FL"}, {"Author": "Jessie L.", "ReviewID": "FLgvokfKV81AUAWrWxdjMQ", "Overall": "5.0", "Content": "I love Thai Spice, I've been coming here for the past 7 years or so. I'm not a big fan of Thai food elsewhere besides Thai Spice. The service and the food is always excellent. I usually get the chicken with baby corn and mushrooms when I come here, but recently tried the New York Strip Steak with rice and bok choy, but substituted the bok choy for shiitake mushrooms which were incredible. I'm looking forward to going back and trying some of their seafood because it looks amazing. Some of the people that I went with got the full Maine lobster and lobster tails and they said that it was impeccable.", "Date": "2014-01-01", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Lakshmi R.", "ReviewID": "eyfg5Rc9EwZpY-xJLqZw-w", "Overall": "5.0", "Content": "Food is Great. Ambiance is quiet and dark. Bit Expensive but worth it.... Go there if you want to impress somebody....", "Date": "2014-01-22", "Author_Location": "Tallahassee, FL"}, {"Author": "Jessica G.", "ReviewID": "LW2ouQRCL9VLzSyY92PFvg", "Overall": "5.0", "Content": "Thai Spice is pretty close to where I work, so I have been here quite a few times for lunch. I rotate between the pad thai and the pad siew, mostly because I love noodles so much I just can't seem pull myself away. The sweet peanut taste in the pad thai is perfect and the sweet soy sauce in the pad siew is amazing. They are totally willing to customize spice level, but I'm not that adventurous with spice so I always get mild.The other night I tried dinner here for the first time.   They offered a groupon a month or so back, so I snatched it up, a good opportunity to try dinner for essentially the price of lunch. I made reservations since it was Friday night, and I'm glad I did. The parking lot was quite full and we had to valet, and we did have to wait a few minutes for our table despite the reservation, but it wasn't long and I wasn't bothered by it.I started with one of their signature drink. This was the first opportunity I had to try anything from the bar since I've only ever been here when I have to be back at work. I don't remember the name but it was essentially an apple cinnamon martini...so good! and the taste reminded me of fall. We ordered the grilled calamari appetizer as well. I'm somewhat new to calamari, especially if its not fried, because the potential is had to be chewy scares me. This was was cooked perfectly, and the grilled/charred taste was excellent. It came with two sauces, one fairly spicy and one mild that went really well. For dinner I ordered pad siew and my boyfriend ordered pad thai. I somehow talked him into this because I really wanted to order both. The pad siew was perfect as usual. He ordered the pad thai spicier than I would normally, but trying it the flavor was really good and the spice went well with the peanut sauce, I just know I couldn't handle the whole portion. I love how the noodle dishes come with fresh bean sprouts on the side, they're great mixed it. I've always had good service here for lunch, and there was nothing really wrong with the dinner service, I just felt it had been more attentive on occasions I went during the day, but this is probably because they were busy. Overall I was pleased with the dinner, but I do have to say that lunch portions are not much different, and the price is lower and the dishes come with salad, so lunch is a better value by far. I'm dying to try the happy hour with the drink and appetizer specials, especially knowing now that their special cocktails and calamari appetizer are so good.", "Date": "2013-09-09", "Author_Location": "Margate, FL"}, {"Author": "Chris A.", "ReviewID": "cBoSua-klmThVfv_QVj4yg", "Overall": "5.0", "Content": "Two words to describe this place \" THE BOMB\".The chili fried calamari is the best calamari around, hands down. If you haven't eaten here then you are missing the BOAT. THE BOMB food.", "Date": "2013-07-27", "Author_Location": "Pompano Beach, FL"}, {"Author": "Frizaley B.", "ReviewID": "y98NkFTW0672-tnMPrrLAA", "Overall": "5.0", "Content": "This is the best Thai restaurant in SOFL. I live the Seafood Red Curry and the chicken wings. The service is nice as well.", "Date": "2014-01-04", "Author_Location": "Palm Beach Gardens, FL"}, {"Author": "Marqus R.", "ReviewID": "qaMNmU1rhQTr4-jNjMLyyg", "Overall": "5.0", "Content": "In Fort Lauderdale there are certain restaurants that set the benchmark for various cultural cuisines. Valintino's Cuicina Italiana for Italian, Eduardo De San Angel for Mexican, Rainbow Palace for Chinese, and for Thai, it's clearly Thai Spice. So, if I were asked what is the best Thai (like in really being Thai, not to be confused with those tagging themselves with the common catchall of \"Asian\") restaurant in Fort Lauderdale, my answer would be Thai Spice. What sets Thai Spice and the others I have mentioned apart is that each generally holds true to the highest, purest form of the specific cuisine of the country they represent without compromising or Americanizing; at least not markedly so.  In my experiences the staff at Thai Spice has always proved superior in attentiveness, courtesy and general competence. Adding to that is the delightful, dare I say elegant \"sexiness\" of the décor, oozing in comfort and ambiance.", "Date": "2012-04-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Dan I. C.", "ReviewID": "hnG3x2Jqhbv7o1TUXdre6A", "Overall": "5.0", "Content": "Very few people can say that have been eating at this place when it was a small grocery store that rented Thai Movies. I can. Thai Spice reminds me of a caterpillar that transformed into a butterfly, just pure beauty. When I walked in the door the place oozed sexiness and elegance. The decor was very hip and even though I was having lunch it felt like night time in the restaurant. I had the spring rolls, steamed dumplings, Red Curry Chicken, a Delmonico Steak, and for dessert, the Mango Sorbet. All the food was excellent. The Red Curry Chicken was spicy hot as I ordered it. The heat was perfect and the coconut curry broth was F'ing delicious. Now for something that threw me for a loop was how good the steak was. What Thai restaurant serves prime beef grilled to perfection like this....I really had to think about it and no other Thai Restaurant came to my mind. The steak was served with a Tiger Tear sauce which was I think was a mix of soy sauce, fish sauce and some herbs. This sauce had a unique taste and gave the steak an interesting favor even though it tasted great without it. The mango sorbet was a perfect ending to a great lunch. Cool, refreshing, and sweet. Service was excellent. I can see why they recently won a Diamond Star Award. I highly recommend this place. It's not cheap folks and it shouldn't be. Great food, service, and ambiance has a price but Thai Spice is well worth it. Remember to tell the owner Michael , Dan sent you and Stay Hungry!", "Date": "2010-06-12", "Author_Location": "Coral Springs, FL"}, {"Author": "Joe C.", "ReviewID": "27k9MJDrRRnCA6m0bG6ENQ", "Overall": "1.0", "Content": "Food is good but you will experience the worst customer service. I am sure they are spending more money in marketing than in employee training.", "Date": "2014-02-06", "Author_Location": "Financial District, San Francisco, CA"}, {"Author": "Richard K.", "ReviewID": "ccEkXwCTsXtqbSD0xn72PA", "Overall": "5.0", "Content": "This is one of the best Thai places in South Florida.The place has very fitting cultural decor. The ambiance feels intimate with a dimly lit dining area and quiet music in the background.The service is fantastic. Waiters are knowledgeable and work diligently at making your experience memorable.The food is amazing. They have the best calamari appetizer. Oh, Crispy Calamari how delicious you are! Everything I have ordered here has been spot on and the people I have gone with has enjoyed this restaurant as much as I have.A good date place.", "Date": "2010-10-04", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Iris N.", "ReviewID": "rtubaiODWnQ0JMiYfO3MVQ", "Overall": "3.0", "Content": "Overpriced.  I have to say that I had high hopes of it being delicious from other yelp reviews, but you are paying for a lot of fish tanks to be well stocked and kept. I did my culinary training in South East Asia, so if there is one thing that I know it is Thai food. This is okay, but nothing that stood out except the check. For the price of the dishes I would have expected some creativity on the chefs part. This was more fusion pricing. If you want thai Tee-jay is along the same price, close in proximity, and better; plus you can get great sushi at Tee-jay.", "Date": "2011-12-20", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Mitchell M.", "ReviewID": "PMvMqrum3sKsBQcDZaHUAw", "Overall": "1.0", "Content": "The last two experiences here in past 2 weeks have been horrible. Came on a Sunday night and then Tuesday lunch with clients.Sunday night had Chiang Mai chicken normally one of my favorites here. Horrible that night. Weird story too. The to use the manager's words Caucasian manager was talking to a table of two ladies one from Jamaica. He mentioned that since he has been hired they have hired primarily \"Caucasians\" and then told another worker that he liked the word. Also heard him say they only had two Thai servers even though it is a Thai restaurant - bizarre.  Thinking Sunday was an off night came back Tuesday and had dreaming chicken deep fried chicken with peanut sauce- horrible. I'm going to give it the benefit if the doubt and say it must be that their head chef is on vacation. But regardless extremely disappointed.", "Date": "2013-07-13", "Author_Location": "Coral Springs, FL"}, {"Author": "Cristina W.", "ReviewID": "uCI_ilCQgD9cAAQaz0Vynw", "Overall": "4.0", "Content": "Loved this Thai restaurant. It was authentic, romantic, chic, etc.. It had it all, except for the bad parking.  We were lucky to find a spot, because there is barely any parking, and if not, it's cash only for valet.  Other than that, I'm glad I had reservations, because if not, there is a 3 hour wait on Fridays.  The service was excellent and so was the food.  We ordered sesame wings to start with, that were perfectly crisp on the outside, but full of meat.  I ordered the Chicken Pad Thai, that had crumbled peanuts laid perfectly on top of the food, and added a special touch.  I will definitely recommend this place for someone looking for a Thai restaurant.", "Date": "2013-10-08", "Author_Location": "Hollywood, FL"}, {"Author": "Lor L.", "ReviewID": "l05zQKEM3EyGuAwVrotdJg", "Overall": "4.0", "Content": "We have frequented Thai Spice for years, and it has gone through a few phases with the service. It's back to having excellent service now. The food here has always been spectacular. They are the best Thai on the east side of Ft. Laud, and they know it! Unfortunately, as many other places have done, they raised their prices. The Pad Thai is now $16.95--about $3 higher than other Thai restaurants.  On the plus side, their takeout menu is about $3 cheaper per dish than the eat-in menu. And of course, you do get  a nice leftover portion to take home.The portions are very large. Atmosphere is dark, classy, and romantic with fish tanks all around the restaurant. This is the kind of place that you can get dressed up a little bit and fit in very well with the crowd that dines there. Are the prices worth it?? Yes. While other Thai restaurants make thier food sweet just to appeal to the American crowd, Thai spice still sticks to being traditional.  This is our go-to place when we have a special occasion, or just have a little more money in the bank than usual. This is where you go to DINE, savor the food, and relax. We will continue going here. If you haven't tried Thai Spice yet, do yourself a favor and go to have a memorable night with friends and family.", "Date": "2009-09-01", "Author_Location": "Mantua Township, NJ"}, {"Author": "Andy M.", "ReviewID": "AduC0MRsVQuDk-29xS_-Zw", "Overall": "4.0", "Content": "Good apps, but entrees need work. These were lunch specials, so I am willing to give them a bit of a break. But still, there's no excuse for watery cashew chicken or a less than flavorful curry. On the app front, Mee Krob was surprisingly good and the spring rolls were nice, if small and a bit greasy.Elegant atmosphere and good service. A bit pricey for lunch, but I'd definitely go back for either lunch or dinner.", "Date": "2013-01-09", "Author_Location": "Lincoln, NE"}, {"Author": "James L.", "ReviewID": "5qY385Z9g3dLvfJSqjGbNQ", "Overall": "4.0", "Content": "Came across this place while working in the area.  I ate from there twice while working in the area. Once at the establishment and once at the hotel I stayed at (they do offer  delivery).   A lot of my  liking or not liking a place is on the service. This place had friendly and prompt service. I ordered the THAI STUFFED CHICKEN WING  with the sweet chili dipping sauce and the THAI BARBEQUED FREE RANGE CHICKEN.Also definitely try the Glass Noodles. If you've never had these give them a try, quite a pleasant surprise. These items are without a doubt  some of the best food I've eaten  from a Thai  restaurant hands down.  If I'm ever to make it back to Fort Lauderdale I will make it a point to return to this place.", "Date": "2012-12-12", "Author_Location": "Lafayette, LA"}, {"Author": "Keith H.", "ReviewID": "wdV9a6JBFXVwDOwLwf_AnQ", "Overall": "5.0", "Content": "Best Thai in South Florida by far.  Service is excellent, attentive and knowledgeable.  Everyone I take here loves it.  Decor is appropriate and romantic.  Fish tanks are awesome, my little nieces love them.  Always get a good laugh listening to the waiter go through the 100+ specials they have everyday.  Items I love:1.  Skirt Steak.  Perfectly cooked and the Tiger Tear sauce is amazing.2.  BBQ Chicken.  So different and better than any other BBQ chicken I have had.3.  Peanut anything.  Pad Thai, Peanut Chicken, Salad with Peanut Dressing4.  Grilled Calamari.  So fresh, served on a mini grill thingy.  Amazing sauce.5.  Deserts.  I think they get them from a local bakery and they are very good.  Join their mailing list, they send you coupons.", "Date": "2011-03-23", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jacquelyn M.", "ReviewID": "DDMezG02ntW71cARVWi7jg", "Overall": "5.0", "Content": "This location has been around for many years.  Thai Spice has made the list for one of my favorite Thai restaurants in Broward County.  They have many options for vegetarians and vegans.  Not only that, ask to replace the meat in any dish with tofu, and they have your back!The outside of this restaurant is a little misleading to how amazing it is inside.  Inside the restaurant is a nice relaxing and intimate atmosphere.  You come here casual or a little dressed up on a nice date night.  Either way, you'll what they have to offer.If you sign up on their mailing list, they send you a letter for a free entrée on your bday.", "Date": "2012-05-16", "Author_Location": "Delray Beach, FL"}, {"Author": "Dawn B.", "ReviewID": "k4z6Wz3ns5aqO70j8y7BWA", "Overall": "5.0", "Content": "Always on point! Mr. Tatton got everything right and expanded in these times, and that speaks volumes. I salut him on creating a terrific dinning experience from start to finish. Nothing is overlooked.", "Date": "2013-10-03", "Author_Location": "Pompano Beach, FL"}, {"Author": "Thomas S.", "ReviewID": "m5icOomNy7yp0V7IrYEIew", "Overall": "4.0", "Content": "A good friend of ours from FTL took us to this place to get what he called \"THE BEST THAI IN TOWN\".   After dining there, I would have to agree that it was exceptional.   I had the Pad See Eiw, of course and my only complaint was it was prepared with thin noodles rather than the thick/flat type.   The spices were good and level of hot was just as ordered. I sampled the Pad Thai from a friend and found that very good, as well as the Panang Shrimp.   A bit more expensive than the traditional thai restaurants, however you get a much more enjoyable atmosphere to dine in.", "Date": "2009-10-11", "Author_Location": "Richmond, TX"}, {"Author": "Eye F.", "ReviewID": "x5_mUjyHa7KvHPg_RduaqA", "Overall": "2.0", "Content": "I guess my review is a bit outside the popular views. I've lived and holidayed in the Far East, including Thailand for years. I eat Thai food in the USA frequently. Thai food this is not. Strikes me a Chinese with some Thai spices thrown in. Heavy, thick sweet caramelized sauces is not what I think of as Thai cooking. Onto the meal. Party of 4. Of four appetizers, the crab cakes were excellent, all the others were picked at and mostly left uneaten. Of the entrees, the duck was eh, nothing special. All 3 fish dishes had the texture of precooked fish that had been sitting on a steam table for hours and fast cooked to warm them up. The fish was dried out and mushy. Service was incompetent. I'll let this one go, it happens in this area all too often. All 4 of us decided Thai Spice was not worth a second visit. It's not bad, but its hardly Thai, the portions are way too large, the dishes heavy and sticky sweet and the cooking poorly executed.", "Date": "2013-05-13", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Moi M.", "ReviewID": "T-Wpsa3CpVuyQZgeRbxHFQ", "Overall": "5.0", "Content": "Can't say enough good things about this restaurant.   Besides the fact it has the best Thai food in south Florida, the staff is extremely nice, friendly, attentive and always close by if you need something. It's worth the drive from Miami or Palm Beach if you want excellent delicious Thai food with excellent service.", "Date": "2013-10-12", "Author_Location": "Boca Raton, FL"}, {"Author": "Silvina S.", "ReviewID": "r0SJ9ZRSpmVjf7MscJjliw", "Overall": "4.0", "Content": "Went with my husband for our anniversary and was very good. The fish was great and the appetizers as well. The filipino dessert, cassava cake, was to die for. My daughter LOVED all the fish tanks. We were very pleased.", "Date": "2013-08-10", "Author_Location": "Hollywood, FL"}, {"Author": "David C.", "ReviewID": "XuZIy5gD2aME3a2YBspsXw", "Overall": "5.0", "Content": "The place is a Thai food JACKPOT. It is truly amazing to have this caliber restaurant in Broward.. All the Thai is solid, but the craziest thing about this place are the steaks. They are amazing, some of the best steaks around. Below are some recommendations: ...Hot and sour soup - some of he best around, all fresh ingredients and not too spicy ...Rock and roll - amazing spring rolls, with real piece of shrimp, not the minced stuff you usually get ...Middle neck clams - JACKPOT - the best I have had here. They were big, juicy and fresh. Why can't more restaurant pay for better high quality clams? ...Stuffed chicken wings - weird to look at, but very flavorful and very fried ...Strip steak - BEST steak around and perfectly matched with a spicy sauce and bok choy ...Seafood curry - Amazing curry taste, fresh scallops and shrimp - this is an easy winner Portions are huge, don't be a piggy and share family style. This place gives hope to all Asian restaurants in the state of Florida. Service was fast, friendly and fantastic - this is going on a bunch of my \"Best of...\" lists. BONUS TIME: This place is fast, they can get you in and out within 45", "Date": "2011-06-02", "Author_Location": "Miami, FL"}, {"Author": "Jamie C.", "ReviewID": "nrcvBBbbZXoQDfV1fagNig", "Overall": "5.0", "Content": "Do you want mouth-watering Thai food? Then this is the place for you!!! I love everything about this restaurant. The atmosphere is great, and the service is impeccable. Some of my fav dishes include: the Volcano Shrimp, Garlic Calamari with Bok Choy, and the Sea Bass, yum yum. Perfect place for a first date or an anniversary. Rated high on Zagat for a reason!! Oh, and a reservation is advisable for faster seating", "Date": "2012-02-25", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jeremy B.", "ReviewID": "FJIXjMCOJLRpwQe0_TJooA", "Overall": "4.0", "Content": "I've been here several times for lunch with coworkers. Agree that it's a great place to introduce someone to Thai food, and for a business lunch. The thai food does not seem the most authentic ever, but that doesn't mean it's not of very high quality and very good. We went here again today, the waiter \"recommended\" a steak or the lamb chop entrees for lunch. Both are around $30. Instead, since we were at a Thai restaurant and came there for Thai food, we all ordered Thai food from the lunch special menu! I bet the steak is good, though. Prices on that lunch special menu range from about $8 to around $13. Most other entrees are more expensive. The Pad Thai (also around $10) is good, but not on that menu, so it doesn't come with anything. Whereas the lunch special items come with rice and either the soup of the day or salad. The soup today was hot 'n sour: pretty standard but good. Service is friendly, sometimes a little slow but that didn't surprise me because they were packed for lunch as usual.  Agree with another reviewer's recommendation to get there before 12 or after 1 and avoid Friday's. Parking can be a hassle and sometimes there's a wait.Regarding today's food, a coworker had the panang curry ($9.95), which had a delicious coconut milk sauce and vegetables such as asparagus, green and red peppers, onions, mushrooms, etc. I got the same dish but paid the extra $2 for shrimp, and was not disappointed. The shrimp were good size and tasty. All four of us who dined asked for our meals medium spicy and agreed that it was just enough kick to give it a pleasantly-spicy taste but to not be uncomfortable. Thai Spice may be a tad bit pricy and slightly americanized, but if you want a nice dining experience and above average thai food, it's a good bet.", "Date": "2009-07-16", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Rhonda H.", "ReviewID": "gEFkzCf7w98loTMZWyJHfw", "Overall": "4.0", "Content": "Hooray! The great food is back! The restaurant had lost its way for awhile, serving less than stellar dishes but after last night's visit, I'm happy to report the standard for great Thai cuisine has been reinstated. This is the best that it gets. Great sauces, quality food cooked to perfection! Fish dishes are a must try, along with most of the appetizers, chicken bites and coco shrimp being my favs. Crispy calamari will have you addicted for sure! Great staff, great waitering and beautiful surroundings add to the pleasant dining experience. Couldn't give 5 stars because of the limited and paltry wine selection (definitely not what it once was) but as far as the cuisine, this will, for sure, be a \"happy ending.\"", "Date": "2013-10-06", "Author_Location": "Pompano Beach, FL"}, {"Author": "Melinda E.", "ReviewID": "9i3Enw7hx119vtCAtSC8qg", "Overall": "5.0", "Content": "Freakin' Delish! Curry puffs to start and scallops basil as the entree...manifique! Great service and ambiance. I will definitely come back when I am in the area!!!", "Date": "2013-11-06", "Author_Location": "Coral Springs, FL"}, {"Author": "Ken G.", "ReviewID": "wMlXE0mAy-KgHSuMF3hwiw", "Overall": "1.0", "Content": "I've been there twice since it's my mother-in-laws favorite Thai restaurant. However, I found the food on both occasions bland, flavorless, and quite over priced. I won't return unless my wife threatens me with divorce, and then I'll have to give it some thought.", "Date": "2013-12-31", "Author_Location": "Los Altos, CA"}, {"Author": "Michelle M.", "ReviewID": "A6vP8044rilLRV2fBAQJRg", "Overall": "4.0", "Content": "Yum! The green curry was GREAT and the bacon wrapped chicken app was delish too! The service here is top notch. Perfect for a first date! It seemed like a lot of regulars were eating there. Try it out!", "Date": "2012-03-27", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Bianca L.", "ReviewID": "RlA0VT2PDCFA0rJesI3BnQ", "Overall": "4.0", "Content": "What a wonderful little restaurant!We went in last night around 9pm after reading reviews about restaurants in the area (which we don't know much about). Thus, my mother and I made our way to Thai Spice. The place was almost empty, but dark and quaint. It was especially comfortable on the booth.  We ordered the following off the menu:Appetizer: Two Thai Spring Rolls (AMAZIIIING), and two Vegetarian Spring Rolls. The sauces that come with the rolls are really tasty, to the point where we'd use a spoon to eat the remaining sauce off the bowl.Entrées: My mother ordered a vegetarian pad thai, which she LOVED. I ordered the fried calamari over brocoli, and sweet corn in a pepper and garlic sauce. I have to say... I did not like it, but my mom loved my dish. IMPORTANT: I didn't care much for the pepper taste because I am a difficult eater when it comes to Asian food. The restaurant cooked my dish very well and I am sure it is a very popular dish. It was just my own preferences...They have quite an amazing list of wine and spirits. We did not have anything but water and tea because we were driving... But I really can't wait to go back! Even if it's just for the spring rolls! The Thai Spring Rolls were tastier than the Veggie rolls.It really is a great place in the middle of Fort Lauderdale. A little pricey for the type of food... but a quaint place.", "Date": "2012-07-19", "Author_Location": "New York, NY"}, {"Author": "Kerrie M.", "ReviewID": "FHQGyF8wZHFOFG8-i2oEYg", "Overall": "4.0", "Content": "If you are looking for excellent Thai food, a lovely atmosphere, and excellent drinks, this is the place for you!  This was simply the best Thai I have had in SoFL! Their cocktails were perfect, everything on the menu was terrific! The only thing that was a bit off-putting was the constant barrage of questioning... It was pretty hardcore compared to other places. Apart from the typical \"can I get you anything else\" type of question, which is to be expected maybe once or twice, these were constant. It interrupted the same brief but important conversation more than 5 times, and the waitress (and two other restaurant employees) asked my b/f if he wanted another beer (no exaggeration) more than 10 times in the last 15 minutes that we were there before getting the check. While this was frustrating, the food was great! I may go back if I am in the area, though I will know better for next time to try and leave certain conversations that should have minimal interruption for a more intimate venue.", "Date": "2012-03-18", "Author_Location": "Deerfield Beach, FL"}, {"Author": "Jeremy A.", "ReviewID": "AqeD5Td1yYHAJzbl4Poxkw", "Overall": "1.0", "Content": "I will never return here. I've been there twice and both times were crappy.  The second time instead of getting one major entree we ended up getting various appetizers to try a lot of their menu options. unfortunately everything tasted the same and they were all dried out.  There is nothing special here.", "Date": "2013-03-25", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jessica S.", "ReviewID": "beU4KqGtWpKTZzn1ubfqmw", "Overall": "5.0", "Content": "This is the best Thai food I have ever eaten(other than Thailand), kidding, never have been there. Would love to though. The ambiance is quaint and personal, the staff is friendly and helpful. If you have never eaten Thai food, it is kinda tricky to order.... Even the least spicy is slightly spicy. The three buddies is my fav and I order it every time I dine here. Not to mention the amazing soups;different flavors all blended perfectly!!!! To die for. Hands down the best Thai in Ft.Lauderdale.", "Date": "2013-04-19", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Christina P.", "ReviewID": "oteECt3s3IOP5Z4zdgH8QQ", "Overall": "4.0", "Content": "This is an excellent Thai restaurant and went for my first time with a group of friends. All of the dishes at our table were mouth watering, (I tried all of them!) Everything here is cooked and prepared with fresh fish and ingredients and it truly shows. We had satay chicken and coco shrimp for starters. For my main dish, I chose the shrimp with cashews plate and it was sooo delicious! The flavorful sauce and water chestnuts in this plate made the meal so satisfying! Although the dessert was forgettable and they didn't have Thai donuts (my favorite) and were playing hip hop music in the background...everything else was superb about this restaurant experience!", "Date": "2011-09-15", "Author_Location": "Miami, FL"}, {"Author": "Carla M.", "ReviewID": "grBUM8sRfgBDI6lVF3Q2jg", "Overall": "5.0", "Content": "Absolutely amazing every time I go. The fish is always fresh.My personal favs: Tom Ka Gai, Calamari and Sea Bass. The pad thai is delicious as well!An absolute must if you have not been!", "Date": "2012-09-17", "Author_Location": "Hollywood, FL"}, {"Author": "Kathy M.", "ReviewID": "5vbBTtsj8JVb4x6n7xVoPA", "Overall": "2.0", "Content": "I've been eating at Thai Spice for about 15 years.  It used to be a treat to go there - the food, the service and the ambiance all exuded elegance.  I have no idea what has happened in the last couple of years, but from now on, I'll happily drive the extra 1.1 miles to the other Thai restaurant on Federal Highway.We were there a couple of Wednesdays ago.  It was Karaoke night. (Short sentences for dramatic effect - I'm trying to think of something polite  say.....) Now, I'm not a big fan of Karaoke, but I recognize many others are.  Fine.  And I enjoy live music when the musicians are, are, well, top-notch.  But is it too much to ask, in a \"destination\" (that adjective is on their website) restaurant that has four distinct rooms, to have regular music where people are eating, and keep the (abrupt colorful adjectives deleted to continue to be polite) \"singing\" (oops...couldn't help myself) confined to the bar area?  C'mon? Please?  For three blissful minutes the \"singer\" paused and the music switched to something current, professionally assembled and pleasant.  So I had three good minutes in the evening, otherwise, the ambiance sucked, er, I mean, had an air of 70's throw-back crossed with high school talent show.My apologies in advance to any waitstaff there who take their jobs seriously.  Unfortunately, we weren't seated in your station.  I wish we had been.  The man who swept us off the entry threshold almost prevented us from a bad evening.  He was so pushy and unaccommodating, if he hadn't finally seated us in the dining room after showing us two different tables in the exceedingly loud and completely customer-desolate bar after we repeatedly asked for \"a quiet table where we could talk,\" we would have walked out before even being seated.  Alas, we were paraded thru the entire restaurant  and given a table next to the kitchen.  Nothing says \"quiet romantic evening\" quite like a banging kitchen door and constant foot traffic.And that was just the beginning - it gets worse!  Our waiter and his little helper were two of the least professional waitstaff I have ever encountered in a restaurant where you don't retrieve your food off of a counter after your name is called.  Our drinks - nothing fancy, just Thai iced teas - took about 13 minutes to arrive.  By this point, we knew what we wanted to order, but Mr. Waiter insisted on reciting the specials.  After the unwarranted litany, we ordered the veggie red curry and grilled organic free range chicken.   Yes, the food took an inordinately long time to arrive.  When it did, the presentation was disappointing.  The curry was served family style.  The chicken and its accoutrements adorned a platter sized for a Viking king.  This doesn't look awkward in front of a guy with wide shoulders, but ladies, don't go there - you'll look like a troughed hog. Despite both meals being ordered \"medium spicy, \" they were both not at all spicy.  They tasted fine, but nothing warranted the prices. The baby bok choy with garlic was perhaps the highlight.Twenty minutes ~after~ we placed our silverware in the 4 o'clock \"we're finished\" position and pushed the plates to the end of the table, Mr. Waiter checked in to see if everything was ok.  \"Yes, we've finished. The check please.\"  Ok - check this out!  Mr. Waiter left our table carrying one little glass and we waited another five minutes for his little helper to cart away the rest of the plates.  Seriously!  Has anyone ever seen that before, because I certainly haven't.  Then, the little helper comes back and interrupts our conversation to request I hand him a spoon that was tucked away by the salt and pepper.  Really?  You want me to help clear the table in a \"destination\" restaurant?  After the ten minute clearing process (thirty minutes now since we finished eating) Mr. Waiter comes back to ask if we want dessert.  \"No thank you, just the check please.\" (Didn't we ask for that ten minutes ago?) Finally, we do get the check.  But!  We also get a spiel about birthday specials and filing out comment cards.  Let me emphasize this: birthday specials and comment cards in a \"destination\" restaurant.  Wow.There is a reason why there are no accolades past 2010 on their web page .  I don't know what that reason is, a change in ownership or management, perhaps?  But the accolade-givers have known all along what I just experience first hand. Thai Spice is a \"destination\" alright - the kind you warn all your friends about.", "Date": "2013-02-09", "Author_Location": "Oakland Park, FL"}, {"Author": "Adam K.", "ReviewID": "4u5kbS05s1meipgy9DpYHg", "Overall": "4.0", "Content": "Best green curry I have had in the Miami/Fort Lauderdale area. If you have ever had green curry in Thailand, you will know what I mean. If you make the curry right, it makes all the difference. It wasn't on the lunch menu but I asked if it was available and they obliged. This one didn't have the thai eggplant and long beans but they substituted zucchini, asparagus (and some snow peas) and it turned out great. The salad that came with it was pretty standard, but had a peanut sauce on it. Not bad.I will be returning to try other dishes as they seem to use authentic (and delicious) recipes. When my co-worker suggested we go to Thai Spice, I assumed it would be a hole in the wall take out place. Nope. This is a full on restaurant, sort of dark inside, with a hostess. Good service. No complaints really. They also have outside seating.Parking was tough during the lunch hour. There is another lot behind and to the east of the restaurant if you are looking for additional parking, but you have to pull out of the main lot and use the next driveway to get there.", "Date": "2010-11-16", "Author_Location": "North Miami Beach, FL"}, {"Author": "Shehnaz H.", "ReviewID": "HZeqrWsti-69FvcMw9VZRQ", "Overall": "5.0", "Content": "The best thai food you will experience is located here in ft Lauderdale. I've lived many places in the country and the pad thai here is the BEST.  My family and I have been coming here for many many years before they expanded and it has stayed authentic, accommodating and of course delicious. Michael the owner is extremely kind and gracious as well as his staff. After yrs of dining here, we have a few favorites that we always order no matter what..... Pad thai ( we order as an appetizer to share with the table) so that we can order entrees as well. The pad thai is a must. Penang, massman, and sweet and sour shrimp.  I'm so happy that this restaurant has done so well and really deserves it. They have made us feel like family over the years and I'm sure you will enjoy too!", "Date": "2013-09-15", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Bill S.", "ReviewID": "Ox0xjhJP65g-mlfSEL8zJA", "Overall": "4.0", "Content": "Really good Thai food.I like the coco shrimp appetizer, garden salad, and Pad Thai for lunch or dinner and it really is good.The only problem with this place is the lack of parking.", "Date": "2011-09-04", "Author_Location": "Delray Beach, FL"}, {"Author": "Kat T.", "ReviewID": "uBfgOi07kCT0rc6EL7fxtQ", "Overall": "3.0", "Content": "I wouldn't call this Thai.Well, not the usual sort of Thai. I was really in the mood for utterly Thai, and this was all about the \"Angus beef\" and wine pairings. A bit too far along the accomodating non-Thai fine diners spectrum for what I wanted that night. It's really intended as an \"impress your dining partner(s)\" sort of place.That said, the crispy calamari appetizer was done really well, and so was the fried whole yellowtail snapper. The only major issue was that the snapper was far too small - it could have been an entree for one - not the thing one expects when ordering a whole fish. Also - \"medium\" was really bland.The many fish tanks entertained the tykelet, and the staff seem to be welcoming of young diners - surprising given their menu. (We saw another table with a kid in a stroller as we left.)", "Date": "2008-06-29", "Author_Location": "Sydney, Australia"}, {"Author": "Darryl S.", "ReviewID": "SEdGco_hl2OYNyR8UkFPZQ", "Overall": "4.0", "Content": "We've been putting this one off for quite some time simply because of it's cost.  (Personally, Thai food should be cheap, or relatively inexpensive; paying $30-$40 for a Thai meal is just not something we're too keen on doing, esp. considering how cheap great meals are in Thailand.  That said, it was time to cash-in one of our \"special night\" chips....)To start, I felt seriously underdressed for this place, as the whole vibe was definitely on the high-end side of the ambiance scale.  Fortunately, this IS South Florida, so even in some of the fanciest of restaurants, casual is cool.  I felt like we were going into some chic opium den:  Lots of exotic-looking woods, numerous large-scaled fish tanks, embellished portals leading to various dining niches, striking artwork, wall art and sconces, and some seriously low-key lighting.  (This was, I think, the darkest restaurant I've ever eaten in.  Fortunately, our table was next to a fish tank, so the lighting helped to illuminate my menu; I had to run out to the car to get my reading glasses.)  Our waiter greeted us almost immediately, and, thus, began what would, indeed, become a special dining experience...!Started off with a couple of Thai beers (Singha), which arrived icy cold with chilled glasses.  For appetizers, we ordered the fresh rolls ($10.95), along with an order of the crispy calamari ($15.95) (my personal litmus test for restaurants that serve this dish).  To our surprise, the fresh rolls arrived quickly.  Also to our surprise, at 11-bucks, these fresh rolls were sadly bland:  the rice paper wrapping was a bit under-cooked and chewy, and the chef used Surimi (imitation crab meat -- the pink stuff) instead of the real thing.  (Personally, it should've just been left off; we were both disappointed, mostly because of the price and expectation.)  That said, the presentation was beautiful, the dipping sauces (one sweet/sour; one peanut) were tasty, and (overall) it was a wholly-decent fresh roll.  Concurrently, the crispy calamari arrived; this was NOT your normal batter-dipped and deep-fried deal!  The plate arrived with a large mound of glistening, red-speckled, slices of squid tubes and tentacles:  no extraneous embellishments.  OMG, this dish was extraordinary!!  I could've simply had this as a meal (with a side of steamed rice) and would've been happy as a clam in a sea bed...!!!  (There was a restaurant in Atlanta that, for many years, took the top spot for fried calamari in my book; Thai Spice has now roared to overtake that spot!)  Even at 16-bucks, I would've ordered another; it was worth every penny!For entrees, my partner ordered the Cowboy Rib-Eye meal ($39.95 -- a hefty chunk o' change, indeed!), and I ordered the Three Buddies dish ($24.95), which is a dish consisting of jumbo shrimp, diver's scallops, and chicken, all simmering in a red-pepper sauce, over some veggies.  The presentation, too, was beautiful and vivid.  The flavors were amazing!  Chicken slices were super tender, diver's scallops were humungous and perfectly cooked, and jumbo shrimps were, indeed, jumbo, plump and tender, as well.  (My only negative is the fact that it was served with its tails still on.)  Mi amigo said his steak meal -- the massiveness of the dish was quite the eye-opener! -- was excellent and well-worth the price.Unfortunately, we were both stuffed at the end, and simply did not have any room for dessert, which our waiter presented to us to view on a platter.  (All looked amazing!)  This was first-class dining all the way...!  Only other negative was the $6.50 charge for the beers -- 4 beers at $26! -- which, in our opinions, was exorbitant, esp. considering it was simply Thai bottled beer that can be had anywhere else at $3-$4....  I suppose these prices are required for the overhead, including the super wait staff....  This place gets 4-1/2 stars -- the 1/2-star deficit is for those overpriced beers and mediocre fresh rolls....  :)", "Date": "2013-05-05", "Author_Location": "Wilton Manors, FL"}, {"Author": "J B.", "ReviewID": "5uBbyGEwKjdT9V7REr2JfQ", "Overall": "5.0", "Content": "Oh Yea this place ROCKS!!!Went here last night, definitely recommend getting a reservation. It was pretty packed. Nice atmosphere, dimly lit. Service was perfect. Food... OK where to begin.Appetizer.... The stuffed chicken wing. They remove the bone of the biggest chicken wing I've ever seen, then fill it like a dumpling with pork, clear noodles, and various thai herbs and spices with a chili dipping sauce. Holy Crap... YUM!Coco Shrimp dipped in tempura batter and rice noodles and served with the most very light velvety honey mustard sauce, best I've ever tasted. Drink: Thai Ice Tea, another yum and my new favorite drink... Lemon Drop Sake-Tini  (Martini made with Sake) Hallelujah!!!!!Now for the main course...Triple Main Lobster Tails in a Thai Garlic Lemongrass butter sauce and vegetables. Words can not express how amazing this dish was. But the lack of words can... my friend and I sat there all of sudden speechless, there were occasional moans of ecstasy coming from us but that's about it. It is on the pricey side, but for original prepared dishes, Thai dishes that are created a little outside of the normal thai box makes every penny worth it, especially matched with great service, and a very extensive menu.", "Date": "2011-03-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Anthony G.", "ReviewID": "h3N8ZB9Orob-jnvCVOW9Dw", "Overall": "4.0", "Content": "Adequate, clean and has good service.  But not the best.Lunch prices are reasonable; otherwise, it is somewhat pricey.  Food is good, although a bit bland.  (\"Medium\" was VERY mild for example.)  Food was good, but not spectacular.  Panya Thai on 163rd is a LOT better in all respects and is about the same price.", "Date": "2011-02-23", "Author_Location": "Miami, FL"}, {"Author": "Jeff P.", "ReviewID": "lhlWABvMucGzwW2VnetWyA", "Overall": "2.0", "Content": "This place was not for me. I felt the food was very Americanized and not authentic. It's almost like a fusion steak house-thai restaurant-seafood restaurant as opposed to an authentic Thai restaurant. For example, they serve steaks, pork chops and seafood in addition to Thai food.  They also serve dishes that are popular in Asia in general such whole fried fish which is very popular in China. They also serve salads with some of their meals. I didn't care for the ambience. I feel the restaurant is too small and I felt claustrophobic. The tables were too close together and I could hear the conversation of the people seated behind me. The waiting area is tiny in my opinion. There were not enough seats and we stood for nearly 45 minutes waiting for a table. Speaking of which, I would definitely not recommend this place for families particularly for those with small children as there is little space for strollers and the long waiting times would make your night very challenging.  The place is located in a tiny strip mall so the parking is also limited. Many people have to wait for others to leave before getting a spot. Finally, the service was pretty lackluster. Our waiter was not very attentive nor friendly. The food was  good but not great. The pad thai had too much egg and peanuts. Their curries and sauteed dishes were very watery with overly large thick chunks of vegetables. Nonetheless, for me, it's too much trouble to dine here. I'm not willing to drive to Oakland Park and compete for parking in a tiny strip mall and then wait another hour in line for pretty good but not great Thai food. I don't really care about wine pairings and unique salads when I approach Thai food. I think the main reason it is so popular is there are not many quality Thai restaurants in the area, and their lounge vibe really works for many people. I think it's a great place to impress a date but for a Foodie seeking the very best Thai food, I think you will be a bit disappointed.", "Date": "2013-11-28", "Author_Location": "Miami, FL"}, {"Author": "Deborah R.", "ReviewID": "dP8nglSZhhzvrfoYZFrfiw", "Overall": "5.0", "Content": "I have been eating here since 1992 and still love the Coco Shrimp and Grouper in Thai Basil Sauce.  My only disappointment last week was that they have changed the coconut ice cream and fried banana dessert.  It used to be with actual bananas cut into bite sized pieces.  Now they use plantains and only 4 pieces, but they just do not taste the same as the bananas!  I hope they decide to stay with their original dessert -don't cut the quality after all these years!!!", "Date": "2014-02-13", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Daisy P.", "ReviewID": "9n9hILwa8XHo8QShCWZEvQ", "Overall": "5.0", "Content": "Hands down the best ! Just got done celebrating a friends birthday here and I am so glad he chose this place. The decor is very nice and I love the many different fish tanks that create light and movement in every room. The service was spot on. Always refilling our water glasses and not overly fawning. The cripsy calamari and grilled calamari were really good. I ordered the Shrimp pad thai and fiancee had the special of the day (Sea Bass with Curry sauce) Wow! the presentation and flavors of the two dishes were amazing and well composed. The kid at our table took a liking to the orchids and decided to eat them.... To end the night we had the peanut butter & chocolate mousse cake and it was heavenly. Cannot wait to go back. Even got to meet the owner who stopped by our table!!", "Date": "2013-01-18", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Becky D.", "ReviewID": "HR-3jVBHboc9Waz9XMD_xA", "Overall": "5.0", "Content": "Upped my star level because this is still the best Thai food that I have found in South Florida. I have been a couple more times and it is consistent with always good food and service. If I could afford to eat here more often I would! Compared to west coast Thai food... well it wouldn't be getting 5 stars, but this is as good as it gets when compared to local competition. I hardly ever give 5 stars and I'm still not sure if it's the right thing to do in this case LOL if 3-stars is average, then most places should be getting 3 stars! Thai Spice is awesome- I'm a fan!", "Date": "2013-06-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jackie S.", "ReviewID": "Qsf2DbG5ZvTzS_6cM6Zw2Q", "Overall": "4.0", "Content": "Wow I ordered the shrimp fried rice and it was delicious, the shrimp was grilled to perfection and tasted really fresh. Can't wait to go back there again...", "Date": "2013-04-10", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Janis R.", "ReviewID": "Ohd1CpyYmX5lVwjAHTbG5w", "Overall": "5.0", "Content": "Thai Spice has always been several cuts above other Thai restaurants from a food and service perspective. But with the recent expansion, bar, entertainment and valet parking, they have upped their game, elevating the entire experience. They've even fixed the backwards entrance/exit issues with the parking lot. From the moment you pull up at valet, to the ever-gracious Mary Ann at the hostess desk, to the accommodating servers and chef, this is pure Thai heaven. And, listen up vegans...They don't look at you like you have two heads when you ask the chef to take out this or add that in so this is a great place to go with everyone without sacrificing your own dining pleasures. I get the vegetable Pad Thai minus the egg and fish sauce and add steamed tofu or the  vegetable Penang curry (minus the fish sauce) plus steamed tofu and brown rice.  You can ask them to do a vegetarian fresh roll if you want an appetizer. And the peanut dressing is not to be believed!  Portions are ample so if you want Thai for breakfast the next day, you won't be disappointed. Call to make a reservation. They're not on open table. Then go. You won't be sorry.", "Date": "2013-03-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "S F.", "ReviewID": "PUWpmlS_j9K2BGkYXfSS8A", "Overall": "4.0", "Content": "Great first experience. Got the calamari, wonton soup and lobster pad thai. The lobster pad thai was great. Huge dish with half a tail. Looking forward to sampling non-noodle dishes.", "Date": "2013-04-13", "Author_Location": "Santa Monica, CA"}, {"Author": "Celina M.", "ReviewID": "wmPfypVu3y1HrAUB3Paviw", "Overall": "5.0", "Content": "Best Thai food in So FLa!", "Date": "2013-06-27", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "M F.", "ReviewID": "ijhPnoplZcdlxf9RlPTf1A", "Overall": "5.0", "Content": "The BEST, I just wish they open a location in the Galt Ocean Mile area! We need a great Thai place around here! The only Thai place we around here is Thai To Go... is really bad (not really Thai) and the staff have bad attitude. We have so many residents that love Thai food in this area, owners should consider getting one of the available places we have around here and bring real Thai to Galt Ocean Mile! we are spoiled here, we just walk out of the lobby and we can go dine without using a car! We have two great Greek Restaurants, few nice Italian restaurants, French,  American and a nice jazz club place that has gourmet appetizers...we need a nice Thai restaurant here!Thanks!", "Date": "2013-07-05", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Cyndee K.", "ReviewID": "znmmb_9WMpCsSzEdsZHhZw", "Overall": "5.0", "Content": "Best Thai food ever.  Been going here for 15 years and always great", "Date": "2013-06-03", "Author_Location": "Alpine, NJ"}, {"Author": "Griff G.", "ReviewID": "jnN7zVppGT3VviBMCJGNUA", "Overall": "4.0", "Content": "Simply as good as it gets down here. And believe it or not, probably the best steak in Fort Lauderdale... yes, better than the major players.....", "Date": "2013-12-09", "Author_Location": "Miami, FL"}, {"Author": "Mike S.", "ReviewID": "v8J_SjOpC8WgxZA35_KH_A", "Overall": "5.0", "Content": "Chicken asparagus = Amazing!  It is seasonal, though.", "Date": "2013-03-09", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Richard R.", "ReviewID": "eSRZxkWinACHfcEh9I3WbQ", "Overall": "5.0", "Content": "Finally a Thai restaurant serving fresh fish and shrimp (as opposed to frozen.)  The whole red snapper with red curry sauce and basil was amazing.  The appetizers of Mee Krob and Yum Woon Sen were excellent, just like in Thailand.  I have reserved 5 stars for Thai restaurants with fresh fish and great flavors and I finally found one.", "Date": "2013-02-15", "Author_Location": "Hampden, MA"}, {"Author": "Dave G.", "ReviewID": "GQokAkrlYL22trU6-KqFRQ", "Overall": "5.0", "Content": "For years I lived around the corner from this little gem of a Thai restaurant and ate here so many times.  About 8 years ago I moved to Los Angeles, and I still haven't found Thai food as good as this place.  Being back around my old stomping grounds, it was time to drop in and do a write up.Well some things have changed in my 8 year absence.  The restaurant as well as the menu has expanded and is more high end now, although all their traditional dishes remain.  It was always very nice looking, with some of the prettiest fish tanks you'll ever see in a restaurant, but by expanding into the next door store, it's even nicer.  They are getting ready to expand yet again.  Business must be good, and they deserve it.We started off with my favorite appetizer, Namsod.  I've never found anywhere that does it as well as Thai Spice.  It's ground chicken breast, fresh ginger, roasted peanuts, red onions, cilantro, chopped scallions, lime juice, and chili paste.  The chili paste is fairly mild as the spiciness seems to come from the ginger.  I'm guessing the red onions are \"pickled\" and really soak up the lime juice flavor.  So many times red onions can be too strong, but not in this dish.  The namsod is served on a small bed of lettuce, and in the past I've ordered just this dish for lunch and been really happy.  I was glad it was just as great as I remember and they haven't changed a thing.  One other appetizer I can brag about is their Curry Puffs.  Ground chicken, sweet potato, onions, are mixed with curry powder and stuffed into a spring roll wrapper.  It's folded into a triangle and deep fried, yum.I value my brother's opinion highly and when he told me I had to try their steaks, I wasn't going to argue.  Steak at a Thai Restaurant, really?  They didn't even have steak, when I used to go there.  But sure enough, not only they have steak, they have Prime Dry Aged steak.  Some great steakhouses don't even have dry aged steak.  So I got the 22 oz Cowboy steak, bone in rib eye.  This was a very thick cut steak, about 3 inches.  Because it was dry aged there wasn't a lot of fat left on the steak, most of that gets lost in the aging process.  They cook it over a very hot open flame and get a nice char to it.  I ordered it medium rare, but it came out more on the rare side.  This was fine for me, but for others might be a problem.  I like rare steak, just as long as it's hot - I'm good.  The seasonings are very very bold.  Almost flavor overload.  They didn't want to tell me exactly what they rubbed all over it, just said it was Thai herbs and ginger garlic soy sauce.  Well, whatever the Thai herbs were, it was one of the most seasoned steaks I've ever had.  But that isn't where it ends..it's served with their Tiger Tear dipping sauce.  I'm guessing it's made from fish sauce, soy sauce, red chili paste, coriander,  lime juice. maybe some brown sugar.  It's very spicy, but I didn't mix it up.  When I poured the remaining sauce on some white rice, I got a lot of the chili at the bottom and it went from very spicy, to \"get me some water now!!!\" Hot.  Yes it will make a Tiger Cry.  Served on the side was some amazing Bok Choy.  This was also quite spicy as it was sauteed in chili oil.If you don't want to break the bank with one of their $40 steaks, they have plenty of traditional Thai dishes in the $15 range.  Their curries are outstanding.  My wife has always really liked the Pad Woonsen, a thin bean noodle dish sauteed with mixed vegetables, egg, and either chicken, pork, or beef.  Thai Spice has plenty of different seafood dishes on their menu, you'll have a hard choice picking between them.Sometimes when you fall in love with a restaurant, but then move away, you start to think it's better than it really was.  Coming back to Thai Spice after all this time, I can say that, it's just as good as I remember it .  5 stars all the way.", "Date": "2011-04-12", "Author_Location": "Fullerton, CA"}, {"Author": "Eric D.", "ReviewID": "5Wl9GxwETpOrb8uwB2JDMQ", "Overall": "4.0", "Content": "Thai Spice is a decent Thai restaurant that has been slightly Americanized.  This was made apparent when they had zero Thai desserts available.  Not what I expected from what on the outside (décor and main dishes) appeared to be an authentic Thai restaurant.Atmosphere - Swadee Thai...elephants w/ trunks up, Buddha's galore, teak inspired coloring on the wood carvings and lots of fish tanks.  I felt I could have been in Bangkok.Food - I had the Yum Nua (Spicy beef salad) my standard test dish of Thai restaurants (yes, this is now a science).  The dish came w/ sliced grilled beef, red onions, tomato, cucumber, red peppers, cilantro and lime juice...oh and a nice purple flower.  It was good as expected.  Only complaint is that the dish was a little too watery making it difficult to eat.  For my main dish I had the Green Curry Chicken which came w/ chicken (duh!), green curry paste, coconut milk, zucchini, bamboo shoots, pepper, green bean pods and fresh Thai basil.  It was tasty and although I am not a big fan of green pea pods in my dish it was on par with a great and a higher priced Thai restaurant that I went to while in London.  While I love spicey, the waiter was kind enough to steer me away from Thai Hot to a more subtle level of heat.  He even brought out a little dish of assorted spices if I want to turn up the heat.  Yo, momma!!Service - Prompt and lots of refills on my water (the food was spicy).  Waiter was conversational and helpful w/ my selections.    Overall - a nice restaurant, although not a 100% traditional Thai restaurant, it will definitely appeal to your first time Thai diner.", "Date": "2008-10-08", "Author_Location": "Cornelius, NC"}, {"Author": "Nina C.", "ReviewID": "H5OZ8lz3hpJgfViVkoC3ww", "Overall": "5.0", "Content": "Anyone who doesn't give this place 5 stars is a complete retard and doesn't deserve to eat period!!! This place was outstanding!!! I had the sea bass with peanut sauce- frickin amazing!! My man had the skirt steak- let me tell ya for a shitty piece of meat (let's be honest) was awesome!! It wasn't tough or gritty just tasted amazing!! The sake was great the waitress was awesome - can't wait to go back!!", "Date": "2012-04-15", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Cyn H.", "ReviewID": "vhk5_LQf-I98AEOdpuHG8g", "Overall": "4.0", "Content": "Good food.  Good wait staff.  Just not that extra to a five star", "Date": "2013-03-18", "Author_Location": "Lubbock, TX"}, {"Author": "Robin E.", "ReviewID": "BDcZYBuF90TBuPnxSQu4wQ", "Overall": "3.0", "Content": "Upscale Thai. It's good. Really good. It's a date night Thai place. It's not your middle of the week Thai place. Bring the boss. Bring that cute girl in HR. Hell, bring yourself for a sake mojito and Tom Ka Gai.  This is an experience and good food (and I wasn't kidding about that mojito ... it's worth the trip alone). Just know there are equally good Thai places at 1/ 4 of the price ten minutes away, and I only point that out because the sticker shock will get you if you're not prepared.", "Date": "2012-12-06", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Tony B.", "ReviewID": "Pv8Op9yYkaz6rznus5V7SA", "Overall": "5.0", "Content": "I had the Vegetable Curry (medium), 13$ and it was wonderful", "Date": "2013-03-10", "Author_Location": "New York, NY"}, {"Author": "Manuel R.", "ReviewID": "7KJo1fYTcIY2Wbeabkz4dg", "Overall": "5.0", "Content": "This is some very very good Thai food. The taste is always consistent. Though a small place the atmosphere is nice and the staff is great. The food is simply delicious. Do you like hot food? You can order it as hot as you can handle it. I recommend \"hot\" or \"thai hot\". Prices are very good and this is definitely a place to take you loved one or clients.", "Date": "2009-06-29", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Tracey Y.", "ReviewID": "f4r53s4-nxDmz-mS2ovRBg", "Overall": "1.0", "Content": "I went to this place because of the 4 star rating and the number of reviews.  I had high expectations since the place was not cheap and it supposedly had a 5 star service rating.  That is not what I experienced at all...  First of all this is a Thai restaurant, and the waitress didn't know what Phad Kee Mao is.My entree cost $38, the entire meal close to $70, and the shrimp was not fresh.  It had the aweful fish stink that fresh seafood should not have.  I never ever complain to the restaurant staff at any restaurant, I guess since I'm shy, but I did this time since I expected more from a restaurant that was rated so high and wasn't cheap.  They told me that the chef said the seafood was fine.  It was always fine according to them.  So they didn't give me anything in response, except for that explanation.  I think that's basically telling me that I must be wrong.I have eaten at numerous thai restaurants and this would rank the lowest amongst them.  I am never going back there.", "Date": "2012-02-27", "Author_Location": "Bellevue, WA"}, {"Author": "Gerald H.", "ReviewID": "HHMLp630bFrShi5kqw3exg", "Overall": "5.0", "Content": "Great food", "Date": "2013-03-25", "Author_Location": "Lauderdale Lakes, FL"}, {"Author": "Lauren B.", "ReviewID": "KIjCN4urNrtuLP_hnM6V4A", "Overall": "5.0", "Content": "Great place! Food is different and delicious. I had coconut soup with chunks of crab which was amazing, and the green curry with beef. The beef is better than other places. The service was fantastic and very attentive.  Will definitely be going back!", "Date": "2011-10-10", "Author_Location": "Seffner, FL"}, {"Author": "Helen L.", "ReviewID": "NYcfgb7Ap4KC1oezM061GA", "Overall": "5.0", "Content": "Words I never imagined hearing from my daughter: \"Mom- their fried rice actually is better than yours.\" (and she loves my fried rice!!!) incredibly tasty food, though, I personally tasted more of a Chinese flavor to their cooking than traditional Thai. Nevertheless, highly recommended!", "Date": "2012-05-29", "Author_Location": "New York, NY"}, {"Author": "Ella G.", "ReviewID": "fD9ReuunArMQID1u7U7j3g", "Overall": "4.0", "Content": "Thai Spice is a safe place for taking out business clients. The food is consistent, fresh and very good. It is not your usual Thai place, it is definitely Americanized. It is pricey for lunch, and reservations for six or more should be made in advance. If you want to get in for lunch, come before 12 or after 1pm, this place is packed all the time. Fridays are the worst. Parking is hard, and there are some parking spots in the back of the shopping center. Their service is very good, very attentive. They do have a lunch menu, which is at the very bottom of the right page of the menu. You need to know that since that includes soup or salad. Most people do not know this fact.They do have lots of daily specials, and these are very pricey. A lunch for two can cost up to $60!They have great looking aquariums, which are kept up very well. There is also outside seating for tourists and locals who smoke", "Date": "2008-12-04", "Author_Location": "Wellington, FL"}, {"Author": "Dennis C.", "ReviewID": "wBtmz6Ulm4wZ_6RPk0lX9A", "Overall": "4.0", "Content": "Great food, and good service.  I agree that it's a little expensive so I'd recommend going for lunch and you'll save a little money.", "Date": "2009-01-05", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Kevin H.", "ReviewID": "UwNjqpz8QuR2_TyPkt2A3g", "Overall": "4.0", "Content": "Great restaurant the food is pricey and they are the self proclaim \"best Thai in Ft Lauderdale\", thats a toss up but the food is very good and the interior and atmosphere are nice.  However because the \"ethnic hiring\" to keep the theme I understood only \"Basil\" \"prawn\" and \"duck\" when the waitress was reading all the night specials I went for tamarind duck and I WAS NOT disappointed, was very tasty.  On a side note, as a Christmas present to employees(my waitress especially) they ought to think about rosetta stone...ENGLISH", "Date": "2010-12-22", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Eugene S.", "ReviewID": "eChkwLvq1nXjSls-wF1gNw", "Overall": "5.0", "Content": "This is the third time I have eaten at Thai Spice and I have had the best experience and the best food each time I come.  I had the lobster and could not eat it all because it was so large.  Took it home and the next day had another meal out of it.. Can't wait to return.. The best Thai Resturant in Ft Lauderdale.", "Date": "2012-10-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Ryan H.", "ReviewID": "eiVxpX_JjP9NrPlR5zhOYw", "Overall": "2.0", "Content": "If you like everything on your plate to taste like peanuts, and don't mind paying through the nose for it... factor in A to B seating (Asshole to Belly Button)... well then this place is for YOU... NOT me.", "Date": "2010-10-05", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Cristina S.", "ReviewID": "U3oVgSQO_zC3px9zDX5UUg", "Overall": "3.0", "Content": "This is the first place I've ventured to for lunch in my new \"work\" neighborhood & it was a great experience. It's a dark little spot in a strip mall with friendly staff & a very extensive menu. I had the Pad Thai with chicken (my safe plate at any thai place, I must admit) & it was delish. It's a huge plate so I definitely took more than half home. The price is just right & I will likely be back soon =)", "Date": "2011-09-12", "Author_Location": "Hialeah, FL"}, {"Author": "Tom S.", "ReviewID": "14uQMpqoiG6-a3CDDs00MA", "Overall": "5.0", "Content": "Excellent food and service.", "Date": "2013-02-09", "Author_Location": "Groton, CT"}, {"Author": "Thomas M.", "ReviewID": "dCv-2ve_XgDsja2dVYtqkw", "Overall": "5.0", "Content": "I have eaten Thai food across America, Asia, Oceania and I must say this is hands down one of the most authentic and complete Thai restaurants in South Florida. The decor and ambiance is very authentic, clean and friendly. Let me start by saying that each and every waiter knows the specials menu of by heart and it's as big as the whole menu!!! I always enjoy testing them on how the food is prepared and what ingredients are used as they present each dish with such pride and precision. I love it. The food is always fresh and very authentic, be careful the spice scale is Thai spice. So don't be a hero and go Thai hot on your first day unless you're a pro and subscribe to man vs. food spicy food challenges. Personal Favorites; Crispy Calamari (no batter, but crispy), Pad Kee Mao, Pad Thai, snapper in coconut and cilantro seasoning, don't remember the actual name. All the curries are very good and extra creamy. Two Thai Spring rolls are not to be missed. Once I ordered two portions of the Crispy Calamari appetizer for my entree, yes its that good, yes I'm insane!Can't say if the whole staff is Thai or Filipino, but they do such a great job. Always busy lunch and dinner. When i think of Thai Spice I get that happy feeling you get when IKEA opened a store in South Florida. You know it's going to be good, it will be unique, you will always go there, it will never get boring and always make you wonder how do they make such simple things so good. Now where is that napkin as i drooled on the keyboard LOL", "Date": "2012-10-27", "Author_Location": "Miami, FL"}, {"Author": "Marilyn O.", "ReviewID": "dEWulpKGun8QGU6ny24OUQ", "Overall": "5.0", "Content": "This is my favorite restaurant! The food is consistently good and fresh. I usually go for lunch and order from the lunch specials which are reasonable priced. It is expensive for dinner but the Thai food is the best I have ever had. If you like Thai food, this will become your new favorite place.", "Date": "2011-01-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Michael M.", "ReviewID": "G1hOvOgtFk00udBCbF8Qpw", "Overall": "5.0", "Content": "I love this place. The food is amazing! Great service as well and a very nice atmosphere.", "Date": "2011-12-16", "Author_Location": "Pompano Beach, FL"}, {"Author": "Mark H.", "ReviewID": "WMYL6uVeNmSskKZ2EzJUFA", "Overall": "5.0", "Content": "This must surely be the best Thai restaurant in Florida.  The food is absolutely wonderful.  I like the Tom Yum 'Thai Hot'.  Dine-in, take-out or delivery, either way you cannot go wrong.  Brian, the delivery man (who is very conscientious), apologized for the food being late even though it wasn't.  He informed me that If I want to order for lunch delivery that I need to do it extra early because they get slammed early on with orders from office buildings.  I am not surprised at all ... the food is just that good.  I appreciate the tip Brian, you rock!", "Date": "2011-11-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Joel M.", "ReviewID": "TPTyjwLM7o0jd5Ruh0I9Aw", "Overall": "4.0", "Content": "Food is great here. The chicken with peanut sauce is amazing! The restaurant does get packed at times and the parking lot gets full. Last time I was there it was 1 to 1 1/2 hour wait. Luckily I was taking my food to go:)", "Date": "2011-12-31", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Sima P.", "ReviewID": "_18AxhxDmHQ5KRwJASK0Ag", "Overall": "4.0", "Content": "First time at this restaurant, the food is great, but the service is even better. Min was our server for happy hour and she was amazing!!! I've been to many restaurants and this one is definitely one of the best!!! Would definitely return to this restaurant and recommend.", "Date": "2013-10-18", "Author_Location": "Pompano Beach, FL"}, {"Author": "Foodie W.", "ReviewID": "ARXbBddb1sCeB2Fyuos6qw", "Overall": "5.0", "Content": "Wow!  When you ask for medium, be prepared!  Awesome nam sod full of flavor. Flights of 3 saki for $13, great way to try something new, and flights are served in sexy stacked rack.  Jake our server was helpful and fast. Place was packed on a wed night.", "Date": "2011-10-16", "Author_Location": "Key West, FL"}, {"Author": "K H.", "ReviewID": "wc5xsbVJRigB53VjhKmQ-A", "Overall": "5.0", "Content": "This place is absolutely amazing! Exquisite!!! The owner understands premier customer service and has trained the employees to continue the exceptional service culture! I have had no better food w/ awesome service combined anywhere else (from any type of cuisine). It is a must visit! U will be a loyal customer for life!", "Date": "2011-12-16", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Trina R.", "ReviewID": "aJNDDH7ZeC-BciPQCSGXkA", "Overall": "5.0", "Content": "I have been there for lunch a couple times and it was pretty good.  My great experience was when I went for dinner.  The waitress was exceptional and made sure to tell us all the specials.  I had the calamari in a chili sauce as anappetizer which was delicious and the scallops and shrimp in a green coconut curry sauce.  It was an excellent meal! I was very happy when I left.", "Date": "2010-03-02", "Author_Location": "Miami, FL"}, {"Author": "Nic E.", "ReviewID": "hXe8FXjCMJeJPhed8TRdTQ", "Overall": "4.0", "Content": "My first time to thai spice was on Monday night. I was a little hesitant to go there but after years of asking I joined my husband for dinner. I was pleasantly surprised by the inside of the restaurant, much nicer than it looks like from the street. We sat at the bar where is was happy hour on food and appetizers, the menu can be pricey but the portions were plenty to share.", "Date": "2013-06-13", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jenny N.", "ReviewID": "WZVhCdTyhfgpxrNNVTcNJQ", "Overall": "4.0", "Content": "Food is excellent! Staff is courteous. However don't order for delivery~~~ took over 1 1/2 hrs to deliver my food & I live only 5 mins away!", "Date": "2010-06-14", "Author_Location": "Miami, FL"}, {"Author": "B E.", "ReviewID": "8FyZon1h_y2PaJ71fDLkmw", "Overall": "4.0", "Content": "Everyone raves about this place and it was absolutely packed on the Saturday night we went. We opted for outside seating instead of waiting 30+ minutes inside. The service was initially very good, but was a bit slow at the end when our waitress was a little in the weeds. The ginger salad had ample freshly pureed ginger/carrot dressing, the crispy duck was fantastic, and the panang curry was also very good. Overall, I have no complaints - it has definitely earn its reputation. However, for the price, I'll stay with Sake Thai/Sushi in Hollywood, where the service is always great and the food is just as good, but nearly half the price.", "Date": "2012-08-01", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Wes D.", "ReviewID": "fN0LhqD4q_9hlWygjBVXPg", "Overall": "5.0", "Content": "This place is really cool, I love the vibe you get when you dine there. The staff was great the food was super. I just wanted to show my appreciation for a real top notch restaurant!", "Date": "2013-09-15", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Wes I.", "ReviewID": "E6rzAicSJe3RJRvvEktpWg", "Overall": "5.0", "Content": "The food and the service was great! My family and I ate outside because we did not have a reservation but it was a good first time experience.", "Date": "2012-10-26", "Author_Location": "Pompano Beach, FL"}, {"Author": "Xyz A.", "ReviewID": "RYrxAb5af3yMfZ84bZGnsA", "Overall": "5.0", "Content": "Happy hour in the bar is brilliant; half price appetizers, try the Thai Fresh Rolls, Coco Shrimp and Chicken Wing, very good!", "Date": "2013-08-16", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Kevin M.", "ReviewID": "tfz4yya8_aQ3cahmZdq5Jg", "Overall": "3.0", "Content": "Better than average S FL Thai resteraunt, but pricier, too. Is it worth the extra dinero?  Not really.", "Date": "2010-01-02", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Julia T. M.", "ReviewID": "q9diVW9i4VrGilpiXIPcPQ", "Overall": "5.0", "Content": "The place is on a pricey side but it's very good food. I would particularly recommend crispy basil squid, which is exactly what is says: crispy and basil. Curries are also very delicious.", "Date": "2010-05-31", "Author_Location": "San Jose, CA"}, {"Author": "D S.", "ReviewID": "zEL4aOFTDff6QSnJ9AiEHQ", "Overall": "3.0", "Content": "Food is excellent.  Unfortunately not all of it. We order a curry, a couple of soups and a seafood salad. The shrimps on on the seafood salad where saggy an almost raw. Very expensive considering the quality.", "Date": "2011-10-29", "Author_Location": "Miami, FL"}, {"Author": "Rose V.", "ReviewID": "3hAB0qpRkMD7bpxZRQfN2A", "Overall": "4.0", "Content": "Very good green curry, although mine was supposed to come with tofu and only ended up coming with vegetables. My friends all had the whole fish, pretty spectacular looking.", "Date": "2012-05-11", "Author_Location": "Pittsboro, NC"}, {"Author": "Penny K.", "ReviewID": "8P_ladHWW4EepVt3FP61YA", "Overall": "5.0", "Content": "Excellent service, beautiful ambiance, cool fish tanks and the food is superb.", "Date": "2011-09-04", "Author_Location": "Acra, NY"}, {"Author": "Keat G.", "ReviewID": "KMt2LfJC31JDLbMANOfoGQ", "Overall": "3.0", "Content": "Great service, but a little pricey for Thai food.I had the soft shell crab appetizer, which was OK, not great.  Also ordered the seafood curry, but made the mistake of asking for it to be made \"spicy.\"  It was way too spicy -- I advise \"mild\" to anyone going there.Also, the portions of rice were way too small.  A meal with an appetizer, an entree and ice tea will run to over $30 after tips.", "Date": "2007-11-24", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Michael L.", "ReviewID": "oUtAsOL-8bWNpFGkxQs81g", "Overall": "4.0", "Content": "Everytime I come to Lauderdale, I make a Point to come here!  Their curry dishes are delish!!", "Date": "2010-04-22", "Author_Location": "Manhattan, NY"}, {"Author": "Jacqueline S.", "ReviewID": "kH2bJtlej-8oDv8KjsEzCg", "Overall": "5.0", "Content": "Best Thai in town", "Date": "2010-10-11", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Amit D.", "ReviewID": "-XXD8jGcNgQgSRj8P2sddQ", "Overall": "5.0", "Content": "Hands down the best Thai food I have ever eaten.  Panang Chicken = Amazing!Samrod Chicken (substituted Chicken for Pork) = AmazingPad Thai = AmazingEven the Poorman's fried rice was excellent.", "Date": "2011-01-19", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Lucas J.", "ReviewID": "352Q6e-7zwiamPjjR4UYnA", "Overall": "3.0", "Content": "Ok, the place is beautiful inside. The food is well presented. The service is efficient and pretty professional. Language can be a problem. The list of specials can be quite long but we could barely understand a word our server said. This was our second time there because we signed up online and received a bogo in the mail. A couple of days later we had some time to kill before a concert at the hard rock and went to Emerald Thai on State Road 84. Emerald Thai has much better food, much larger portions. We've been there numerous times and it is always consistently great.", "Date": "2012-07-24", "Author_Location": "Coral Springs, FL"}, {"Author": "Donna K.", "ReviewID": "o2h31spORM19pfRH7zJogA", "Overall": "4.0", "Content": "Went there because of the yelp reviews! It was excellent-the outdoor seating was along the front of the building along the sidewalk but at least it's outdoors. We had the panang curry pork and bangkok chicken along with chicken satay appetizer. Excellent! Next time we are in town we will be back!", "Date": "2010-10-25", "Author_Location": "Brookfield, IL"}, {"Author": "Kevin M.", "ReviewID": "qFypDkPWVodsdn331qhCaQ", "Overall": "5.0", "Content": "Great food", "Date": "2011-06-01", "Author_Location": "Fort Myers, FL"}, {"Author": "K B.", "ReviewID": "YTaO3iMQLw-C6e08VXZF7w", "Overall": "5.0", "Content": "Tried Thai Spice for the first time tonight. Got delivery. It was GREAT!!! I ordered Pad Thai and asked them to recommend their best appetizer under $10. The person on the phone said her favorite was the curry puffs and I am so glad she recommended them.The pad thai was delicious and the curry puffs were great. They came with 2 sauces which were soooo good, also .Also, when I ordered delivery it was right during their dinner rush. They said to expect it to arrive in 45 minutes to 1 hour, which was fine with me. It arrived however, in about 30 minutes. Pretty darn fast.Can't wait to try some of their other dishes and take my husband in to eat in the restaurant! Yum yum yum.", "Date": "2011-06-09", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jorge S.", "ReviewID": "hXv5Bab8BNYspaoHZj0Ohg", "Overall": "4.0", "Content": "Hard to find good Asian food down here in South Florida, let alone a good Thai restaurant that is not OVER PRICED! Thai Spice fits the bill as a moderately priced yet quality Thai dishes with a spectaculer green curry sauce. Service was excellent and the overall atmosphere was very comfortable without becoming stuffy. I think from now on this is where I will go for Thai food.", "Date": "2012-07-01", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Lora T.", "ReviewID": "VN0DLclTkP7SriLOfGPsQQ", "Overall": "4.0", "Content": "Very impressed with the tuna app and the shrimp app. We also ordered the shrimp fired rice, volcano shrimp, and the pad thai. Liked the fried rice the best. Felt the appetizers were better than the meal but overall enjoyed everything.", "Date": "2013-04-17", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Vasilie C.", "ReviewID": "jQe5eg5iaGDlhZ89p9pS2Q", "Overall": "4.0", "Content": "I ordered red curry with scallops and it was delicious. The salad had the best peanut sauce I've ever had and the spring rolls were ok. My date had Thai noodles with tofu and the tofu was perfect with a crispy outside and delicious inside. The noodles were a bit rubbery, but the flavor was good. My only gripe with the place was our server, who left us without a drink refill through our appetizer, salad, and halfway through entree. Luckily the manager came by and asked how everything was going. I told him I appreciated him coming over and he said he would fix the situation. At first he didn't quite understand what I was saying I guess. I told him that I ordered spicy food and it was a problem to not have water refilled at all. I then told him I had to go so far as to ask the bus boy for a refill and he had taken care of it. The manager responded with: do you want more spices on the side? Despite the communication problem, they did recover from the slip up, so I would come back but I won't be sat at that server's table again.", "Date": "2013-01-29", "Author_Location": "Portland, OR"}, {"Author": "Eli S.", "ReviewID": "o6f7RYOiLiDGj_drdS00-Q", "Overall": "1.0", "Content": "My review begins with me trying to find the perfect (pad) Thai. ( new suggestions appreciated ) . I moved into the area less than three weeks ago, and last night was my second attempt after scanning Internet reviews and delivery menus of local Thai restaurants.  Iv had Thai from a few other places in Florida since I moved here from NYC a few months ago and sadly I have to say it goes the same for the pizza,  I just haven't found one that iv truly been satisfied with so far. hoping to prove my analysis wrong, and still determined for pad Thai I ordered a delivery order from Thai spice.  An order of pad Thai chicken (15) 2 coconut milk soups ( 4.5 x 2 ) and a pint of brown rice ( unknown ) came to $32.50 , even for being regularly comfortable with NYC prices I thought that was a lil high but at the time I didn't really care, until .. After eating the first bite of chicken, and then ripping all of the pieces apart, it was clear to me that the meat was not fully cooked, I called back and there was no answer , it said open till 10 it was 10:01.  Today I had called , explained to them my disappointment with my order and they resent a new order of chicken pad Thai that I asked to be cooked well done this time.  The order they sent back was in the same size container though only half way full, and again the chicken was rubbery on the inside and not grainy like it should look fully cooked. So I paid 15 for basically an order that I did not get to eat. My conclusion on Thai spice is completely over priced for service that they are inaccurate to provide. I'd ADVISE checking your meat thoroughly most disease are ingested into the bodily system by dead cells hosting parasites that feed and harness themselves in the corpesd carcases  of dead animals. So I'd give this restaurant a WARNING advisory rather than just a review.", "Date": "2012-08-31", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Monika K.", "ReviewID": "ucVszldQl8y5glWcZibh7w", "Overall": "2.0", "Content": "service was not so great, decor was pleasant and ambiance was nice, server didn't offer us the specials but did to the table next to us, we split the yum woonsen which was just decent, tom yum gai was ok but nothing great, bf ordered the porterhouse which he liked but he better have at $40, i had chicken panang curry, even though i asked for it hot, i did not taste any spice whatsoever, didn't get a friendly welcoming vibe there, the server seemed annoyed when we didn't want to order dessert. one time is  enough for this place.", "Date": "2011-01-11", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Dean C.", "ReviewID": "0Z-i4XMW6QeVmUWy2b2lTQ", "Overall": "5.0", "Content": "I am giving Thai Spice five stars based on delivery of food to my nearby hotel room.  I have eaten Thai food in all kinds of places - converted Denny's restaurants, minimalist college-town storefronts, elegantly appointed \"important date\" restaurants - even from an Italian-Thai restaurant in Chicago called Luigi's!  The food from Thai Spice was insanely good.  I used to dine at a wonderful little restaurant in Chicago (Bangkok House) that served delicious spring rolls, and I've been hunting for any other place that served them that way - not the deep-fried mess that you get in so many places, but the doughy wrap, the crisp, fresh vegetables, the hint of shrimp, along with the most delectable sauces to compliment them.  Just the \"Fresh Roll\" was enough to justify five stars for me!  I also ordered the Tom Yung Goong, which did not disappoint in any way.  The delicious broth, mushrooms and vegetables cradled three delicious shrimp.  Wonderful!  And finally, for an entree I chose the Green Curry Chicken, one of my favorites that I recently re-discovered.  The coconut milk-based sauce was heavenly.  Even though I ordered medium spicy it was very digestible even for a sensitive constitution.  I am in Ft. Lauderdale without a car so the fact that Thai Spice delivers was a real bonus.  The food was promised in 45 minutes - it came in 30.  How wonderful!  If you have the chance to eat this food - do it - restaurant visit or no!", "Date": "2013-01-28", "Author_Location": "Racine, WI"}, {"Author": "Derya D.", "ReviewID": "J8So_6uaXqevogzPJvvhGQ", "Overall": "5.0", "Content": "Best thai food ever! Grilled calamari and sea food red curry were amazing!!!", "Date": "2012-03-31", "Author_Location": "Berkeley, CA"}, {"Author": "frank w.", "ReviewID": "VXU1eMBO3eIE2WP-na3z6Q", "Overall": "5.0", "Content": "Words cannot express how good the food is here. had whole deep fried snapper,grilled calamari ,stuffed chicken wing, grouper and duck. Each dish was flawless and the best I've ever had. Was in Bangkok two months ago and had nothing even close to the quality here.", "Date": "2012-05-14", "Author_Location": "Boca Raton, FL"}, {"Author": "Teresa S.", "ReviewID": "ryDlqvQiIdyNwAlXyW1pBA", "Overall": "5.0", "Content": "Thai Spice has the best thai food in South Florida period. I've been eating here for a few years now and other thai restaurants just don't compare. Anyone who rates this restaurant lower than 4 starts is insane. I've eaten many dishes on the menu and it's fantastic!!", "Date": "2010-03-04", "Author_Location": "Atlanta, GA"}, {"Author": "J S.", "ReviewID": "l8aY_NYMRoi2QaX281NkSg", "Overall": "5.0", "Content": "Best Thai restaurant in all of South FL!", "Date": "2011-05-27", "Author_Location": "Pompano Beach, FL"}], "RestaurantInfo": {"RestaurantID": "_KluD4TM958wGEFQfdq0MA", "Name": "Thai Spice", "Price": "$$$", "RestaurantURL": "/biz/thai-spice-oakland-park", "Longitude": " -80.128075", "Address": "1514 E Commercial BlvdOakland Park, FL 33334", "Latitude": " 26.1889234", "ImgURL": "//s3-media3.fl.yelpcdn.com/bphoto/7MaY3lROtdIBUZktsiHgKA/90s.jpg"}}