{"Reviews": [{"Author": "Marina G.", "ReviewID": "Z3Ncc-l9w4oZVKPaIwvVgQ", "Overall": "5.0", "Content": "amazing place! love it! beautiful design inside & outside!the service is great, Food- is from another world! in love with this place!", "Date": "2014-05-18", "Author_Location": "Dania Beach, FL"}, {"Author": "Nikol M.", "ReviewID": "z3EOGkgaYmQ9LFo8KRyswQ", "Overall": "3.0", "Content": "I really really wanted to like this place.  I would have given 2 stars, but the stuffed faux sheep by the front door deserve a star themselves. The place is modern and reminds me of the white washed buildings in the Islands of Greece.  We ordered several appetizers (mezedes) and they were all pretty bland.  We ordered the assorted spread platter and were told that they were out of two of the spreads they offer.   How this is possible on the start of a Friday night?? We moved on to order the Green Chick Pea spread, which was flavorless.  The zucchini chips (hot and crispy), but served with a tzatziki type sauce that had so much dill - it was not edible.  We also had the fried calamari and that was seasoned nicely and served hot. The cheese Saganki was a disaster. Our Saganki was accidentally given to the table across from us (who was in the process of paying their bill at the time) and the remake was a cast iron soup of lemon and cognac/brandy. The lamb sausage was a traditional Greek Loukaniko with spikes of orange peel, but for $12 for one link, I could have purchased 2 packs (8) from our local Greek grocer!  We ordered the ribeye for dinner and that was forgettable and overcooked. Overall, there are better choices for \"chic Greek\" or traditional Greek.", "Date": "2014-07-08", "Author_Location": "Miami, FL"}, {"Author": "Brenda P.", "ReviewID": "6L_B7NqLivLJpsmZ7RcB0A", "Overall": "2.0", "Content": "Yelp's \"Meh. I've experienced better\" is perfect description for how I feel about my \"experience\" here. My \"better\" is New York City's AVRA. (That said, I cannot believe I just noticed I never even reviewed it. Oooops! Will fix that very soon). Parked with Thaso's valet service and walked inside to check-in for our reservation. No one that worked there was at the desk initially. After a minute or so of standing there, a gentleman walked up and attempted to \"check us in.\" \"What was your last name again?\" We said it, (and showed him on the screen) three times, before he \"got it.\"He walked us to a booth, we sat and he gave us menus. Our waiter came by, introduced himself and asked our water preference. Jason, our waiter, had a contagious smile. I wish all waiters were this pleasant. I could not help but be happy with him around. Unfortunately, his smile could only go so far. Thasos fell flat on most dishes and I doubt I will ever return given the choice. TOAST/EGGPLANT DIP- The eggplant consistency was that of a puree and it was excellent. The toast was cold. Blah.CURED ORGANIC SCOTTISH SALMON CARPACCIO- Listed as having cucumber, salmon caviar and dill crema as sides. The crema had the cucumber in it and was very good. The caviar was not there. When we mentioned it to Jason, he also admitted he didn't see it on the plate. The actual carpaccio wasn't bad. It just wasn't delicious. I'm not sure what it's \"cured\" with, but it gave the salmon a heavy glaze and took away from it's firmness making it, well, heavy. GRILLED HALUMI CHEESE- Hmmmm I was so excited for this, but ended up very disappointed. It definitely had \"grill\" marks, but it was cold upon arrival and had a crumbly texture. Sigh. The accompanying greens were dry and unappetizing. The quince was a good mix with the cheese had it been hot. GRILLED OCTOPUS- OK. Just OK. GRILLED LAMB CHOPS- This was the best dish of the night. Ordered \"medium\", but delivered \"well.\" This was similar to Danielle R.'s experience. Somehow, the \"well\" worked. It had a nice char and was still somewhat juicy enough to enjoy. These 4 chops were very flavorful. The accompanying potatoes were also delicious. The green beans were soggy though. Sigh.VANILLA CREME BRULEE- Received the espresso creme brûlée for my husband who specifically said he didn't want espresso. Mentioned it to Jason who confirmed it, but didn't offer to correct it or remove it from the bill. THYME BREAD PUDDING- Didn't taste like thyme. It tasted like the fruit it had on top (maybe apples? can't recall). Whatever it was, it was very good! The portion was too big for me to finish. Ended with a couple of espressos and called it a night. Thasos was all about ambiance and not too much substance. The music was blaring in the background and was mostly TOP 40's (not  too clubby). The restaurant's very cool all-white decor lends itself as an IT place to gather a large party or celebration. This was not enough for me. I can appreciate a good looking place, but it has to follow up with the food. Sadly, I wasn't impressed. P.S. The couple of flies constantly hovering over our (indoor) table was also a nuisance. Urgh.", "Date": "2014-06-30", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Lawrence P.", "ReviewID": "yRUntc5z4KeGxQslWSxvyQ", "Overall": "3.0", "Content": "The first thing you notice about Thasos is the décor.  There is a lot of WHITE in this restaurant from the walls to the tables to the chairs to the...  and it kinda works... it looks like a \"Greek\" looking space... Miami style!!! This restaurant is also great for big groups... particularly if you are a party of 10 you can ask to sit in a long table with these chairs that are shaped like the back of a man or woman towards the back of the restaurant.  Very cool look!!!We arrived on time for our reservation.  At the \"desk\" there was an older gentleman sitting there.  When we attempted to check in, we realize that he didn't speak English so we waited.  I think Greek may have been his language of choice and my Greek is a bit rusty... OK it's non-existent!  Another employee came by and attempted to check us in.  We stated who we were three times and he seemed as clueless as the older gentleman.  I finally pointed to the computer screen where our name was and he thanked us.  We sat towards the back of the restaurant next to these big sliding windows facing a very nice outdoor area where a few families were already being served.  The second thing I noticed, after the décor of course, is the size of the flies that were hanging out by the big sliders.  After trying to swat a few of them with the menu, I gave up and just tried to keep them away from my Cabernet.  We got Jason as our server... a very personable young man.  He opened our wine (restaurant has a $25 corkage fee) and we got underway with the salmon carpaccio, the octopus and the halumi as written on the menu (or haloumi as written on the bill).   I did not love the carpaccio. The salmon had a \"coating like\" glaze that I did not enjoy.  I didn't know what it was and Jason didn't know either.  I liked the halumi even less.  It sounded promising... I mean how can grilled cheese not sound promising?  In the end, it was disappointing.  I don't know if the cheese was supposed to be served room temperature but ours was.  I thought if the cheese had been served hot or hotter it would have been better.  As for the octopus, it was fine.  Well cooked. It was accompanied with a bit of a salad but the salad could have used a bit of a dressing.For the main plate, we order the grilled lamb chops to share. They were well cooked and had flavor.  Good, just not spectacular.  The chops came with lemon roasted potatoes and string beans.  The potatoes were good.For dessert Jason recommended with special Espresso Crème Brulee but I ordered the Vanilla Bean one off the menu.  The wife ordered the Bread Pudding.   After a few bites I realized that I had gotten the espresso crème brulee.  Jason came over and agreed they had brought me the wrong dessert.  No offer to bring me the right one so I just finished off the espresso crème brulee.  It was okay.  I usually don't like coffee tasting desserts so I am not surprised I didn't love this one.  I think the wife gave me a taste of her bread pudding but I can't comment as I don't remember.Although Jason had a great personality and if I ever go back I would love to have him as my waiter, service didn't go smoothly.  I can't help but think that had they opened the slider but for a minute, the flies would have departed.  I also didn't get the right dessert.  I wasn't offered a replacement and I was surprised to see it on the bill.  Also, as it turns out, the young man forgot to check us in via the Open Table reservation system because the next day we got an email from Open Table saying we failed to honor our reservation.  On a final note, as I write this review, I notice the restaurant did not charge me the $25 corkage fee.  I feel like they just forgot.  Whenever a restaurant waives the corkage fee, they usually tell you they are doing so.  Here, no one said anything.  Anyways, if they did waive it on purpose, thank you very much.  But, next time, I recommend you tell your customer.  It usually ends up, at least for me, in a bigger gratuity for the waiter.", "Date": "2014-06-30", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Yakelin S.", "ReviewID": "Ri-688bnTSGwpnrpbok-7g", "Overall": "4.0", "Content": "Good food ,very good service, nice ambiance;-) food actually as good or better than the beautiful ambiance!", "Date": "2014-07-15", "Author_Location": "Theater District, Manhattan, NY"}, {"Author": "Robert L.", "ReviewID": "DVaNVmooSjTl4V14H6Pr3A", "Overall": "3.0", "Content": "Not bad. Great decor. Very south beach. Starters were excellent. Waiter attentive. However, with a third full restaurant, main course took nearly an hour and vegetables were cold. I would go back....but only one more chance.", "Date": "2014-07-06", "Author_Location": "Aventura, FL"}, {"Author": "Carolina M.", "ReviewID": "a14GwwnZkJ_97D0dnastUA", "Overall": "4.0", "Content": "Worth a visit to Broward for.Great ambiance, nice decor. It makes you wanna go to Santorini for a visit.Place is decorated in typical Greek isles white and blue, service is good. Food was very good, we liked everything. Went with friends and had a nice time.Lamb chops were well prepared, the grilled octopus was delicious. Beet salad, grape leaves, all was great!.They have a nice selection of cocktails and wines, some Greek wines that were also good.The decor definitely makes it stand out, upscale and nice food overall.", "Date": "2014-05-19", "Author_Location": "Miami, FL"}, {"Author": "Aline S.", "ReviewID": "W66DWzmHoVcuFyohDltGSw", "Overall": "5.0", "Content": "Had a surprise birthday party for my husband here...everything was perfect!! Food is delicious, the staff is amazing! They went above and beyond to make the night enjoyable. To top it off, the restaurant is gorgeous. I definitely recommend dining here for any occasion.", "Date": "2014-06-23", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Michael C.", "ReviewID": "jU0RVNz70G-uXaj7YOgtNg", "Overall": "3.0", "Content": "The place is just beautil. All white with LED lights and very upscale, modern  & HIP. The service is excellent, but not your traditional Greek Restaurant. The food is not what you expect at a traditional Greek restaurant. Is very pricy and the food is just OK. The menu is very limited.I had the pork chops ($25.00) and was not impressed (no taste or seasoning). The place is just OK to visit once a year but not like the Greek Islands Taverna just across the street that has excellent food, larger menu and much better prices.Is not a place I will visit often", "Date": "2014-04-30", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Erik B.", "ReviewID": "cq6Rni3Wi-7WamUKF1-F3w", "Overall": "4.0", "Content": "Been meaning to try Thasos since it opened. It is truly a gorgeous space... incredibly well designed and dripping with style. It is easily the most stylish restaurant in Ft Lauderdale and has delicious food to boot. We had a bunch of small plates and a couple of entrees. They were all very good to delicious. The place is a slightly upscale spin on traditional Greek food and everything was really well executed.That's the good news. The bad news is in the arena of service. Our waiter was pretty much absent for much of the meal. We didn't get water. We didn't get silverware. We had to ask multiple times for these things (and they still didn't come). Our drinks took about 20 minutes to come to the table. I think it was probably just our waiter, as other tables seemed to be getting regular service.We'll definitely be back, but hoping for improved service!", "Date": "2014-02-20", "Author_Location": "South Slope, NY"}, {"Author": "Greg O.", "ReviewID": "KDUuiyHQ9Ul1EaHLLDT5zQ", "Overall": "4.0", "Content": "I felt like I walked into a Greek restaurant in LA or Athens. The atmosphere was lovely and seemed uplifting. I came here back to back weeks to try on a Sunday night and a Friday night. Love the charcoal grilled sea bass. The charcoal flavor was great. The New Bedford Scallops were bland and not cold enough. The octopus was warm, but I craved hotter fish. The flavoring was delicious. The second trip we sat at the bar. My brother asked the bartender for his recommendations. Not only were his drink recommendations great, his food were even better. We ordered the keftedes, whole grilled fish, crisp smelts were tender and juicy, and the calamari was wonderful. The waitress from my Sunday night came over to say hi, which is quite sweet. I live in NYC so the prices were acceptable for me. I can see Fort Lauderdale having some issues, but the overall experience was great.PS. I have been to Greece and do not like Greek Wine. If anyone can please recommend a good Greek wine I am up for the tasting. I was talked into a glass at dinner and against my taste bud memories, I drank two. The nose was great and the finish was terrible. Sorry, the Greek's invented wine probably and the taste is awful. Help me please!", "Date": "2014-02-11", "Author_Location": "Brooklyn, NY"}, {"Author": "Dharra D.", "ReviewID": "rjCZgGCS9WIy2rV8XMOXcg", "Overall": "5.0", "Content": "I went there for a friend's birthday.    Although I missed happy hour,  the happy hour deal is great.    The meatballs and zucchini chips are awesome.   The menu was not your typical Greek cuisine but a mixture of Greek fusion with a twist.    I would definitely go back for dinner and try more items on the menu.The location was a tad difficult to get to.", "Date": "2014-02-01", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Jan L.", "ReviewID": "fzRVn1zumHSYyxR9nwgd7w", "Overall": "4.0", "Content": "Best Greek place I have been to in the few restaurants I have been to! The hummus, Greek salad, octopus, mussels, and mushrooms were so delicious that I finished dinner in record time! The service was only ok. If it were better I would have given 5 stars. Definitely try it out if you are in the area!", "Date": "2014-02-10", "Author_Location": "Glastonbury, CT"}, {"Author": "Kris C.", "ReviewID": "hpClajfppbC45hdHhe-Mow", "Overall": "5.0", "Content": "We took my mom there the other night, which was the first time at Thasos for all of us and was wowed by the friendly service to the delicious food and the beautiful decor. Definitely one of the prettiest restaurants in the area. We had some small plates along with entrees and the beef kebab melts in your mouth. Its upscale Greek dining in Florida. The baklava was amazing too! We will definitely be back when in the area.", "Date": "2014-04-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "RM K.", "ReviewID": "SORrN0VXpAZqhCzzptM63w", "Overall": "2.0", "Content": "Trendy decor~ but slow service! Food is just ok for the price! Better place is right cross the street !old greek restaurant! I personally wont come back to this place.There was bunch of parking but only accept valet parking! And over price for the food... Fish is not fresh enough.", "Date": "2013-12-26", "Author_Location": "Miami, FL"}, {"Author": "Sherry W.", "ReviewID": "qpqTu6m5X0dW6EuYNJ4CiA", "Overall": "4.0", "Content": "On Thursdays they have free lamb meatballs with tzatziki and fried zucchini chips at the bar.  Happy hour runs til 7 for 1/2 price drinks.  The décor is beautiful and all white.  The music is at a level that you can easily converse.  It attracts a nice crowd.  Valet is complementary.   There is also a happy hour small plate menu for $7.  I would definitely go back for happy hour.  They have some neat mixed drinks which are a great deal at happy hour.  For value on food, however, I would go to the Big Fat Greek Restaurant on Griffin for dinner.", "Date": "2014-01-31", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Susan T.", "ReviewID": "fvxAv81d94YP5bc_Iq8IsQ", "Overall": "4.0", "Content": "Have been there at least 20 times already in the past 6 months.Initially, I was in love with the place. Great quality ingredients, seasoned and cooked beautifully, love the décor, bathrooms are clean, ... was def my top restaurant in fort Lauderdale, even with its spotty service (Dre is my fav waiter there). My last three visits were slightly disappointing, the silverwear and glasses had finger prints, tomatos from the greek salad were (for the lack of better words) grime-ish, everything was too salty, green chick pea hummus is becoming less green and less tasty. I don't know if they are trying to cut costs hence quality has suffered or what is going on. I loved going there for lunch and brunch, but I think they were not as busy for those times and only open for dinner now. Even with everything said, I still enjoy the restaurant, just wish it was more consistent and hope it is not on its way down. Some of my fav dishes: lavraki, grilled octopus, green chickpea spread, all salads are wonderful but greek is still my fav, wild mushroom side, mussels, smelts, beef tenderloin and beef skewers. I think their dessert is good, but not as great as the food. Also, as we do go quite often as a family, we have never gotten anything on the house. The only time I had anything comp'd was when there was a fly in my bottled water, they gave us a new one. Also considering how often I am there, doesn't seem they particularly appreciate my business/presence. - this is not reflected in my rating. But I guess that does reflect in their overall customer service.", "Date": "2014-03-25", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Wade M.", "ReviewID": "uuK80dSdrl93pn4r_BK6sA", "Overall": "4.0", "Content": "TASTY FOOD - HIP - PRICY. The Greek-nouveau food and service were not perfect, but very good. Our let downs were a dry $35 Chilean Seabass and a skimpy shrimp appetizer that was delicious. The stark white interior is a cool backdrop for the mosaic of people when the place is full, but empty, it looks like a mental hospital. The color lights and projected images of Greece are a nice touch. The dining room and bathrooms were impeccably clean. Would be a good place for a group or date.Since there are two other Greek restaurants nearby, it's worth mentioning that Greek Islands a more authentic, traditional, cheaper place with usually delicious food. I love the baby back ribs. Taverna Opa is a raucous party where food is a footnote, but still pretty good.", "Date": "2013-09-13", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "J H.", "ReviewID": "qxE4kvV2eWnz68VwpM_lqw", "Overall": "4.0", "Content": "We made up our appetizer dinner from their standard menu items and had a blast. There's no need to overeat if you don't want to by having what we are sure are delicious large main dishes. The bartender makes an excellent Hendrick's Gin Martini. We recommend reservations at this fashionable place.", "Date": "2014-04-03", "Author_Location": "New York, NY"}, {"Author": "Danielle R.", "ReviewID": "XWpt0VlHq4d_jyNlLZfpHw", "Overall": "3.0", "Content": "Tasty, Tasty, Tasty.  Love their all white SouthBeach vibe with the changing lights. Everything in this place is white besides these neon technicolor lights. Pretty cool. I will say the music was AWFUL for me. Brian R is correct. There were 2 songs we actually liked.  They really need to start dong some Goolge/iTunes searches for Greek Techno music (hello Ibiza????? dah).  Or find a Pandora station and stick with that...or better yet get a freaking DJ-eh?  This place looses a star b/c all 4 of us wanted to strangle ourselves that have to listen to their torture called music.3 of us got there early and sat at the bar to have a drink while we waited on lady #4 (she was on a drink date so we let her have a hall pass).  We had called earlier and made a reservation fro 7:30.  We sat, had a libation, and around 7:35 #4 had finally arrived and we were ready to grub.  Unfortunately, our table wasn't ready???? ehhhhh not sure why, but it wasn't so we all congregated in the front (by the fake stuffed sheep) for a good 10 mins before we were finally able to sit. When we left the place was really busy, def gets busier later at night (which makes even more reason to have a DJ) the Valet was slamming. We had to wait another 10 mins to get our car, and he was hustling. When we left there were 4 cars waiting to be parked and they were clear out into the street, at least one more valet guy is needed. Both of those issues knocks another Yelp star for me based on experience. On to the food...(as always see the pix)1-Grape leaves served warm-very good2- Chickpea spread (ala Hummus) needed much more garlic for me. Remember Opa and the make your own Hummus?  They need to get that here.3- Eggplant Spread- again bland for me, it was OK, the warm pita made it happen for me3-Greed Salad-Very good, this is a DEForder4- Watermelon salad-this was the BEST thing we ate, in my opinion. Presentation was kickass, it had a ton of flavor, perfect combo of acidity and sweetness with the salt from the Feta.  A+ dish5-Lamb Chops-Ordered M/R came out Well for sure.  Surprisingly, they were still tender having been overcooked to that degree.  Would def order again; however, would make sure I mention last time they overcooked.6- Grilled Octopus- other clear winner in our selections.  Very deliciousWe ordered a bottle of wine and I had 2 glasses of Malbec, split 4 ways bill was $50 with tip. Will I go back???....Maybe....only after someone else updates saying they updated their music.", "Date": "2013-08-05", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "George B.", "ReviewID": "LOv5vHNyE-mQSw_KKanGpQ", "Overall": "5.0", "Content": "Another wonderful meal with excellent service   Our waiter, Daragan suggested the four sample appetizer which was wonderful.  I don't know Where they find delicious tomatoes for the Greek salad in Florida , but it is superb.  As always, the noise level on a busy night is distracting, but the overall evening was great. This has become our favorite restaurant to take guests in Fort Lauderdale and it never disappoints.", "Date": "2014-02-24", "Author_Location": "Douglas, MI"}, {"Author": "Chris M.", "ReviewID": "3AskEp7k_bHTYWktiVXy5w", "Overall": "3.0", "Content": "Came here for dinner at 8 on a Saturday night and was really looking forward to this place. The food was very good. Our table order the Green Chickpeas, which was basically green hummus and very tasty, grape leaves (delicious but took forever to arrive), kefetedes, mussels (plump, tasty, and cooked perfectly), Greek salad, shrimp saganaki (3 per order, but they were U10s and cooked just right), and lamb sausage. On just the food, this place is one of better Greek restaurants in South Florida. Stars were lost on the fact that the kitchen seemed overwhelmed. The grape leaves took an hour to arrive and the rest of the food was 30 minutes or so. Our server was very friendly and apologetic, but my service background would've prompted me to offer a comped dessert for the wait. Another miss was the atmosphere. The restaurant is pretty in a Logan's Run meets Mykonos kinda way, but there's no sound deadening, so conversation involved a lot of yelling. Lastly- super nitpicky of me, but the hand soap in the mens room would not rinse. I don't know if it was the brand or hard water, but there's a simple and cheap solution for either issue. Given the quibbles, the food is worth a return visit, but the issues were enough that I'm not planning to go back soon or often.", "Date": "2014-02-15", "Author_Location": "Hollywood, FL"}, {"Author": "Alex L.", "ReviewID": "fCPIoD1ufi4m6FXATo70pg", "Overall": "5.0", "Content": "Went there last night for dinner, the restaurant itself is amazing and to tell you the truth so is the food and service we had a server name Michael who went above and beyond expectations,as did my roasted chicken, I can't wait to come back.", "Date": "2014-04-19", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "James O.", "ReviewID": "GSmRt429CD5wnngUJol6QQ", "Overall": "4.0", "Content": "Let me just start by saying that every time I try a new Greek place I say the samething, should have gone to Greek island Terverna (GIT). Without a failure every new Greek place has been lousy.  So....I really liked this place. Everyone was super friendly and there's just a real good vibe about it. This will give Greek Island Terverna which has been the undisputed champ of Greek food forever a run for it's money. First the bar area is huge and beautiful, all white stone, very clean looking. Bartenders friendly and knowledgeable about the food.Valet parking, big plus, such a hassle parking at GIT.We sat at the bar to eat and have some drinks. Good wine by the glass.Started with Spanikopita, very disappointing and thought I made a mistake by not going to GIT, I started saying to myself you know what. The spanikopita had waaaaay too much phylo dough and waaaaay too little filling. Dry tasteless thing.Next we had the zaziki and eggplant spread both were excellent with tasty pita breads. Then we had the stuffed grape leaves. These were home made and not from a can. They were delicious. Better than GIT.Then came the octopus, this was a prize winner. Beats the octopus at GIT which is saying a lot. It was just perfect and super tasty.Then we had crab fritters, not a Greek dish for sure but delicious none the less. Could have used a little lemon. Then we finished up with lamb chops. Can't go to a Greek place and not have lamb of some sort.  The chops were very high quality and melt in your mouth tender But lacked that traditional Greek taste which the addition of a little lemon and some sea salt took care of right away.Slight edge here to GIT whose secret sauce is awesome but the lamb is not as good in quality. So all Thasos has to do is add a little flavor via some lemon, salt, oregano and they will be the lamb chop kings.Oh yes and we had a side of the feta with Thasos olive oil. Outstanding, much better then GTI feta. Loved it. So overall, they could use a little more lemon on some of the dishes, even the perfectly cooked octopus needed a squeeze which I forgot to mention. But other than that I think this place is here to stay and there might even be a new champion in  town very soon.And don't forget to take a picture sitting on one of the stuffed lambs in the lobby, especially if you go with kids. I did it and it's a great picture. Lol.PS: If I could give them a half a star I would for just for having the guts to open right down the block from the Greek Colossus of South Florida Greek food, the Greek Island Terverna.  this will be like the  Ali-Frazier matches of Greek food. Us Greek food lovers will be the winners here since we will end up with two great Greek restaurants to eat at.", "Date": "2013-08-11", "Author_Location": "North Miami Beach, FL"}, {"Author": "Jonathan A.", "ReviewID": "p7PZHPf60Rfr5fLRd5xkYw", "Overall": "4.0", "Content": "First timer! The place was packed on a Saturday night so a rez is recommended however we didn't have one and they seated the two of us within minutes.We kept the dinner super light as I just got over the flu the week before. We ordered the large Greek salad, zucchini chips, two glasses of their Santorini White Wine, and finally baklava. The large salad was huge. It was filled with sweet tomatoes, crisp sweet cucumbers, red onion and phenomenal aged smooth salty feta. The olives were meaty, fruity, and fresh. The dressing was a clean red wine vinegar and perfectly balanced. The zucchini chips were coated perfectly with a tasty light coating then fried perfectly. Most of the chips were absolutely perfect and not soggy what so ever. Even after sitting for a awhile at the table they stayed crispy which is impressive. On the side was a yogurt dill dip. The two pair perfectly. Santorini wine was crisp, clean, apricots, with a touch of bed linen. Kidding in the last bit . Baklava was amazing. Not overly syrupy and just a great treat in the end. I also tasted a hint of ginger was a great surprise. We washed it down with American coffee and I must say, it was truly amazing coffee. No bitterness what so ever. I drink it black. My advice is definitely order a large Greek salad to share with any entree you order. The place is very expensive with great service to match the price tag.Same prices as any high end steak house. With that said, I don't know many high end Greek places around town so if your in the mood for a high end tasty treat, head this way. You will not be disappointed.", "Date": "2014-01-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Andre W.", "ReviewID": "hhWxIMKZReQsKCP4KE4wXQ", "Overall": "3.0", "Content": "This is a trendy Greek place.  Open late might be its only advantage to all the other great Greek places around.When you go to a Greek restaurant you go for the food if you have been going   to Greek restaurants all your life.I found the food acceptable but not memorable. The wait staff just like the place had a feeling that you were in a club not a restaurant. Yes I know, this is a trend. But what keeps people coming back are either the food and or the price. In these areas the food was good just a bit high for what you are eating, but value if you want the surgical ambiance.", "Date": "2013-07-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "m p.", "ReviewID": "k1j6ivMgj9TWn9ZlFqGH_g", "Overall": "4.0", "Content": "The atmosphere was amazing. We sat outside in the covered area. Food was delish. The watermelon salad was good and so were the lamb meatballs.It seemed like there were too few waiters. He seemed to cover too many tables at the same time. We also never got our water glasses refilled. Over all a great place for a nice dinner with great ambiance.. Just be patient with the waiters running around with their head cut off.", "Date": "2014-03-15", "Author_Location": "Mooresville, NC"}, {"Author": "John F.", "ReviewID": "qNa4xZO3f_Tmsz1hljS95g", "Overall": "5.0", "Content": "Ate here two of the five nights on the beach, the first time on the recommendation of a good friend. The three of us decided to eat at the bar, and Dawson took outstanding care of us both nights. If Dawson is working, ask him to make you one of his signature Tiramasu martinis...they are not on the menu but are outstanding.On both dinners we started with the calamari (excellent) and the Piatella (Greek spreads sampler) which were both memorable enough for the second visit.As for other small plates, the fire grilled octopus was tender as chicken and had excellent flavor. The baby eggplant was excellent as well.For the large plates, the scallops and the grilled lamb chops were out favorites, and the lamb chops were the best I have had anywhere.  The sea bass was also excellent, with a great citronette salsa.  The sirloin was good, but not as memorable as the other dishes mentioned.For dessert, the cherry chocolate torte with vanilla ice cream was excellent, and not as heavy and overbearing as many tortes can be.Overall a great atmosphere, above average food and service.", "Date": "2014-01-01", "Author_Location": "Alexandria, VA"}, {"Author": "Ani S.", "ReviewID": "tBsmYrgOnfqcPteZwTqogg", "Overall": "2.0", "Content": "OVERALL: Ok.  Not terribly dazzled with the food.   Trendy Decor and Seating but service and food leave much to be desired.   Definitely NOT child-friendly.We stop in every few months when we are looking for a spot to host a birthday or holiday party.   Came in for lunch while re-considering this spot for a party.  AMBIANCE: Immediately on entering, you are struck by the white on white decor and changing LED lights throughout that give this restaurant their striking image.   Subtle \"tushy\" chairs (chairs shaped like \"tushys\") scattered at random tables add an eclectic element.   An open kitchen lines one side while full wall windows that open to the patio seating line the other.   A bar and a semi-private dinner area are tucked into one side.  FOOD: We ordered the zucchini chips appetizer, Keftedes (Meatballs) with Fries entree and Roasted Leg of Lamb sandwich entree with fries.  The Zucchini chips where lightly battered and lightly fried.  Quite good! Not at all oily or greasy tasting.  They arrived with a simple tzatziki sauce that added a refreshing bite to the chips.   Definitely would reorder.  The Keftedes (Meatballs) and Fries Entree was served with rosemary fries.  The Meatballs were covered in a lightly cooked onion and herb mixture. The Meatballs had a barely-there hint of the flavors you associate with greek meatballs, but not enough to give them any sort of taste.   The dish came with five meatballs-  I had no interest in eating more than one.   I rarely eat fries, but compared to the meatballs, the fries were quite welcome.The Roasted Leg of Lamb sandwich was another miss.   The description sounded delightful- shaved leg of lamb, arugula, roasted peppers and herbed yogurt.   The Lamb was tasteless- you almost thought there was no lamb in each bite.   The herbed yogurt would have been a refreshing addition if there was enough to even see it on the sandwich.  The Fries that accompanied both were listed as \"Rosemary Feta Fries\".   The fries were tasty- the rosemary is always a nice addition to fries. SERVICE:  There were THREE tables occupied (including ours), yet our server took forever to handle simple requests (Silverware, please? So we could eat?).   We arrived with the baby just as the venue opened for lunch.  [I know, I know- this is not typically a baby spot, but my husband and I had a rare moment together, in the area and we both wanted to take another look at the party options here.  The baby was going to fall asleep in a few minutes anyway and is actually pretty well groomed/mannered for restaurant visits.]  We were not offered a high chair, nor did we ask for one.   I did ask for a baby cup of water with a straw for him.  The waiter was sweet enough to bring a GLASS shotglass with a straw in it.  He said he thought it would be perfect for little hands and proudly handed it to my one year old.   I had no comment. It was obvious that he had not been exposed to children much so I just giggled and politely asked if he had any plastic cups with or without a lid.   Apparently they did not.  No bother, I thought, as I had water for him in a child appropriate cup.COST:  Our lunch cost @$42- including the two entrees and appetizer listed above along with two club sodas.  WILL WE RETURN: Like sirens in ancient mythology that lure sailors with their beauty and music, the trendy ambiance of this venue lures us back each season as we hunt  for a fun spot to host a party.  However the food and service always turns us off to this spot and we end up booking elsewhere.", "Date": "2013-11-05", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Lee T.", "ReviewID": "wRUNdQKtvRfE35vDvsLBGg", "Overall": "4.0", "Content": "great decor modern, very clean, refreshing place, attentive service, great food, especially the seafood", "Date": "2014-05-12", "Author_Location": "Pompano Beach, FL"}, {"Author": "Susan L.", "ReviewID": "nvc-z6WXJHt5vWZ4dFbJDA", "Overall": "5.0", "Content": "One of our favorite places, Dawson 's tiramisu martini is off the hook. Don't miss the grilled octopus and the crab cakes. And one or two or three spreads   Lol.", "Date": "2014-01-04", "Author_Location": "Las Vegas, NV"}, {"Author": "Douglas C.", "ReviewID": "9qyKv6ui0xI8nee5U-xQFQ", "Overall": "3.0", "Content": "We had been meaning to try this place for a while.  Our vacation had just ended and we wanted to keep the fun alive, so decided to try out this restaurant.  The location on Oakland Park is a little annoying to get to because if you miss the restaurant on the first try you will have to make some U-turns.  Certainly not a deal breaker however.  We went on a Saturday night and valet parking was mandatory, although complimentary.The decor of this restaurant is really top notch.  Awash in white walls, white tables, white floors and white stones the contrasted array of pastel squares lighting the room really pops.  It is a very cool restaurant.  There is a partially enclosed outdoor seating area too that appears to  provide some nice shelter from Oakland Park Blvd.  We sat indoors though.  Picturesque scenes on projectors shining off the walls provide some nice views.Upon being seated the hostess recommended the lamb chops.  Service was excellent the entire night.  Bread and an olive tapenade with olive oil were served.  My girlfriend and I split an order of the spanakopita and I had a bowl of the chicken lemon rice soup.  The soup had nice fresh chunks of chicken in it and was good although I wish it were a bit tangier.  Others might prefer the less citrus-y version that was served on the night I dined here.  The filo dough on the spanakopita was flaky and crisp, and the filling was tasty although the pocket could have been a bit more stuffed with the spinach mixture.For entrees I ordered the recommended lamb chops and my girlfriend had the chicken.  The lamb chops were expensive, $35, for 4 lamb chops, so I was expecting them to be quite amazing.  They were good, but I felt they were about $7 overpriced.  The chicken for $20 was a better value.  The chicken was well seasoned and not overly lemon soaked.  The vegetables served along with each entree were also seasoned very well.  Dinner was good, albeit I felt overpriced.  For $5 more than the $35 for the lamb chops, you can enter the realm of a top tier steak house serving prime cuts, and the chops here just did not live up to that level.  Also, you can go across the street to the well known Greek Islands Taverna and pay a bit less too, although the service and atmosphere at Thasos is decidedly better in my opinion.Overall, I would return but don't think I would get the lamb chops again as they are too highly priced for what you get.  It is a very cool place though and the service was excellent.  Also, a nice wine and cocktail list.", "Date": "2012-12-27", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Daniel B.", "ReviewID": "NyFO5rXBkxA2w3r2_ynxQQ", "Overall": "4.0", "Content": "We hadn't eaten Greek food in quite a while, but this place really surprised us.The locale was beautiful and the service excellent. We got there quite late (around 1100pm) and the kitchen was still open.  The only problem I had was the music was a bit too loud, making comfortable conversation quite a challenge. On to the food itself, we ordered the daily special, the entree was a toasted pita bread with delicious lamb on top. It was great. The main course was outstanding as well. Lamb Ossobuco. Keep in mind we have never been fans of lamb, but this was excellent. Definitely recommend this restaurant, specially if you're in the area and are looking for a good place to eat on a late evening.", "Date": "2013-05-19", "Author_Location": "Miami, FL"}, {"Author": "Ash D.", "ReviewID": "UxF_COrLskHOIZHMJExzLQ", "Overall": "5.0", "Content": "WOW...Excellent ambiance... Beautiful decor...beautiful people... We had grilled  cheese in an iron skillet with Metaxa flambé to start with.. the lamp chops, scallops and the fish chipura... actually the fish is flown from Greece..one of the best..... Aaah! feels like home..there is nothing like Mediterranean fish. YUM !!! Buddha Bar/Hotel costes music... Cranked up after 11pm  Southbeachy atmosphere... L-O-V-E it!", "Date": "2013-03-26", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Edward N.", "ReviewID": "3kvbq12FedZGFeqvuP7yuQ", "Overall": "3.0", "Content": "It's almost there.   It's a beautiful restaurant. The food is good.  The appetisers are good.  It has complementary valet parking.  The prices are okay.  And the service isn't bad.  So what's the problem?A couple of things.  First, the accoustics are pretty bad.  All hard surfaces.  And the bar adjoins the dining area with no sound buffers so if it's a noisy bar scene, dining becomes intolerable.  A glass partitiion could remedy that issue.  So coudl turning down the canned music.But it won't happen because of the second problem -- management.  They seem indifferent to the concerns of their customers.  Finally, the wine list needs some work, both in price and recognizable labels.  If they fix these things, and, perhaps, introduce a happy hour, they could have a thriving business.  if they don't ... well, Fort Lauderdale's survival rate for restaurants is scary.I hope they make it because the potential is great.", "Date": "2013-06-30", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Joanna R.", "ReviewID": "Ur85eGMQDmOqmAgPcwIDlw", "Overall": "4.0", "Content": "Came here out of the blue with some friends during 4th of July weekend, as we were staying at the W nearby and didn't have luck with the original restaurant we wanted to go to (I forgot the name already). They were open late and were incredibly attentive and accommodating to our group of six. I had the baby eggplant for appetizer and boy did I love it! I really wanted to order a second one but abstained from being a total fattie cakes. I ordered the pork (which I wasn't thrilled with because I found it to be too big and not seasoned enough), but then again I am Cuban and well, no one does pork like us. The decor of this place is VERY cool (all white and neon lights), very reminiscent of the old Cafeteria on Lincoln Road if you ever had the chance to go before it closed.I'm never in that area so highly unlikely I will return (although I have been thinking about that eggplant), but it was a lovely meal. My friends liked their lamb a lot so I would recommend that dish as well.", "Date": "2013-07-16", "Author_Location": "Miami, FL"}, {"Author": "Jon K.", "ReviewID": "xKoLjKK81V_GQVkGuDvRIg", "Overall": "3.0", "Content": "2nd visit to Thasos.  Couldn't find my initial review on here, so decided to do another one.Went with a group of friends on Saturday night.  Place was busy, gald we had a reservation.  Seated pretty quickly.We split a few salads and had the saganaki.  Didn't like the fried cheese the first visit, it was better this time, but still not as good as Greek Islands.I had the chicken for my entree.  It was moist and warm and pretty good, not outstanding.The baklava cake for dessert was very sweet and yummy, luckily I like sweets.Overall, its a fine restaurant, very well decorated and more like South Beach in Ft. Lauderdale, but it is very pricey for what you get.And my bottom line is that Greek Islands is just a better place and better value.  Yes it might not be as pretty and clean, but the food is better and not as expensive.  So, its up the person to decide which to go to, but my go to would be Greek Islands.", "Date": "2013-02-02", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Chaim L.", "ReviewID": "JV44V75YbFdH9YIpQjB2Ng", "Overall": "5.0", "Content": "I can honestly say I didn't know Greek food could be so good and an ambience so thoroughly Greek (though very clean and modern) so beautifuly tasteful yet fun.  Everything from the valet to the warm, parting good-byes is charming and classy.  The decor is so unique and distinctive and plays with the edges of over-the-top without ever going there.  The menu is relatively simple - but the execution of each dish is so honest and fresh and delicious.  The service was low-key graceful.  It's pricy but portions and quality still equate to value especially with the environment.Caveat: This would probably be a 4 Star in Chicago, but for Ft. Lauderdale it was a delightful, delicious discovery.", "Date": "2013-03-18", "Author_Location": "Chicago, IL"}, {"Author": "Junior M.", "ReviewID": "3D6UlvOpY--jKrwfiL4qYg", "Overall": "4.0", "Content": "Please. Id eat here every night if I could. The servers are MAJOR helpful. She has a very greek and VERY long name.  I wasnt blown away by the food but it was far from bad. GIving it 4 stars because its SOOOOOO LOUD in there. Im not sure what the deal is with that but FORGET about TALKING to your party.", "Date": "2012-11-19", "Author_Location": "Hollywood, FL"}, {"Author": "Don P.", "ReviewID": "27tdJu6x5WmF7BhsqRntVA", "Overall": "2.0", "Content": "Good food", "Date": "2013-12-26", "Author_Location": "Norfolk, NE"}, {"Author": "Michael K.", "ReviewID": "yeeFC4TkIZJEupQo_o7kow", "Overall": "5.0", "Content": "Awesome, really beautiful design, and amazing Greek food. Fantastic!!!The staff and the service is phenomenal and the food also.Get the grilled octopus, mussels. and the lamb meatballs.YUMMY and beautiful atmosphere.", "Date": "2012-10-24", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Marqus R.", "ReviewID": "_aLc12tK5jf_PyCFv1BRVA", "Overall": "5.0", "Content": "The décor and design are really something. It has trendy pizzazz, panache and sort of understated simplified elegance with nothing being too flashy, frumpy or flamboyant. As for food, obviously Greek with rather complete but somewhat abbreviated menu having all items and sides separately priced and, as one might expect, pricey but tasty, good and well presented. I had the roe spread, Greek salad, grilled octopus appetizer, and flat iron steak with shallot as an entrée along with a rather nice rich robust in tannins Malbec. The only thing that came with the meal, not separately priced were some tasty Greek olives served in a same bowl and a couple slices of bread, no humus butter or other accompaniments. The salad was basically tomato, iron, a variation lettuce topped with a couple healthy slabs of cheese, all of which was crispy fresh and wonderfully flavored. The octopus was indeed grilled, tender and done to perfection as was my entrée flat iron steak with roasted shallots. All in all, an extremely good though to the pricey side for a meal but overall not a bad value for the dollar. Being a new restaurant, it was crowded with first timers, noisy and soon those without reservations were being turned away at the door.", "Date": "2012-09-28", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Maurice C.", "ReviewID": "VhnnTFyoFTeZJDdV5-AvoA", "Overall": "5.0", "Content": "Definitely the best Greek restaurant in the Fort Lauderdale area that I've been to.  They have a nice small plates menu.  We ordered 4 for the table: Saganaki (grilled Greek cheese), shrimp saganaki (grilled shrimp with a tomato sauce, some of the biggest shrimp I've ever seen, by the way), zucchini chips (essentially fried zucchini), and fire grilled octopus in a lemon-olive oil sauce with grape tomatoes.  They were all very good, although I would say that the shrimp saganaki wowed me the least (might still be worth getting just for the novelty of having such large shrimp).After sharing all of these small meals I was fairly filled up already, and I wasn't sure if I should just have another small plate as my \"main course\" or if I should go ahead and just order the large plate meal that I had originally planned.  I decided to stick with moussaka, because I had always wanted to try it in a high quality Greek restaurant, and it didn't disappoint.  I loved the layers of bechamel, the minced meat in tomato sauce with a subtle hint of cinnamon, the eggplant, and I even tasted some potatoes in there too.  Delicious.  I didn't even try to taste what my fellow diners were having because I knew I had to save enough room for my own main course.  Still, I couldn't quite finish it despite its deliciousness, and so I will have to enjoy the rest later.  I'm looking forward to that...One of the people I was eating with had their birthday, so the staff brought out a piece of flourless chocolate cake that was big enough for sharing.  They also lively sang \"Happy Birthday\" to him, in chorus with our own group.  A few minutes later, they brought out another slice of cake, and so we all got enough to share along with the birthday boy.  The cake was good, although not mind blowing.  Upon return, I think I might try the baklava instead (which they actually brought out to us after the chocolate cake, but the people I was with wanted another piece of chocolate cake instead, so that's what we got).  Well, anyway, this is a Greek restaurant that I would highly recommend for a large group or for a first date due to its lively atmosphere and bright, white decor.", "Date": "2013-12-14", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "James B.", "ReviewID": "nSQ1GWz0DheDJnJkVn-ZEA", "Overall": "4.0", "Content": "A solid but quiet lunch spot that needs more road signage and perhaps train the waiters on not arguing with customers. Food is good (and wow that kitchen is clean) - I'll definitely try the dinner next time I'm in town.", "Date": "2013-11-29", "Author_Location": "Spring Branch, TX"}, {"Author": "Leon N.", "ReviewID": "uwShXPWArL-Yza9YMv48CQ", "Overall": "5.0", "Content": "The food is so amazing and fresh. Loved the zucchini chips, grape leaves and spanakopita. It is a little bit pricey but it is top notch food.", "Date": "2014-04-17", "Author_Location": "Potomac, MD"}, {"Author": "Brian R.", "ReviewID": "QQM4-STiQ5g95vyyL1TU8Q", "Overall": "3.0", "Content": "The food was excellent, but it loses two stars. Our waitress was fine, but the rest of the wait staff I was less than impressed with, including the young woman on a break standing in the middle of the valet area smoking who actually stuck out her tongue at me and stalked off when I was trying to drive up to the valet guy to park in their tiny lot. Not a great introduction. The people at the host area were busy and dismissive. Strike one star.  The ambience of the place is hipster cool, which can work. The droning, blaring House music? With Greek food?  Non-starter. Took my whole meal down a peg.  They can't find hip music to program that let you enjoy your meal? I'm not there to dance.  Star two.", "Date": "2013-07-16", "Author_Location": "Boca Raton, FL"}, {"Author": "Armando Z.", "ReviewID": "gbhLDQlPeRp2yOQ7d0QHdw", "Overall": "4.0", "Content": "Very good restaurant. Excellent food and friendly service. The only downside is that it is really loud inside between the loud music and the people talking it was hard to talk to my girlfriend without yelling. Be aware that sparkling water is $7 a bottle! For the rest the seafood entrees we had were very good, the salmon and the swordfish were both delicious and cooked to perfection.", "Date": "2012-08-09", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Marianne R.", "ReviewID": "6CAQkYJ9Ne3ps5kijKc_lQ", "Overall": "3.0", "Content": "I don't understand why everyone is raving about the decor; It's white. White chairs, white bar, white walls. Everything is white. We had some appetizers which were Ok, nothing specular, but very small portions and overpriced. I really like the stuffed Sheep at the entrance! Very cute!", "Date": "2012-10-24", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Ana B.", "ReviewID": "BB9a-NZjVmtsQ_H4J29Jxg", "Overall": "5.0", "Content": "Beautiful place!Great service at the bar and really good food!Pricey but you get what you pay for (except for the octopus that was VERY small portion :) but simply delicious tender.Cocktails sounds good, very fresh ingredients, I wasn't feeling like drinking anything but wine, but will definitely try next time. $14 for a small drink for the records.. Must be really good!!!Definitely recommend it!", "Date": "2012-09-14", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Susy A.", "ReviewID": "gMgMMlB_MEdgzoFz2H7Qxw", "Overall": "3.0", "Content": "Had the bad luck of attending the night of their anniversary dinner and since nobody told us about it we had no idea it was a white party ( and coincidentally everyone on our group happened to have dressed in black for the night). Food was good but music was so loud we could not speak to each other all night. We will have to go back on a normal evening to try again", "Date": "2013-08-24", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "DAWN K.", "ReviewID": "x2r-OQ8OgzyU_3yD4_Riww", "Overall": "4.0", "Content": "Love Thasos.  My favorite dishes are the greek salad and the grilled octopus appetizer.  I could eat those two dishes once a week and never tire of them. The atmosphere is more South Beach than Galt Ocean, which I love.  Fun place with great food and drinks.  Highly recommended.", "Date": "2013-09-15", "Author_Location": "Pompano Beach, FL"}, {"Author": "Jason F.", "ReviewID": "-NJEVn197zLaDZVzN-K4sA", "Overall": "5.0", "Content": "We always look for the opportunity to find good Greek food. The food here was fresh and done very tasteful. My favorite dish was the grilled octopus a must have!", "Date": "2013-09-22", "Author_Location": "Fort Myers, FL"}, {"Author": "Alex G.", "ReviewID": "KPcSlCfL8E06BMQy9jV08g", "Overall": "4.0", "Content": "As Greek restaurants go, this is solid and well above average.  The decor is super hip, although the lighting should be lowered slightly.  Greek salad was fresh and delicious, with perhaps the best mini cukes I have tasted.  Zucchini fries were tasty, but they could have been slightly crispier (note: use hotter oil).  Octopus was the table hit, well flavored and generous portions.  Lamb chops tasty if a bit fatty.  Drinks - especially hand made cocktails - were top notch; Greek red wine by the glass was soft and lush.  Yum!  And don't skip the baklava!", "Date": "2013-03-18", "Author_Location": "Broward, FL"}, {"Author": "Ryan S.", "ReviewID": "FizfyUOZWP8mgOT9856bMA", "Overall": "5.0", "Content": "Really delicious food with a great presentation.  Cool atmosphere as well. Not usually into Greek food, but Thasos was certainly an exception. They have a nice variety of apps and entrees so you are sure to find something.", "Date": "2013-04-01", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Drew T.", "ReviewID": "dEc3IF4xys0sS1ID4ovh5g", "Overall": "5.0", "Content": "We went to Thasos on the first night of our vacation, a Wednesday night.  We arrived just before the kitchen was closing, and were made aware of this, but we were still given the best Greek meal we have received in a very long time.   We did not have the noisiness issue that many people on Yelp talk about, probably because it was close to closing time.  The restaurant is completely white, white booths, white tables, white chairs, and a white bar.  The color changing lights in the ceiling go well with the all-white décor.We started with a dip sampler, which included all of the dips on the menu and was a great value.  Large amounts of each one of the offerings which included taramosalata (delicious creamy caviar dip), tzatziki (traditional Greek yogurt dip - this one with real Greek yogurt), hummus (freshly made), tyrokafteri (spicy feta cheese dip), and melitzanosalata (eggplant and red pepper dip).  We had the dolmathakia, ie grape leaves freshly rolled with rice and herbs.  They were fresh tasting and moist, not dried out like most home-made grape leaves other Greek restaurants offer and pine nuts were also a nice addition to the dish.  We also had the lamb meatballs, tasty, fresh and cooked properly, delicious with the homemade tzatziki.  The last thing to arrive was our individually portioned soufflé dish of moussaka.  It was creamy, seasoned well, and the beschamel sauce light and flavorful.  Overall the meal was very delicious and we had no issues or complaints about the food or service.  If we find ourselves in Ft Lauderdale any time in the future, we will be sure to stop back at this great restaurant.", "Date": "2013-03-15", "Author_Location": "Mercerville, NJ"}, {"Author": "Frank M.", "ReviewID": "NHsfYVLduo7v0KvhiEDUvg", "Overall": "5.0", "Content": "First let me start by saying that I always went to Greek Island Taverna which is around the corner from Thasos. The first thing that I noticed upon arriving my first time,(I've been there six times in three weeks now), was that the restaurant was stunning visually and the valet was very quick and polite. No hassle like looking for parking when I go to other restaurants in this area. But the real treat was when I walked in. I felt like I was transported back to Mykonos.The food , the service, everything was amazing. I give thos place a very enthusiastic five stars. Be sure to try the grilled octopus, and the watermelon feta salad. Oh, and the sagankai with shrimp is AMAZING!!!", "Date": "2013-08-31", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Ronn M.", "ReviewID": "ut7FnB7St7-TPKfYgJP_wg", "Overall": "4.0", "Content": "This new restaurant (opened in August 2012) has received spotty reviews for its spotty service and mostly pricey menu. Those \"reviews\" (posted on insidefortlauderdale.com, which isn't a local website, but owned by a for-profit, commerical company in NY) may or may not be accurate. I'm sure the owners and staff of Thasos are reading what's being written about them, and are tweaking their restaurant. Maybe they'll tweak the menu too, reducing some of the more outrageously priced items, not least of which is the wine list.My suggestion is to order your dinner at Thasos the way Greeks order when they go out. Authenticity has to be the rule of thumb at Greek eateries, and Thasos must be following that strategy. The moussaka and calamari were both cooked to perfection, with perfect seasoning. Neither were overly greasy, a common pitfall of these dishes at ordinary Greek restaurants.It's too bad we weren't able to drink Greek retsina wine with our meal, but $30 for a bottle of pine-flavored white wine is more than twice what that wine is sold for stores who don't want to rip off their customers.The stories you've read about the origins of this taverna arising out of an argument are true. As long as the owner of Thasos wants to put Greek Islands Taverna (a block away from Thasos) out of business, the dining public will benefit from authentic Greek food served by friendly staff in a chic Greek taverna. Opa!", "Date": "2012-10-07", "Author_Location": "Pompano Beach, FL"}, {"Author": "Sofia P.", "ReviewID": "du-MsqhENY_9eppFNMVPBQ", "Overall": "4.0", "Content": "Great place!  Fabulous trendy decor, fresh food and great atmosphere.  Went with a party of four, had a bunch of appetizers and Greek white wine which was fantastic. Why four stars and not five, service.  Our waitress wasn't impressive.  Overall enjoyed this place and would for sure go back!", "Date": "2013-07-16", "Author_Location": "Stamford, CT"}, {"Author": "Robert L.", "ReviewID": "-69ZXy6b0BxfFc4rDquz4w", "Overall": "4.0", "Content": "I was not sure if I should give a 4 or 5 star. They should allow us to give a hal star somewhere along the way. But the evening was perfect for us.Being greek I am very picky with greek food. Olive paste and bread given at the start was OK. A little salty for me. I asked for some olive oil for my bread and they brought me a nice bottle of Terra Medi. Dealing in oil myself by the taste I knew this was northern greek oil. Similiar to the Italian oil. OK for me but most will not notice.We had the lamb on flatbread which was awesome and their dips on boats we just awesome as well. Loved the presentation.  Octopus was next. This could have been a little bigger in size. To thin for my liking. Greek salad was very good. And finally the Chilean sea bass, excellently cooked and great taste. Finally the dessert, we tried 3 different types. All excellent and great presentation.Over all a great night, place was a little loud as the whole place is stone wall. What a felt lacked was management coming around to greet the people. This is not your everyday average restaurant. Little Raki on the house since I am sure most people are dropping $$$ for the dinner.  Most higher end greek restaurants do this that I have been too. Just a little suggestion. It goes a long way.I will be back as it's just minutes from my place.", "Date": "2013-07-20", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Rebecca C.", "ReviewID": "Ym_WrV5-_M0GBrHjEJEYhA", "Overall": "2.0", "Content": "A bad review will go a long way. You have to piss somebody off pretty bad to want to write a review at midnight.Funny, when we arrived we saw a large table of people from our industry (superyacht) and we went to say hello. Knowing that we are from Fort Lauderdale they asked: \"What do you know of this place?\" and we answered that we were here to find out.Ambiance? Great. Food? very nice. However, when our waiter came at the end of our meal to check on us we mentioned to him that we found a rather long hair in our potatoes. We noticed that the majority of the cook staff had hair nets, so this seemed rather odd.We didn't plan to make a big deal of this, as the food was fine. However, the waiter brought a manager to our table right away.This is where the evening went wrong.The manager, instantly on the defensive, said \"How could a long hair be in our food if all of our people wear hair nets?\" \"I don't know,\" said my husband, \"but that is what we found.\" The rest of the banter is insignificant, suffice it to say that the overly defensive manager had absolutely no interest in hearing that there was indeed a hair found in his food. He was certain that we had \"planted\" (Yes, a word he used) the hair.I don't need to say more. Except that I will not be including Thasos in any positive reviews. As I said to the overly defensive manager: \"It is not only about the food, but the service, and the customer service.\" I was in the service industry once myself, as was my husband. We were taught the following: \"the customer is always right\". Thasos should take a long hard look at its management team. There was a second manager who was sent out when Manager #1 wasn't settling the situation. Manager #2 said to my husband \"If I found a hair in my food, I would send it back immediately\". Well, Mr. Smartypants, the hair was found in the potatoes, something my husband started eating after the lamp chops. Again, insinuating that we were up to some sort of scheme to swindle them out of their $28 lamb chops.Instead, we paid our bill, tipped our waiter 18% and tipped our valet. But that is the first and last time we will be at Thasos. We will continue getting our lamb chops around the corner at the wonderful Greek Taverna Islands as we have been for years. Oh, and for the remainder of our superyacht friends? Well, our recommendation will be for elsewhere. And believe me, we know a lot of people.", "Date": "2012-10-27", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Erin L.", "ReviewID": "eXeNiDdrxsBWOmxv22AyGg", "Overall": "4.0", "Content": "Awesome food ! Love the all white look with accent lights. Reasonably priced and again, food is awesome ! Great for couples, small groups or a big party !", "Date": "2013-05-03", "Author_Location": "Boca Raton, FL"}, {"Author": "Cherepaha B.", "ReviewID": "cq6tZwyUyIORsFBAHNsS-A", "Overall": "4.0", "Content": "The food is good, but the music is too loud -- even the waiter can't hear you from a foot away as you're trying to order.  It has this feeling of a dance club, except there's nowhere to dance.   Can't talk, can't feel romantic, just feels chic, cold and uninviting.", "Date": "2013-07-14", "Author_Location": "New York, NY"}, {"Author": "Ed G.", "ReviewID": "OSTET4pwgRbLOc2EcYn0qw", "Overall": "4.0", "Content": "Outstanding.  Highly recommended for food and service.", "Date": "2013-07-29", "Author_Location": "Hollywood, FL"}, {"Author": "Louise A.", "ReviewID": "aC9Zkir4OlM4zCYKPUk_Aw", "Overall": "5.0", "Content": "I could not understand how a Greek Restaurant could open a stones throw from Greek Isles Traverna but it is totally different.  Very upscale and innovative dishes - while still well prices.  The place is gorgeous and George was an outstanding waiter.  All the dishes were great.  I will definitely go back.I see there are some reviews questioning the authenticity of the reviews.  I do not know the owners and they did not ask me to review", "Date": "2013-08-03", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Tricia L.", "ReviewID": "2w5UlMa_IRiYECtVZad37Q", "Overall": "5.0", "Content": "I'd heard from others that Thasos was overpriced for the food and while it is a pricey Greek Restaurant, I must say that the price was worth it!  It's definitely got a South Beach flair with everything white, so you've got to be in the mood for that.  The food was amazing.  I had the lamb chops and our family shared a great deal of appetizers.  The service was impeccable and the music (Goldfrapp-ish) certainly fit the mood of the restaurant's environment. If you're looking for a great Greek restaurant with a modern style, I would definitely try Thasos!", "Date": "2013-05-22", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "N P.", "ReviewID": "C3yvITgQIYIYIoGmPr5Ckg", "Overall": "4.0", "Content": "We found Thasos Greek Taverna on Yelp and we thoroughly enjoyed our meal. This restaurant has a modern, sophisticated Mediterranean feel, very white, very modern. We liked the look and more importantly the we loved the food. We both passed on a the entrees and stuck to the appetizers- eating tapas style, which was plenty of food. Highlight for us was the grilled octopus and lamb.", "Date": "2013-05-05", "Author_Location": "Providence, RI"}, {"Author": "donald a.", "ReviewID": "13T2jGZEGBUcGgZgVDXv5g", "Overall": "3.0", "Content": "Went here for dinner during the week with the place about 40% full.That was a good thing as between the brick and plaster walls, it is A VERY NOISY PLACE TO EAT.They are copying Estatrios Milos in NYC.This is an expensive glamorous place on west 56th street with $50 fish entrees, btw that is ala carte.I had a couple of spreads, a greek salad and the lamb chops.All were good, not exactly heavenly.Given the high prices and noise level i would much prefer Greek Taverna down the road.", "Date": "2013-02-22", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Hope P.", "ReviewID": "31ji3Qk0O2RA2_vf3bDLlg", "Overall": "5.0", "Content": "The Hype is on and I'm going to find out if Tastefully new Thasos Greek Taverna meets expectations.. Wow How amazing the Decor and the food and service was down to the phone call for the Reservations I am blown away! (I took lots of PICS!)    Got to make reservations pre-open for 7pm Party of 6 on a Monday and was greeted right away by great people (I recognized Billy from Peter Pan Authentic Greek Diner) you walk in the door there are a couple of Stuffed Sheep animals and beautiful Flower centerpieces, and met George the GM, down to the waitresses and food runners everyone went out of the way to make a memorable experience, not to be forgotten!! The beautiful LED colors light up the outside of the building in square blocks of lighting and the theme runs throughout the interior with nice square lighting and square drop lights, this place screams amazing Party whatever the occasion may be. The waitress took our order and kept checking up on us making sure we all were happy and satisfied.  Most of the table had Prosecco's (Il Fresco Rose), and I had the Karpuso Cocktail which the waiter recommended its Ouzo, Kettle One Vodka, Lemon, Watermelon and Rosemary(14$), it was good and perfect balance of strong and tastefully good accompaniment for the appetizers. The Apps (Pikilia~Greek Spread) Tried :     Green Chick Peas -Crushed, Fried Garlic, Olive oil, Lemon (6$)     Eggplant- Fire Roasted, Basil, Red peppers, Olive Oil (6$)      Whipped Feta- Hot Chilies, Cured Tomato, Our Rusk (6$)   Taramasalata- Whipped Roe, Almond Milk, Sourdough (6$)So delicate the Peas were a refreshing take on a Humus, the Eggplant was marinated perfectly and so delicious, the Whipped Feta was delicious had a roasted Chili on top for presentation, who doesn't like cheese?! It was melt in your mouth explosion. Taramasalata Im not usually a fan of but this one was tasty and delicate too and not salty like others.. Wow cant wait to eat more from the menu.  The Mezedes ~Shared Plates Tried :               Grape Leaves- Stuffed, Arborio Rice, Lemon, Mint (8$)              Octopus- Fire Grilled, Lemon, Oregano, Thasos Olive Oil (14$)              Keftedes- Grilled Lamb Meat Balls, Whipped Yogurt, Tomato (10$)The Grape Leaves were really fresh and not much overpowering flavor, this is not the over marinated Grape leaves you would get at other restaurants.  The Octopus WOW WOW WOW Okay this is the most tender best Octopus I have Had EVER! It was amazing not one ounce of chewy and not slapped on with some lemon-sauce like other places, this was again in a delicate Olive oil and let the organic Char-Grill enhance the flavor to the Cephalopod Mollusc ..Truly A Must Try Dish!! And the Keftedes were like Kobe Meatballs just tasty and nothing like your taste buds expected so be ready to keep your mouth closed the taste buds just might leave you behind to try more of it.  The Apo Ton Kipo(from the Garden) Plates Tried: Greek Salad-Heirloom Tomatoes, Cucumbers, Feta, Olives, Thasos Olive Oil(8/14$)  Fennel Salad- Orange, Frisee, Manouri, Pine Nuts (10$) Thasos Summer- Watermelon, Feta, Basil, Thasos Olive Oil (8$)The Greek Salad just fresh and tastes straight from the Garden, there were paper thin Red onions in it that gave the flavor not like any \"Greek\" Salad you've had. The Fennel Salad was really great the Fennel sliced paper thin again and just a delicious salad I highly recommend it!  The Thasos Summer salad was cubed Feta a top of watermelon squares and chopped basil on top, the flavors marry together another Great try!Finally (But not Least) Apo Tin Fotia~ From the Fire:     Organic Salmon -Lentil Cake, Charred Tomato, Giaourti, Dill (22$)Lavraki- Grilled Whole Mediterranean Sea Bass, Fine Herbs, Lemon,Thasos Olive Oil(28$).     Split Roasted Chicken- Mizthra Dumpling, Lemon (16$)Lamb Chops- Crunchy Fingerling Potatoes, Thasos Oregano, Lemon (26$)The Salmon was Delicious and Organic makes all the difference with fish. I ordered the Lavraki and it flaked off the bone and was scrumptious and I even ate the crispy delicious skin, I was happy with my pick until I got to try some of the Lamb Chops.Wow again they soo know how to cook the most perfect lamb here it was outstanding and medium-rare tasty-delicious masterpiece.. Okay you Should order this one and Im usually disappointed by Lamb at restaurants but this one will make you fien for more, like an addict its That Great. The Chicken again tasted organic a great taste to it slight lemon, crunchy skin, a Great dish.Okay we were satisfied with all of the food  to tell you the truth before the entrees came out, but we finished them up, couldn't help it! But of course had to try the Baklava and the Greek Yogurt with fresh berry coulee, the Sifnopitta (Honey and Cheese Cake) All really fresh and not too sweet, delicate on the palate is how I describe the whole meal. The Espresso and Cappuccino's were by Illy and Italian approved.    *The dinner and drinks complimentary opening", "Date": "2012-08-06", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Nina C.", "ReviewID": "P-or4EyqnD5myVSR8mR2qQ", "Overall": "5.0", "Content": "Atmosphere is awesome!!! Food was great tooo!! Bar service was outstanding!!! Billy you did a great job!!!! Congrats!!", "Date": "2012-09-19", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Susan L.", "ReviewID": "qhp9uglb5Q22AbZSEt5pYg", "Overall": "4.0", "Content": "It is a feast for the eyes...Beautiful decor...fabulous service....excellent food. I would have given it 5 stars if the noise level was a little intense, however you do adjust after a while.  We shared the octopus as an appetizer. Quite good. My date had the lamb chops which I tasted and were out of this world, moist, tender and flavorful. I had the grilled sea scallops over a bed of rice with tomatoes and feta cheese. Also amazingand full of flavor, scallops done to perfection.  Had the phyllo and custard dessert - can't remember the name but do try it...also perfection. The perfect balance of sweet, custardy, cinnamon...Delicious!", "Date": "2013-03-07", "Author_Location": "Boynton Beach, FL"}, {"Author": "John S.", "ReviewID": "g066VKgjT7PCsIyanOjg2g", "Overall": "4.0", "Content": "Food was great, our energetic server was better but the place is L O U D.  Don't go here if you want to talk to someone.", "Date": "2012-10-24", "Author_Location": "Hollywood, FL"}, {"Author": "M F.", "ReviewID": "1J3GwemXFC1xHFBv-OMZXg", "Overall": "5.0", "Content": "Beautiful ambiance, great that they take reservations...Attentive servers, poor wine list choices, great food.", "Date": "2013-11-05", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Tara S.", "ReviewID": "sFyKH8mjyQF7YgmjyGJynA", "Overall": "3.0", "Content": "We had a nice dinner here.  The interior (and really, exterior as well) is STUNNING.  Truly.  It's a little bit loud inside, but not enough to bother my husband or me.  My in-laws thought it was too loud :).  The food was mostly good.  I wasn't really blown away by anything, but it was all good.  Service was attentive.  There is a whipped feta dip served with pita that I would LOVE to have the recipe for; the octopus, tzatziki, lamb meatballs, grilled cheese (not the sandwich...), and a grouper special were all great.  Everyone had a greek salad and enjoyed them, nothing special, but a decent greek salad.  Overall, a nice meal in a beautiful setting.", "Date": "2012-11-01", "Author_Location": "Loveland, OH"}, {"Author": "David I.", "ReviewID": "VUQ1GPt27l8i90ZJDd4xIQ", "Overall": "5.0", "Content": "I am a 50 year resident of Ft Lauderdale and have eaten in most all restaurants in town.This one went to the top of the list after my dinner last night.The restaurant is resplendent in white and blue and has an atmosphere like you are in Greece.They hired a new chef a while ago and he has done miracles with the food.I had the best Greek salad I have ever had,followed by a smokey style pork chop with lemon potatoes and a dessert of cheese cake that was as good as I would want.There were no negatives in this experience from the moment I entered to the moment I left.The service was impeccable.It is mandatory free valet parking and I recommend you call for directions as it is a litle bit hard to find if not famaliar with the area.Treat yourself to a wonderful experience", "Date": "2013-01-20", "Author_Location": "Hollywood, FL"}, {"Author": "Gaby D.", "ReviewID": "eg7SVkayRJ1_vnZyX2n7Ng", "Overall": "5.0", "Content": "This is a simple review, the ones I like best. Nice place, great service and delicious Greek food. It has a bit too loud music if you want to have a conversation in a large table, but that is it. Still give it a 5 , for sure will be back with more friends.", "Date": "2013-09-08", "Author_Location": "Miramar, FL"}, {"Author": "Jennifer A.", "ReviewID": "OM_8XjdpM0BJXMrPnbqZ0w", "Overall": "5.0", "Content": "Absolutely beautiful restaurant, the designer did a fantastic job, lots of attention to detail and beautiful from every angle of the restaurant. I had one of the hand crafted Martinis and it was fabulous. Our dinner was exquisite, very good quality, and tasted unbelievable. Even those who have not tried Greek fare will enjoy this menu. Love it!", "Date": "2013-04-18", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Robert K.", "ReviewID": "FpQ38qqsx_ld4HDY98v7bQ", "Overall": "4.0", "Content": "My wife and I went there on a date night.  Overall, it was a very good experience.  The food was fantastic.  The special house martinis were fun and different.  I liked the menu, as you could do a tapas type dinner or the regular full dinner size meal.  The pumkin swordfish was quite tasty.  The whipped feta with red peppers appetizer was awesome with fresh baked pita.  The chocolate dessert in a martini glass was a  cool presentation and yummy!!  The only drawback was the acoustics, a little on the loud side.  I would highly recommend for a fun evening with more than one couple or a group.", "Date": "2013-04-23", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "R P.", "ReviewID": "rEP_-59IY5uLc0PdTErjTw", "Overall": "4.0", "Content": "First off this is by no means a romantic place. It looks nice but has this sterile almost cafeteria ambiance. Had the arugula salad with pine nuts and goat cheese. It was great. Also the Octopus was fantastic. For the entree I had the lamb chops. This wasn't blow your mind good or great, just good.  Overall I would go back, I liked the food in general but I wouldn't hold any expectation of intimacy at this rest. probably best attended with a group of friends out for a good time rather than a date.", "Date": "2013-03-12", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Kino S.", "ReviewID": "1SAvJTpkAABdNSdiAsGqbg", "Overall": "5.0", "Content": "impressive interior design! Food is fancy and GOOD.", "Date": "2012-12-17", "Author_Location": "Jersey City, NJ"}, {"Author": "Budlette N.", "ReviewID": "Rwm-FjAMgbsZYhFF7rYi6g", "Overall": "5.0", "Content": "I just had dinner there for the second time last night and it did not disappoint!  From the fennel salad (toasted pine nuts, salty cheese, fresh arugula and slices of orange or tangerine sooo good) to the moist and tasty keftedes everything was delicious and even the service was spot on.  On my first visit it definitely seemed like they were still working out a few kinks of being a new restaurant  (the staff seemed a little lost/confused and the lighting was wayyy too bright at night) but the food was so good I decided to give it a second try last night.  And I'm really glad I did because this time everything was perfection!  We never had an empty glass, the timing of the food was perfect and have I mentioned how delicious everything was?  My boyfriend wasn't even in the mood for Greek food but by the end of the meal he was singing their praises right along beside me.  I would definitely recommend any one to try this place if you're looking for a trendily designed restaurant with freshly made gourmet Greek food, mmmmm, I can't wait to go back!", "Date": "2012-12-04", "Author_Location": "Savannah, GA"}, {"Author": "Stefan C.", "ReviewID": "DV6VKCdaqeRZJ2LOg1A2OQ", "Overall": "5.0", "Content": "I travel all over the country regularly and eat out a lot through my work.  I must say this was outstanding!  The atmosphere was slick, I had my wife with me and we felt very romantic and energized.  I felt like I was in a hip restaurant you would find in the Mediterranean right down to the music!  The food was amazing.  Simple and incredibly fresh ingredients prepared the way they should, simply letting the ingredients shine versus the restaurant trying to outdo the flavor of the ingredients themselves.  Next time we are in town I will be back.  This place is a must!  Only word of caution is, if you don't think you handle the energy this place will bring to your dining experience you better stick with the blue plate special somewhere else.  Great food, great service, great fun....!", "Date": "2013-05-31", "Author_Location": "Penn Center, Philadelphia, PA"}, {"Author": "George K.", "ReviewID": "Fd87TnQt8ojBcQix_DVaGQ", "Overall": "5.0", "Content": "Living in Sunny Isles we have the distinction of being in the center of the Universe half way to Miami and Fort Lauderdale. When Milos opened I wrote that we finally can celebrate that we have a first class Greek Seafood  restaurant in Florida and I can happily say that you dont have to travel from Fort Lauderdale to Miami to enjoy first class seafood Thasos that has just opened on Oakland Park is doing it right. We started the evening with an amazing Greek salad followed by an octopus dish that was incredibly tender and then keftedes which are Greek meatballs that were just so delicious that we almost ordered a second serving. Next came a Mediterranean Sea Bass that was so fresh and so well cooked that I wondered if they were flying them in directly from Thasos Island which happens to be the birthplace of the owner Kosta Leontarakis who was on the premises and greeting all the guests with his grandson and manager George who was beaming with pride standing next to Grandpa. We also tried their famous lamb chops which were grilled to perfection,tender and served with the most amazing roasted potatos garnished with a touch of rosemary.This is a family restaurant with family prices and delivers on all cylinders, Quality, Service,Price,and not to be missed amazing Decor. Can't wait to visit again soon,so that we can try some other dishes that we saw being served and enjoyed by other patrons. BTW  Valet was offered and get this Free of charge.", "Date": "2012-09-11", "Author_Location": "Mont-Royal, Canada"}, {"Author": "Liz G.", "ReviewID": "WsO9_F9zAA7YesRcslwE2Q", "Overall": "4.0", "Content": "A chic setting that is vaguely reminiscent of the Greek water landscape (boxes clustered on the hillside). The zucchini chips were lightly battered and warm; my mom's roast chicken was simply but tastefully done; and my individual crock of moussaka was an upscale take on an old comfort favorite.  It was a nice meal in a nice atmosphere, but just seemed a little overpriced (and I'm from NYC, the mecca of overpriced restaurants)!  Also, it was empty enough when we arrived to make the mandatory valet parking a little absurd, though it got busier by the time we left.  All in all, a good experience.", "Date": "2013-04-11", "Author_Location": "Englishtown, NJ"}, {"Author": "Shawn P.", "ReviewID": "i2JKwdntKtWO4qzSxmP-LA", "Overall": "4.0", "Content": "I love this place!  The decor is amazing and the food is even better.  Yes, it's a little pricy for South Florida, but it's nice to have such a great restaurant in Fort Lauderdale.  The only down side to this restaurant is the noise level - simply put, it is way to loud.  There were 6 of us seated at a round table and it was not possible to have a group discussion.", "Date": "2012-10-20", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Terry c.", "ReviewID": "e-siQYJLwtVRjNIPDShBjQ", "Overall": "5.0", "Content": "Food and service was great...ill be coming back...", "Date": "2012-12-03", "Author_Location": "New York, NY"}, {"Author": "mark g.", "ReviewID": "V9IJy2n-nALGi_X1G3i-bg", "Overall": "5.0", "Content": "Extremely fresh seafood and veggies! Had the cuttlefish, octopus, calamari and can't wait to go back to try the rest. I normally steer clear of brussels sprouts, but these had a smokey bacon flavor and sweetness from honey -- delicious. I for one think it's nice to finally see a Greek restaurant that isn't serving typical diner fare. Welcome to the neighborhood!", "Date": "2012-08-22", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Glenn M.", "ReviewID": "NIzMH-EkZzrpHOna0-IQCg", "Overall": "5.0", "Content": "We had a great experience, sat at the bar had the zucchini appetizer and the eggplant dip. Then moved to a table had great fun talking with the couple sitting next to us, we had the swordfish and the lamb chops! Service and food was wonderful, going back soon!", "Date": "2012-09-07", "Author_Location": "Fort Lauderdale, FL"}, {"Author": "Dee M.", "ReviewID": "h4QnB4_vl2rAzzV9Ks0IDg", "Overall": "5.0", "Content": "k--still inordinately pleased with this place. Stopped in yesterday in the pouring rain and had the valet run out with an umbrella even though my hubby was self parking. We then proceeded to eat non-stop..those \"sharing  plates\" will get ya if you just can't stop sharing.  We shared the avgolemono soup which was excellent--not too lemony or eggy which tends to make me queasy. The beet salad was beautiful -with some sort of garlicy mashed potato bottom that was unexpected but added to the flavor profile.Had the grilled octopus again which was perfect--not a chewy piece in the bunch. The shrimp saganaki was also perfect with plump shrimp and wonderful tomato sauce-just the right amount of piquant. And lastly the Baby eggplant stuffed with ground lamb was spiced just right. Needless to say the waiter was impressed or horrified-lol-by all the cleaned plates. The desserts unfortunately were so so -the panna cotta was executed quite well but my husband had some sort of chocolate pudding thing-while tasty-seemed like an afterthought. I am not complaing though-since next time we will just focus on the main dishes. Beautiful location again--will be back soon.", "Date": "2013-07-19", "Author_Location": "Pompano Beach, FL"}, {"Author": "Jessica S.", "ReviewID": "vYJ4ZYzPPF2yPK5DViK4UA", "Overall": "5.0", "Content": "started with the greek salad, large is great for four people. very good. lamb was delicious, spiced perfectly, potatoes, eggplant, and desert all done well. No complaints. Swanky atmosphere. Will def go back.", "Date": "2013-02-17", "Author_Location": "Fort Wayne, IN"}], "RestaurantInfo": {"RestaurantID": "_KM4bBsEuF9ZhNXIFrYJPw", "Name": "Thasos Greek Taverna", "Price": "$$$", "RestaurantURL": "/biz/thasos-greek-taverna-fort-lauderdale", "Longitude": " -80.10134600000000", "Address": "3330 E Oakland Park BlvdFort Lauderdale, FL 33308", "Latitude": " 26.167192", "ImgURL": "//s3-media1.fl.yelpcdn.com/bphoto/yE4kRc8BJ9u1oJ9hPNlHtg/90s.jpg"}}