{"Reviews": [{"Author": "Barclay W.", "ReviewID": "RMcmiyBnbQDhGSTDK45_4A", "Overall": "4.0", "Content": "I came here with some friends for good drinks and good food. On both those fronts we were blown away. Drinks: They have sipping drinks for $5. These are basically big shots that you just slowly drink. What I liked about them was that you could try a variety of drinks essentially without breaking the bank. Food: The food blew me away it was so good. They take traditional bar foods and twist them into crazy new deliciousness. I remember we stayed long enough for the menu to shift (I think from happy hour to non happy hour) and we ordered off both menus. It was delicious each time. We mostly focused on small plates and apps that we could share. I was stuffed by the end. The space was also really interesting and our waitress was very fun, so A+ on that front.I ding them a star though because the live music they had was TERRIBLE. It was guys who thought they could rap (but couldn't) backed up by drum machines and other noise (I say noise because it was not music). It was just loud. While the space is interesting, it doesn't make for good acoustics. We had to shout to each other to be heard. I would definitely try this place again though.61/100", "Date": "2014-07-21", "Author_Location": "Pasadena, CA"}, {"Author": "Teri S.", "ReviewID": "DSb3sf1Rr3fShJzDQZn6Ow", "Overall": "5.0", "Content": "So, haven't been down there in a while and went with a friend to hear some music.  We ordered small plates to share, and were there at a time where our first order was the dinner menu before 10 pm, and our second one was the late night snacks menu.  I've been there late before for music, but have never tried the late night menu and have always wanted to.  Bonus :)Drinks were delightful, as always.  I had the Man With the Forked Beard (Dark and Stormy).  OMG, the food... Broccolini with garlic and parmesan.  Asparagus with chili flakes and marcona almonds.  Mac and cheese with lobster and avocado.  So much deliciousness.  But maybe the best, and the most reasonable, score of the night was the chef's take on fish and chips.  Apparently, it is the \"collar\" of the halibut.  He smoked it with some BBQ seasoning and served it with their fabulous fries and a tomato aioli.  For $6.  SIX DOLLARS.  My friend and I each had a huge piece of smoked fish... I guess I'm not all up on the going rate for fresh halibut these days, but I'm pretty sure that chunk of meat costs more than that!Great service, loved the show, excellent food and drink... continue to love this place! Was told the dessert menu is changing next Friday, so I guess Imma hafta head back down!", "Date": "2014-07-13", "Author_Location": "Inver Grove Heights, MN"}, {"Author": "Kathy S.", "ReviewID": "EE1vlpj5DMuOzC16P4YrAA", "Overall": "4.0", "Content": "I'd heard more than amazing things about Icehouse but never made it over there until last week. SO much regret that I didn't come here earlier!It's been a while since I've eaten somewhere and truly been blown away by the food, but Icehouse didn't disappoint for a second. For last week's happy hour, we got the fries and the most gigantic buffalo wings I've ever seen. Off of the regular menu, we also sampled the Breakfast for Dinner (crispy pork belly and maple are an amazing combination) and the Ploughman's Platter (a wonderful sampler of smoked meats and other nomz). My mouth is watering just thinking about those dishes, and I haven't even tried the rest of the menu yet! Also...the cocktails. Must. try. all of them.Also, the stage/live music was excellent. Luckily, we were by the window and had a little bit of breathing room from the stage, and I loved being able to catch a performance while also catching up with friends. I'll have to check out their schedule and see a show soon. Everyone else's reviews also capture how awesome this former icehouse/warehouse interior and atmosphere are! Pretty sure next time I go back and try the full menu, this review will be updated to five stars.", "Date": "2014-06-12", "Author_Location": "Minneapolis, MN"}, {"Author": "Tam N.", "ReviewID": "9lB27pBljZgv7W-_eL8ktg", "Overall": "2.0", "Content": "Food was really horrible and quote greasy.  We got the $30 entree with all chefs special and the bulgogi and really couldn't even finish half the plate.  Service was slow despite the restaurant not being that busy.  The best part was their salted caramel macaroons.  THose were actually quite good.  So no I would not be returning and thought the food was quite overpriced for quality.", "Date": "2014-06-15", "Author_Location": "Inver Grove Heights, MN"}, {"Author": "Janell H.", "ReviewID": "Xwu_7YeV1XuzvpOXzr95dg", "Overall": "2.0", "Content": "Review Title:  \"What's that dangling from my miniature chicken wing?This place is a freak show! Great ambiance... that's about it. The food was terrible. We ordered the wings and they were oddly tiny, as if they came from mal-nourished chickens. Attached to the wing was a burnt slither of a carrot that did not look edible. The menu was weird. They are trying to hard to reinvent the wheel. First time, last time.", "Date": "2014-03-30", "Author_Location": "Saint Paul, MN"}, {"Author": "Anon X.", "ReviewID": "W6ubEE2O8E2jRiEzhFA8jw", "Overall": "5.0", "Content": "We went out for dinner on a Saturday afternoon.  Our bill was $80 total.  We ordered the Buffalo Wings, Hanger Steak and Short Ribs.  We also had their natural Ginger Ale and Moscato.  The drinks were excellent.  The food was also excellent.  The meat was seasoned and cooked extremely well.  This was coupled with great service.  The restaurant was not overly busy and we only waited about 5 minutes to get our drinks, 10 minutes to get our food order and we were checked in on throughout the night to assure that everything was good by our server.  She also had insight on different menu items.  I would highly recommend this place to friends and family.", "Date": "2014-06-05", "Author_Location": "Minneapolis, MN"}, {"Author": "Anne M.", "ReviewID": "TOYNSR5OPmImVRFoCGR7EA", "Overall": "5.0", "Content": "My new favorite restaurant - had lunch here today and felt completely spoiled. Started with the soup du jour, divine! Then had the small plate Gravlax Plate with pickles, quail eggs, black mustard and to. die. for. salmon. Hats off to Chef Matt Bickford!!", "Date": "2014-06-21", "Author_Location": "Loretto, MN"}, {"Author": "Joy H.", "ReviewID": "y9EO2ttuasgDPj2FMBdlsA", "Overall": "4.0", "Content": "After months of speculating what this place is all about, I finally got to check it out yesterday. I didn't get to see the live music scene, but I'm kinda glad I didn't since the stage seems wayyy too close to some of the tables in my opinion. Perhaps this set up is to accommodate for the deaf people of the world (Hearing aids? No problem. We'll just seat you a few inches away from blowing out your eardrums). Equal opportunity rules. All that aside, this place wowed me with the food department since the crispy pork biscuit I got was mouthwatering. I'd definitely plan a return visit here again sometime to try out their other items. By the way, fellas, the waitresses here are HAWWWTT. Not sure if this should be included in the review, but I just thought I'd let you know.", "Date": "2014-03-16", "Author_Location": "Minneapolis, MN"}, {"Author": "Annie H.", "ReviewID": "wVzo12p8ukuTsbml7JRTNA", "Overall": "4.0", "Content": "Just popped in for drinks and dessert (liquid and solid sugar) after having a cheap meal down the street. The lemon cake was awesome, so soft and airy with the zing of fresh zest. My friend got the choc-bread-pudding. That was phenomenally rich with toasted marshmallow mini-mountains on each soft, warm little brownie, coupled with salty sweet ice cream. Win-win. The waitress was funny, friendly and steered us in the right direction for drinks. I was impressed and I'll be back.", "Date": "2014-06-06", "Author_Location": "Minneapolis, MN"}, {"Author": "Lindsey R.", "ReviewID": "fOs0Itxi24fKqcf19GJNVw", "Overall": "1.0", "Content": "I went here when it first opened and the food was amazing same with the service. It has been over a year so I was very excited to come tonight since I had such a positive experience the last time I was here. Idk where to begin with this review..1. Late night food menu was on the table-I asked to order the duck poutine -she told me the kitchen was close to closing and wasn't sure if they would be willing to make my food for me - sure enough they wouldn't make it 2. Ordered drinks I felt rushed to make a decision - told us she was planning on leaving soon so we needed to pay and from then on if we wanted drinks to order it at the barHer excuse for the kitchen was it was slow and they had already closed down. Every single restaurant I have ever worked at no matter what if the order was given before the kitchen was closed they made it because the kitchen is still technically open. I understand yes it is frustrating but it's not like the tip for accommodating us wouldn't have been worth it. Next to just openlyTell us to pay out when she wouldn't even get us food was extremely rude. She could have told us she was leaving let us know if we wanted more drinks to order through the bar but not make us feel Un welcomed which  is completely how I felt. I am embarrassed that I suggested to go here with my boyfriend because the service was horrible.. Food.. Wasn't able to get it and overall felt like our business meant nothing. Willing to give the place one more shot but needless to say I will never recommend this place to anyone who is looking for a new place to try ever again!", "Date": "2014-02-24", "Author_Location": "Nokomis, Minneapolis, MN"}, {"Author": "Jacob B.", "ReviewID": "MrQBgt2b5IQ2RnSeo4rAYw", "Overall": "4.0", "Content": "Excellent food and great service.  Always told by waiters at restaurants that they have the best burgers...here they really do!  Went for my birthday and the sous chef brought out a custom dessert just for me. Great experience!  Highly recommend for any occasion.", "Date": "2014-05-29", "Author_Location": "Minneapolis, MN"}, {"Author": "Dane R.", "ReviewID": "9CuIe6zNp7YkrhJFRVKuoA", "Overall": "4.0", "Content": "This place can be a pretty great laid back weeknight spot.  It also has a service industry special on Sunday.They have a great beer and cocktail list that rivals neighbor Eat Street Social.  I haven't eaten here but I don't think there would be much of a reason to eat here anyway.  It is more of a cocktail bar and music venue then a food joint. If you catch a show, try to get balcony seating, although service up there isn't always prompt. If you're there and there isn't a show, find a spot on the balcony, its a great place to drink and get some rays. I have seen some pretty sweet shows here and it saves me from trying to catch a lot of my favorite bands downtown.", "Date": "2014-04-08", "Author_Location": "Minneapolis, MN"}, {"Author": "Tom N.", "ReviewID": "9swGLcFVcDIXpa6HCs-Cmg", "Overall": "2.0", "Content": "We have been to Icehouse a couple times. It should be noted that we go here to meet others who have chosen this restaurant, not out of our own choice. I don't see this changing.Icehouse is a fine place to meet up with people but I do not understand the hype. We have done brunch and apps/drinks here and every time we leave underwhelmed.Brunch: I had the Brisket Hash and my wife had the Crispy Pork Biscuit. My food was OK, nothing special but a good breakfast. Her meal was a disappointing take on 'biscuits and gravy.' The pork was more dry than crispy and the dijon mustard used was the overwhelming flavor.Apps/Drinks: The drink selection is good and you can usually find something you like. The apps/small plates are OK but forgettable. Nothing stands out.Extra: Disappointingly, if you are seated in the front region of the establishment and stay too late on nights they have music they will ask you to 1.) pay a cover, 2.) move, or 3.) leave. I find this a little odd, especially due to the fact we were not warned of this before being seated. Also, the servers take orders on phones, which was also not initially explained and our entire table thought our server was texting while on the job.We would not turn down a request to go to Icehouse with friends but we would likely make other recommendations in hopes of not having to go back.", "Date": "2014-01-16", "Author_Location": "Minneapolis, MN"}, {"Author": "Darina H.", "ReviewID": "WyjP-zFEEWwEbjRb5NP2cg", "Overall": "3.0", "Content": "Where do I start? My family made reservations for Icehouse a few weeks back since my husband and I were coming into town from California.  We had a party of 7.  The restaurant is a new and hip venue, a cool hangout for drinks and live music.  We valet parked (yes, parking can be a little tricky downtown) and had no problems being seated.  In fact, we were right near the stage giving us a perfect view of the musicians and the restaurant itself. The food and drink menu was super unique with varying food options (Marrow Bone, Duck, foie gras, love it!) and I was impressed with the uniqueness of the small plates, meals and cool drinks.  My family ordered various drinks from the bar before dinner was even served.For my meal, I decided to get the IceHouse Burger (cooked medium) with salad instead of fries.  The rest of the family ordered various things on the menu including the pickle jar, meatballs, the King Crab Ravoli, Mushroom Pot Pie and Scallops.  The waiter, \"Mat S\" was super nice but there were some bumps along the road:1)  The pinot noir from Oregon (2011) that was ordered did not taste like a pinot.  We addressed this with Mat who took back the pinot and suggested a zin.  The zin was excellent.2) The Icehouse Burger that I ordered came out and they mistakenly brought out a vegetarian burger.  Not what I ordered and we all had to wait while the kitchen fixed the mistake.  While waiting, other people's food got cold.  I remember Mat asking me when he took my order how well I wanted my burger to be cooked, so I didn't quite understand the mix-up. 3) My sister-in-law's scallops had a piece of hair in it (long hair that did not look like her own).  She asked them to take it back and they did so apologetically but not before staring at the plate to find the piece of hair (a little rude...just take it back).  4) Finally, when we got our check at the end of the dinner, they charged me for my Icehouse Burger AND a vegetarian burger (that was never ordered)!  You mess up my order and then charge us twice! Sigh! It was all a little frustrating to say the least. Overall, when the things were addressed and corrected, my meal was delicious.  One of the best burgers I've ever had.  Live music was great and did I mention that their salted macaroons were AMAZING! I will have to give this restaurant 3 stars for some of the problems we encountered.  I would give them a second chance (maybe), but the first impressions always give such a lasting impression.", "Date": "2014-04-29", "Author_Location": "Folsom, CA"}, {"Author": "Lina H.", "ReviewID": "JYkuKrixV9Em2PmK5DWo2Q", "Overall": "3.0", "Content": "I really want to love this place but its tough when the portions are so tiny and the price doesn't seem right for the offer. The duck was NOT good. And I'm a duck lover. Whatever came with it wasn't right. What was the chef thinking!? The Mac and cheese was great except it was the smallest portion I've ever had for $13. The server was not friendly. She was rather... EMO. I need someone high energy. Someone worth tipping. Someone who will come to our table and tend to us. Anyway, if you like your drinks strong, then this is your place. Maybe they decided to be generous with drinks rather than food. Ha ha. When I came it was a Friday night so it was quite busy and we sat in the corner next to the kitchen. We were on the other side of the restaurant so we didn't get very much interaction with the band playing. The stage where the band was playing is very tiny so the person who is singing can pretty much spit on your food if you're eating at atable right in front of them. Would I go here again? Maybe...", "Date": "2014-01-07", "Author_Location": "Eden Prairie, MN"}, {"Author": "Micki C.", "ReviewID": "_aVxIYDZnP27d73igmPOMw", "Overall": "5.0", "Content": "This place doesn't really need another 5 star review, but we have such a wonderful time for my friend's birthday that I thought I'd throw up a short post piling on the praise.  Beautiful interior, nice and warm inside despite the cold weather, excellent service and recommendations from the staff.  All the food was amazing: brussel sprouts, mushroom flat bread (OMG!), lamb chops, ricotta gnocchi, and pork belly (double OMG!!).  They also brought out a cute little birthday Sunday (on the house) with a candle for our group's birthday girl.  This was a perfect place for a special night out.  Other good to know: they do have valet for $6.  I'd never used the company Valet Magic before, but it was pretty sweet.  I could pay online, and then use the little app to have my car ready and warmed up in 5 minutes or brought around to pick me up at the front door.", "Date": "2013-12-12", "Author_Location": "Hopkins, MN"}, {"Author": "Meggan E.", "ReviewID": "LyrwDY-UXpfonEr3uSc-7A", "Overall": "4.0", "Content": "Good cocktails. You will wait for these handcrafted drinks. But it's worth it. I have not eaten here so I cannot attest to the food. The ambiance is cozy dark and mellow. The stage is a nice set up providing a good venue for live music. That said, the layout is tight and makes for moving through the space difficult. Groups over 6 ppl will find it difficult to gather. Save this for a good date, double date or small group night.", "Date": "2014-04-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Edward P.", "ReviewID": "R4ynMJ4hPE_uYVZlRqgCbg", "Overall": "1.0", "Content": "Simply unbelievable. I'm not some self proclaimed food critic, but I know good food, decent foods, and terrible food. This was in every way shape and form closer to the latter. Incredibly bland sauces. A fish dish that consisted mainly of salt, breading, and oil. A macaroni dish that could have been improved upon by subbing in velveeta shells and cheese. All of which was accompanied by an outlandish price tag in comparison to the quality and presentation of the dishes provided. When the issue was tactfully addressed with the G.M. he offered to send us some drinks to which we replied would not be necessary but would be appreciated. Instead they sent us over 2 very poorly done macaroons that were as dry as the Arizona dessert. All together not impressed in the least, poor recovery, arrogant management. 5 customers lost indefinitely.", "Date": "2014-03-08", "Author_Location": "Minneapolis, MN"}, {"Author": "Andi S.", "ReviewID": "vEXbqn7o2BRaUr6rYLujkw", "Overall": "1.0", "Content": "I was there for the first (and now, the last) time earlier this month. I enjoy the live music scene, which Icehouse offers, but the food left much to be desired. My meal, which was supposedly \"the special\" fish, was so salty it seemed as though the cook had gone outside and scraped the salt off the road between snow emergencies and placed it on my plate. The fish itself was breaded, which might have been crunchy at one point, but was drowned in oil beyond repair. The macaroni dish my friend received was the saddest display I had ever seen, with the blandest cheese and likely might have been accompanied by Kraft noodles. Quite honestly, it was baffling as to how limited their \"late night kitchen\" was, in that most dishes were overpriced for miniscule portions, drowned in bland sauce, and overall were barely differing versions of typical bar food. The wait staff takes your order on a smart phone, which is newer to many restaurants, and off-putting to some, as it can appear they are texting and not answering your questions about the menu.The quality of the food had been attempted to be concealed by the live music, which was enjoyable. Note: There was also an entirely pointless entry fee to enjoy the music; pointless due to the fact that it was literally impossible to not hear/see the music unless you were vision and/or hearing impaired. The reasoning behind a secret cover charge, which we did not find out about until arrival, is perhaps an attempt to make up for the lack of tips the serving staff would receive from the mediocre at best \"meals\" offered. The wait staff is also less than willing to be of assistance to customers (noted by deflecting questions to other servers, stating they simply deliver food, or not knowing ingredients in the food - essential to diners with specific dietary needs or restrictions), which was not surprising after the manager reflected this same attitude after he approached my table, seeking our opinion of the food and service. After stating that we were dissatisfied with the price to quality ratio his establishment was providing, he proceeded to send over complimentary desserts; a gesture that would have been better if our main complaint had not been the food. The dessert of choice that evening was macaroons, which were essentially glued to the plate with honey. Why were they glued? After the first bite, it was clear: they were as dry as the Sahara and thus edible glue was entirely necessary to keep the macaroons on the plate.Overall quality music accompanied by sub-par food, unknowledgeable staff, and run by management that does not seem to be as concerned about the dining experience as he might pretend to be during his walkthrough of the restaurant. If you enjoy live music as I do, then I would highly recommend going elsewhere.", "Date": "2014-03-26", "Author_Location": "Minneapolis, MN"}, {"Author": "Alexandra H.", "ReviewID": "Zh5YuBWEp6XTXkIzaEb3fQ", "Overall": "5.0", "Content": "5 stars is love, and boy, do I love Icehouse.The interior screams \"Brooklyn!\" and by that I mean it reminds me of some of my favorite places in Brooklyn, not that it's a haunted house that has mysterious voices screaming at you. It's a loft with large windows, exposed brick and unique woodwork, and almost of all of the dudes that work there rock a beard. There's live music almost every night of the week which is both a blessing and a curse. It's a blessing when you're in the mood for relatively inexpensive entertainment--the stage is central, the sound is great and you can sit for as long as you like--but when you just want to grab a quick drink or a bite to eat and there's a cover, it's not so great. The food is already kind of pricey.Personally, I love going for drinks because I'm a big fan of the creative $5 sipping shot menu. Grampa's Choice with rye and sarsparilla bitters is basically an adult root beer float, and the Playing Makeup, Wearing Guitar (try ordering that without slipping up after a few) with its cherry cola bitters, makes me want to be a woman of the '50s. Keep up the cool, Ichehouse! I like what you're doing.", "Date": "2013-10-08", "Author_Location": "Twin Cities, MN"}, {"Author": "Nicholas G.", "ReviewID": "8GOm1nXa43yOKFcZuWWJMg", "Overall": "5.0", "Content": "Foie Gras DynastyYou might be thinking... What is foie gras and what does it have to do with dynasty? Okay, so maybe some of you actually know what it is and are putting the two of them together and figuring out my cleverness. For those of you who have no idea what I'm talking about, here's a little hint, calm down and instead of holding on to your britches, hold on to your feathers!Are you still confused? Whelp, here it is in plain French. Foie gras is French for \"fatty liver\", the liver of a duck or goose that has deliberately been fattened up to create an amazing delicacy. I'll say it with you, \"ooooooooh, now I get it - Duck Dynasty!\" I suppose you're wondering why I would eat such a thing and what it was on? This time I'll spell it out in plain English for you, Heaven! Where can you find heaven? The Icehouse - Minneapolis and it's in a $22 burger. Yep, a $22 burger!This burger was definitely the most expensive burger I've ever purchased, but after reading the description, it was a must that I try it. Hey, it was my birthday! Here's that description; Icehouse Burger - seared foie gras, truffle demi-glace. That description needed no further information and my mind was made up, I must try! Now, I must say one thing... If you do decide to try this, and you should, remove all condiments from the table, they should not be used. If you do use them, you'll ruin this masterpiece! I mean really... foie gras and truffle demi-glace on a burger..... like I said, heaven!What did your wife get? Ah yes, she did indeed order a meal as well and that too was one of the best meals I've ever had the privilege of trying as well. Her meal was the Poached Alaskan Salmon served with prawn & potato croquette, chablis and chanterelle - AMAZING! Easily the best Alaskan Salmon I've ever had and a must try. Oh, don't be afraid of the tiny little caviar looking things, they're salmon eggs and they're delicious, so try them!Life is good and so is food, stop wasting your time at the chains and actually try some real food, good food and food that is actually worth eating. The Icehouse is more on the expensive side, but well worth the money. So the next time you need a place for your anniversary, birthday or special occasion, make your way to the Icehouse. While you're there, try a Ramos Vaporizer, they're delicious!", "Date": "2013-11-20", "Author_Location": "Twin Cities, MN"}, {"Author": "Sari K.", "ReviewID": "8yR0ONjb-O4GXxZso_43kg", "Overall": "5.0", "Content": "The food and service was absolutely 5 stars. My husband had the foi burger, he could stop telling to his friends how tasty it was. I had the monk fish, it was very tasty. My favorite was the little neck clam, the sauce was amazing.We had a group of 6, and we all LOVE our dish selections.We also all selected the chef tasting menu.We absolutely highly recommend it, & will return to try other dishes.", "Date": "2013-12-29", "Author_Location": "Southwest, Minneapolis, MN"}, {"Author": "Filiberto N.", "ReviewID": "DflAeViCFFQRi3ivXZVzGQ", "Overall": "5.0", "Content": "I f'ing love this place! I live around the corner and probably come here way more often then I should. You can probably find me on the bar chit chatting with my favorite bartender Jess. Everyone here is well informed about the cocktails they serve and the food. My favorite dishes thus far are the monkfish and vege pot pie. Look, lets get real for a second. This place is bougie for sure, its cool though. While the prices may seem like a bit much you get incredible value for the quality of the food. The 5 dollar tasting shots are the best. Acoustically its great and the artists are fairly reverse. My favorite day was when this amazing flamenco musician started owning the stage. Awesome!!", "Date": "2013-12-16", "Author_Location": "Minneapolis, MN"}, {"Author": "Kiki T.", "ReviewID": "lEV0OdteV5HqU4PoboObCw", "Overall": "2.0", "Content": "I came here last weekend for dinner with my family and we were all disappointed with the overall quality of the food. The jazz duo was great and I can see how this would be a great place to grab a drink with friends, but I would never come back for the food.Appetizers:  Golden beets were very good - sweet subtle flavor of beets combined with a cheese souffle was a great combo.  Truffled crepes - I'm not sure what they meant when using the word \"truffled\" as there was not even a hint of truffle in the dish. The crepe itself was hard to distinguish from the filling; it was so soft and mushy, probably from sitting out too long before being served.Entrees: Chestnut gnocchi, monkfish osso buco, short ribs, lamb shank. None of these were stellar nor were they terrible. The one thing they really needed was bread or something to neutralize the taste of the dish. Maybe we would have been able to finish our meals if this had been provided...Desserts: Macaroons - wtf was that? very salty, macaroon itself was hard to bite through, and the icecream was mediocre. Lemon cake - very good light dessert. Orange basil sorbet was INEDIBLE and was sent back to the kitchen. They charged us 1/2 of the dessert since it had been tasted...", "Date": "2014-04-19", "Author_Location": "Cleveland, OH"}, {"Author": "Glen S.", "ReviewID": "rZsPSbe2kUNJ1dzKhtwmag", "Overall": "4.0", "Content": "Went here to see some live music - turns out, their staff is pretty sweet.Great beer/alcohol selection and good/decent venue to see some live music.  I wasn't much into eating at this time - so I'll abstain form reviewing that (even though I hear it's a bit spendy for the area).Would I go back?  yeah, most likely to catch a show.", "Date": "2013-11-19", "Author_Location": "Minneapolis, MN"}, {"Author": "Calvin C.", "ReviewID": "T9P6ADdTDwtT-OawZxUybA", "Overall": "2.0", "Content": "Simply put, one of the most \"hip\" & rugged NYCish place you can find near twin cities, but their food... absolutely disastrous. Quick family outing with my parents, we ordered Au Bon Canard BBQ duck breast, Icehouse Burger, and the Mushroom Pot Pie. Couldn't even chew through the duck breast meat, pot pie was dry and even crunchy inside with no significant flavor, the burger was almost cold in the middle& tasted like rubber. The sides were sub-par as well, fries too salty and overcooked, spinach was not fresh, and the cooked sweet potato was not at all sweet. The only reason why I gave it more than 1 star was because the design&ambience, our waitress was kind enough to take some item off our bill, and the beer menu was local. That's it. Don't expect their overpriced food would have any taste to them or sometimes even edible. This was my third trip here, and yes this was my last visit except maybe for the live music&drinks.", "Date": "2014-04-02", "Author_Location": "San Francisco, CA"}, {"Author": "Jacob E.", "ReviewID": "6DMmid8IyWH2Z8pM3d1PWg", "Overall": "5.0", "Content": "Delicious.  Some of the best food I've had in months. Mushroom pot pie over lentils and arugula. Smoked brussel sprouts with onions. French fries with smoked tomato aioli. Salty caramel macaron. Orgasm in my mouth.", "Date": "2013-10-24", "Author_Location": "San Francisco, CA"}, {"Author": "Jason W.", "ReviewID": "9wpIsXq_Z4wFciCosDMOXw", "Overall": "4.0", "Content": "We showed up on Tuesday 11/19  for the Scott Laurent/Penny Royal Show.   We had bought tickets in advanced and showed up about an hour and a half prior to the show starting.Service was prompt even with a full house.  We were pleasantly surprised.  Our Waiter was patient, courteous and knowledgeable.The food was pretty damn good.We had a few small plates:  Broiled Sirloin Crostini-  omg tasty tasty.  It had an olive tapenade-ish mix.  Lots of meat and almost too much  toppings for the bread.  I would've like to see an extra piece of bread and even out the toppings.   The pork belly waldorf-  my Wife is a sucker for good pork belly and this was no exception.  Fork cutting pork belly, what is better than that?Brussel sprouts-  it was average to be honest.  Good but not omg good.  I need my veggies and these fit the bill.Calamari and pickled Veggies-  To be honest this was my least favorite and I'm a sucker for Calamari.  Came out a bit greasy and the pieces of veg were just too small.Skip this dish.The Venue for music-  the sound was awesome and for the most part we had an unobstructed view from the upstairs(a few times people came up expecting standing room and would get in our way). Overall we had a great time and were happy with our food and service.", "Date": "2013-11-22", "Author_Location": "Minneapolis, MN"}, {"Author": "Wayne S.", "ReviewID": "KK_UGQtgp-EoNmKQcXWv2Q", "Overall": "3.0", "Content": "The food was definitely tasty, but the portions were small and the price tag was high. The cocktails were fancy and potent, but delicious nonetheless. I think it's a great cocktail spot that you wouldn't necessarily need to come hungry.I have also been here for a sold-out show and it wasn't incredibly well managed. They cleared out the tables in the front to make for more standing room, but the building doesn't necessarily lend itself to the volume of the shows it hosts. I can't say anything about the vibe though, because the show was definitely fun and everyone had a blast.", "Date": "2013-08-20", "Author_Location": "Minneapolis, MN"}, {"Author": "Ronnie G.", "ReviewID": "tG_ugzrHZ-eUd83xiDN20Q", "Overall": "5.0", "Content": "Uhm...new favorite restaurant in the twin cities.One star for the sweet digs. A warehouse turned jazz stage/speakeasybar.Two stars for the killer Johnny Michael drink menuThree stars for the food. oh the food. Get the Mac and Cheese.Four stars for having that minnesota humility. Good servers who know their stuff.Five stars for decent parking. yea you might have to park on the street but its free.Gotta try this place minnesota.", "Date": "2013-08-02", "Author_Location": "Minneapolis, MN"}, {"Author": "kyle t.", "ReviewID": "Z4GudGVllPn2XaEhQ_wCqQ", "Overall": "4.0", "Content": "I've walked past here a bunch of times and what better night to stop in than when it's 90 out!Now I have to say, we only came in for some drinks and to enjoy the patio while we mentally preparing  ourselves for some Thai food across the street (review to follow).  That said from the second I walked in here I was very glad we stopped.  The ambiance of this place is fantastic.  They had a little jazz band playing, not to load but added to the feel.  We stuck with the patio which is laid out in a nice little urban setting and is very comfortable and isolated a little bit from the street not to far off.The drink selection was great and I had a fantastic ginger whiskey something or other that I will make sure to search for on my next visit.  It was a nice fresh ginger flavor, good clean whiskey taste and a little fruity but not too much!  The service was great and after glancing at the menu I saw a number of things we will return to sample.Love the room, loved the patio and giddee-up on the cocktails!KT", "Date": "2013-07-08", "Author_Location": "Maple Grove, MN"}, {"Author": "Kimberly C.", "ReviewID": "_CPO2BKuABkl09PIc1Zi2w", "Overall": "3.0", "Content": "With the several reviews about this wings, I figured I had to give them a shot....after all I love buffalo wings,  Well I'm glad I tried them b/c they were good.  However, I had a hard time calling them buffalo wings since they were not sauced.  They were just dusted in a dry spicy rub, which was good.  What I didn't like was that 1) the wings were small malnourished pieces and 2)the blue cheese was aerated, which made it bit watery once the wing was dipped. I guess they were trying to fancy, but I would have preferred the good ol' creamy stuff that coats and sticks the wing. I also got the empanadas which contained beef and potatoes; they were okay. Each (there were 3) came with an accompaniment, one of which was a fried piece of cheese; it was good.  It was a thin white cheese (don't ask me what) with a bit of spices added.Sitting on the patio was overall pretty nice (and a bit breezy as I found once my napkin went flying), but at first it was distracting given all the students from Vertical Endeavors (next door) doing planks in the adjacent courtyard. With that said the distraction wasn't horrible, just more entertaining (after a while).Although, I enjoyed the wings it wasn't enough for me to feel like I need go come back.  The menu options don't appeal to me and seeing that I live to eat....that's no good!", "Date": "2013-05-16", "Author_Location": "Minneapolis, MN"}, {"Author": "Kelly S.", "ReviewID": "BWNX9LtYBkQ50SyJJ7q6-A", "Overall": "5.0", "Content": "WOW! smart witty servers, awesome patio setting & out-of-control-amazing small plates! the drink menu is thoughtful & expertly done & the food options make it really hard to choose. we had a trio of empanadas (awesome), pork belly (awesome), brussel sprouts (pretty good) quail (awesome) & another meat dish that I thought was great, but can't recall what it was exactly. strangely affordable & a fun delicious experience overall - we will be back!!!*sitting on the outdoor patio is the way to go & save room for the sea salt caramel macaroon dessert!", "Date": "2013-08-28", "Author_Location": "Minneapolis, MN"}, {"Author": "Lindsay M.", "ReviewID": "vLPyxhsyaUNDcuxuOGHcUw", "Overall": "5.0", "Content": "SO, so good! I found myself in Minneapolis for a conference recently, and took myself out to the Icehouse my first evening, based entirely on the Yelp reviews (thanks guys!)The place is an old industrial building with high ceilings, exposed I-beams, and a narrow mezzanine along the outer edge of the room. There's a small island of a stage in the middle of the dining room, where a jazz duo made up of stand-up bass and high-hat heavy drums was playing when I walked in.I went ahead and indulged the most enticing items on the menu: an extra dirty vodka martini, accompanied by a small dish of spare olives (perfect!), the \"Icehouse Burger\" a completely ridiculous, completely delicious burger that includes a big slab of foie gras and some kind of amazing au jus, and truffle oil french fries. All completely over-the-top and amazing.I stuck around for an extra hour or two to enjoy the more substantial six piece jazz group that came on around 10:30. All together a great experience.", "Date": "2013-08-11", "Author_Location": "San Francisco, CA"}, {"Author": "Carrie L.", "ReviewID": "yuUUJLu_xYxJ_w5eFZJyXA", "Overall": "5.0", "Content": "My friend and I shared the golden beets topped with a cheese souffle and winter squash. Both amazing. I had the au bon canard bbq duck breast . . . excellent. The drinks are inspired and unique, the likes of which you may see as one or two drinks at so many places, but much more extensive here. Two-piece band playing on the stage. The ambience is stylish yet warm and unintimidating. The service was excellent. The best all-around dining experience I've had in a long time.", "Date": "2014-03-01", "Author_Location": "Eden Prairie, MN"}, {"Author": "Prachee M.", "ReviewID": "0m1gHwCVrumMKQweJ83w7w", "Overall": "5.0", "Content": "Enormously space with tall ceiling and dark colors makes for a very relaxing vibe. Outdoor seating a plus. Fabulous cocktails. Which they change up all the time and I love the ones with bitters in them, Great variety of foods to choose from, from small plates to entrees. One of the best garden salads - the dressing is simple and oh so delicious. The dessert menu - DO NOT forget to save room for this. One of the few restaurants in the Twin Cities with a pastry chef - Diane Yang of La Belle Vie. I'm only willing to have desserts when I am assured it will be something out of the ordinary. The macaroons with home-made salted caramel ice cream? Divine. Except, maybe a little more salt would offset the sweetness of the macaroons. Aerated cheesecake with a blackberry compote - you have to see and taste this to believe it. Imagine a very fluffy cheesecake followed by the intensity of berries and the texture of a pie shell. It is served in a small glass jar and you will have to dig deep to get all three layers in every bite. Service is excellent - and we've had Toby on each visit. I don't know how but he always remembers which cocktail I had on my last visit!", "Date": "2013-08-12", "Author_Location": "Minneapolis, MN"}, {"Author": "Kim P.", "ReviewID": "sp1vgmIuFx3xesa2dGTQew", "Overall": "4.0", "Content": "A really beautiful space with lots of different seating options - patio, indoor and bar if you want to get close to whatever band is playing that night. I ordered their prix fixe option which allows you to get a small plate, an entree and a dessert for $35. Depending on what you order, it can be a solid deal and lets you try a little bit of everything. I got barbecue pork belly for my small plate (smoky, delicious and comes with a miniature twice-baked potato and corn panna cotta), ricotta gnocchi for my entree (pillowy, toasty, very well-balanced flavors) and a chocolate trio with chocolate nib ice cream, chocolate mousse and a chocolate cake/cookie crumble for dessert (super rich and everything you want in a chocolate dessert). Also, I definitely appreciated their drink list. There were lots of cocktails, wine, craft beer and more. I will definitely be back!", "Date": "2013-08-30", "Author_Location": "Minneapolis, MN"}, {"Author": "Hannah T.", "ReviewID": "JrKRXBId86U-JwK9-qBa-Q", "Overall": "5.0", "Content": "Always wanted to visit here and finally had the chance! However this review is strictly late night and only based on a few drinks and mostly atmosphere. Absolutely loved this place! Seriously, it was classy, upbeat, and cool. A great place to have a ladies night! My friends and I went to watch a friend preform on a Saturday night, we showed up at 11 pm and it was packed (but not to the point of not having space)! A great sign for a venue! We got some drinks at the bar and within a few minutes a table opened up and we were sipping, talking, and listening in a very pleasant space. There was a lot of talking that distracted from the performance, but the stage is great. The sound system for a small stage/space is excellent, very clear, crisp and basstastic. The space itself is just warm and classic. Friends, first dates, and romantic dinners would all work here. On to the drinks! I got the Quebecois, which is one of their $5 sipping shots made up of bourbon, maple syrup, and bitters. PLEASE if you LOVE bourbon GET THIS!! It was so good and totally worth the money. Though it is a shot, it is a pretty large pour that took me a while to get through. The flavor is sweet, but not too much, it starts bourbon-y and ends maple syrup-y, so good. Just thinking about it makes me happy! OH and the ice! I believe they cut their own ice, and this might be weird, but it was the prettiest and nicest ice I'd ever seen. 2 cubes filled the cup and melting slowly and perfectly. I tried another super weird sipping shot, the Rizzo, which had rye, cynar, fernet-branca, and lemon. I know right, what is that stuff?? All I can remember is the server told me the fernet-branca was some Argentinian liqueur with 15 different herbs infused into it, and that it was almost medicinal. So I had to get it out of pure curiosity. She was right on the medicinal to the point it almost tasted like cough medicine. Not my favorite, but not intolerable. Once the ice melted about half way it was much better. I'm not saying don't try it, just be prepared for the interesting. It's just not my style. The only thing wrong (and obviously didn't take off a star for this) is that when there is a really rockin' band (Such as BeatBox (Whom I saw)) and you want to start grooving, there isn't really a dance area. I get that this is a sit down venue with more chill beats ringing, but sometimes I just gotta dance! Luckily some people in the corner left enabling my girls and I to shake what our mama's gave us without obscuring the view from other patrons. The sound is not so great here because it is pointing out to the center, but still fun! I am so excited to go back here and try more of these crazy drinks they have AND possibly get to the food too. Late night is so great though, if for the cheap cover ( I think the highest I've seen is like $8), the amazing drinks, or that ice cream that I saw some people licking up. YUM", "Date": "2013-04-17", "Author_Location": "Minneapolis, MN"}, {"Author": "Beth J.", "ReviewID": "HHQ_PQqIu5aHa6Sc0LS8WQ", "Overall": "3.0", "Content": "Walking in, I was immediately charmed by the rustic exposed wood walls, live music, and the innovative list of food and cocktails; unfortunately, the high expectations I set for my meal were missed on many points. My guy and I stopped in on a moderately busy Friday night, and we were immediately seated in the second floor lounge area where we had great views of the entire first floor including the stage. On the stage, there was a mellow jazz band playing great background music. Our server brought us drink menus, which was an extensive list of unique offerings. Feeling overwhelmed by all the choices, I asked the server for his recommendations that seemed to completely miss the mark on my preferences. So on a whim, I opted for the small, very seasonably priced salted caramel vodka sipping shot; the well-executed drink tasted like a dirty martini with a hint of sweetness.Next, we ordered some snacks to go with our drinks. First, the duck consommé featured perfectly crisp foie dumplings, that were strangling similar to the generic pork dumplings found in any Asian grocery stores, and the tepid consommé tasted like it was crafted using an inadequate amount of bouillon. Next, my favorite dish of the night were the crunchy cornmeal fried oysters were complemented with smokey, peppery gumbo seasoned greens and creamy grits. Finally, the hand cut fries were seasoned well and complemented with unctuous duck gravy, but lukewarm temperature and corresponding soggy texture completely ruined the dish.  I understand on busy nights mistakes in the kitchen and expediting food are bound to happen, but my biggest disappointment was the server never came to back, except to ask if we wanted the check. Would I go bakc to Icehouse again for the live music and interesting cocktails? Yes. Would I go back to Icehouse for the food or service? Probably not.", "Date": "2013-04-07", "Author_Location": "St Paul, MN"}, {"Author": "Tasha C.", "ReviewID": "3hqNi33fxWeigXyrCgokYg", "Overall": "4.0", "Content": "Solid as a rock. The hubs and I have checked this place out a couple times already and have had a great experience both times.  This review is specific to our experience on Valentine's Day last week. Hot DAMN is all I can say!  We showed up right on time for our reservation and were seated right next to the stage.  The band (of which we had no prior knowledge) was to start in 15 minutes and we had no interest in being that close to a string quartet during our romantic evening.  We requested to be re-seated and the waitress not only did so with a smile on her face, but asked us where we woud prefer to sit.  So far, so good!The restaurant had a prix fixe menu for the evening, which usually concerns me considering I'm a pescatarian and the hubs is allergic to shellfish.  Not only was this not an issue, but information about our dietary restrictions was requested, addressed and satisfaction guaranteed.  The selections were served on separate plates to address his allergy and options were tweaked to ensure that there were adequate vegetarian options to fill my tummy.  I would get into the specifics of what we ate, but 1) I don't remember what we ate and 2) it doesn't even matter because every single offering was so exceptionally prepared that I'll order ANYTHING off of the menu at my next visit.  This visit (and this review) was/is all about the SERVICE!Our server, Deandra, was exceptional.  She made dietary adjustments, described the menu delectably, visited us at appropriate intervals (which is even more exceptional considering we sat upstairs) and did not rush us through the courses.  A solid experience that will definitely keep me coming back.", "Date": "2013-02-20", "Author_Location": "Minneapolis, MN"}, {"Author": "Casey R.", "ReviewID": "UiU8C2haG7U1FVaPyr3BkQ", "Overall": "5.0", "Content": "I spent a lovely Sunday afternoon here trying local beers recommended by the bartender and others at the bar and enjoying some music. The conversation was great and informative about the area and it was neat to learn more about the Minnesota craft beer scene. I would definitely come back if I am ever in the area again. They had a fun looking cocktail list and all the brunch food looked delicious although I had already eaten.", "Date": "2013-12-10", "Author_Location": "Philadelphia, PA"}, {"Author": "Jay E.", "ReviewID": "ad3YBgZXmcZGo6YR8KcX4Q", "Overall": "4.0", "Content": "My return trips have yielded excellent $5 Happy Hour cocktails and pretty good food. I'm all for redemption, so I'm updating this review. I doubt I'll do lunch here again, but I suggest checking out Happy Hour and dinner with no hesitation.", "Date": "2013-12-06", "Author_Location": "Minneapolis, MN"}, {"Author": "Jeannie R.", "ReviewID": "7JwY54oUXhD09k-Lf6duwA", "Overall": "5.0", "Content": "Oh-My-Gosh, this place is incredibly food-tastic!! Definitely not your standard see-and-be-seen, overrated trendy 'hot spot', it is unpretentious, inventive and original. They are doing all the right things in all the right ways here, we have been 3 times now and the chef here does not disappoint. The Sweetbread and Escargot Brochette - oh-so-amazing, The Sea Scallops and Foie Gras w/rhubarb, vanilla, rosti potato, creme fraiche - absolutely on the money, and the home made bacon ice cream were the stuff to come running back for. And live music in house following a stellar meal without having to run around the city and finding a parking spot at the next venue ... who can ask for a better night out. This place is perfect for date night, friends night, or pretty much every night - love it!!!!", "Date": "2013-06-10", "Author_Location": "Minneapolis, MN"}, {"Author": "Heather S.", "ReviewID": "WWyqDE4vxNPzrkQHOuCRBA", "Overall": "4.0", "Content": "We've wanted to try Icehouse for sometime and certainly were not disappointed, save for one dish.  The drinks are inventive and tasty; I would recommend the sipping shots - you get all the flavor at a much more palatable price.  They have a great bourbon selection, so for those that are into bourbon, or want to introduce themselves, it's a great place to go.As for the noise level, we chose to be in the side dining room because we were afraid the live music would be too loud for our conversation.  However, we found that the live music was much more subdued compared to the cacophony coming from the large table next to us.  We hoped that once the live music started, it would drown out some of the shrill sounds, but to no avail!  Next time, we will opt for the main dining room with the live music.  It could be that the acoustics in the separate dining room don't lend well to quelling noises.  As for the food - the forest mushroom flatbread with poached egg is a must as well as the beet salad.  We were disappointed with the foie gras dumplings in duck consommé; unfortunately, the star anise overpowered the dish and I was immediately taken back to some bad Chinese dishes I've had on numerous occasions during my frequent travels in China.  This definitely could be a taste thing.  I find that star anise is like cilantro, you either hate it or you love it.  The short ribs were wonderful and well balanced with the other items on the dish.  The scallops were cooked perfectly, but I had hoped that the \"Bacon Candy\" would have been a little bit more \"crisp\" and candy brittle-like.  All in all, we will definitely go back, but next time will be for brunch!", "Date": "2013-03-24", "Author_Location": "Rockford, MN"}, {"Author": "Patricia G.", "ReviewID": "k69XMsMsBRYtVbMjfRADaA", "Overall": "4.0", "Content": "My boyfriend and I have wanted to try icehouse for awhile and finally went in on a Saturday night, without a reservation. The host told us the wait would be 45 minutes and didn't really seem all that competent. We said no problem, we would wait. Before we even got drinks from the bar he told us he had a table for us. I'm not a big fan of staff that doesn't understand the flow of their own restaurant; you lose business that way and its counterproductive. It was a weird start to an otherwise pretty good dinner. We started out with drinks. I had a half portion of wine (Zinfandel; better deal than paying by the glass if you plan to have more than one) and my boyfriend had a bourbon that the waitress recommended. We both really enjoyed our drinks. After that we decided to share two small plates. My favorite was the Beet Salad, with honey comb, burrata, charred endive, and honey wine vinegar. These were probably the best beats I've ever had; the dish was super flavorful and perfectly sweet. Pretty small portion, but a nice start. We also shared the Barbecued Octopus with braised beef tongue en mole, pickled tomatillo and crema. This was tasty, primarily because of the sauce and sour cream that accompanied it. Both the beef tongue and octopus were cooked nicely, and it was one of the more substantial small plates available. For the main course I had the Short rib Stroganoff. The short ribs were, again, perfectly prepared, and the sauce was pretty tasty. I wasn't blown away, but overall it was a solid dish. My boyfriend's entree beat mine for best bite though, however his was more inconsistent. He had the Icehouse Burger (Hamburger with Foie Gras). I had some issues with his burger: primarily, the hamburger portion was just really mediocre and it was missing something. When you got a bite that had the foie gras on it, it was super yummy, (duh!) but this was only about half the time, and the hamburger itself just wasn't good enough to stand on its own. It could have used some crunch and textural contrast (lettuce, roasted peppers, onions...something!) and a better meet/fat content.To end the evening, we tried two scoops of ice cream. He had the tobacco ice cream and it literally tasted like smoking a cigar (mouth tingle etc). It was kinda good in a weird way though, especially with the bourbon whipped cream. I had the orange flower ice cream, which was nice and light and refreshing.  The service was great; our server was personable, attentive, and lovely. It did take a while however, for her to take our drink and food orders, but they were busy and that was okay. A nice bonus was some impromptu music during dinner (we were there between the two shows but they still had some live background music). I was pleasantly surprised that we were as full as we were at the end, though I think this was mostly due to our choosing the richest dishes. The ambiance was great and I would definitely be back. It gets marked down though because the $75 we spent in food was really $15 too much for what we got and the food itself was lackluster at times.", "Date": "2013-04-25", "Author_Location": "Minneapolis, MN"}, {"Author": "Keshar N.", "ReviewID": "UrKefVV_9sxkpTak69M3OA", "Overall": "3.0", "Content": "I am one lucky girl. Not only do have a virtual bevvy of beautiful and successful friends but they are so talented that we are often celebrating various successes with (what else) going out for food! My good friend Sarah just landed a sweet new gig, and decided that going out for a fabulous brunch was just the ticket! There were about 16 of us going to Icehouse and THANK GOD they took reservations for brunch. We arrived at around 11:30am and were happily surprised to see a live band getting ready to play. We were also a little concerned at the proximity of our table TO the live band - but we are loud, we can yell if we need to. I ordered a Bloody Homer (I mean anything that has a mini donut accompaniment is going into my stomach) to start. The Bloody was REALLY good, spicy and not super tomato-y. I do not like feeling like I am drinking tomato sauce, so that was good. Bob and I shared the brisket hash and the brioche french toast. And now this is where things went a tiny bit downhill... the hash was ok. It did not really taste like anything and did not have hardly any brisket in there! The few pieces were so prized that Bob and I ended up fighting over them. I found it to be a little bland and a little soggy? The brioche french toast was good but nothing extraordinary. The apple compote was really good, but there was really none of that on there either. In order to drown my disappointment in my meal I ordered another drink, the Tiki God's Fury. It was AMAZING! I am always a bit leery to order a \"fruity\" drink because it usually feels like I am drinking Hawaiian Punch and then my stomach feels as though it's going to rebel against me. But this was wonderful. The right balance of sweet and bitter. Yum! Now, all of that being said - the ambiance was stunning, the service spectacular and the band... quirky. Would I go back - yes. Did this live up to my expectations, not really. But! I would absolutely give it a go for dinner, since I feel like that is what they are known for. That being said, if dinner is a disappointment you can always drown yourself in drinks to ease the pain.", "Date": "2014-04-15", "Author_Location": "St Paul, MN"}, {"Author": "Zac S.", "ReviewID": "Tn6c_ZR_LujsDu1tsieOwA", "Overall": "5.0", "Content": "always awesome, although the apple pie was a total meh. I remember fondly sitting on the patio on a steamy hot day and having some kind of berry pie with corn icecream on top during the summer. So good.I haven't ventured out of the $5 sipping shots yet - just too good of an offer to pass up!I wish they still had the lesser burger on the menu, but instead it's a $22 whopper with foie gras and all kinds of tricks, but the menu changes frequently so keep checking.Sunday brunch bloody homer - bacon and a mini donut on top of a bloody  mary infused with bacon. It's rich and creamy and a meal all on it's own.", "Date": "2013-01-21", "Author_Location": "Minneapolis, MN"}, {"Author": "Katy F.", "ReviewID": "4iqkOrg8cbctlfV_oenwRQ", "Overall": "5.0", "Content": "Went there for the first time for valentines day this year. It was fantastic. We had a reservation and they were going to seat us in a booth in the room that didn't have a view of the stage. Being that we were planning on staying a while we wanted to be able to see the live music and they switched us around without a hitch. We sat up on the balcony along the railing. It was fantastic.Atomsphere: Incredible. Music was a little on the loud side but we could still hold a conversation. Definitely not super intimate soft music but it was really entertaining and out of the box. We sat at a small cocktail table. It was cute but the stools were low and didn't have backs on them. Three hours later and our mid-twenty bodies were hurting a bit. Possibly the only thing I would have changed. LIVE MUSIC WAS FANTASTIC.Service: Fantastic. We had lots of questions and asked for lots of recommendations. All of the answers and suggestions were spot on. We even asked for an after dinner drinks spot and again our server knocked it out of the park. We were there for over 3 hours and never felt rushed once. Always nice when it's a busy Valentine's Day.Food: I consider myself a quasi-foodie. I love food. I love great food even more. I wouldn't trade my dogs for food, but I love it enough to pause if someone asked me. This place would have brought me to my knees if I hadn't been sitting. Holy crap on a cracker it might have been the best meal I ever had. And as much as I could have eaten my whole body weight of the foods I got, I appreciated the smaller portions. I left still feeling good in my dress and not like someone had to haul me in a wheel barrel to our car. King Crab Ravioli was freakin' fantastic. Loved it. Not skimpy on the crab at all (and the price showed it but that's next). My boyfriend had the Beef Empanada. Also amazing. I liked mine better and he liked his better. He had the Buttermilk Fried Chicken. Holy crap is that stuff good. It came with a maple syrup whip and bacon cornbread. The fried chicken could not have been made better. Beware though, it was a pretty big meal. I had the duck. Fantastic!!! Came with couscous and some other delicious stuff I had no idea what it was. Would recommend all those things!!Pricing: This place will clean out your wallet for sure. Is it worth it? That's probably up to you to decide. I thought there was nothing special about their drinks or wine to warrant $10 a pop, but you know what? Sometimes a little bubbly is necessary. Entrees ranged from around $15-$25 and starters averaged around $10. Keep in mind you really don't get so much food for that but damn it is it good food. In my \"professional\" opinion I say it's worth it!!Overall: I gave it 5 stars for a reason. Dynamite place and we can't wait to go back.", "Date": "2014-02-17", "Author_Location": "Minnetonka, MN"}, {"Author": "Hazel S.", "ReviewID": "WMIt06_MDBYxxJxxTFJfqg", "Overall": "2.0", "Content": "This place has a lovely patio area and the drinks are very nicely prepared. Sadly, I thought the food was needlessly pretentious and the quality didn't match the price. I had a variety of the small plates -- macaroni and cheese, which came with a huge glob of half melted gorgonzola and bleu cheese on top. The french fries were overcooked and tasted bitter. The worst was the brussels sprouts, which were smothered in onions and a thin salty broth. It takes a lot to make me regret ordering sprouts, one of my favorite foods, but they did it. Finally, we ordered apple pie a la mode, which like all of their desserts comes in a mason jar (why?) and was deconstructed (also why?). That meant that the \"pie\" was cooked apple cubes tossed with little pebbly crust nodules. Everyone at the table was just kind of bummed out. BY DESSERT. All of this would be only mildly disappointing if the prices were not so high. But the five bites of boring mac and cheese I had cost $8. And I saw a lot of half full plates getting bused off the patio.Go for the drinks and the entertainment, but eat at home first.", "Date": "2013-08-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Jon C.", "ReviewID": "1ub2FKZeXfldBhoaoevrog", "Overall": "3.0", "Content": "I've enjoyed Icehouse multiple times over the past year for drinks and live music.  For that purpose, I believe it is  wonderful choice.  Their unique drinks that range from their \"Little Richard\" to their \"mustard whiskey shot\" make it a competitive option for those that commonly enjoy the unique drinks of Eat Street Social.  However, like Eat Street Social, these drinks are pricey.For brunch, Icehouse doesn't disappoint.  I am a huge fan of their Bloody Homer and commonly enjoy it with their Brisket Hash... (This pairing was a common staple for me throughout the fall).With that said, I recently went to dinner with some friends and left largely disappointed.  As predicted, our drinks were wonderful but pricey.  No complaints.However, our meal was another story.  Typically, when a restaurant lists New York Strip as an option, I get delightfully curious and order it up right away.  Unfortunately, this curiosity failed me at Icehouse.  When my \"supper\" was delivered, I was slightly confused.  Normally, New York Strip implies a solid 9-16 oz of actual meat, cooked to perfection.  In this case, I was served perhaps 4-5 oz of \"New York Slices\" topped on top of some sort of vegetable/potato.  (I forget what it was exactly because I was so distracted by their miniature version of the \"steak\").  The 6 bites of steak were tasty but far from what I was expecting.  My colleagues were equally disappointed with their meals.  There was a universal consensus that the food was a \"6.5\" on a 1-10 scale.Now don't get me wrong, I am not some glutenous slob that enjoys the \"Golden Corral\" on a nightly basis.  I've dined in great restaurants all over the USA, Europe, Central America, and the Middle East.  I appreciate places that offer small plates and main courses.  However, one should be able to distinguish the difference between the two!  My \"beef\" with Icehouse is based solely on the cost and portion size of their main entrees.Perhaps, I am just \"too middle class\" to be upset about dropping over $200 on a meal and having my guests and I leave wondering why we were still so hungry?", "Date": "2013-02-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Kel K.", "ReviewID": "MH9TRgCDbnp2h7kuE-3O0w", "Overall": "3.0", "Content": "Should be noted that my Icehouse visit was a completely random 2pm Wednesday shot. The Full.Grown.Man drink fully put hair on my chest--STIFF. Sweet, adorable ice cream sandwiches are not to be missed. Patio was delightful as we no doubt deserve some sun & cocktails as the city FINALLY shed it's Winter and extended Winter layers!Next time:  A peak hour visit for a cocktail and tunes.", "Date": "2013-06-28", "Author_Location": "Tucson, AZ"}, {"Author": "Lauren J.", "ReviewID": "txZfXzmhnUHGbDd2F4Qk9g", "Overall": "5.0", "Content": "Thank you. Thank you Icehouse.Thank you for reminding me that Minneapolis has great restaurants after an incredibly lame trip to Union. I think Annie D and Amanda W sum up this place well and really capture what makes this place so. dang. cool.Also, thank you for being another place that doesn't start packing up and pressuring you out around 10pm. This place is just getting started then.The best things I had:-Scallops-Foie gras burger (duh)-French fries. But mostly the duck gravy dipping sauce-Butterfly kiss (cocktail)-Satan laughs & spreads his wings (sipping shot)The \"free jazz\" group was awesome too. If you're going not going for the food, go for the service, or drinks, or live music, or decór....You get it...Just go.", "Date": "2012-12-04", "Author_Location": "Minneapolis, MN"}, {"Author": "Molly T.", "ReviewID": "cbNEdhglv6RUHEcW8HKtsQ", "Overall": "5.0", "Content": "I was scared--my friend said that he had walked out twice so furious with the service prior to our visit. He's obviously not a Yelper--I know people who refuse to go back to a place once because of horrible service, let alone twice, and then to give it a third try! But we were all floored by how awesome brunch was last week. I had the mushroom-truffle crepe and a latte, and my friends a brisket hash and the special, which I think was a chilaquiles, but I don't think they called it that. My crepe was divine. Anything truffle is divine, let's be real, but this was really spectacular. Both my friends' meals were great. The service was actually quite good, smiley, apologetic when something went wrong, and just generally friendly. The bluegrass band, though, was the best part of the brunch. How COOL to have this folksy band playing while you are eating folksy food in a folksy place? I love you, Minnesota. This is something that can only work here, and it works well. I wish them the best!", "Date": "2012-11-06", "Author_Location": "Los Angeles, CA"}, {"Author": "Aaron M.", "ReviewID": "ueO81HDxtQvJHW069uUkbQ", "Overall": "2.0", "Content": "My first experience at Icehouse -- for a work dinner with a large group -- was great. The restaurant is well designed, the food was delicious and interesting, and the cocktails were creative.That dinner made me willing to reserve a table for two on New Years Eve. Unfortunately, that experience made me realize that the above excellent qualities aren't the only ones that make a great restaurant. Here are a few suggestions to improve Icehouse from a two-star review to something higher up on the scale:If you're going to ONLY offer an $85 per person tasting menu on NYE, you should put this on your website, Open Table and other communication channels so that people who are doing research on where to spend their evening are aware and don't show up to an expensive surprise. Also, when your people call to confirm reservations, they should reinforce this detail. The table next to us got up and left when they were handed their tasting menu and told it was $85. If it weren't 8:00 on New Years Eve with limited chance of getting in elsewhere, I likely would have done the same.Don't expect that people will show up for dinner at 8 and want to stay through midnight.Get your kitchen in order and work out those \"bottlenecks\" our server kept complaining about. And on that note, it's appropriate for servers to apologize for slow service, but you probably shouldn't say, \"Sorry this has turned out to be an utter disaster.\" Put on a smile, support your people, and make up for it however you can.Another note for servers: Stop texting, put away your cellphones, and pour wine in my glass that's been empty for 10 minutes. Manager: You're cute. But stop talking with your friends in the corner, realize that your restaurant is struggling to get food on your customers' plates, and help fix it. After all, the main challenges of the night felt like they belong in your court to fix.", "Date": "2013-01-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Brian B.", "ReviewID": "pvtGxWl_hu8YqyYm_egK1A", "Overall": "5.0", "Content": "Sous vide short rib \"Pastrami\"Carbonated bourbon Manhattan with cherry cola bittersYes.", "Date": "2013-07-28", "Author_Location": "Shakopee, MN"}, {"Author": "Randall N.", "ReviewID": "IUY31aUcrscaEih_Q3n5ig", "Overall": "4.0", "Content": "Walk in for drinks...get a flamenco performance. The Icehouse gave me one of those rare moments in a Minneapolis fall where I forget winter is coming and that I want to not live here because of it. I've heard about the Icehouse for ages. I was prepared to be highly disappointed....happily I was not. The cocktails list includes a bit of everything (though gin makes more appearances than probably necessary) they offer small and large plates for food and have a stage for music and performances. What's not to love? The interior even made me really happy cause it reminded me of one of my favorite bars in New Orleans. I had the chicken and waffles which was pretty damn good. The waffle was light and airy yet still really filling. The mushroom onion compote and soft boiled egg was a perfect \"sauce\" especially since they don't give you syrup (I'm totally cool with that since maple makes me gag). I could have just the waffle with the compote and be totally happy. The chicken had a really great, crunchy, thick batter and tasted really good. The execution of the chicken had an issue though. My complaint (and one of two reasons they get 4 stars instead of 5) is that they did not remove the chicken skin before frying it. Either other places always do this or they don't and cook it better because the skin left a really gross texture (that you'd rather I not get into) on chicken. It separated from the meat really easily and I could avoid it but then the breading was separated from the meat. Fix this and you have a signature dish to bank on. The other complaint is that we got there at like 8. The Tom Petty cover band started at 11. After spending nearly $50, to stay in the main room where the music was they wanted to charge us a cover. That bothers me. If I clearly came here just for the band I could see that but a. this was a cover band and b. we had already been there for several hours eating and drinking. That rubbed me the wrong way and I really did not like that. HIPSTER CENTRAL BTW. If I had a nickel for every ironic mustache I saw I could easily have bought myself another beer.", "Date": "2013-10-22", "Author_Location": "Minneapolis, MN"}, {"Author": "S W.", "ReviewID": "RDZjwL-wOM_tWx3xw6HSzQ", "Overall": "5.0", "Content": "Hot damn, I love this place. Is there a problem that cannot be solved by Icehouse?I want to have the best friggin happy hour steal in the metro: Icehouse.I want to meet my nooner tryst: IcehouseI want to have snacks and pull out my laptop and finish work: IcehouseI want to be alone in a dark bar and elegantly destroy myself at 1 pm: IcehouseI want live tunes and a good place to bring a date I want to impress: IcehouseI don't want to eat too much, but I want every bite to be AWESOME: IcehouseI want a cute patio: IcehouseI want cocktails that aren't stupid: IcehouseI want small plates that I'd drive across town for even if I moved in above the Sample Room: Icehouse.I want to take my not completely uptight mother to brunch: IcehouseYou get the picture.  I'm sure there are some mis-steps on the menu at this point, but dunno what they are, haven't met them yet.The only people who should avoid icehouse are people who want to be pointlessly stuffed with subpar food rather than appropriately fed with awesome. And people with screaming children. Although it's so cavernous that off hours it's possible no one will hear them.This is the place that the others try to be. Sorry Maude, sorry Loring Pasta Bar. Don't hesitate, don't pass it up. It's the dining panacea.", "Date": "2012-10-01", "Author_Location": "Minneapolis, MN"}, {"Author": "Wen T.", "ReviewID": "IW_Zpsx6oJ4ZLYOVx5whdw", "Overall": "3.0", "Content": "Solid place on Eat Street. Food:Beef empanadas: 4/5Pulled short ribs inside a fried shell. Three to an order. Each one had its own sauce.Fried oysters: 5/5Cornmeal dusted and fried to yummy perfection. Not sure what it was served on but it was good.Salted cod: 3/5Super salty. I know the description says it's salted but it was so salty we didn't really enjoy it. Lobster and pork belly: 3/5The lobster was slightly overcooked and the pork belly was over-fried and was hard, rather than crispy. Has the potential to be much better.Buffalo wings: 4/5These were surprisingly good, considering I don't like buffalo wings.We came with a party of six and we ordered a combination of appetizers, small plates and entrees. We got our appetizers relatively quickly. But then we had to wait a really long time for our second course. It was a little weird.  Another weird thing is that the two couples with us each ordered french fries. One couple got their french fries with the first round of food (and they weren't hot). The second couple got their french fries with the second round of food (and they were hot). French fries should always be hot and crispy at a sit-down restaurant -- this isn't McDonald's where it's okay to let them sit under a heat lamp for 15 minutes before serving them.If you go on a Friday or Saturday, there's live music so if you want to be able to hear your dining companions, ask for a table in the back room.I like the fact that it has an open kitchen. And I love the fact that it's really clean. You can see the stainless steel gleaming which is always a good sign.", "Date": "2013-05-11", "Author_Location": "Minneapolis, MN"}, {"Author": "William C.", "ReviewID": "otlZxXXoe1dortX1saobuw", "Overall": "5.0", "Content": "Adding a star, I had such a great time here last night listening to Sonny Knight and the Lakers. The live music makes this place a special gem in the neighborhood.I also enjoyed a Thee Sir Brett whiskey sipping shot (sweet and gingery) and some local brews. Try to make a reservation so you can avoid seat searching or standing.", "Date": "2013-04-04", "Author_Location": "Portland, OR"}, {"Author": "Emily G.", "ReviewID": "NUJVRSmlSPjV6taPkm9sbQ", "Overall": "4.0", "Content": "Granted I have only been here once and only had a snack as it was a late show, but the food was ok, me and my boyfriend had the wings. However, this is a fantastic place to catch live music and have a few drinks. And the staff was very friendly. It probably won't be high on my list for dining out but I will definitely see a show there again.", "Date": "2014-04-29", "Author_Location": "Saint Paul, MN"}, {"Author": "Terry S.", "ReviewID": "E82nKrxBVX6t9sNvPu3Vyw", "Overall": "1.0", "Content": "Pretentioushouse.  ***Caveat:  In all honesty I wanted to do a one word review of Icehouse, but I felt it fair I explain myself.  I went to Icehouse on a Monday night with a few friends.  We were exhausted from making our way through the snow all day and decided to get a few drinks and take it in.  Initially we were headed downtown, but I mentioned a closer place, Icehouse, a new bar/music venue, and said I knew someone who said it was a pretty cool spot, and we should go.  I was surprisingly wrong.  I don't know if it's just because of how new the place is, or just because of the atmosphere, or the service, but our experience was not great:  The doorman must have been high, he I.D.ed my friend 3 times, once for every time he stepped out for a cig.  The service was slow, we waited long enough after we ordered for my friend to start complaining (which was about 20 minutes), and we had only ordered 3 drinks.  The place wasn't even close to capacity and it was running in slow motion, it was monday, right? It wasn't so bad that the drinks came late, but that the drinks were upwards of $10 a pop.  I felt like I would have had a better time watching shit telly, drinking a sixer of PBR, and complaining to my Bro-mates about the Vikings,  for half the cost.  We just wanted to wet our whistles and relax.  This was not going to happen.    Then the music started up, some sort of Jazz.  It was all right, except I have an issue with laughing at people who play the upright bass.  The motions are hilarious.  The whole time the music is playing I am thinking:  Is he making love to it, is he massaging it, what is he doing, how does the instrument feel???I tried to focus and not laugh, but our drinks weren't coming.  We kept looking around for what was to transpire and couldn't seem to locate it.  When our server wasn't making us wait she was asking us questions, well actually yelling at us over the music, telling us about the band, about how excited we should be, and inquiring as to why we were leaving so soon.Honey, we can't wait that long, time is precious.  My friend kept shaking his head, he literally wanted to just get drinks and not be bombarded with chit chat.  Finally, the drinks came.  We gulped them down and bounced on to greener pastures.The drinks were all right, were they worth ten bucks?  No, but they were all right...All I could think about when I left was how my friend got trapped in the drapes hanging over the entry way door as we entered.  There were drapes hanging from everywhere.  These big maroon bastards; it was like a waterfall of burgundy fabric all over the place.  I imagine these are fire hazards. Icehouse was a mix between a cabin, The Dakota (No offense to The Dakota), and a drape store, with the service speed of an airport terminal.  I felt the place was over dressed and had a nose-up appeal.  Yeah, if I wanted to be cool I would say it was an awesome venue as most have, but in reality this bar is a shot in the dark (and I am not being paid for this review by the venue).  It aims at the trendy and hip, but it forgets the rest, and doesn't even hit its mark. Definitely not a relaxing environment for those interested in knocking a few cold ones back and having a conversation.  (If you do go, just dress like you are in Uptown and act like you are cool as fuck.)All in all, I feel a bit put on by the hype.   We did not have food, we hardly had a drink, we left post haste, I did not feel the draw.  I was excited at the chance to go, and I was kind of let down with an anti-climactic lull.  Hopefully they can work out the service issues and bring down the hipster levels.  I live close and I can say I will probably avoid Icehouse in the future, and that is my opinion.", "Date": "2012-12-12", "Author_Location": "Minneapolis, MN"}, {"Author": "John O.", "ReviewID": "o_O2yJIcGykfmUyp1My6_A", "Overall": "4.0", "Content": "Happy birthday to me!  I was given my pick of pretty much any place in the Cities and decided to come here based upon the favorable yelp reviews.  I give this place 4.49 stars.  Everything about the place was five stars for me but the food.  The ambience is very cool, modern and unique. They had a nice jazz duo on the main stage providing nice background music.  The cocktail menu here gives Marvel Bar a run for its money.  As I was not driving, I had quite a few - namely the man with forked beard (a dark and stormy), the full, grown man (somewhat like a dark and stormy but with bourbon thrown into the mix), and on blueberry hill (blueberry gin collins).  Really liked them all, but I think on blueberry hill was my favorite (I am in touch with my feminine side).  It was a very refreshing, summertime drink.  Our server was a five-star rockstar, except when it came to her speaking volume.  She was a real low talker as Seinfeld would say, but otherwise she was Ms. Johnny on the Spot.As to the food, better than meh.  Some items stood out more than others.  I knew it was tapas/small plates coming in, but the food would come out and it would be like really, that's it?  If you are a dude with a healthy appetite, be prepared to part with some serious cash if you want to leave full.  I definitely recommend the crab cake mac & cheese.  The smoked chicken was pretty good as well, but a little too much fat on it to be completely to my liking.I think maybe if I were to come back for the lunch menu sometime, I would bump this place up to five stars.  All those sandwiches listed seem like they would be more my style.  The cheesesteak in the picture up top seriously looks like the bee's knees.", "Date": "2012-09-07", "Author_Location": "River Falls, WI"}, {"Author": "Jason Y.", "ReviewID": "bM7-bpBxNvaff5IlCvWapA", "Overall": "4.0", "Content": "Very nice place.  Good music playing on stage.  The food was perfect.  Good portion size and delicious tasting too!  I would go back and I would also recommend to anyone looking for a new place to try.It is kinda hard to see this place from the road when driving on Nicollet, so just look for the Dunn Bros coffee on the corner and Icehouse sits right next to it-almost sharing parking lots.Check this place out!  You like it a lot like I did!", "Date": "2013-04-14", "Author_Location": "St Paul, MN"}, {"Author": "Josh I.", "ReviewID": "tF7NxRJwJTWPlTbIVPVG7Q", "Overall": "5.0", "Content": "Came here for a late night show and lived the bar & drink options. Just ate dinner here and was blown away by the customer service, quality of food, amazing meal and outstanding live music.New favorite restaurant!", "Date": "2013-01-03", "Author_Location": "Minneapolis, MN"}, {"Author": "Bruce L.", "ReviewID": "oCGJ_c8Ebesvmbv-sWXUJw", "Overall": "4.0", "Content": "Hard to find a place to park so valet is recommended if you don't have patience to drive around looking for a place to squeeze into.Started off with the mixed grains salad with smoked mushroom, poached egg and a sherry dressing, great choice to get the taste buds going. Next was a mac and cheese with two crab cake \"balls\" on the top.  This really didn't go well together at all.  The cakes needed a little something like a mustard drizzle, but not mac and cheese....bad choice.Next was smoked chicken with braised greens and barbecue sauce.  The chicken was nice and tender and with the barbecue sauce it was a home run.  Not  a BIG main dish more like a responsible portion.Dessert was peanut butter ice cream with chocolate and pretzel crumbles and a whole lot of whipped cream.  Easy on the whipped cream, the main focus of this dish was the AWESOME peanut butter ice cream, not the whipped cream...ease off please.  All of their ice cream is made in house and is thick and creamy.I'd come back", "Date": "2012-11-02", "Author_Location": "Burnsville, MN"}, {"Author": "Dave K.", "ReviewID": "tmNH5BxLcPBspfrX6JnQGQ", "Overall": "4.0", "Content": "Amazing burger with frois gra. Garlic roasted brussel sprouts are highly recommended. My wife raved about her duck breast.", "Date": "2013-11-16", "Author_Location": "St Paul, MN"}, {"Author": "Andre M.", "ReviewID": "YbAK-9tK-mOnyIUCK3eHpA", "Overall": "5.0", "Content": "Excellent food, Great Cocktails, and very friendly accommodating place. The bartenders are always nice to talk to and happy to give suggestions. I always suggest it to friends.", "Date": "2014-01-14", "Author_Location": "Uptown, Minneapolis, MN"}, {"Author": "Mark L.", "ReviewID": "63CR8E3bMaDGuzOI_ZQmeA", "Overall": "5.0", "Content": "Icehouse gets very little wrong in the rising scene of the Minneapolis new American food genre. And by very little I mean that I'll be going back here for sure.As a self-proclaimed technorati, any new innovation in restaurant tech gets me into a \"I'm so glad I live in 2012 mood.\" Icehouse waiters use iPhones to take orders. Why is this cool? No more hassle about splitting bills; easy to change the order; instantaneous transmission to the chefs. You feel like you're in the Apple store. Not only this, but their online menu is mobile-friendly, which is good for me and I'm sure many Yelpers who mainly use the app and are sick of trying to read a 2-pixel font on a restaurant's website.My party of six went at 6:30 on a Tuesday, however I would still recommend making a reservation as this place is ramping up in popularity (a la \"Butcher and the Boar\", another new American restaurant that recently sprang up).The Icehouse espouses the \"small plates paradigm\" by offering several (unique) smaller entree options. I have come to appreciate this model as it offers the diner a more varied experience while not putting all your eggs in one basket. Our party tried a good portion of the menu but some of the highlights included the dry-rub buffalo wings (these were amazingly flavorful; just order them!), market fish, gulf shrimp, and swiss burger. It's easy to order too many things if you're feeling hungry, but I find that as we went through the meal, to order as you go was an efficient solution.Icehouse is not the place where you have a huge entree and call it a night. You have to carefully navigate their very unique drinking menu ($5 sippin' shots will have you intrigued) and order a few small plates. The waiter made a recommendation to get a salad, small plate, and drink, and that would be enough to fill us up. He didn't know he had some very voracious consultants on his hands, but I think his suggestion is good for the average diner.All in all, I can't wait to come back here.", "Date": "2012-08-01", "Author_Location": "Detroit, MI"}, {"Author": "Ben D.", "ReviewID": "z51-Em2oqaNUwbhou514-w", "Overall": "3.0", "Content": "I'm rather confused by this place... They advertise live music all night, but when we got there there wasn't any. None. Not even an instrument on the stage. There was a guy sweating into his shoes in the upper back corner of the balcony spinning beats on his Mac. Honestly that is the only thing about this place that sticks out in my memory... It was HOT in there. Like steamhouse, I felt like taking a shower after I left because I was sweating profusely the entire time I was there. As was every other person in our gathering.The drinks were okay, not really the strongest (and a very weird concept Mojito that wasn't a mojito). The food looked good though I can't comment... There just wasn't anything here that I enjoyed particularly. And the staff, though courteous if they are serving you specifically, are very unhelpful if you haven't seen yours in about 30 minutes. I probably won't go back unless I REALLY want to see a band that's playing here, and even then, they had better actually be playing.", "Date": "2013-01-30", "Author_Location": "Owatonna, MN"}, {"Author": "Suzanne P.", "ReviewID": "p_L-dwh0P4abaeB-RO5bwg", "Overall": "5.0", "Content": "I've been there for dinner, I've been there for drinks, I've been there for the music and now I can say that I've been there for brunch.  Each and everytime everything has been fantastic.Icehouse never fails to disappoint. Never.We started brunch at the bar with a Bloody Homer (bacon-infused vodka, garnished with a tiny bacon doughnut and a slice of brown sugar bacon) which is bacon-y heaven.*  Once our patio table was ready, we ordered the truffle crepe and Croque Madame - both to split.  And while we were at it, we both ordered their peach amaretto mimosas and Bailey's lattes.  The portions were perfect; we were totally sated but not uncomfortably full.The drinks were tasty and creative and perfectly mixed and the service was great.  We were warned that there was only one server on the patio, but he did a great job despite juggling quite a few tables.Icehouse, I love you.  And bacon too.*bacon-count in this review: 5.  Scratch that.  6.", "Date": "2012-08-20", "Author_Location": "Minneapolis, MN"}, {"Author": "Jasmine B.", "ReviewID": "Fpv_847Z5FSyI3JE5DR-Tg", "Overall": "5.0", "Content": "This place is soooo cool (pun intended).Its surprisingly big inside, with an upper level seating area that circles the bar and a nice patio, too.  They play jazz music and it perfectly adds to the chic but not snooty atmosphere.I was lucky enough to be seated at the chefs table. What a perfect spot to watch the kitchen and the entire restaurant, with a top notch view of the stage to boot!  I was told the table was made of reclaimed barn wood.  Seating for 10 and large velvet curtains for added privacy makes this particular table the perfect party spot, too.The menu is small but just the right size for the small plates and snacks they serve. I still had trouble deciding what to order.  I ultimately decided on the porcini vegetable burger, topped with teleggio (cheese) & spinach.  Man was it delicious.  Served with some house made spicy pickles it made the perfect meal, but wasn't something that would make you full.I decided not to drink because I had a long drive home, but they had plenty of nonalcoholic beverages to choose from and the balsamic strawberry lemonade was calling my name, loud and clear.  Holy-moly delicious lemonade; I can't wait to go back and try more flavors.  I also recommend getting the Wisdom of the Century, the last item on the drink list, its free and very refreshing (seriously order it, and see what you get).  One person in my party had the blushing belle (pomegranate hibiscus gin-tini with vanilla cream foam) and I had a taste, it was amazing, seriously delicious and I will be having one the next time I visit.The servers enter your order on iPhones and the food and drinks all arrive fairly quickly.  Once you are done, they scan your credit card on the iPhone too, so no worries about someone stealing your info (I have had it happen to me before at an unnamed restaurant that I have reviewed). They take Discover Card too, so that is always an added bonus for me.The only snafu of the evening was they ran out of menus so my party of 8 had to share 3, but really, it didn't matter so I won't knock them down a star simply for that minor issue.  We kept our menus the entire meal, in case we wanted to order more, so I would guess that is what others also did that night.It might be a tad expensive for what you get, but its worth it, go visit Icehouse you won't regret it.  I can't wait to go back.", "Date": "2012-06-16", "Author_Location": "Hopkins, MN"}, {"Author": "Amanda W.", "ReviewID": "frD_FtDMDEjv6AIfvsTlLQ", "Overall": "5.0", "Content": "I was so excited by Annie D.'s review of this place yesterday that I knew I had to go here, stat. So, Leah G. and I headed here right after the Elite party yesterday so we could get our hands on some of those amazing-sounding drinks.When we arrived, we saw that there was a $5 cover for a jazz artist that was playing tonight, but the hosts told us they wouldn't actually charge a cover until 9:30, and if we were still there by then, they'd just charge us the $5 on our bill, which I think is a very reasonable practice.We were seated in the upper level, which gives a great view of the stage below. I can't wait to see a show here...it's perfectly intimate without being overly clustered. I like that.  Our waiter was quick to attend to us, and was awfully nice. Note: they do all their ordering on iPhones, so they aren't texting while you give them their order!We ordered the beet salad and the bacon and green chile burger and just split them both. SO tasty. The beet salad came with two delicious deviled eggs, sweet beets, some arugula, and a nice thick bacon. The burger was also excellent-very flavorful and big enough to share. To drink, I ordered the La Samba, which was an orange-cinnamon caipirinha. It was served in a large shot glass for $5, and the  flavor was so warm and spicy I can't wait to try it again.We finished with the rhubarb pie, which was a perfect ending to our meal. We both decided that we absolutely need to go back, and with the prices, we absolutely can afford to. Our meal, for three items and two drinks, was $34. I can just tell this is going to be a huge hit.", "Date": "2012-06-12", "Author_Location": "Minneapolis, MN"}, {"Author": "Joe I.", "ReviewID": "0HIsTfWbLW3ZYgbeAc-uDg", "Overall": "2.0", "Content": "Yeah, not so much?  Attended the Surly Wet release here recently.  I won't knock the place for the absolute horrendous parking situation it finds itself in, but seriously, I felt like I needed to pack snacks and extra water for the walk back to my car.  It wasn't crowded either... The place is average looking inside, sort of what you imagine when you close your eyes and imagine a bar in Minneapolis, though I can't imagine what a band would sound like in here with the brick walls and metal balconies.The food?  Distinctly average, if you are lucky enough to actually get consumable food in your order.  I'll explain.  There was a special Surly menu on said release evening.  One item on the menu was a \"Bender brisket\" sandwich.  Mine was average.  It didn't suck, and for $6 I guess it was fine.  One of my companions ordered the same thing, but instead of brisket he got a giant muslin bag full of spices and a giant string in his sandwich.  And I mean giant.  Once removed there effectively was nothing remaining in the sandwich.This is a serious error.  I guess the muslin bag looked *slightly* like brisket, but not so much so that it should fake out someone who serves food for a living.  In fact it shouldn't fool anyone who has a least one semi-functional eyeball and an understanding of the fundamental differences between MEAT and a GIANT MUSLIN BAG OF SPICES AND STRING.  And since the same someone who put the bag on the sandwich might also be the same person who created and placed the bag of spices in with the meat in the first place, and therefore might have reason to suspect that there is a giant bag of spices somewhere in the meat, and they should probably be on the lookout and make an effort not to serve it as meat.  Because it is not meat.  It is a giant bag of spices.  With string.But everyone makes mistakes.  But then we come to the service recovery.  Upon waving the server down to point out the giant bag of spices and string (now featuring a bite mark in them) and the resulting severe lack of meat on the sandwich, what is a server to do?  Our server asked if we wanted him to replace the sandwich.  The customer here never, in fact, received their order.  YES WE WANT IT REPLACED.  The implied question was, \"are you okay with the two pieces of bread that used to be around the non-food item we attempted to serve you, or are you such a fussy-pants that you want an entirely new sandwich?\"  Dude!  You served a giant freaking tea bag in lieu of brisket.  Yes, please kind sir, if you could find it in your heart to provide for us what we ordered, we would be so eternally grateful.Again though, mistakes happen.  I would call serving a giant non-food item thinking it was food a mistake.  I would call asking if we wanted to replace the food we didn't get in the first place a mistake.  I would also call not getting an apology, or a visit from the manager, or at least a slice of bread comped on your bill a mistake also.  A nervous grin, a pat on the back, and a \"whoops!\" was pretty much all we got from the server.  I guess we didn't look like the type of people that the staff cared enough about to make any effort at recovery.  Which sucks.In the end, nobody died, and we walked out of the place with a story to tell.  But not one of the five guys at our table will come back here either.  They served Surly so they get two stars.", "Date": "2012-09-25", "Author_Location": "Saint Paul, MN"}, {"Author": "Sasha A.", "ReviewID": "5UFFPr0RE_ZKprvZ0x9deQ", "Overall": "5.0", "Content": "As a fan of BeWitched, the partner restaurant to Icehouse in the Warehouse District, I was excited to see this place move into the neighborhood.  Having been here several times, for lunch, dinner, and drinks, I've been extremely impressed not just with the taste of food and drinks alike, but the service itself.  For a place that has a hipster trendy vibe, with live music no less,  the service from all the waiters we've had has been superb.  They have been attentive, pleasant, and accommodating each time we've gone.  Most recently, as part of a 20+ person party, I prepared for chaos, particularly with the check splitting, but because of an app-based system for taking orders, they were able to swiftly deliver individual checks to every person.   And that's worth coming back for, especially as part of a group.The $5 signature cocktails are great.  Nachos, fries (with duck gravy), wings are great appetizers.  And if you want a fantastic sandwich, the pulled pork and the smoked salmon w/avocado are fantastic.  And try the egg salad. Its exceptional.", "Date": "2012-07-09", "Author_Location": "Minneapolis, MN"}, {"Author": "Ryan P.", "ReviewID": "y_pm1y5f6C8Ytnixd-WzDA", "Overall": "5.0", "Content": "You like jazz?  Go here.  It's as easy as that.  Want to know more?  Read on....Please note, this review strictly pertains to the live music and atmosphere aspect.  I will soon be back to try the food and drinks, but in the meantime I just had to share what is going on in this place at night.  It's incredible!  FINALLY A JAZZ SPOT IN SOUTH MINNEAPOLIS!  The cover is a bargain at $5.    The jazz itself varies from blisteringly hot to romantic and low key.  I am by no means a jazz expert, but I loved it.  It reminded me of the stuff they play at Artists Quarters in St. Paul which is a very good thing.  The crowd was way into it and having a good time which is nice to see.  The jazz is really the center of attention here at night.The ambiance is incredible, spacious, huge ceilings, industrial but comfortable at the same time, with this great wood paneling.    I can't wait to go back and try the delicious eats.  With Matthew Bickford & Mike Ryan of Bewiched Deli as owners, you know the food is going to be incredible.  And if you haven't been to their first restaurant, Bewiched Deli yet, you should go now, it's incredible.  Same with the drinks, can't wait to get back and try those as well.  Apparently they got the guy who does cocktails at La Belle View to be in charge of drinks here, so you know it's gotta be out of this world.  Ice  House looks to be THE TOP MINNEAPOLIS HOT SPOT this summer.  I can't wait to return!", "Date": "2012-06-12", "Author_Location": "Minneapolis, MN"}, {"Author": "Blair R.", "ReviewID": "OYhXOikuSSQcByCS9xTFhA", "Overall": "4.0", "Content": "I visited Minnie the other weekend, and my friend had us check out Icehouse for dinner. I've never been to Minnie before, and I was happy to see a restaurant that reminded me of my hometown - Chicago. The interior and ambiance were great.Needing a break from alcohol and craving something warm, I started with the warm caramel apple cider. Yum. This definitely hit the spot. I still crave that drink whenever I am cold now. For food I was more boring and stuck with the roasted root salad and a dinner roll. I definitely enjoyed it, even though admittedly it wasn't exciting of me to order. Still, the vegetables were warm and yummy and the tangy bleu cheese hit the spot. My friends tried the mushroom pot pie, lamb casserole and burger. Everyone seemed happy with their choice. If I were to go back, I'd definitely split a bunch of the small plates.We didn't get to hear the live band go on stage but it seemed like it would be fun. If I were to move to Minnie, I'd be happy to return to this little joint.", "Date": "2012-12-03", "Author_Location": "Chicago, IL"}, {"Author": "Lan F.", "ReviewID": "1o4FTwqvdvRpVppSGpFrPw", "Overall": "5.0", "Content": "I am a huge fan of this area for restaurants, but most of the restaurants I typically go to on Nicollet tend to be hole in the wall places.  This was no hole in a wall, I immediately loved the atmosphere of Icehouse, it had a polished yet rustic and homey look that was very inviting.  The service was impeccable, the servers were equipped with lots of menu knowledge and iphones to take your order.  The memorable items we had were the market fish (halibut), gnocci, duck plate and dry rub buffalo wings.  Every plate was well seasoned, great textures and good quality local meat (bonus!).  We were quite full from our dishes but decided to splurge more by getting the blueberry pie with corn ice cream.  It was a nice combination of flavors and love that they make everything from scratch.  Prices are great for what you get and when the server asked how our first visit was I could only respond with two words: \"Fucking Amazing\".  Enough said.", "Date": "2012-07-14", "Author_Location": "Minnetonka, MN"}, {"Author": "Kate L.", "ReviewID": "sp-mPejMJjic7vg9-wc6Og", "Overall": "4.0", "Content": "I am so glad that this place is a member of the neighborhood!!  What a great place for a bite to eat and some great Jazz!?!?The layout of the place is fantastic - and they manage to squeeze in as many seats as possible despite the giant stage.  I also really liked the bar, tucked away just under the stairs.  Balcony seating was comfortable and spacious, providing an excellent view of the crowd below and the band.  Our particular visit had landed on their one week anniversary....yay!  But I'm not sure they were having a good run this particular night.  Despite an attentive server and waitstaff, somehow our drinks took 45 minutes to arrive.  Not to mention the fact that our food order (placed shortly after the cocktail order) and took just as long.  However, I did see what could have been our order pass us several times and be delivered to the other tables that seated/ordered after us.  Could it be they all ordered the same salads??So we had plenty of time to take in the scenery and chat...but when the band took a break, the wait became excruciating.  But finally, our Beet Salad arrived!  The deviled eggs were good, but didn't quite stand out for me.  The salad was a great combination of beets, ham and a light sherry vinegarette.    Our next order, which also took awhile to arrive, was the crab cake mac and cheese small plate and Broiled oysters with pancetta and marjoram.  While both looked amazing, sadly they were both slightly cool.  Broiled oysters, cold, isn't the greatest experience but at least the mac and cheese was cool enough to dig right in.  The speed of food service was the main factor I didn't send it back.  I was starving.That being said, their cocktails are amazing and as Annie D mentions (sadly I read this too late) the rock shots are BOOZEY!  What a great deal, really.  But I just couldn't hang and had to switch back to my initial drink of choice - the Silver Sombrero.  Our server was great in replacing the drink even though I took full responsibility for my decision.  That was a really great move on his part, great service.All in all, I really like this place and hope that perhaps this was an isolated incident.  The servers do have these I-touch order systems which should speed things up.  We will definitely be back for another try!", "Date": "2012-06-20", "Author_Location": "Minneapolis, MN"}, {"Author": "Eric S.", "ReviewID": "tsfam-qveWghXNK0QNh6xw", "Overall": "4.0", "Content": "Credit where credit is due, the $5 signature cocktails are imaginative, delicious and a crazy bargain. I had the foie gras burger. Not cheap at $22 but a generous slice of foie gras and delicious onion marmalade; but the burger itself seemed to have been cooked way ahead and was dry and cold. My friend had the sous vide short rib stroganoff which was delicious. The live music was very nice and unobtrusive.  I'll go back but I wanted it to be better.Edit - Went back, made different choices from the menu, and was well satisfied.  I think the burger was just a bad choice.  Upgrading from 3 to 4 stars.  Well worth the trip.", "Date": "2013-11-17", "Author_Location": "Minneapolis, MN"}, {"Author": "Kristin H.", "ReviewID": "lJuI_npR3y8tQvRDf7XFqA", "Overall": "3.0", "Content": "When we arrived, the parking lot was packed. Luckily I had put in a reservation through the Icehouse website, not knowing how busy it would be on daylight-saving Sunday.We passed the side entrance off the patio and walked to the Nicollet Avenue door. We were greeted with a warm welcome and seated near the stage. The bluegrass band was a welcome addition to our double date.Since I'd been up since seven, I already had my fill of coffee. Phillip and I opted for bloody mary's ($9). We were both a little disappointed that our pricey drinks didn't come with a beer chaser, but my skewer of pickled veggies was delicious!I ordered the French Toast. Three pieces of crisp, toasted bread topped with a heaping of apples, maple syrup, and a dusting of powdered sugar. I was surprised to see no side of syrup, but with my first bite I realized it wasn't needed. Buttery, sweet, and perfectly \"eggy\".Phillip ordered the Crispy Pork Biscuit.  He found it a little ironic that the meal looked like a sandwich when it was plopped in the middle of a thick pool of gravy. But, that doesn't hold a man back from a plate of protein. A delicious dish in a generous portion.In typical fashion, Alex and Kristin ordered the same meal: the Brisket Hash with crème fraiche and a dollop of harissa. It was presented beautifully, making me want to lean over and take the first bite myself. The hash was starchy with a strong bean taste. Both Al and Kristin mentioned that the hash was a little mushy, but were pleased with their choice.AtmosphereMasculine. Modern. Hip yet classically Minnesotan. A great location for any occasion.ServiceService was slow, but it encouraged an unhurried brunch. Our waitress was very personable and took her time with us.PresentationThe \"feel\" of the restaurant came through on each plate. All the dishes had a rustic look placed on a clean, white background.TasteIt was some tasty food. The three others said theirs were good, but I'd say my French Toast was delicious.Value for DollarsA decent value for the food and the great atmosphere, yet on the pricey side. A good choice for a special Sunday brunch.", "Date": "2013-01-04", "Author_Location": "Minneapolis, MN"}, {"Author": "Susan L.", "ReviewID": "7GIv0RgbTigMW-Sqgpky1A", "Overall": "2.0", "Content": "I really want to try and love this place, but maybe I went there at a time that wasn't so great. It was a few weeks after they opened and I was there during their lunch hour.  Not too many people around, but still I was ignored and not served.  After  2 minutes I politely asked if I could order some food (after a few people passed by me in the kitchen) and one of the sous chefs said, \"oh, I'll grab someone.\"  The person they grabbed was the person cutting some cucumbers.  Okay.They have minimal amounts of food for their lunch menu so I ordered a veggie burger.  It was a really expensive veggie burger and came with a lot of things that I really hadn't had on a veggie burger before.  You know, 2 slabs of butter, mayonnaise (after I asked if I could have it off if it came with it), and something that I couldn't quite tell what it was.  There wasn't hardly any spinach, and it was sauteed before being added to the burger.  The burger was falling apart and really lacked some seasoning.  I had to go up and ask for ketchup since I didn't get any when my burger came out.  The pickled vegetables were really good - so maybe that is where they are spending their time in terms of food?  I don't know.  I just wasn't impressed.  I've had better and wasn't ignored either.Maybe they do better for dinner/nightlife time when people are drinking it up and don't notice the food.  I'll wait a little bit before going back, but I was not really impressed with the service or the food.  I dig the concept, but they should spend a bit more time on the delivery.", "Date": "2012-08-13", "Author_Location": "Minneapolis, MN"}, {"Author": "Whitney F.", "ReviewID": "WJvB8ZWqdcQlxlVrpZQrlg", "Overall": "4.0", "Content": "The Twin Cities needs more place like Ice House. I'm not typically an Eat Street regular, but this was a delightful place to spend a Saturday night. Coming in I thought I wanted a spot on the patio, first come first serve, but the inside has just as much if not more character. I parked it right in from of the stage. Only qualm was that it was a little loud, almost to loud to hear dining buddies, but we survived. The cocktails, oh the cocktails were delightful. I had the \"on Blueberry Hill\". Very tempted to try the sipping tequila (thats next round). Friends had the Cucumber Collins and the \"George is Drinking tonight\". That drink doesn't lie - the enamel about came off my teeth after taking a sip... still pretty darn tasty. We all split the empanadas (yum!), wings, bbq chicken, and eggplant canneloni. Loved the dry rub wings - a little spicy and could have used a side of ranch/blue cheese/etc to cool us down (thank goodness for the mixed-d's). The BBQ chicken I would pass. Just didn't cut it for me and was a little underdone. The eggplant was fine and super fresh. We finished the meal with the blueberry pie and a bottle of red! I think next time my meal will purely be some bevies and desserts. As we were leaving they were clearing the tables for the dance party to get started... excited to check this place out another time post-dinner!", "Date": "2012-08-19", "Author_Location": "Minneapolis, MN"}, {"Author": "Leah G.", "ReviewID": "BNB0VQvRo4Wj2VxFu8fqfQ", "Overall": "4.0", "Content": "ICEHOUSE.I adore this place and I haven't even been to a show yet. I imagine that this place is even more magical with music. My girl and I went for Happy Hour on a super hot day last week and sat on the patio. It was well covered and had an awesome breeze wafting through the tables; it was perfect sitting outside even though it was in the nineties.Their beer, house wine and rail drinks are all on special for HH and they have a limited (yet still rad) food menu. I ordered a Pacifico and the \"Daily Dawg\" which was covered in pickled cauliflower. What a dynamite food and drink combo that was. They also have 4 different sundaes to choose from-ideal for July!This place is bomb; my only fear is that it will go all Muddy Waters on me and will be too popular and I will never get a table.", "Date": "2012-07-03", "Author_Location": "Minneapolis, MN"}, {"Author": "sallie w.", "ReviewID": "8TbZU7j2BPieVuszhZq1BQ", "Overall": "5.0", "Content": "I'm really excited about the new restaurant/bar/music venue that just opened last week at 26th and Nicollet.  Popped into Icehouse Saturday night for some chow and to check it out.  It was an amazing night so we opted to sit on the decent size deck that overlooks 'Icehouse Plaza' which opened a month ago and is described as a 'privately owned green space'.  Drinks were inventive and delish.  I had the 'mother rita' (I think, might be forgetting the exact name) which was a grapefruit based margarita, yum!  The speciality cocktail menu will set you back $9-11 a pop.Food:  Rainbow J and I split a few things - beet salad, trout salad, empanadas, crab cake mac n cheese, salmon trio and mushroom cannelloni.  Yes this sounds like a ton but it's small plates.  We over ordered by probably one dish when it was all said and done.  I always find it hard to judge the small plate thing...  Oh well.  It's fun to sample a variety of stuff.  Unfortunately this inhibited us from ordering dessert.  We saw several pieces of pie walking by so we were a little sad that we couldn't partake.  I'd say the average on the small plates is about $10 so it ain't cheap but the quality is good.  Overall the menu is interesting and I thought the food was tasty.  If you have a shellfish allergy you'll find the menu to be limiting.  It will be interesting to see what sticks and how the options evolve.  Side note: the place is party owned by Be'Witched Deli in downtown Minneapolis.Set-up:  The place is huge and has chill vibe; beautiful old woodwork, upstairs balcony area, 2 dining rooms, a stage, a huge bar, a deli counter in the smaller dining room - need I go on??  It appeared that they are open for lunch, weekend brunch, have a late night menu and offer a happy hour from 4-6pm.  I'm very curious to get back here and check out a show.  It sounds like that they are taking that aspect of the business quite seriously with a proper PA, serious lighting, etc.Overall I say thumbs up!", "Date": "2012-06-12", "Author_Location": "Minneapolis, MN"}, {"Author": "Jessica S.", "ReviewID": "_HHDxADmjWpkUdIdUBMotQ", "Overall": "3.0", "Content": "Dropped in for dinner after HH at Eat Street Social. Definitely a nice atmosphere. I'd say the crowd was mostly 30 and 40 somethings. I think we, in our 20s, were definitely among the youngest there that night. But this was not a problem. There was a band -- a keyboard and some big string instrument, sorry I'm not so musically-inclined. I normally don't like bands while I am dining. But their music was relaxing (and I believe free of vocals) and really enhanced the atmosphere. One glance at the menu and I knew I was in trouble. No light and healthy options. (Plus it was on the expensive end.) I ended up getting some sort of wheat salad (some hot grains on type of a type of spinach with a poached egg on type), which was not entree size, but there was nothing else appealing on the menu. The salad was not great but not bad. My bf ordered their steak. I think he liked, though half of it was pushed off to the side as a pile of fat. We ordered some drinks too. Apparently they are changing their drink menu and were out of a few of the drinks, including one my bf wanted to try. (Not sure why the waitress could not mention this upfront.) I am not sure what my bf ended getting but I ordered a pomegranate-flavored cocktail with a layer of vanilla cream foam on top. This was a really nice, smooth drink. I loved the layer of vanilla foam that was incorporated into each sip (as the foam never into the rest of the drink). Unfortunately, aside from this cocktail and one other topped with vanilla foam, I am not sure there was a wide enough selection of enticing drinks for me to return. (I like light , fruity gin or vodka based cocktails and there was not enough of these.)The dessert was extremely disappointing. We ordered a chocolate souffle-style cake. It was nasty. Aside from the baby food-like consistency, it was missing sugar and sweetness. It was just mushy chocolate bitterness. Overall, there were some things I liked about this place. But there were also a lot I disliked about the place. For this reason, I feel the need to break my rating down into different factors:Drinks: 5/5 ... Well-crafted, smooth.Food: 2/5 ... Mostly due to lack of selection for health-conscious. I am sure their food is actually really good, if you're into that kind of stuff.Dessert: 0/5... So so so bad. : (Service: 4/5Atmosphere: 4/5", "Date": "2012-10-21", "Author_Location": "Minneapolis, MN"}, {"Author": "Elyse A.", "ReviewID": "3lBKf5NsFfKRkjWEMo-woA", "Overall": "4.0", "Content": "My husband and I live in this neighborhood and have been delighted with the resurgence of new energy and businesses! The Icehouse is no exception.We dined here last night, spontaneously, and had the loveliest time. We sat on the patio in the back and enjoyed cocktails (I had the cucumber Collins drink...called a Derek something??? It was delightful and perfect for a summer evening!) We also shared the House Salad which was lovely and flavorful and not at all sad (like how some House Salads are). The crab cake mac and cheese was heavy but rich and flavorful. We loved the texture of the fried crab cake and the creamy mac and cheese. We also shared the shrimp and potato-risotto with basil dish. Also nice.The service was also excellent! Our waitress was adorable, kind and very helpful.I'm excited to come back here and try other menu items.", "Date": "2012-07-20", "Author_Location": "Minneapolis, MN"}, {"Author": "Christopher G.", "ReviewID": "OBoMIULxy0RNQyjHspm5Yw", "Overall": "2.0", "Content": "I guess I am not a fan of venues that tout themselves as a place to take in great shows, charge a cover, and then allow people to eat seated at tables right in front of the stage throughout the entire show.  So, I pay a cover, and am relegated to stand either to the side of the stage, or behind a half wall by the bar.  Either place was very cramped, and I found myself yearning to dance and shake a bit while the bands played.  Thank you Icehouse for denying me that luxury.  What is the thought process behind serving food in front of the stage while bands play?  If you want to balance things out, take the Amsterdam Bar approach...no cover, and keep a small section by the stage open for people to be up close to the band.This venue is kind of hidden, but I had no problem finding parking...and there is a very well advertised valet service.  The bar is stocked amply, with many good choices for local beers.  At 5 bucks a pint, it balanced out my annoyance with the set up of the venue, and I was able to make new friends despite my soured mood.Change the setup during shows, and this will be one of my favorite places to take in local acts.  Don't change the setup, and I will never be back.", "Date": "2012-12-04", "Author_Location": "Minneapolis, MN"}, {"Author": "Veronica A.", "ReviewID": "eoHkf3l1nNp1trV_L3_Ayw", "Overall": "5.0", "Content": "This place does live up to the hype.  The decor is industrial which keeps to the history of the building as an icehouse.  Lots of windows, nice little patio, beautifully lit stage for live music, just wish they had a larger bar. Love, love, love the breakfast at Icehouse!  I have been there twice for breakfast and have been so happy both times.  I have to start with the Bloody Homer which is a bloody mary with a piece of maple bacon and maple bacon mini donut as garnish.  All the cute stuff aside, the bloody mary mix was divine!  Great tomato flavor and just delicious, I wonder how they make it.  My favorite entree so far has been the Duck Brioche with a duck egg and poblano gravy - yeah, they do that and it is fabulous.  Tender braised duck nestled in a little brioche box lovingly coated with poblano gravy and an egg on top.  It was rich and velvety with such complexity that I about melted.  Another hit is the hash which is not traditional as the potatoes are nashed and creamy with the brisket folded in but it is quite good.I am a big fan of this place.  I do have to go back and have a proper dinner though.  I did check out some of the small plates early on but was not very impressed with my choices except the Electric Beans which are divine.  Can't wait to check it out again.", "Date": "2012-09-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Ali D.", "ReviewID": "7WLR0G5yehVHlPQA2evLRg", "Overall": "4.0", "Content": "I'm officially obsessed with this place. The $5 sipping shots are where it's at. Icehouse offers 13 different varieties of these larger-than-a-shot, smaller-than-a-rail cocktails, and I could definitely see myself working through the entire menu. Which means I'll need to visit this place several more times, since just a few of these will put you well on your way to a liquor-fueled, hazy night. My friend and I are both whiskey drinkers, so we ordered the 'Satan Laughs and Spreads His Wings' (bourbon, orange liqueur, and bitters) and the 'Thee Sir Brett' (whiskey, ginger, and ginseng) as well as a $3 glass of house wine during happy hour. Both were extremely strong, but extremely tasty. I'm in love.They have a great patio on the side of the building slightly looking out on Nicollet Ave., and the interior of the building is also really cool - kind of a warehouse-y, moody space that's perfect for grabbing drinks and food while listening to the live music that they have really frequently. Some of the shows are free, some have a cover, but either way, it's definitely worth it to experience the atmosphere and great feel of this place.My only gripe is that Icehouse doesn't offer any happy hour specials on food, and they offer a very limited menu in between lunch hours and dinner (3 sandwiches and a few side pasta/potato/green salads to choose from). But that's it. Definitely check this place out.", "Date": "2012-08-11", "Author_Location": "Minneapolis, MN"}, {"Author": "Jacqueline S.", "ReviewID": "tYWzO8a-NGkN648iAx3MvA", "Overall": "4.0", "Content": "When friends are in town I usually take them to Icehouse for a drink, and have always am always thanked. Their sipping shot menu is excellent at $5 (I recommend the Playing Make-up Wearing Guitar or the Straight Cash Homie). I've not found a drink off of the cocktail menu that I prefer for the increased price. The menu changes semi-regularly so I hesitate to generalize, but, I oftentimes wish I had more options as a vegetarian. I have never been disappointed in a lunch, but have more than once been disappointed by dinner, which is more expensive and meager in portions but not substantially improved. There's an affordable salad that comes with respectable butter lettuce I've named Ol' Reliable.The live music I've seen has ranged from three piece jazz to almost-too-trendy-hip-hop. I have never disliked the live music... but I have been bummed to hear the venue music go off, as that is typically great.There are some large booths, but I think the best dining area is in the back area, or in the immediate stage-right section. Service in the upstairs area is substantially slower in my experience. The outdoor area offers a nice patio, non-smoking earlier in the evening and smoking later on. There's full service during the day and for dinner, not sure about the late evening.Staff are capable and hospitable.", "Date": "2013-01-11", "Author_Location": "Minneapolis, MN"}, {"Author": "Todd S.", "ReviewID": "jreZYJzAg7x4uQCy2kIqrA", "Overall": "3.0", "Content": "Icehouse is hit or miss, miss on a busy night hit on a slow night. Drinks are cool, nothing really out of the ordinary for a Minneapolis bar with local tap beers, and moderate prices $4-6. I've heard the food, especially the burgers are excellent but haven't tried anything yet. Sound and Acoustics for shows are actually real good, so it's a good place to catch a late show. The issue is the space, it feels very crowded in there when its not even really that crowded, and normally I don't really care about claustrophobia but it can be tight in there, and when its tight service is very slow, like 20 minutes waiting with your group at a table before you get a server slow. Overall, not a bad place to chill if you can find a seat.Loud on the weekends with DJ 3.5", "Date": "2013-01-10", "Author_Location": "Chicago, IL"}, {"Author": "Halina Y.", "ReviewID": "F-150cRTFYVtXxR1C7SgEA", "Overall": "3.0", "Content": "Finally made it to the Icehouse for Brunch, but think I'd prefer this place for dinner. Eating brunch and trying to talk over the music got very old. It felt odd being in a concert venue ordering breakfast. That being said, our meals were 'good enough'. I don't think we were overly impressed. We ordered the French Toast & two orders of Brisket Hash. We found it odd that the 'side of bacon' we ordered was practically a 1/2 in cut of ham. ????? Next try is going to be dinner or post dinner at Icehouse- maybe my review wouldn't be so \"A-OK\".", "Date": "2012-09-11", "Author_Location": "Minneapolis, MN"}, {"Author": "Ellen B.", "ReviewID": "Ae_hrUipRm0NIYjMnf3APA", "Overall": "4.0", "Content": "I came here last night with three of my friends. We usually hang out in St. Paul, but decided to venture over to Minneapolis. It wasn't too difficult to find parking. We ended up getting a street spot about a block down. My friend ordered the Mothership Rita--it was by far my favorite drink of the ones we ordered! It is a grapefruit and rhubarb margarita. Super tasty and not too sweet. I appreciated that the \"girly\" drinks weren't served in ridiculous glasses. Our party also ordered:-Jackpot (I am pretty sure this is a lot like an Old Fashioned)-Grampa's Choice (rye and sarsaparilla)-House red (Bota Box)-MeatballsAll of these were great!When we arrived, there was some great live music. I wish it had gone a little bit later into the evening. Eventually, it was replaced by music that was just played over the speakers in the establishment. My only complaint with Icehouse was that I thought the music (after the live band) was way too loud. The crowd was not super young (although fairly hip) and it wasn't very crowded. Generally, I like extremely loud bumpin' music at places that are really busy. Most of the people were seated at tables and the bar was full but not packed. Maybe later on in the evening it would have seemed more appropriate.Overall, the drinks are a lot of fun and our server was extremely helpful! It was a great spot.", "Date": "2012-09-30", "Author_Location": "Santa Monica, CA"}, {"Author": "Sammy S.", "ReviewID": "yruzZuBnM0c-LaYicFGBxg", "Overall": "5.0", "Content": "Icehouse, I love you. Where have you been all my life?Icehouse Rocks = genius. Sipping shots on the rocks, basically three drinks in one. And only $5! What a steal. Everyone at my table swooned over these not-your-average cocktails.Even though our initial Icehouse intentions were purely alcoholic, we ended up sampling a couple of the small plates as well. The salmon trio was clean and refreshing. All three takes on the salmon were connected, yet each bite was unique. We all had our favorites on the plate.Also tried the mushroom/artichoke cannelloni. Creamy, rich, and decadent. Highly recommended. The service was fantastic. Helpful, futuristic (you'll know what I'm talking about once you go), and lovely.I cannot wait to go back to sip some more shots and sample more food!", "Date": "2012-07-31", "Author_Location": "Minneapolis, MN"}, {"Author": "Kelly G.", "ReviewID": "E6AXPmcqPnuFJFmzgbsk9Q", "Overall": "4.0", "Content": "I waffled between 3 and 4 stars but the Tortelloni and the good service pushed me over to 4.  We went in on a Monday night, and it was QUIET, despite no being able to find a parking spot within 2 blocks.  We sat at one of the cool half booths and since neither of us drink alcohol, we were here totally to check out the food.  We had the fried ravioli first, which was good enough.  Then, we had the Tortelloni, which was an absolute delight to the mouth.  I could have eaten a bucket of those.  Then we had the Lamb casserole, which despite being so HOT we had to wait quite a while to eat it because it comes out in a cast iron dish (looks great, too hot), once we could eat it, it was good.  Great presentation.  Finally, we had the chocolate souffle, which, despite the meh presentation, was perfect and delicious. Good pricing, good service, good food.  I'd love to go back and catch music now that I have the jist of the joint.  Will go back.", "Date": "2012-12-07", "Author_Location": "St Paul, MN"}, {"Author": "Jess F.", "ReviewID": "89jcHUr34gNhxo-A0DKswg", "Overall": "3.0", "Content": "Drink and atmosphere galore!  Wow.  I've tried 6 very different drinks here, and I'm a fan of the bartender.  I'm also a fan of the music, feel, and look of the entire place.  Ice House is a very cool place to chill, listen, and/or hang.  Not a fan of the food or the service, but hey, after a few drinks, it's hard to care!", "Date": "2012-09-25", "Author_Location": "Minneapolis, MN"}, {"Author": "Spencer R.", "ReviewID": "6IMWeH66_CZGirQU_f3ysg", "Overall": "4.0", "Content": "A great tapas bar with a hard-to-swallow price point. If you're comfortable spending that much money on dinner, you won't be disappointed. The food and presentation were both top-notch, and the signature cocktails are big, strong, and flavorful.I went on opening night, and while they were still working out a few bugs (they kept running out of menus, servers were still figuring out their custom iPhone apps (yes, they use iPhones to take your order)), the experience was quite pleasant.I hear they will have regular live music, and Gospel for Sunday Brunch. I'll be back to investigate that... but not any time soon. I need time to refill my wallet!", "Date": "2012-06-13", "Author_Location": "San Francisco, CA"}, {"Author": "ben f.", "ReviewID": "OAHce2Uv5fxCA3_e2z6kjw", "Overall": "5.0", "Content": "We just wondered in for some dinner and found ourselves amongst some amazing jazz. Good atmosphere and music= Bonus. Simply do yourself a favor and order the beefsteak. It's a hearty piece of heaven.Enjoy.", "Date": "2012-11-29", "Author_Location": "Portland, OR"}, {"Author": "Annie M.", "ReviewID": "5ArIBytPsnG6M_PVvXM0uw", "Overall": "5.0", "Content": "The atmosphere was really cool and the food was amazing. Our server (Mandy) was super helpful and really nice. I love the idea of sipping drinks because that's what I do at home and no other restaurants do that! And at a really decent price. I really recommend this place!", "Date": "2013-09-24", "Author_Location": "Minneapolis, MN"}, {"Author": "Jocey N.", "ReviewID": "hyRydsJDoclsSuQhmy44_A", "Overall": "5.0", "Content": "I'd been waiting to visit Icehouse since first hearing about it, and I was not disappointed when I finally did.We sat on the patio, so I can't comment much on the indoor ambiance, but I can say that outdoor dining at Icehouse is delightful.  The patio is set back far enough from Nicollet Avenue that you don't hear street noise or smell exhaust, and it's bordered on the non-restaurant side by a gorgeous little park/garden.  Sidewalk dining is awesome and all, but this is even better.We loved the food.  We tried had the beet salad, Buffalo wings, Gulf shrimp, and the mushroom-artichoke cannelloni, and for dessert, the buttermilk pie.  All of it was good, with the wings and the beet salad being my favorites.Something to keep in mind is that these are small plates, so each one is approximately one to one and a half servings, and if you split them, you're going to get a few mouthfuls of each.  They're exceptionally delicious mouthfuls of food, but if you're looking for a full serving of something you're better off not sharing.We left feeling very satisfied with the quantity/quality of the food and with the cost.They have a great beer list, and we tried one of their craft cocktails (On Blueberry Hill) with dessert and loved it.The service was fantastic.  Our server was attentive and helpful without being all up in our faces about it, as was the rest of the staff.  Empty plates and glasses were removed and water glasses were refilled quickly and unobtrusively.  Our server was also great about making recommendations and explaining how the menu worked.  I'm giving them that fifth star largely because of the excellent service.", "Date": "2012-07-08", "Author_Location": "Minneapolis, MN"}, {"Author": "Bryan E.", "ReviewID": "oeu_kKggMq4YlmCH3-kTNA", "Overall": "3.0", "Content": "My wife and I went to the Icehouse for the first time a little while back so I honestly can't remember too many specifics about what we had for dinner.  However, I do recall that we were seated in the back room at a two top next to a 20 top where one of the gentlemen had his rearend (clean language) in my face and food while he was greeting the entire table.  While this has no bearing on the restaurant, this was one of my takaways.  The Icehouse is similar to the Dakota Jazz Restaurant in downtown Minneapolis in the way that they have live music that you would want to enjoy dinner with.  The accoustics are a little lacking so it is somewhat loud in the restaurant.  My wife and I shared a few plates since they are smaller in size.  Some of them are TINY in size.  I say that with the preface that we are not big eaters.  We will tipically share a salad or small starter and share an entree.  I would go back here again if I wanted to see the artist performing that night and we had reservations in the main room.  Otherwise, I would just eat at Eat Street Social around the corner if I was in the area.", "Date": "2012-11-11", "Author_Location": "St Paul, MN"}, {"Author": "Ashley M.", "ReviewID": "gUdt6chWTFU8zxHhrUSoeg", "Overall": "4.0", "Content": "Found this place in an area called \"Eat Street\". Smelled really good from outside, so we decided to venture in. After glancing at the dark interior, and because it was such a nice day, I chose to sit outside on the patio. Our waiter, Christopher, was helpful and attentive. The cocktail menu is really fun. I ordered the Blushing Belle(pomegranate hibiscus gin-tini with vanilla cream foam), and full.grown.man.(bourbon, rum, house ginger beer & bitters) for drinks, while my bf ordered bulleit bourbon & ginger ginseng whiskey. The drinks were my favorite part... I try not to order cocktails usually so I can skip the unnecessary sugar, but I had to try theirs since they have some unique ones. Good choice!! Very delicious. For food we ordered the special (scallions with cauliflower sauce) and the salmon trio. Both were good, but they are small portions, so don't come here on an empty stomach and expect a cheap meal ;) Some live music started at about 9:30, but it had a $5 cover charge, and didn't seem especially interesting to me, so we decided to skip it. Overall, a fun experience~~ definitely come and try the drinks! :)", "Date": "2012-07-14", "Author_Location": "Dallas, TX"}, {"Author": "Jacky W.", "ReviewID": "IoKnEctPebS3AJNaBN9Y7A", "Overall": "5.0", "Content": "This restaurant is a great addition to the neighborhood. The food is very good - I had the veggie burger and the specialty cherry pie. Both were phenomenal. I can't wait to go back and try the rest of the menu.The atmosphere was really interesting and enjoyable. The stage is great for live music/dj's. I can't wait to go back!", "Date": "2012-08-09", "Author_Location": "Minneapolis, MN"}, {"Author": "Rachelle T.", "ReviewID": "msnoZslnLaoyDt3own7hLA", "Overall": "5.0", "Content": "I finally made it to Icehouse. I was a little concerned about the hype, can it really be that good?Umm, yeah! That place is pretty amazing!! The food was delicious, one of the best beet salads ever and the shrimp special was beyond my expectations. We tried the chocolate souffle and YUM!! One of the servers accidental dropped some bacon ice off at our table. Yes, bacon ice cream... just try it! The drinks will not disappoint either, they are a bit sweeter than other places that boast an expert \"mixologist,\" but still super tasty. The decor is pretty fabulous, somewhat rustic with an urban appeal.It has live music too. Do you really need anything else?", "Date": "2012-08-28", "Author_Location": "Minneapolis, MN"}, {"Author": "M. A.", "ReviewID": "7xuWFuFJfJioEYNzKduEmg", "Overall": "4.0", "Content": "Sipping shots!!! And music. And sipping shots!!!", "Date": "2013-09-14", "Author_Location": "Minneapolis, MN"}, {"Author": "Isaac B.", "ReviewID": "x8S0v68VfD8X5VUdpVij3A", "Overall": "1.0", "Content": "Over priced, multiple items ordered never came, food was mediocre at best. Not to mentioned that the host forgot to seat us for 20 mins after our table was ready. Icehouse tried to be another Happy Gnome and failed. Will never come back.", "Date": "2013-05-03", "Author_Location": "Minneapolis, MN"}, {"Author": "Kipp C.", "ReviewID": "oB-ldcOP455ziO6uzBJRGA", "Overall": "4.0", "Content": "I have never even tried there food but they have outstanding drinks!  Fun place to go!", "Date": "2014-02-27", "Author_Location": "Tampa, FL"}, {"Author": "Katie D.", "ReviewID": "07pa8g31QX5BCt2fcANMYw", "Overall": "3.0", "Content": "I've been here twice, once for dinner and recently for brunch.Go here for dinner! The ambience, music, and food are excellent and make for a fun experience.Go here for drinks, cocktails are amazing!Dinner left me with high expectations for brunch. Brunch was just okay! The pros: bloodies and cornbread were delicious. Unfortunately, not very impressed with the rest. I'll be going back for dinner or drinks!", "Date": "2013-09-09", "Author_Location": "Minneapolis, MN"}, {"Author": "Barb V.", "ReviewID": "R6AwcM28u8KDzE7XBqGOXg", "Overall": "3.0", "Content": "I think our tastes are more \"mature\" than most reviewers (as in we're older). The clam small plate had 3 clams, duck breast was tasty but more like a small plate, chicken was nothing special but the side was good, but $21 really?  Desserts were good. We all had the fixed  price menu which included this. Loved the atmosphere. The service was good and friendly. We were told the music started at 8 so intended to listen to a few tunes before departing. No music until 9:40 and when we ordered drinks to listen to a song or two we were told it would be a $6 cover for us to stay. This is after paying a $200++ bill.  Last trip to this place! Guess we're not hip enough to appreciate the place.", "Date": "2013-12-19", "Author_Location": "Minneapolis, MN"}, {"Author": "Lacey H.", "ReviewID": "yITPGeG-WOmsBiXB4C1B3g", "Overall": "1.0", "Content": "Well. My boyfriend took me here Friday night for Reggae music and late dinner. The people putting on the wrist bands at the front door were very rude. I asked him for a reciept for the entrance fee and he was real rude in explaining they dont give out receipts. We found a spot by the stage and it took about 20 min till we were finally asked if we needed anything. Being a non drinker and not liking ginger that left me with a choice of pop or water. We ordered our dinner which came very quickly but was very disappointed with the quality of our food. We ordered the fries as an appetizer and they came in a metal cup all soggy and limp. We then ordered a cheese plate and the oyster poboy. The fried oysters were very soggy and had a bad odor to them. The sandwich was also very small. About the size of a fist. It also came with the no salt, soggy, limp fries. Music was great and I even \"liked\" the band on Facebook but just overall not a place to ever go again.", "Date": "2013-11-19", "Author_Location": "Minneapolis, MN"}, {"Author": "James L.", "ReviewID": "yT1LgZ4ykRw0qr1X1J1F-Q", "Overall": "4.0", "Content": "Foie gras... Yum. Charlie is great. He will take care of ya. I had the duck. Awesome place if you are looking for live music. $5 sipping shots, too!", "Date": "2013-12-10", "Author_Location": "Saratoga, CA"}, {"Author": "Lilli C.", "ReviewID": "0d0-ryiPTWRObQTK7JQT9Q", "Overall": "2.0", "Content": "This is a review of my visit on Saturday, January 26, 2013.--About a week prior to my visit, I made reservations at Icehouse for my boyfriend's birthday.  When I made the reservation, I noted to the woman I spoke to that I'd like to be near the music.  After we got off the phone, I realized she hadn't repeated this specification back to me, so a few days later I called and confirmed my reservation and my seating preference.The reservation was for 7:15.  We paid $37 for a cab ride SPECIFICALLY to Icehouse, arrived at 7:08, and were sat a few minutes later in a back room with no view of the musicians whatsoever.  I told the hostess that we'd requested to be by the music -- she said she'd figure it out.  A few minutes later she approached us and offered us a table upstairs, where she said there'd be a nice view of the musicians.  We sat up there to find the view wasn't that great AND the sound of the music was super washed out from where we were sitting.  We debated asking the hostess a SECOND time for a different table...  During that time, we were approached by a waiter who poured water for us, asked if we had been seen by our waitress yet, and told us she'd be there soon when we responded no.  (Why didn't this guy just take our order?  Is he incapable of using the POS or something?)  After at least ten minutes of debating, and since our waitress hadn't even shown up yet, I returned to the hostess and asked AGAIN for a table near the music (the table I had reserved and confirmed!!), but she said there could be a wait.  I said I was willing to wait.  I felt annoying and like an inconvenience -- why should I have felt like that?  We waited by the bar and each got a cocktail, which we drank in a cramped space where we were consistently in the way of traffic.Okay, 'nough said about that hassle.  We finally got the table we wanted by 7:45, a half hour after we reserved it.  (Also, I think it is worth noting that if you sit at a two-person table by the music only ONE of the people faces the music...  I think the tables should be rotated 90 degrees.)  And HERE is where we encountered the SAVING GRACE OF OUR ICEHOUSE EXPERIENCE -- our waiter, Kevin H!  He was friendly, professional, courteous, knowledgeable, and prompt... all the things I hope to find in a server.  Kevin, if you're reading this, those two stars are for you!  And thanks.Note:  The music was really great, but I'll attribute that to the musicians themselves.Onto the food and libations.  The drinks we got at the bar (Silver Sombrero and Dark and Stormy) were tasty and boozy -- the way I like 'em.  We ordered fries with two sauces for $5 as an appetizer.  We got a portion of fries in a metal canister the size of a beer koozie.  Where I work, we sell a heaping plate of fries for $5.  I'm sayin' -- there was way more sauce than needed for this small amount of fries.  And potatoes are seriously cheap...  I just don't see the need for skimping here.  I got the Mixed Grains salad...  I was happy with it.  Tasty, interesting, and healthy.  The size of my $12 entree, the Mushroom Pot Pie, did not seem $12-sized, but it was very flavorful and actually filled me up just right.  My boyfriend's $20 Baby Back Ribs were substantial and had a good flavor but were pretty tough, and he only had a butter knife to cut them with.  First of all ribs should be tender, and secondly if they're not they should be served with a steak knife!  Our post-dinner beer was good, and my scoop of chocolate ice cream was REALLLY good.Now, here is my final complaint about this place.  After missing our reservation, which created a hassle both for us AND the hostess, WE WERE NOT APPROACHED BY A MANAGER.  I'm pretty sure I know who he was -- a bald guy with a big black and gray beard walkin' around.  I noticed him schmoozing with the band for an extended period of time, but I guess he didn't have the time to try to create a better experience for his paying customers.  Okay, manager -- a table touch would've been nice, and some free drinks would've been even nicer.  As a manager you have the power to make someone a returning customer or someone who will never return.  (Can you guess which one I am now?)Maybe I am being overly sensitive or picky about this, but in all honesty the mix-up with our reservation caused us to have to come up with entirely new plans for our night because we couldn't make it to the next thing we wanted to do at 9:00.  I wouldn't be frustrated with spending the money there and to get there if only the experience had been good.I tipped the hostess on the way out 'cuz for all I know it wasn't her fault we didn't get the table we wanted (there appeared to be multiple hosts), and she had to work to get us the table we wanted.  If we hadn't gotten that table in our great waiter's section, the whole thing would've blown.  My boyfriend disagreed with my tip.THE END.", "Date": "2013-01-28", "Author_Location": "Duluth, MN"}, {"Author": "Justin K.", "ReviewID": "7iYxXzY0hMZPtf0e8vtbUg", "Overall": "3.0", "Content": "After some considerable thought, I've come to the realization that Ice House has managed to discover a sixth taste (after sweet, salty, bitter, sour and umami).  What is this magical sixth taste, you ask?  Regret.  That's a strong statement, yes, and it doesn't apply to everything, but I can tell you definitively that one of Ice House's signature dishes, the foie gras burger, is loaded with it.  The cooks discovered this flavor when they took a perfectly decent, though already overpriced, burger and topped it with a puny piece of seared duck liver and then drowned it in a tasteless Bordelaise.  All this for the eye-popping price of $22 (before downtown Minneapolis tax and tip).  There isn't much complexity to it aside from the richness of the foie gras, but it's so small, you only get 1-2 bites of it before you're left with just beef and bun.  While it does come with a side of very good fries, which isn't mentioned on the menu, if the dish was put on the stock exchange, the return on investment would be somewhere between Enron and Facebook.  A friend of mine, who went on a different day, reported an identical experience with the burger, so this isn't just one cranky yelper spouting off to get his jollies.  There's a lot left on the menu to explore (see below), so I just want people to go with proper expectations.  If you're still craving a burger, I hear The Blue Door Pub is opening up next door any day now...Ok, so that's the major downfall of the place.  The other is the slow and rather inattentive service when the restaurant was otherwise empty during a Saturday at lunchtime, but that could have just been an off day.  They were, however, willing to split the two dishes we ordered so that we could try them both, which was very nice.  It could be better during a busier time, when adrenaline might make things move faster.  Stranger things have happened.  But it was definitely noticed.One thing that saves this place, and in my eyes, the one reason I would consider going back, is the cobb salad.  Made with crisp bibb lettuce, silky house-cured pork belly, garlicky croutons, ripe bleu cheese and two mouth-watering poached eggs, this will make you forget all your other worries and spoil every future salad you will ever have anywhere else.  It's that good.  Get that and you'll even forgive them for charging $22 for a stupid burger!", "Date": "2013-01-06", "Author_Location": "Minneapolis, MN"}, {"Author": "David C.", "ReviewID": "KHGkl1HoihZWpiANzkAVOQ", "Overall": "4.0", "Content": "Great dishes, great service, splendid venue, and live music!  They have live acts on certain nights, and definitely capitalize on their terrific drink menu.  The crowd is cool (albeit slightly older) but definitely alot of fun.  I think you should come here is you are looking for a more laidback night,  Doesn't quite have the same energy as a nightclub, but will satisfy you immensely if you are looking for something more low key.", "Date": "2013-04-24", "Author_Location": "San Francisco, CA"}, {"Author": "Anthony M.", "ReviewID": "isJ1Rr6z6gFAuxC-MQHkVQ", "Overall": "5.0", "Content": "Hands down the best place Ive been to in Minneapolis in a very long time!BEST CHEESE STEAK SANDWICH EVER!!!!Do yourself a favor and check this place out as soon as possible :)", "Date": "2012-08-02", "Author_Location": "Andover, MN"}, {"Author": "Emma R.", "ReviewID": "4g_YKW3RN5AVDTJSbqeI-g", "Overall": "5.0", "Content": "An evening at Icehouse is what you might expect from Matt and Brian's new venture. Fabulous food balanced with great sound and ambiance. The small plates were all superb and the drinks funky and fresh down to the perfect ice cubes. I can recommend the trio of salmon and the cheese soufflé salad. Make sure you save room for dessert. The buttermilk pie was rich, but the warm chocolate soufflé with hot chocolate sauce poured in to the center at the table was the best dessert I've ever tasted. The music was perfect for the evening and the space. Icehouse is large with six different areas to choose from (bar, balcony, chef's table, outside plaza and dining in front of the stage and to the side) depending on your mood, yet all connected with a smooth sound with great acoustics. I will be returning to Icehouse without a doubt. I can't wait to try brunch and lunch (deli style) and share this great new venue with my friends.", "Date": "2012-06-30", "Author_Location": "Burnsville, MN"}, {"Author": "Jane D.", "ReviewID": "z_jgO5EWeSB4s404BVLSHQ", "Overall": "4.0", "Content": "Haven't tried the food yet, but what I saw looked so good! The local beer, house wine, and crafty cocktails are great! Cozy live music venue that this area needed!", "Date": "2013-07-14", "Author_Location": "Minneapolis, MN"}, {"Author": "Adam L.", "ReviewID": "25iZKmdXKzsztoV5UOq9iQ", "Overall": "3.0", "Content": "Great food and creative drinks.  The small plate macaroni and cheese was delicious.  Most of the food consisted of trendy small plates, but some of the dinner options I felt were overpriced.  The location was very empty for a Tuesday night at 7.  I would have expected more people, so the vibe was quiet and reserved.  Good experience but with so many other places in Minneapolis, I will try something new before returning.", "Date": "2013-08-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Jodell R.", "ReviewID": "eTICDbkuNYZ1JrFmdxIzUA", "Overall": "2.0", "Content": "I really wanted to love Icehouse. The space is great, the stage seems like it would be fun to watch/hear live music. My drink-the Quebecois-was a fun way to kick off the evening, and our service was attentive. Sadly,  the food left itself to be desired. We ordered the crabcake mac'n cheese to share. Not one, but both of us got pieces of shell in our inidividual cakes. My friend could hear the CRA-ACK of my tooth hitting something hard from across the table. Bad enough the meal was bland, but please, at least clean the shellfish.I was leery to try anything more with the chance of a shell or a bone, so I chose the Beets with deviled egg. The eggs were actually soft boiled, and were tiny. Maybe quail eggs, or very small chicken eggs?  But they were mild, and the dish needed the tang of a deviled, mustard influenced flavor. Yawn.   My friend got the porcini veggie burger and she felt it was also mediocre. No flavor.Hoping to rescue the evening, we chose a dessert: the waiter-recommended buttermilk pie. The filling was creamy and had a nice snap, but the crust was extra thick and extra old. You couldn't even break it with a fork. Where was our crab shell shard when we needed a sharp instrument?  So overall, the food lacked focus, and attention to detail. We decided to stop at nearby Eat Streat Social for a nightcap and I found a stronger flavor proifle and more love and care put into my non-alcoholic drink than I did in any food from the previous two hours at Icehouse.", "Date": "2012-08-06", "Author_Location": "Eden Prairie, MN"}, {"Author": "Matt M.", "ReviewID": "RriZ_PPWkUC6mQ2RmTR6CQ", "Overall": "2.0", "Content": "Wow, what a disappointment.   The burger was bland and the bun was dry and cold like it had just been pulled from the freezer. The service was good.  I may give it one more chance, but with lots of better choices it will be tough.", "Date": "2014-01-24", "Author_Location": "Minneapolis, MN"}, {"Author": "Robin D.", "ReviewID": "EwE5Tn1AkDQf24oQ6-eMeQ", "Overall": "2.0", "Content": "This is my second review of Icehouse. The first time we ate here, we had a great experience but after the last two TERRIBLE meals I felt it necessary to re-review to balance out my original rating.I'm typically an optimistic and positive diner, but this place needs to get its shit together. First off - the servers use iPhones to take your order which is really distracting and impersonal. The server is just staring at a phone the entire time they are talking to you, and every time we saw our server he was standing somewhere fumbling with the phone. It just made for a weird experience. Then there was the lack of attention. Okay granted, we used the Groupon on both of these awful trips but if that is cause for wait staff to completely ignore you then the coupon idea is a major failure.Bad Experience 1: brunch. Server was pleasant, and at first things were fine. We got our drinks pretty quickly and placed our order. But then our drinks were empty (and we would have ordered more) and we waited 30+ minutes for our food to come out. Not once during this time did he come by the table. We tried to catch his attention but every time we saw him he was either on the iPhone in the corner or walked by without acknowledging us. Our food came out (not our server), we ate, and still no check in from the guy. We still had a beer left to order from our Groupon, and we finally ordered after he came by to take our empty plates. Ahhh! If the food was fabulous, I might have been a little more forgiving but the hash I ordered was unappealing and tasted like it had been prepared on a dirty griddle. I honestly would have preferred a bagel from Brueggers.Bad Experience 2: much to our dismay, we bought two Groupons because of our first great experience. This time we had lunch. I do have to say the sweet girl bussing our table was very nice and attentive. But again, the service from our waiter was awful! The stupid iPhone distraction is horrible. We again waited forever to be asked if we wanted another drink (which we did because they do have some tasty cocktail sippers!) and the guy walked by our booth maybe five times without ever even looking at us. Food was totally disappointing and my boyfriends Reuben came out on soft wheat bread. I'm sorry, but you better have some tasty toasty rye bread in back if you're going to put dear Reuben on your menu. My burger was so greasy that the bun was soggy. The other sandwich that was ordered was ho hum.Bleh. We will never go back to Icehouse. I hope for their sake they read these reviews and 1) rethink the iPhone thing...definitely not in any way helping their image; 2) hire some competent wait staff; 3) fine tune themenu and pay attention to the details.", "Date": "2012-12-30", "Author_Location": "Minneapolis, MN"}, {"Author": "Mahad M.", "ReviewID": "pi3vKT7EOQZVZtthRTZv9g", "Overall": "3.0", "Content": "WARNING: This is not the place for you if you're a hungry guy or gal.I was dropping a friend who lives nearby, after a long weekend of camping. We needed a meal and a few drinks, so we stopped by here around 5pm on a Sunday.The ambiance and the decor of the place are unmatched, compared to any place down on Eat Street. It's welcoming and almost perfect for a date.It was a bit loud; some folks were playing Cello on the stage, so we decided to sit on their patio, looking out partly into Eat Street, the parking lot, and Vertical Endeavors. Our server (Chris) using an electronic device to take our order was phenomenal of his knowledge of the menu and his overall demeanor. A guy came out running with a water bottle and then the menu arrived. One glance at it and I knew we were at the wrong place for a wasteful, gluttonous night. Chris did tell us that they've only been open for a couple of months and so far are testing the menu. We ordered the Sloppy nachos + Meatballs cheese sauce + house-cut fries with duck gravy & harissa sauces. My buddy had about three cups of their California red wine, I had two summits. We were hungry, so we couldn't resist ordering their buttermilk pie and peanut butter banana cream. I can see myself coming back here just for these two pies. We were pretty surprised it only cost us $38 at the end of the night. Still hungry though, we went to Taco Taxi :)If I do decide to come back, you can bet I won't be hungry.", "Date": "2012-08-02", "Author_Location": "Minneapolis, MN"}, {"Author": "Sarah Z.", "ReviewID": "DO7OPlFhah0aZnpXZgsiDA", "Overall": "5.0", "Content": "I FINALLY made the trip to Icehouse. It was on my summer bucket list, and now that summer's going to be over in a few days--well of course I had to go.The restaurant is in an unexpected area, I thought; it kind of sticks out like a sore thumb among all the ethnic stores and restaurants. But the interior (and exterior) are beautiful! The waitstaff and others working here match the look, with neutral clothing and rustic hipster-ish----everything. So you get the whole experience when you go here. I think it's a nice, rich atmosphere that makes it easy to relax and enjoy the food.And the FOOD. Was SO good. But let's talk about the drinks first. I might get too far ahead of myself... I planned for this moment, because I know there was no way I was going to be able to order if this was my first time looking at the drink menu. So after much thought I was able to walk into the restaurant confident that I had to have the butterfly kiss. Like egg white and olive oil in my drink? Yes please! Give me some of that experience! Doesn't sound like something I could get anywhere else, so I got it. There was a subtle temp difference between the egg whites on top and the cool alcohol below. The creamy butteriness that was the egg and olive oil blew my mind when paired with the sweet apricot-lemon flavors. And this drink packed a good punch. There were three other people in my party, so of course I tried other drinks. My favorite was the Summer something, with strawberry and balsamic. It's like a burst of fresh strawberry in your mouth. It could be dangerous in large quantities, because it's so tasty. I also really enjoyed the blueberry collins. The golden margarita was sort of just a margarita. It was probably made with really good ingredients--but still, nothing super special to it. NOW onto the food. I'll try to make it short. Let's kick off the food section by saying the french fries at Icehouse are the BEST french fries I've had (matchstick fries, not waffle). I didn't really know what I wanted from a french fry until I tried these, so you just need to get them. Crispy, little salty, good dipping sauce(s). Salad: I got the beet salad, which was the most fantastic choice. The salty crunch from the ham, the creaminess from the quail eggs, the pepperiness from the arugula, and the tanginess from the beets were unbeatable. This was one of my favorite parts of the meal. Small Plate: Ordered the eggplant cannelloni. It was good, but I might have enjoyed something else a little better. It's not because this dish wasn't all it could be--because I think it was. It was SO well thought-out, but eggplant stuffed with kind of mushy summer squash concoction, swimming in another concoction (aka broth). TASTY! But something in my desired a lil somethin different.Etc: I tried the sweet corn flan in my bf's lobster entree. It was super cool! The smoked chicken was also really moist and good. This is a good option if you're on the hungry side.Dessert: I had the coconut cream pie with lime curd. Love! The top was super creamy, with a subtle layer of lime curd on top of a crispy crust. Perfect. The Chocolate souffle cake was also really good. I've had something like it elsewhere though... I wish someone would do something mind-blowing with chocolate! But if you're craving chocolate then this is a great answer to your body's calling. Phew! Ok done with that.My only complaints about this place are... 1. The menu descriptions. The menu doesn't list half the things in each dish, so you're bound to be surprised by what you order. I get the thinking behind this, but I'd much rather know what is in each dish. 2. The prices *felt* a little much for the portion sizes. I think that's because I'm used to walking out of a restaurant feeling totally stuffed after paying a similar price for my food. BUT! the food quality it top-notch! It's something the Twin Cities have to get used to! Can't wait to go back for lunch and more drinks. (Philly cheesesteak and hot dog, you're mine!)", "Date": "2012-08-22", "Author_Location": "Madison, WI"}, {"Author": "Annie D.", "ReviewID": "09EK92LI2k0FJ5xkt6jBxQ", "Overall": "5.0", "Content": "On opening night, one expects kinks that need to be worked out, long waits, the kitchen running out of everything, unseasoned staff and just about everything to go a little haywire, but not at Icehouse. It's this well-designed behemoth of a building that used to be an actual icehouse and then a production studio, so I hear. It's industrial and modern, without being cold. There's a balcony lining the walls as well as plenty of seating and a big bar downstairs. The live music stage takes, well, center stage, but there's also room in the back for quieter dining. The first night they were open to the public, we ended up sitting on the patio overlooking the nice Vertical Endeavors rock garden. The cocktails are by Johnny Michaels (of La Belle Vie fame) and he really outdid himself. I've tried quite a few of them between my own and tasting my friends', so here goes...Signature Cocktails: (These are in order of how hard I would slap you if you tried to steal each particular drink out of my hand.)-On Blueberry Hill: It's a blueberry gin collins with cardamom and vanilla. It's balanced and refreshing and perfect. THE best summer drink.-Some kind of tangerine margarita-Butterfly Kiss: chamomile-infused something with egg white, olive oil... This was my friend's drink and it was pretty great, but I wish I could remember all the ingredients.-The Taste of Summer: with balsamic, tasted like a fresh, homemade strawberry popsicle (speaking of which, there actually IS a drink here that comes with a popsicle)-Watermelon Man is a pickled watermelon collins that I don't think I'd order again. It wasn't bad, but just not my favorite.-Colonel Mustard: \"A $1 shot of whiskey from a mustard bottle. Available at the bar only.\" I didn't try this, but I appreciate it almost as much as I appreciate that they make their own ginger beer.Rocks Cocktails: (If you're on a budget and still want something really boozy, try the $5 rocks cocktails. These are a steal in comparison to similar drinks in other bars. The rocks menu includes two of my favorites as well.)-Satan Laughs & Spreads His Wings: bourbon, spicy bitters and a nutty, caramely liqueur. Despite the name, this was absolute heaven. Track it down and order it immediately. If this is ever taken off the menu, I will cry.-La Samba: this orange-cinnamon caipirinha is soo interesting and good. This would be perfect at brunch, actually.-The extra smoky sazerac is OK if you like super smoky flavors. It comes with a pine-smoke absinthe-soaked glass.Now for the food. My friend and I went a little crazy the first night because everything sounded so good. We started with a couple of small plates: the yummy duck plate (confit fries, roast duck with blackberries and foie gras on a perfectly aromatic spiced cake) and then the empanada trio (same beef empanada with three different sauces---these were good, but could maybe be improved with varied fillings too). The small plates are small, as advertised, but ours were tasty. Then I ordered the cheesesteak, which is impossible to eat like a lady. It's sandwich packed full of brisket, spicy giardinera and bleu cheese fondue as a sauce and the flavor is worth the trouble of looking like an animal during feeding time. The burger with peppers and bacon with a side of crispy fries with harissa? OMG, just go there already. To finish off our meal, we ordered a slice of rhubarb pie to share. Pie. I love that they have a whole menu of pies, which are my favorite kind of dessert. Surprisingly though, the pie wasn't even my favorite part of this dessert. It comes with a scoop of rose creme fraiche sorbet on top that stole the tastebud show. They have a whole menu of house sorbets and I'd recommend one of the sundaes or the trio of mix-n-match ice creams (the bourbon scoop comes with a mini donut!).This review is becoming a novel, but I can't leave out the service, which was also tops. So genuinely nice. It's regular table service at night and then cafe-style service at lunch. And note that they are not texting when they are at your table... they are putting your order into their futuristic system. They can also check your IDs with a single swipe and run your credit cards right there. Though I think I would actually prefer if they stepped away from the table to do the credit cards (even just a few steps). It's a little awkward when someone's hovering over your table, no matter how nice they are. Usually I have to wait until \"things calm down\" or \"the place gets their footing\" until I feel comfortable leaving a review, but I just couldn't wait to give up all the stars for this place. Icehouse is so good for this neighborhood and was rocking it on day one (and on day two... as I visited twice in the first two days it was open). Can't wait to see what day three, four and five-hundred bring.", "Date": "2012-06-11", "Author_Location": "San Diego, CA"}, {"Author": "Paul C.", "ReviewID": "KFze8VX5yjysUlpT5oWPqw", "Overall": "5.0", "Content": "My good friend and I decided to try Icehouse on a whim. We were very pleased. The staff was very friendly and helpful. There was some cool, live East Asian music playing on the stage. We sat up top on the mezzanine, very cool vibe. Ordered the pickle juice and whiskey drink. I'm biased as I love whiskey and pickles but it was very good. I ordered a caramel olive vodka drink for my second drink and was also pleased. The people watching was great, the food looked good (didn't order any) but the atmosphere is what really stood out. A great addition to the Twin Cities scene. A great night is to go to Icehouse and Eat Street Social (next door). I wil definitely be coming back.", "Date": "2012-10-28", "Author_Location": "Little Canada, MN"}, {"Author": "Angela L.", "ReviewID": "DTdrLL6b4Hrwe-eRc2u91g", "Overall": "4.0", "Content": "Went here for an event! Turns out this place is a great event space for music, comedy, speaking, whichever....great stage with an industrial but modern vibe and warm lights. Definitely not icy! I need to come back here for dinner sometime as the menu looks spectacular if not a tad pricey! Updates to come!", "Date": "2013-02-18", "Author_Location": "St Paul, MN"}, {"Author": "Alicia R.", "ReviewID": "PQkfMYBt8qP6dEP2D_i53A", "Overall": "3.0", "Content": "I wish I could share everyone's love for this place. I went in with high expectations and left I satisfied. First off- the service. Not bad, but not great. We asked our waiter \"how things worked\" on the menu- his reply was \"try the shrimp\".  Odd. So we tried the shrimp.  And the crab cake/Mac and cheese. And the burger and the empanadas. There were four of us and we decided to pass and share, as recommended. The first disappointment was everything arriving in quantities of three- that made it hard to divvy things up fairly, and it would have been nice to know. But we made it happen! The empanadas were awesome- nice and creamy and veggie-tastic. I love the varieties of salsas. The crab cake Mac and cheese was okay- really creamy Mac and cheese- but why did they add marinara? It mixed in with the purity of the Mac and cheese and made it more like spaghetti. Finally- the burger. Now that was delicious.  We had the bacon and green chili burger- the bacon was more on the pork belly side, and the spice was right on. If I go to Icehouse again, this will be my repeat choice!All in all, the space was nice, but the food just didn't wow me. Maybe next time!", "Date": "2012-07-06", "Author_Location": "Minneapolis, MN"}, {"Author": "James B.", "ReviewID": "sHkDgyhJdFXt5J8SuTR52w", "Overall": "2.0", "Content": "Nice bar with great drinks and a decent beer selection but the food isn't good at all.  Burger overcooked, every dish desperately needing salt, and hands-down the worst octopus dish I have ever had.  I would go back to get a drink or two but not for the food.", "Date": "2013-05-27", "Author_Location": "Uptown, Minneapolis, MN"}, {"Author": "AJ J.", "ReviewID": "2z1KMlbak-SYmDupbKtJmQ", "Overall": "5.0", "Content": "This is a great date spot.  Great atmosphere, wonderful staff, mouthwatering food.", "Date": "2013-12-17", "Author_Location": "Minneapolis, MN"}, {"Author": "Trevor W.", "ReviewID": "M-UWpg9AGNLXgmIGbB3tVQ", "Overall": "4.0", "Content": "Great venue but because it's so pristine seems oddly placed in the heart of eat street. When you walk in the door, it feels more like you're in uptown. Icehouse is a great restaurant/bar music venue with regular live entertainment, it's dimly lit with an intimate feel making it a great date destination. The owners did a wonderful job with the space and it has a modern industrial warehouse cabin feel to it. The drink menu is solid and worth the price. Food is great and totally affordable.", "Date": "2012-11-24", "Author_Location": "STUDIO CITY, CA"}, {"Author": "Amy S.", "ReviewID": "0tHt1rZgZkGc-1Jq-vsPJg", "Overall": "3.0", "Content": "I went back to Icehouse with some friends during lunch yesterday. Because the group was too large, they didn't allow us to do counter service which meant slower service.  My burger was quite good, but next time I want to eat in an hour I won't go with such a big group.", "Date": "2013-01-10", "Author_Location": "Minneapolis, MN"}, {"Author": "Jasmine M.", "ReviewID": "ZEYzJFNlMOYCukBr-147bw", "Overall": "4.0", "Content": "An excellent addition to the Minneapolis dining scene.  Love the small plates ideas and the lengthy list of cocktails. Plus, who doesn't love pie?  I think Icehouse is really well-priced given the high quality of the food here. It would definitely fit in well in NYC and be a lot pricier.  If you can get the mushroom pot pie with taleggio cheese, definitely order it (and don't share!) I was less enthused with the mac and cheese with crabcakes in terms of integration, but it was still yummy and comforting with a twist. The cheese souffle with bourbon? Hello yes! Dessert was also a real winner. I am not usually a fan of cake, but I loved the pineapple upside down cake here. Service was attentive and very friendly.  It has a relaxed but hip vibe in an industrial (hence the ice house) but modern setting.", "Date": "2012-10-25", "Author_Location": "Manhattan, NY"}, {"Author": "Jennie H.", "ReviewID": "xlICuK3lXc8z7aEZsSzELg", "Overall": "5.0", "Content": "The food is great.  There is some very creative dishes.  My favorites were the crab mac and cheese and the ravioli (I can't remember what was in it, but it was amazing).  The atmosphere is fun and trendy.  The service was fantastic.  Oh and their orange flower ice cream is probably the best ice cream I have ever had.  They also had a good wine list/drink menu.  I had a fantastic glass of rose that the server suggested.", "Date": "2013-03-08", "Author_Location": "Minneapolis, MN"}, {"Author": "Andrew H.", "ReviewID": "QURax8hZkGHWiWAgTDeuVQ", "Overall": "4.0", "Content": "I had the duck gumbo. It was a good meal, but it was a little too salty and the portions were small even for a place trying to have small portions. The ice cream scoops were more like slivers. This place has a good ambiance.", "Date": "2012-11-17", "Author_Location": "Singapore, Singapore"}, {"Author": "Victor M.", "ReviewID": "u6GBuXJP8ZUxwRjYRRZLXg", "Overall": "5.0", "Content": "Went to ice house last night and the service was amazing! The food was good . The only thing i dont like about the icehouse is the music is soooo  loud you cant talk or anything. Other than that i give it a solid 5 stars", "Date": "2012-12-21", "Author_Location": "Saint Paul, MN"}, {"Author": "Luthien N.", "ReviewID": "_CTIPA0Si05E-_Mw7dkGtA", "Overall": "4.0", "Content": "The $5 small drinks are one of the biggest reasons we go here so frequently - the drinks are elaborate and exciting and cheap enough that you can have a couple without spending too much money (new favorite: Hard Knock Life, Canadian whiskey with a pickle back).  They have a great patio when it's warm and it's a great atmosphere for a variety of live music - there's typically a cover when there's music, which isn't awesome, but it's usually just $5-10 and definitely worth it for the fun crowd, excellent musicians, and neat atmosphere.", "Date": "2012-12-03", "Author_Location": "Oakland, CA"}, {"Author": "Carley M.", "ReviewID": "aS0XS0eFdhpUUrYM9VKp8w", "Overall": "4.0", "Content": "I had a great time going! They had a great jazz band play and since we made reservations we didn't have to pay the 5 dollar cover. They had a decent beer selection and the server was polite. Since music was playing talking wasn't really an option but the atmosphere was still really fun. The food was pretty meh although we only got apps but it didn't seem like anything special. The mix drinks were also tasty I would def return maybe during a happy hour.", "Date": "2013-04-03", "Author_Location": "Minneapolis, MN"}, {"Author": "Anders C.", "ReviewID": "t4E8CQ-qY318VVeDeRnxaw", "Overall": "5.0", "Content": "The cheesesteak was one of the best sandwiches I've ever had. Not what you'd expect either. Blue cheese, hot peppers, smoked brisket. My mouth is watering right now. Well worth the ten bucks. The Reuben was also special and delicious. Great atmosphere here as well.", "Date": "2012-07-03", "Author_Location": "Minneapolis, MN"}, {"Author": "Linda B.", "ReviewID": "0ZsEH8wepBJPddQnN8Srtw", "Overall": "5.0", "Content": "What a fun, new place! I love the warehouse-like, industrial feel of the place. Each room has a different ambiance. The food and drinks are great. I sampled the spicy nuts, fries, Samba shot, porcini mushroom veggie burger and yummy olives. The menu is very meticulously organized on a miniature clipboard. The patio overlooks the beautiful courtyard with  our very own Zoran's sculptures. I'm definitely going back to Icehouse!", "Date": "2012-07-04", "Author_Location": "Minneapolis, MN"}, {"Author": "Kc K.", "ReviewID": "V2G3gm6pOWVjMWNHclWGZg", "Overall": "5.0", "Content": "What a wonderful vibe this place has!  Third time here.  Today, came for brunch and the live music, had spectacular dishes (a wonderful french toast and an egg/pork belly eclaire--both fantastic, and interesting!).  The decor is hip, cozy and unique.  And the four piece music was great on its own.  Enjoyed the food/ambience/music trifecta so much, that we decided to come back for a late dinner, and to catch the late Sunday night band (in from NYC). Again, the dishes were great--unique and reasonably priced. Loved the Strangers in the Night drink (vodka w hint of salty caramel w almond). Thanks to manager Mike and the kitchen staff for keeping the kitchen open a little late for us (few minutes after 11pm) and the great food/drink recommendations! Great service!", "Date": "2013-01-24", "Author_Location": "Minneapolis, MN"}, {"Author": "Mique T.", "ReviewID": "JW9EabeI2kzBUFm7K41yVw", "Overall": "4.0", "Content": "It would appear we went there on the Jazz specific night. Went there another night for a concert and it was awesome. The venue is a little small for such things but still great. Just avoid the jazz night.", "Date": "2012-12-13", "Author_Location": "Minneapolis, MN"}, {"Author": "Mariel L.", "ReviewID": "Vb7_XLMmsM7Xch847atilA", "Overall": "4.0", "Content": "Oh my goodness, this can get dangerous. Finally had dinner here with some friends, and it met my (heightened) expectations. The restaurant is spacious, has great lighting, and great acoustics. Even as the dinner crowd started building, I noticed I didn't have to start speaking loudly; this restaurant is also a music venue, and I can't wait to come back for a musical treat along with my delectable one. The menu is a limited list of small plates, entrees, and bar food. I was debating between a couple of options, including the chicken, a couple of bar food items, and the rabbit. I eventually went for the foie gras and truffle burger, because I'm a baller, no doubt. This burger was quite amazing, cooked to a perfect medium rare, and had some uneven textures to it, which makes sense as the meat is ground in-house. The truffle wasn't overpowering, and the foie gras was this luxurious, smooth meat icing on top of the cake. And, as fancy as this burger sounds, consuming it is anything but. It's ridiculously juicy, so get a bib ready.The fries that come with it have a great crispy skin outside, and you can choose the dipping sauce. I went with the duck gravy, which actually had a little bit of the duck meat in it. Ri-freaking-diculous. My friend also ordered a burger and I got to try the lemon aioli she had, and that was lovely as well. For dessert, I tried the bacon and brown sugar sunday because, duh. It's bacon. And brown sugar, In a dessert. Definitely a must-try when you come here. It's not as odd a combo as it sounds; little bacon bits on top provides a bit of saltiness with the cool sweetness of the brown sugar ice cream. It was just a great finish to a stellar meal. And I can't wait to come back for more. This will, indeed, get dangerous.", "Date": "2012-09-23", "Author_Location": "Minneapolis, MN"}, {"Author": "J J.", "ReviewID": "2ZsJL1Pfj72UovmSFtJOpA", "Overall": "4.0", "Content": "Didn't go to eat. just for music and drinks...nice environment, good sound. Liked it. But no Captain Morgan? Seriously??? No Crown Royal? Really? Seemed odd...think we just stopped asking for what we wanted and asked for what they actually had lol.", "Date": "2013-10-15", "Author_Location": "Minneapolis, MN"}, {"Author": "Kathleen M.", "ReviewID": "90D7CHmfEBDL92qLiWazyg", "Overall": "5.0", "Content": "Came to Icehouse after seeing it in a Best of List in vita.mn.  We arrived during the time where they have their 'Snack' menu.Atmosphere- The design of the interior and the menus.  Super trendy but also inviting if you wanted to come here just for a nice dinner. Food & Drink Quality - I was first skeptical of the Snack menu, but once I saw the options for food and cocktails/sipping shots, I was sold. We got the Steamed Bun chicken and Steamed bun pork sandwiches- these came with a few fries and was truly the perfect snack. For drinks the Silver Sombrero marg and sipping shot titled Playing Make-Up, Wearing Guitar(tasted like very strong manhattan) were tasty and strong. And last but not least, Service was OUTSTANDING. The waiter was friendly, informed us about the drinks to help choose, and also gave us some insight on the establishment since it was our first time here (such as weekly events, specials, etc.)Will definitely be returning for dinner and also would like to try a show one night. Recommend!", "Date": "2013-01-01", "Author_Location": "Minneapolis, MN"}, {"Author": "Matthew F.", "ReviewID": "nNdWxu0Z-gMJfqA1LjgDdQ", "Overall": "1.0", "Content": "My review is based solely on the rudeness of the hostess.  I called to see if we could get seated, she said there'd be a 20 minute wait but yes.  When I showed up I talked to the same hostess who told me there was nothing available except a waitlist for a possible table an hour and a half later.  And there were plenty of empty tables right in front of me.  I won't go back.", "Date": "2012-09-11", "Author_Location": "San Francisco, CA"}, {"Author": "Mandy C.", "ReviewID": "IFq2GYjyrWPy18l9Zf2WrA", "Overall": "4.0", "Content": "Stopped into Icehouse randomly and had an absolutely lovely experience!  We originally noticed people sitting outside and enjoying the patio as we went into the climbing gym, Vertical Endeavors, adjacent to this place.  It looked like a good time so my partner and I decided to stop in and see what it was all about.  We were very pleasantly surprised as they sat us quickly on their laid back patio with an unpretentious, eclectic group of people.  We noticed their specialty drink menu right away.  We tried several of the drinks including the Blueberry Hill (too sweet for my liking), Derek Smalls (mm cucumber!), Butterfly Kiss (delish!),and the Watermelon Man (another favorite - this actually wasn't too sweet and had mint leaves which really made it for me!).  So the drinks were pretty cool and I'm not a huge fruity, speciality drink drinker - so if you're not either, they have a good beer and wine list which I would hit up next time.  Next we enjoyed a couple small plates which is what their food menu mostly consists of.  We shared the artichoke and mushroom cannelloni (the goat cheese on top was awesome) and the gulf shrimp (I wasn't a fan of the potato risotto but of course I ate it anyway).  We wanted a little something extra to munch on while we were enjoying all the cocktails so we ordered the dry-rub wings (bar snacks) which I might have to chalk up as my favorite thing we tried!  I am very eager and curious to try the rest of their small plates - they all sound creative.  Another mention, the service was awesome!  Our server was the perfect combination of attentive, polite and non-overbearing (is there a word for that?).  She came when the time was right but didn't get in the way.    I have never dined or hung out in this Minneapolis neighborhood before but this place definitely left me intrigued to come back...not only to Icehouse but other spots in the area!!", "Date": "2012-07-13", "Author_Location": "Nashville, TN"}, {"Author": "Ariel L.", "ReviewID": "Wu0YK0EyBnm8dCA-Mm0tgg", "Overall": "4.0", "Content": "I was pleasantly surprised by the appearance and the atmosphere of Ice House. For some reason, I initially imagined it would be more like a \"Famous Dave's\" chain store type place. Boy, was I wrong. The restaurant has a cool dark vibe, a huge contrast to the more \"neighborly\" restaurants on Eat Street. I don't think I've actually been to a restaurant in Minneapolis where it felt legitimately \"cool\" until now. Ice House is classy, sexy, cool. There is an inexplicable allure, dark, worldly and mysterious. The spacious stage is the center of the restaurant and the star as it entices us with \"come-hither\" tunes from talented musicians.As enamored as I am with the atmosphere and tasteful interior design, I did encounter one annoying flaw about the place. My friend and I were seated on the second floor balcony by the wall. On this wall is a huge red pipe that runs horizontally across the entire wall, which, when seated, is right next to your head.  It's a funny thing to be annoyed about I suppose, but, I don't like sharing my \"head\" space with a gigantic red pipe. I wanted to move the table and chair another 2 -3 feet away from the wall so that I could feel more comfortable and relaxed.  Next time, I'm getting a reservation specifically for the 1st floor area, where red pipes aren't trying to throttle your head. Oh, now, about the food. We had the smoked trout with walnuts and the truffled cheese souffle salad. The salads are portioned sparsely but are delicious! For those accustomed to HUGE American sized portions, this salad would disappoint you, portion-wise it's tiiiny.  I was quite pleased with the size(and tastiness) though considering I hate American monster sized portions anyway. Then, I had the reuben style pastrami sandwich, which is a regular-sized hearty sandwich but unfortunately not that great. All I tasted while eating that sandwich was the heavily creamed mixed greens that they slopped on top of the pastrami.In any case, I'd love to stop by Ice House more often to try out the cocktails and other items on the menu. I hope I can find a favorite drink and meal there.", "Date": "2012-07-14", "Author_Location": "Minneapolis, MN"}, {"Author": "Zehr S.", "ReviewID": "1eL--QYzPsxHp_NcttYhgw", "Overall": "4.0", "Content": "very creative menu and drinks herevery cozy and nice atmospherevery cool decorvery friendly serving staff, professional and attentativevery nice to have live jazz band, though the night i went, it was just ok", "Date": "2012-07-23", "Author_Location": "Plano, TX"}, {"Author": "Marsha L.", "ReviewID": "l6tn6RHrloRxxL8mkC-hxA", "Overall": "2.0", "Content": "The water tasted like gross fishy tap water and was room temp. The food was only ok. After we were finished eating. It took 45 min to get our check. Also, it was ridiculously loud in there and couldn't even hear my friend talking to me and there was not even any music playing, just horrible acoustics.", "Date": "2012-06-26", "Author_Location": "St Paul, MN"}, {"Author": "Melanie B.", "ReviewID": "3uwpO7tpT9egT2GvEIH8UA", "Overall": "5.0", "Content": "My fiancee's Birthday falls on Valentine's day which makes going out to eat tricky, as we're both foodies but hate battling the over-crowded restaurants, forced prix fix meals and rushed feeling.  The Icehouse was anything but.  From the moment we walked in we knew our luck had changed.  We got a perfect corner table with a great view of the flamenco dancer and spanish guitarist on stage (perfect for V-day).  Our server was pleasant, attentive, and insisted we take our courses slowly.  We both started with delicious cocktails and all 3 courses of our meal were absolute perfection.  Between the 2 of us we had king crab ravioli (the best thing i've tasted in ages) and a Ploughmans platter covered in sausages, crusty bread, pickled vegetables and spicy mustard, for dinner duck breast over carrot couscous for me and mushroom and chevre stuffed pot pie for him and dessert was a pumpkin mousse and flourless chocolate cake.  We both grinned ear to ear the entire 2 hour long meal and I nearly hugged our server goodbye.  By the end of dinner my fiancee declared that we would be returning every year for his Birthday.  Thank you Icehouse!", "Date": "2014-02-17", "Author_Location": "Minneapolis, MN"}, {"Author": "C J.", "ReviewID": "NgLmH3OHwst__l50ZzOw7A", "Overall": "2.0", "Content": "I wish I had the experience reflected in so many reviews on here, but I'm afraid Icehouse fell completely flat.The positives- absolutely love the decor and that it was much larger than expected.  It's kind of a sexy, modern. lodge with a hit of steampunk. The live music was also really great.  I also thought their cocktail menu was great and well-priced.  I had the house-made dark and stormy (I forget the name of the drink) and the Mothership Rita, and both were fabulous.  The 'meh;- the service was ok.  Our server wasn't very helpful when navigating the menu.  The not so great- the food menu felt very disjointed from the ambiance and I left with no sense of the restaurant's identity.  For such a big, cool space a whole bunch of small plates just didn't seem to fit the vibe.  The beet salad was very good but not big enough to share.  The gulf shrimp were beautifully cooked, but the pesto potato risotto didn't really work with it for me.  We decided to split the cheese steak sandwich after the server recommended it and we saw another table order it- it looked awesome.  First, ours was barely warm, and when I asked the server if it was meant to be a hot sandwich (and he said yes) he didn't offer to warm it up when I told him ours was just above room temperature- very awkward.  It came with the blue cheese fondue sauce on it as the menu described, which was a total miss for me.  It had no flavor and only managed to make the meet and bread really slimy.  I had a few bites and was done.  We had an $90 tab and didn't feel at all satisfied by our food.  We ended up going next door to Eat Street Social to share a meal- they're execution has been stellar from the start.  Sorry, Icehouse- I won't be back until there's something exciting to come back to.  I really wanted to like it there because I LOVE trying new restaurants.  It's also so great to have new places in our neighborhood.  I'm still rooting for them, but they've got to more clearly define their brand/food identity and refine their execution.", "Date": "2012-07-06", "Author_Location": "Minneapolis, MN"}, {"Author": "Rhonda D.", "ReviewID": "aDEg75d_4Csl492en86lOQ", "Overall": "5.0", "Content": "We ate at this restaurant for lunch.  What a fabulous find.  I am a vegetarian and am very picky about veggie burgers.  Icehouse's was DELICIOUS.  My fiancee is not a vegetarian and loved, loved, loved his Ruben. We also loved the pear cake and chocolate cake.  We found it refreshing that the chef/owner was very accessible and schmoozed with us for a very long time.  We can;t wait to go back, and we especially can;t wait for their patio to open..  We will be returning very, very soon.", "Date": "2013-02-13", "Author_Location": "Minneapolis, MN"}, {"Author": "Dane W.", "ReviewID": "Wa2PZcTVieGmmISGQGk1PA", "Overall": "4.0", "Content": "Coolish vibe in a sort of yuppy way, but the five-dollar sipping shots are worth the trip. Basically the concept is that you order a shot-sized cocktail, which at first sounds like you're going to be drinking shooters, but then you realize they're really interesting mixology concoctions. Some work, some don't, but generally they are all worth a try. And the other nice thing is that the drinks are a healthy size--much larger than a shot and in some cases really the size of an actual cocktail. It's a great deal and a fun way to sample a bunch of different booze combinations.", "Date": "2012-08-01", "Author_Location": "New York, NY"}, {"Author": "Julie S.", "ReviewID": "qoS6GlHdQXOrBeyYw9iUyA", "Overall": "5.0", "Content": "Love, love, love this place. Highlights-great layout so it feels roomy even when its busy. Casual vibe with upscale bevvies and an unusual yet unpretentious menu, I was there for happy hour so just had the meatballs and the \"dawg of the day\" both were way beyond my expectations and can't wait to go back for dinner. Our server was very friendly and attentive. Can't see any real drawbacks to this place.", "Date": "2012-06-28", "Author_Location": "Minneapolis, MN"}, {"Author": "Mac G.", "ReviewID": "lBDssWzhLz7OiSsdxT3cSw", "Overall": "5.0", "Content": "This place made me feel like I hit the trifecta; great food, music and drinks! What an amazing vibe Icehouse has. We went on a Friday night and a bass and keyboard player set the tone for a wonderful evening. I had the grass-fed beef with roasted marrow and also the shrimp with potato risotto and basil. Absolutely delightful flavors. The waiter was kind enough to box up the bone for my dog and later he even brought me another one with the marrow included! How about that for service? My dining companions had the salmon trio and cheesesteak and they raved about those as well. Desserts were delectable! The drinks were \"stiff\" and tasty. I loved the big, perfectly formed cubed ice in the drinks. I've been to most of the best restaurants in Minneapolis and I think we have a rising star on our hands with the Icehouse. Highly recommended!!!!", "Date": "2012-06-29", "Author_Location": "Lakeville, MN"}, {"Author": "Sopheak S.", "ReviewID": "_VHDhy1kJEXCKk2_litXjA", "Overall": "5.0", "Content": "I've been to Icehouse several times, and I recently came with a large 20+ person group for my birthday. Being that it was a Sunday evening when they serve a limited selection of food from their late night menu, I was a little nervous that people might not be able to find something that they would like to eat, or that there might not be enough for people to eat. I was wrong because everything we ordered was delicious. Plus, the service was superb and quite prompt, the ambiance was pretty nice and chill, and the live music was great!The chicken wings were among my favorites. They're seasoned with a pretty tasty dry rub. I also really liked the nachos (and I normally don't like nachos). For drinks, I'd recommend just about any of the $5 cocktails. The $1 Colonel Mustard is fun too!", "Date": "2012-07-10", "Author_Location": "Minneapolis, MN"}, {"Author": "Willa W.", "ReviewID": "QKEZDH7sg8A9UlFe02_SXw", "Overall": "5.0", "Content": "My husband and I went to Icehouse for lunch on a Friday. The very friendly host greeted us when we walked in and told us we could sit anywhere. So right away, I'm very happy. I love choosing my own table. Why can't more restaurants extend this same courtesy during not-so-busy times? We sat next to one of the huge windows in the back, basking in the all-too-rare Minnesota winter sunshine, and, in no time, we were sipping a delicious and hoppy brew from Indeed while we looked over the menu. Our server was fantastic. Attentive but not intrusive. Happy to answer our questions, but not unnecessarily chatty. I had the short rib stroganoff and my husband had the salmon. Both were fantastic: very flavorful, prepared perfectly, and just-the-right size. We were full, but not stuffed. Great service. Great food. Great atmosphere.", "Date": "2013-02-09", "Author_Location": "Minneapolis, MN"}, {"Author": "Summer B.", "ReviewID": "O9gldBlREiYuJ46Mmq-25Q", "Overall": "3.0", "Content": "I was very pleased with the atmosphere and the drinks. they were tasty and beautiful. I was not pleased with the service. I was there last night and the waitress seemed a bit lost. she first of all thought that my drink i wanted wasn't on the menu. (it was a classic martini). then when i had finished my drink she asked if i wanted another one and i asked for a minute to pick one out and she never came back.  by the time she came back it was getting late and my friend and i really needed to go. very disappointed by that, it wasn't even busy.", "Date": "2012-06-27", "Author_Location": "Minneapolis, MN"}, {"Author": "Ted H.", "ReviewID": "BNOuNdYrTW0hFjF1YkMI_w", "Overall": "2.0", "Content": "Maybe we hit dinner the wrong night. An attractive menu on line unfortunately they didn't update their menu and to our disappointment when we arrived. Still the new menu looked attractive however they couldn't executed the food promised on the menu. The small plates were good and the entrees were not. The execution of the kitchen was off. Fries were cold - sent back,the burger was suppose to be med rare came out medium well - lukewarm and foie gras over seared - lamb was cold - sent back however the medley under it was very tasty. The Gnocchi for $17 was 6-7 small pieces, however very good and the fried chicken new menu item - yuck. After spending  $160.00 for 4 people  (no alcohol or dessert) we, as a table concurred that the talents in the kitchen can not meet the menu. The table of 4 next to us had even more problems. Missing mussels in a seafood dish and vegetables that were suppose to be on the plate.Too bad because our waiter was knowledgeable, the building and environment is cooland you want a place like this to succeed. There isn't a vibe like at Butcher and Boar, Travail, etc. leaving only results to whine about. Ted", "Date": "2013-07-22", "Author_Location": "Minneapolis, MN"}, {"Author": "Janna S.", "ReviewID": "B1s57QBPl7TqPouPDmQwxA", "Overall": "4.0", "Content": "I went there for dinner with a few friends. Our service was great, the food was delicious--though a bit pricey. It would be nice if there were some sandwich options. Which they could do well since they are the owners of Be'witched. And the $5 'shot' cocktails were a great value. We left before the late night music started. But I am eager to go back and check out the nightlife scene.", "Date": "2012-11-21", "Author_Location": "Minneapolis, MN"}, {"Author": "Frank G.", "ReviewID": "t5e4iTPSYdjkDrIWcIWTKA", "Overall": "5.0", "Content": "It has been the second time that we went to Icehouse. First time i had there Reuben sandwich and it was fantastic..House made corned Beef and homemade bread made this ONE of the BEST in the Twin Cities!! We went back one week later and i had the brisket sandwich with a side salad and a Indded Daytriper beer which was awesome!!! They just started carrying 612 beer Rated R IPA was was  Fantastic!! We had the Chocolate Pie and a pear dessert which rocked. It was GREAT talking to Matt and Brian.. They run a GREAT restaurant... Looking forward to going there for dinner and hearing some live music.. We left for the second time and they WOWED  us again..Can not wait to go back...", "Date": "2013-02-22", "Author_Location": "Minneapolis, MN"}, {"Author": "Lauren S.", "ReviewID": "P1iOe-O4dQKy8RkcHkq45A", "Overall": "4.0", "Content": "This could be my new favorite place. First off it is a visually stunning restaurant- very hip and cool atmosphere. Wish the bar was a bit bigger so when you wait for a table you weren't smushed in. The drinks are fabulous and I am feeling it today. We would go back just for the bar and live music. The food was really good. The lamb casserole was a hit with all of us. The chicken was very tasty. Mixed reviews from our table on the ribs. I liked them. The egggplant canneloni was good. The French Silk pie was delish and I don't even like French Silk pie. Excited to go back and try something different. Wish we had stayed for the second round of music but the drinks were getting the better of us. I am so excited for this restaurant to be a huge success. Met the owner Brian and really appreciated the time he took to chat with us. It makes such a huge difference and we will spread the word. Next time it's going to be the spot for a girls night. Can't wait!!", "Date": "2012-09-23", "Author_Location": "Minneapolis, MN"}, {"Author": "Philip C.", "ReviewID": "7gi1lW4Wz84Ae_8ALlaWtA", "Overall": "3.0", "Content": "Went to see Van Stee's CD release this weekend and I was impressed with the venue. I will say the venue was not the best setup for a show as it was more catered to the restaurant service. The bar was set back in by the front of the building and had a galley style seating area right across, which made the bar very packed. It wasn't terrible to get drinks but still somewhat of an inconvenience. Additionally, there were a lot of tables placed awkwardly around the stage which made for watching the band a bit harder as you had to try and find a nice nook to stand if you were not there early enough to get a table. The beer selection was great; they had a lot of MN beers and the specialty drinks looks great as well. I was told by another patron to try the Little Richard, in which they floated a picture of Little Richard in your drink. Overall I was impressed; I thought the bar décor was awesome, and I will defiantly be back to try out the dining experience sometime soon.", "Date": "2013-03-04", "Author_Location": "Minneapolis, MN"}, {"Author": "L C.", "ReviewID": "URVkEwXGq_O4Wm6R1iepaw", "Overall": "2.0", "Content": "Third trip to The Icehouse, all 3 occasions for drinks and dinner right at the transition from the bar to the dinner menu. The first 2 experiences, mediocre food and great service - it was clear the kitchen was struggling with getting food out (odd given the place was 2/3 empty), this can be frustrating for the waitstaff, but on both occasions the women were engaging and fun. The third time back, consistent in terms of mediocre food and a long wait for food in a half empty restaurant/bar, but this time the service, well, it was odd. The gentleman was clearly only half there - we had to remind him several times of things we ordered, but didn't receive. In addition, he simply lacked any social skills, mumbled when speaking, no smile, no basic manners when a 'please' or 'thank you' was appropriate. After we'd finished dinner, they needed to move us from the dining room to the bar as our table was needed for a large reservation - no problem, the manager offered a drink on the house for any inconvenience.  But as we were getting up to move, our waiter mentions, 'they've been on me for the last half hour asking if you're going to order more food or if your leaving or what'. So strange, as we'd been essentially ready to go for 20 minutes but waiting for him to bring the bill. There are simply too many alternatives in the Twin Cities, and, in THAT neighborhood, that offer better food and service.", "Date": "2013-01-27", "Author_Location": "Longfellow, Minneapolis, MN"}, {"Author": "Mpls A.", "ReviewID": "oUG6zHzm73b_EPbUm8_NjQ", "Overall": "5.0", "Content": "Good food, great cocktails and A+ staff.  Whether going for a small nosh or a morning bloody, all of our experiences at Icehouse have been better then the prior.  They also may take the cake for the best bloody in town. Nice to see Eat Street coming back stronger!", "Date": "2012-08-13", "Author_Location": "Minneapolis, MN"}, {"Author": "Katharine L.", "ReviewID": "Fuyo7_msdVXfp8oznJ6-ew", "Overall": "3.0", "Content": "Pretty good food; slow service. Dynamite french fries, but skip the tobacco ice cream (it is foul).", "Date": "2012-12-26", "Author_Location": "Minneapolis, MN"}, {"Author": "Jill R.", "ReviewID": "fG79an_z6yb7rJXApA8ZtA", "Overall": "4.0", "Content": "Food was great! Atmosphere and decor awesome. Service extremely slow. Great place to go with a group or if you have all night for conversation. A jazz band started playing just when we were finishing dinner. Pretty sure they were all high on something...", "Date": "2012-09-04", "Author_Location": "Green Bay, WI"}, {"Author": "Jacob S.", "ReviewID": "UwrWl6jQDaFa2rrm6PidOw", "Overall": "5.0", "Content": "Great place.  Wonderful food, nice outdoor seating, decent prices.  Drinks are overpriced, but they're creative, and there are cheap beer options too.", "Date": "2012-07-29", "Author_Location": "Houston, TX"}, {"Author": "Colleen S.", "ReviewID": "4aZgh48qvvGf68nKBFnjmg", "Overall": "4.0", "Content": "As a long time fan of Be'Wiched Deli in the North Loop, I've been eagerly awaiting Mike and Matt's new restaurant.  Our first meal here was very good across the board.I had the house salad which was simple but with great layered flavors and very fresh greens.  My husband couldn't decide between the duck and the grass fed beef, so he got them both! The portions aren't huge but the quality is so high that you savor each bite much more than you would at a typical restaurant.  I could see him resisting licking both plates after he finished because they were sooo good.  I had the lobster fettucini which was a good portion size with 2 large pieces of lobster (tail and claw) sitting right on top. None of those tiny nibblets of lobster you might find at another restaurant.  Our only advice would be to serve a little bread on the side because all the dishes had such well developed sauces that it was a shame to leave any of it behind on the plate, and soaking them up with bread would have been heavenly. Alas.Our luck was high because shortly after he polished off the duck and beef, the kitchen accidentally made an extra duck plate and brought it to us! I finally got to try a little bit of everything and it was heavenly. I'm usually disappointed in the non-alcoholic beverage selection at restaurants, but they actually had a number of good options (I think I had a ginger limeade, but it's not listed on their website menu, so I can't be sure.)  I want to try everything on their dessert menu, but started with the blueberry pie with sweet corn ice cream. The flavors worked well together for a solid dessert, though I prefer a thinner, flaky crust and this was a bit dense. Not a deal breaker though.Only semi-complaint was that it took a while before anyone came to greet us or bring us water once we were seated. The waiter was a little bit of an odd duck and seemed nervous or maybe he's just an awkward guy, but once we got used to his personality it was all good. He did provide solid service throughout the evening. As an interior designer, I really enjoyed the decor and atmosphere Shelter Architecture created throughout the space. Looking forward to a return visit.", "Date": "2012-07-17", "Author_Location": "Minneapolis, MN"}, {"Author": "Kai T.", "ReviewID": "uHj2U7ZRjG74Ao1NXzVWZQ", "Overall": "5.0", "Content": "The Service is phenomenal and it amazes me that EVERYTHING I have eaten there is wonderful. Truly, a gem.", "Date": "2012-07-15", "Author_Location": "Minneapolis, MN"}], "RestaurantInfo": {"RestaurantID": "_lgiMFJy51yTCfz6wJcbPQ", "Name": "Icehouse", "Price": "$$", "RestaurantURL": "/biz/icehouse-minneapolis", "Longitude": " -93.27839799999999", "Address": "2528 Nicollet AveMinneapolis, MN 55404", "Latitude": " 44.956194000000004", "ImgURL": "//s3-media4.fl.yelpcdn.com/bphoto/Drfj_yN9xYa8oD1BKrVYyA/90s.jpg"}}