{"Reviews": [{"Author": "Sahil D.", "ReviewID": "FEmeqMLgCX8ApQNDb1YOoA", "Overall": "4.0", "Content": "Taco Mac is a good go-to bar/restaurant. They have a lot of drafts and I love to try new ones for beer club. Nachos and tmi wings are my favorite. I also really love their fries and blu chz dressing. Busy on Thursdays bc of pint night but you get a free glass if you try the featured brew. It's fun. It may be a stereotypical corporate sports bar but I like that about this place. It is quality.", "Date": "2014-06-05", "Author_Location": "Midtown, Atlanta, GA"}, {"Author": "Nikkole K.", "ReviewID": "pDygcUtUVEploLKw6cBp4g", "Overall": "3.0", "Content": "The food was great. I love the queso all the time but tonight I could not enjoy it because it came out at the same time as the food. I asked for my wings extra crispy and they weren't crispy at all! I got three mile island sauce because that's the only good one (mild medium and hot are all the same sauce) but they needed to be wetter. The server told my friend she couldn't try the sauces because he was too busy but he wasn't too busy to hang out at the hostess stand. He barely checked back on us. And messed our checks up. The location is too good to have okay servers.", "Date": "2014-07-19", "Author_Location": "Alpharetta, GA"}, {"Author": "Joe D.", "ReviewID": "NU883f6G-INFl3SLVsh3Ow", "Overall": "1.0", "Content": "I have had a yelp account for years and have never needed to write a review until now I am tired of the poor management of this location. I am a brewniversity member with approx 165 beers, I have spent a lot of money at taco macs but this fails to meet all expectations. After last night I have decided that if I want taco Mac I'll just go to Decatur where I get great service. Walked into the metropolis location just after the USA soccer game ended and it was packed but people were started the clear out by the masses. We put our name on the list for a 4 top. They said 50 minutes but with so many people leaving it was bound to be shorter than that. We walked up to bar and got a beer with in ten minutes of being  there 3/4 of the restaurant was empty with dirty tables. After 15 minutes half of the tables had been cleaned. I then walked up to the host stand to see where we were at in line as doing so I noticed a couple of servers just siting at various tables doing nothing. Got to the host stand they said we were 5th in line. I waited another 10 minutes with 3/4 of the restaurant emptied and cleared and still not sat I was pissed and myself and the group had had enough. We decided to cut our losses and give our business to the vortex which was awesome. The whole time this was going on I didn't see a manager at all. I have dined in this location many times and the service is always slow and horrendous. They never have updated daily beer lists the only time you ever see the management staff is when you walk by the office to go to the bathroom. If you are looking for a slow moving service this is your place. Judging by some of the recent reviews it seems that people have been experiencing similar experiences as mine. Looks like management is doing nothing to change this.Think twice before visiting this Taco Mac!", "Date": "2014-06-23", "Author_Location": "Canton, GA"}, {"Author": "Kelsi V.", "ReviewID": "SDgTo3NVBG9LVj9sTaNIwQ", "Overall": "3.0", "Content": "Food is okay at best. I don't even like the wings.. All the sauces are no bueno. However, it is a cool place to have some drinks and watch a game. I still avoid this as an option due to the food if I can help it.", "Date": "2014-06-08", "Author_Location": "Atlanta, GA"}, {"Author": "John B.", "ReviewID": "8yJSL0FsryJI85tD0qeDKw", "Overall": "3.0", "Content": "I went here the other evening for a late night snack and wing-tasting challenge (okay, self imposed wing tasting challenge). Ultimately, we had a good time though our waiter Jeremiah was a bit slow delivering silverware and water. I ordered 3 Mile Island and Habanero BBQ wings, and enjoyed both with Blue Cheese (though I believe I ordered Ranch, but no biggie -- it's all carbon, you know?). They were quite mouth scorching and complimented each other well. It was a late evening and even though our waiter was slow, we had a good time. Dessert was served as a smore cake concoction  and was delicious. Ultimately, the waiter sold us on ice cream but from my understanding they were out. If I had to rank wings in Atlanta thus far, it would go 1.) 3 Dollar Cafe/R.Thomas and 2.) Taco Mac  3.) Wing Factory", "Date": "2014-05-23", "Author_Location": "Midtown, Atlanta, GA"}, {"Author": "Ruben B.", "ReviewID": "KWrZ77OXK6IOsSLEGxoRiA", "Overall": "5.0", "Content": "I love this place, friendly staff and good food. I have been here several times with friends. The drinks are out of this world.I ordered the Grilled chicken ranch wrap.It was so good. I will be more and more, awesome!!!", "Date": "2014-06-03", "Author_Location": "Midtown, Atlanta, GA"}, {"Author": "Travis H.", "ReviewID": "yBX2JrL1LXXiDVjB7tbB3w", "Overall": "5.0", "Content": "This place has so many beers on tap, it will make your head spin! Was waiting for our tour of the Margret Mitchell house to start and thought we would grab a quick bite. Sat at the bar, the bartender was great and very friendly. Would come here again!", "Date": "2014-06-17", "Author_Location": "Fresno, CA"}, {"Author": "Jake G.", "ReviewID": "JGQV4_iIzsw2kr9Qo-McUg", "Overall": "4.0", "Content": "Upgrading to 4 stars - Taco Mac has some of the best wings around. Their death wings are AMAZING! They also honor their advertised hours, unlike Vortex, which is a big deal to me.I never like to go somewhere right before close but we were running late and ended up here right before close (around 2 AM), and they were totally willing to serve us even though they let us know to come in earlier next time. I really appreciated that because Vortex, who advertises an hour later closing time, was closed when we went there first, hence why we went to Taco Mac.", "Date": "2014-04-21", "Author_Location": "Atlanta, GA"}, {"Author": "Kevin B.", "ReviewID": "gJeQ1TQoOBsZea2_kFT88A", "Overall": "2.0", "Content": "The food was good and the waitress was nice, BUT the bartender must Honey Badger (don't give a shit)...because it took 30 minutes for our table to get beers. Really? All it takes is a pull of the tap. Lame", "Date": "2014-05-25", "Author_Location": "Alexandria, VA"}, {"Author": "Nathan K.", "ReviewID": "KLXFj6HH88ZbBhnqYQ513g", "Overall": "2.0", "Content": "Few things- hostess not so greetingServer- took 5+ minutes to come say hello and not busyFood- salt key ingredient but I get it you're a sports bar and make your money on beer sales not good food. Ordered a burrito dish that already had rice and beans in it so why does it come on side also? Overkill on size of portions. Enough said-- moving on. No recommendation here.", "Date": "2014-04-17", "Author_Location": "Los Angeles, CA"}, {"Author": "Chris B.", "ReviewID": "MPTnBUtEgWRBYyAr6tv-Xg", "Overall": "2.0", "Content": "This review is based solely one the particular occasion. Taco Mac over the 3 plus years has become less of a sports bar and more along the lines of a lounge which happens to have a great beer selection. I had a single(10 pc) three mile island-roasted, fries, and one beer-$20.I can't justify paying $10 for cold wings that took a good 30 mins to bring out. Its not that they were busy. Either the cook was slow, or the bartender forgot to put my order in. Also the fries were too crispy, i don't know if that's the new style but I miss the old style where the fries were softer and had a slightly sweet taste to them.Beer selection is always 5 stars, which is the only reason why I continue to come here. Leave for the food..stay for the beer! 2 stars!!", "Date": "2014-02-26", "Author_Location": "Decatur, GA"}, {"Author": "Robert C.", "ReviewID": "bChxyPstYavBOibsUuIlYg", "Overall": "1.0", "Content": "Horrible dinner.  I decided to try Taco Mac as I pass it often.  Bad move.  It's a bar.  It's not a restaurant.  I got a chicken fajita.  How can you make this bad.  However, everything with the fajita was old.  The tomatoes were old, the black beans were old, The chicken was old.  The lettuce was old and the fajita bread was not even heated.  My wife had the salad.  Everything was wilted.  I will never go back here.  How can you mess up a salad.  How can you mess up fajitas.  Crazy, just get fresh ingredients.  I guess the people just standing around all day explains why they are just there to collect their paychecks and not do much of anything except standing around.", "Date": "2014-06-01", "Author_Location": "Atlanta, GA"}, {"Author": "Zach H.", "ReviewID": "KoLtremK_eXfLK4A9gU_Lw", "Overall": "2.0", "Content": "I've been to Taco Mac a few more times since my last review.  They have serious issues with their staff.  Very rude people.  I'm tired of putting up with that crap.  I don't need rude people in my life; I'll just eat somewhere else.  There are millions of Americans lining up to get jobs, this is unacceptable.", "Date": "2014-06-02", "Author_Location": "Atlanta, GA"}, {"Author": "Terry F.", "ReviewID": "NzygB6KjwmqXpm4LfGATMA", "Overall": "4.0", "Content": "One of the best wing places in town.  Huge selection of beer and many chicken wings options (drums only, many sauces and sizes, etc.).  Try ordering a few \"six packs\" of wings to try as many of the flavor combos possible.Service is usually good, but the last time I was there, we saw the serve like 3 times during our hour-long visit.  So, obviously, they need to staff up a bit.Located right on Peachtree Street and a short walk from the Midtown MARTA station.", "Date": "2014-02-25", "Author_Location": "East Point, GA"}, {"Author": "Garett B.", "ReviewID": "a0FAngTtLF2njPKn4PNhvg", "Overall": "5.0", "Content": "This is my 3rd visit in 2 days I'm on vacation. I've eaten at many restaurants in the area over the last week and this has been my favorite. The service has been amazing on all 3 visits. The first visit I had the chicken burrito which was amazing.  The 2nd was the six pack of wings with sweet hickory sauce. And the 3rd I just had chips and queso and a couple beers. Each visit I had a couple beers. The beer list is huge which was nice to try new things. I recommend anything from sweet water brewery. I had 3 different servers I sat at the bar and in the restaurant great service every time. I wish we has one of these where I live!", "Date": "2014-03-31", "Author_Location": "Spokane, WA"}, {"Author": "Andrew G.", "ReviewID": "5zn_y6uRqTzpizOpc8qKFQ", "Overall": "3.0", "Content": "3 Stars for the beer selection.  The wings are OK, not great, maybe better than BWW, but not on the caliber of a Duff's.The salad was fresh, the bleu cheese dressing had large chunks of blue which was nice.  The chicken was overdone and a little dry.Next time I'm at a convention I'll give another try, cause they're still better than the food on the floor!", "Date": "2014-03-21", "Author_Location": "Mansfield, TX"}, {"Author": "Brian A.", "ReviewID": "FL98C3WzovsOROQxMP_B-Q", "Overall": "2.0", "Content": "Meh.  Great selection of beer on tap, but food was sub par.....Chicken Quesadilla was dry and the boneless wings were cold, they were not busy as I was one of about 5 at the bar on a Monday night.I only stopped there because I was desperate for food after the cross country flight.I don't think I would go back.", "Date": "2014-03-05", "Author_Location": "Issaquah, WA"}, {"Author": "Vishal P.", "ReviewID": "4Mu_p7w_mq6Z5a6JThSyug", "Overall": "4.0", "Content": "Sports bar with dozens of TVs, plenty of seating, and a HUGE beer list.You want to come here to watch any game or fight on TV.... just ask the waiter to change the channel for you!", "Date": "2013-12-24", "Author_Location": "Morris Plains, NJ"}, {"Author": "Tariq P.", "ReviewID": "SB_k_KpAKxgipN5i09XBPw", "Overall": "3.0", "Content": "It's a common place decently priced and just a good location nothing more nothing less good with a few bros might see a few chicks but it's not a go out on a date spot trust me!!", "Date": "2014-05-12", "Author_Location": "Los Angeles, CA"}, {"Author": "Matt D.", "ReviewID": "AL1QG3qyPe7OOlJFBfdJOw", "Overall": "3.0", "Content": "Friends were in the mood for Tacos so we ate here while on business.  We asked what they were known for and our waiter said wings.  Not what we were expecting from a place with Taco in the name.  The food was pretty good and despite it being responsibly busy and being on a time crunch the food came fast and quick.  There are no shortage of tvs view.  It would be disorienting if it wasn't so awesome.", "Date": "2014-05-15", "Author_Location": "Plainfield, IN"}, {"Author": "Anushree K.", "ReviewID": "LjC6qvAogSDuGU1RS4uoqg", "Overall": "5.0", "Content": "Good food and good service.. And I say this even though once a waitress dropped a taco all over me...Absolutely love the salsa and the queso.. The vegetable quesadilla was perfect so was the tacoGood for late night dinners as I guess its open till 2.30am..", "Date": "2014-02-18", "Author_Location": "Atlanta, GA"}, {"Author": "Lindy F.", "ReviewID": "1490lP_iHZAwtWL1uUXyLA", "Overall": "3.0", "Content": "\"Bring us a pitcher of beer every seven minutes until someone passes out, then bring one every ten.\" -- Back to School (1986)Probably the slowest Taco Mac in town, and I'm not sure why.  I've been here a dozen times and the place is always teeming with staffers (you can tell by their t-shirts), but none of them seem to want to help.  It doesn't seem to matter if it is a small group of 2-3 or a large group of 12-20; it takes forever just to get your drinks in the first place, not to mention any refills.  I will say, on par with other TMs, the beer selection is extensive (and Brewniversity program is great).  However, the food is hit or miss.  I love the taco salad, nachos and wings.  However, the sandwiches are always a disappointment as are the fries.  I do enjoy their queso dip as well.There are plenty of TVs to watch whatever game you are looking to see, but be prepared to spend hours here to have a good meal.If I could award a 2.5 star review, I would.", "Date": "2013-11-09", "Author_Location": "Atlanta, GA"}, {"Author": "John S.", "ReviewID": "_PLvXfvDDY8unHh5N0ow7g", "Overall": "1.0", "Content": "I've been to Taco Mac a few times before at different locations and I always had good experiences on my stays in Atlanta.  However, this location really sucked it up.  As a disclaimer, I'll say that the restaurant was busy because it was during the Falcons game.  However, the customer service received from the front-desk hosting staff was absolutely inexcusable.My friend and I waited in front of the desk for 7-8 minutes while the staff did not acknowledge us once.  Both my friend and I have worked in the food service industry from lowly waiters to owners of our own restaurants.  We realize that restaurants get slammed and that there's few things as stressful as dealing with irate, hungry patrons.  We are reasonable people and we would've been fine waiting as long as we got a \"I'll be right with you\" or a \"Can you please wait for one minute?\"  Instead radio silence...After waiting for the aforementioned time, my patience had finally worn thin and asking to be addressed as a human being, I was interrupted by the female host with one finger up in the air and a \"I'll be with you in a minute\".  Wow...  I'm not a violent man by nature (irrespective of all the times I listen to \"Night Fever\" and walk the mean streets of Los Angeles) but it took all I had to restrain myself from screaming at the entire host stand.  Instead, I said, \"Fuck these motherfuckers\" and my buddy and I went down the street to Jimmy Johns.  Seemed like the hostess then had some choice words to say, but alas, the time for conversation had long passed.There were two young hosts and a manager there and none of them went to any lengths to address us for an extended period of time.  This is an egregious violation of basic restaurant service (and just being a regular human being) and I strongly urge Taco Mac's managerial staff to address these issues.", "Date": "2013-10-31", "Author_Location": "Beverly Hills, CA"}, {"Author": "Michael A.", "ReviewID": "xiA3WeHD5s_ikTouxLNlDQ", "Overall": "1.0", "Content": "Oh. My. God. The wait here was so cruel!!!!!! I wont get into detail but it was so bad that I actually had to talk to the manager. Oh my jesus. I'll never come back here. Rarely will I ever want to wait 30 minutes to be seated, another 30 minutes to get water, another 30 minutes to place our order, an hour for the food, and another 30 minutes to get silverware after the food has already come out.Wow.", "Date": "2013-10-27", "Author_Location": "Irvine, CA"}, {"Author": "Golden M.", "ReviewID": "mqgNA-QFI0mbss8js1pXWg", "Overall": "5.0", "Content": "I didn't go to Taco Mac my first few years in ATL because i thought they sold Tacos there.And then I went. And the world became better.I've been to every location in the Atlanta Metro and I'm yet to be disappointed. One time the waitress slipped and spilled some cold drinks on me. I was still happy.Do you see where i'm going with this?TV's, Nice environment, friendly and relatively quick service. The food is good. This has always been a win for me.", "Date": "2014-01-12", "Author_Location": "Atlanta, GA"}, {"Author": "Ashley E.", "ReviewID": "wPFTzjAWQZC_uWat1H84mw", "Overall": "1.0", "Content": "Worst service ever. Seriously, this place blows. Waited forEVER for food order, then once we put it in it took well over 1/2 an hour to even get them. For chips. Chips! Don't come here.", "Date": "2014-03-20", "Author_Location": "Orlando, FL"}, {"Author": "Jackie H.", "ReviewID": "TZmEdo5v7KNPxQAvyaQ6RQ", "Overall": "3.0", "Content": "I like this TM right on Peachtree and across from Hudson Grill.  What I like the most are all the tvs all over the place.  I'm always scouting for a good place to watch my Dirty Birds and this place fits the bill.  It's spacious and has natural light and tvs eerrrrrrrrwhere.Now the parking.  Apparently they will give you one hour free and then you pay what seemed to me to be about $10 to $12 if you stay for 4+ hours like I did (watching a game).  But holy Batman and Robin, the parking lever went up and let us out for free!  Win!  Next time I go, I'll need some clarification on that parking situation because I'm not the one who pays dollars for parking (somebody else was gonna pay that).  I sure hope they find a way to make it free like, uh huhm, Hudson across the street.  I will, not go to your restaurant because you make me pay to park.  I will.Anyway, service was pretty good and I have enjoyed a good burger and some wings a time or two.  Not a bad spot. Oh, I like that I can get a frozen margarita here too.  Plus.", "Date": "2013-09-13", "Author_Location": "Atlanta, GA"}, {"Author": "Korey M.", "ReviewID": "2BwGgQI1QgzGbxtfX0X3ZA", "Overall": "2.0", "Content": "Huge sports bar with tons of TVs, lots of beers on draft, and a monster menu with tons of options to eat....sounds great on paper right?Well it is not quite as good as I had hoped, and yet I still return solely because it is a good location.The food is subpar, sometimes cold, pretty overpriced for the frozen food quality. The service is slow, at best. The beer selection is good, but many selections(namely IPA's) that need to be drank fresh, are usually old and not tasting as good as before.The main reason I go here is to watch sports if Hudson Grille across the street is too crowded, and yet every time I leave this place disappointed.", "Date": "2014-01-21", "Author_Location": "Atlanta, GA"}, {"Author": "Tony G.", "ReviewID": "QH-hhOU075uJRoGtRDTNdQ", "Overall": "5.0", "Content": "Wonderful establishment. It's true the food isn't the greatest ever, but that's not why anyone should come here. If you make a trip to this establishment, understand that it should be an endeavor based around drinking. Not drinking cocktails, either. This is a bar for beer. After creating a \"Brewniversity\" account, I find myself here every Sunday. Sitting at the bar, I'm faced with over 100 beers on tap. They have everything from the typical cheap beer, to the fancy exotic beers you've never heard of. The service is friendly, and usually above par. The bartenders are always happy to make recommendations on drinks and food. Really a great bar to visit with a friend and hang out at for a few hours.", "Date": "2014-04-24", "Author_Location": "Atlanta, GA"}, {"Author": "John W.", "ReviewID": "eoTfaOboOwhTpvPuNPs1nA", "Overall": "4.0", "Content": "This is a typical Taco Mac. Great wings, great beer selection... But the only thing is that they do not go through their kegs as fast as other TMs. So some beer has been sitting there awhile or will take up a tap spot for a while. That can be to your advantage if there was a beer you were wanting to try and thought it might sell out fast. Close to the MARTA station. They have some nice beer events here too that are not offered at other TMs.", "Date": "2014-04-13", "Author_Location": "Reno, NV"}, {"Author": "Jason B.", "ReviewID": "bGkAzohqDk6KKt1QlhGHPg", "Overall": "1.0", "Content": "I usually have a great time at this location, but not this past Sunday. The bartender forgot about us during shift change. Nobody checked on us for damn near 40 minutes. I doubt I sit at the bar at this location again.", "Date": "2014-03-11", "Author_Location": "Atlanta, GA"}, {"Author": "Kendall H.", "ReviewID": "28NYzl_aiU505JfT8sKrAA", "Overall": "2.0", "Content": "I cannot express how much I dislike this establishment.  The service has always been terrible, the servers have been rude, the food is so-so, and on average, it takes about 30 minutes to get a drink.  I wish my husband didn't love this place because I'd never go back!", "Date": "2014-03-25", "Author_Location": "Atlanta, GA"}, {"Author": "Mariel J.", "ReviewID": "VpusN5InqrX2byLKstIfSQ", "Overall": "4.0", "Content": "I haven't been in Atlanta long, but Taco Mac has become my go to place at the end of a long work day when I'm looking for somewhere really casual to just kick back. It conveniently located right by the Midtown MARTA station, so you don't have to go far. It's got lots of space, so you don't need to wait to be seated. And it has lots of TVs, so if you want to zone out and watch the game, you can do that, too. The only things I've ever ordered here (and I've visited multiple times) are wings, nachos, and beer. Relaxed atmosphere, good service, solid wings and nachos, and a great beer selection = perfect after-work combo.", "Date": "2013-09-10", "Author_Location": "Atlanta, GA"}, {"Author": "Felix C.", "ReviewID": "KuqmaYDz4ziyXHY3kzMxQw", "Overall": "4.0", "Content": "A new addition for Fall 2013: Roasted wingsThe roasted wings give you a non-fried option for your sports-watching pleasure", "Date": "2013-09-02", "Author_Location": "Atlanta, GA"}, {"Author": "Rashmi A.", "ReviewID": "WjgshudYf1qVM7b_NwH30Q", "Overall": "5.0", "Content": "This place. Beer and wings, both super awesome and you can't go wrong with them if you're not sure about what you're going to order! Very accessible for students from Georgia tech and anyone who is in the midtown Atlanta area. The long island iced tea and the apple martini are my regular drinks here and I can vouch for their great value. This place has a full bar, and so they pretty much do all cocktails. The waiting time to be seated may be overwhelming during weekends and busy days, so you might have to make the compromise there. If you ask me I'll say go for it! :)", "Date": "2013-11-24", "Author_Location": "Atlanta, GA"}, {"Author": "Amanda D.", "ReviewID": "m8xXj1_KZ-SHXZCZtyh4tw", "Overall": "3.0", "Content": "This is another one of those times I wish half stars were a thing. I feel bad giving 2, and it's really not 3. It's really 2.5 but like the math on the check here, I have to round up.Ok people seem kind of confused about the parking validation thing: it's one hour. Not two, not your whole stay (unless it's an hour, somehow). I had sorted by new just to see because it was suddenly people jumping from one hour to this and yeah...it's only free for the first hour. It's pretty apparent on the Metropolis sign on the corner....which is stupid as hell. I know that's not their fault but uh...people come here to watch sports. Sports don't last an hour. That lot 2 blocks down Peachtree is $5 flat until 6am if you come at night, which helps if it goes into overtime or if you decide to go off somewhere else for hours after.So I came here to watch playoff hockey with some friends, and it was like our server was always around until we were waiting for something. And then it took him forever to bring it. And then he did the whole 18% gratuity thing because I guess us sitting there for hours makes us untrustworthy. I was kind of pissed about that because for most of the time there were only 5 of us. Only 5 of us really made up the bulk of the time, and ordered food and everything, and 2 other people came at the end and probably together spent $10. But not my problem if you only want to be tipped 18%.And do not even get me started on the splitting of the check. \"I can't split up the food,\" he said, but somehow we could all pay in amounts. And here I was like oh well we got that but now we're going to have to actually split it by the items. Oh no of course not dollar amounts worked. So we spent like 20 minutes on all this math for really no reason. Welp. Also I am pretty sure the guy who took care of the wings before he left to go see a movie paid the tax and gratuity on them and our server did not let us know that we were going to go over because of that. Nice.So yeah. This place kind of sucks if you're a group but I'm sure since it's close by for a majority of the group we will probably end up back here, blahhhhh. I'm starting us all off w/separate checks this time, I don't need that math. Though maybe after seeing Daniel B's review I can suggest Hudson Grille instead.And oh of course the food is so below average. I'm so glad we could pay over a dollar for two people to get some extra celery, because you know, celery is such a hard to find item and it's especially important to squeeze as much out of a nearly $200 check as possible. It was like maybe together they had 3 stalks of celery.Every. Time. I need to tell myself to stop eating wings here because they are always the most disappointing thing I have ever tasted.", "Date": "2013-05-05", "Author_Location": "Sandy Springs, GA"}, {"Author": "Chuck R.", "ReviewID": "jPhbaB7LPKJwAl9dEyYd8w", "Overall": "2.0", "Content": "Cold hamburger on a stale bun for lunch. Not so much.", "Date": "2014-01-30", "Author_Location": "Atlanta, GA"}, {"Author": "Ashley M.", "ReviewID": "yJ7vO_P_ldcpibfaYaToSw", "Overall": "2.0", "Content": "Because this location is adjacent to the office, I end up coming here much more than desired. The food is always....meh....and the service is always poor to mediocre. In my last experience, I dined with a  group of four other coworkers and our server seemed completely disinterested in paying more than bare minimal attention to us. I don't even think she smiled the whole time she was there.I love Taco Mac but I think this location is one of my least favorite, unfortunately.", "Date": "2013-04-12", "Author_Location": "Atlanta, GA"}, {"Author": "Shirley V.", "ReviewID": "Hj2Zx-owYQUWJ2fuP4csng", "Overall": "5.0", "Content": "We were celebrating my friends birthday we had a blast. The service was great! The drinks were Awesome!! Especially the long island iced tea.. Great atmosphere and the wings were delicious", "Date": "2014-02-15", "Author_Location": "Covington, GA"}, {"Author": "John S.", "ReviewID": "m37bSFDgQwYHu00xncJhJQ", "Overall": "2.0", "Content": "Taco Mac is an Atlanta-based restaurant and bar chain that has expanded rapidly over the years.  I like the fact that it is a successful Atlanta based startup and that they have always had a great beer selection, I occasionally visit Taco Mac around Happy Hour time when traffic is bad.Strenghts:1. Numerous TV's, all sporting events showed here, great place for large groups to hang out and drink beer.2. Excellent beer selection3. Prime location in midtownWeaknesses: 1. I question the quality and maintenance processes of the taps, lines, and equipment used to distrubute the vast quantities of beer on draught.  I have definitely ordered a beer like Sweetwater 420 or IPA (which I have had numerous times) that tasted \"off\" when it was served to me at Taco Mac.  When this happened, the bartender gladly poured me another type of beer (which did taste fine), but they should be following consistent procedures to ensure that the lines, taps, and other equipment is maintened.2. Food.  The food is forgettable at best.  Some of it is just not tastey.  Most of the food tastes like it was taken of a reefer (refridgerated) truck, placed in the freezer, and then heated and plated for the customers.  I do not know their processes exactly, but I have to imagine a lot of the food arrives frozen.  I have yet to find a menu item that is something I would recommend.  The 2 star rating is chosen mainly due to the poor food quality.  If Taco Mac would increase the food quality, this would easily be a 4 star rating.", "Date": "2012-12-27", "Author_Location": "Atlanta, GA"}, {"Author": "Bob B.", "ReviewID": "hYXt0zHWVbvSOwVTCE2bTQ", "Overall": "3.0", "Content": "Came here to take in a Braves game and happened to be the same weekend Michigan played in the Final Four, Go Blue!  This review is based on everything except food, our group ate beforehand.The place was pretty packed, but there were no problems ordering our beers from bartenders.  It was standing room only where the bar was because there were so many people watching.  It was nice though because there was ample space where you weren't jammed against one another.Great beer selection and decent prices.  For a chain it's pretty good.  I'd consider coming back if in the area.", "Date": "2013-04-23", "Author_Location": "Tampa, FL"}, {"Author": "Sarah M.", "ReviewID": "fvMjNQ8RXOMbxTauuYueMQ", "Overall": "5.0", "Content": "I've frequented Taco Mac on a couple occasions now. I love that it has such a nice beer selection. As a girl from the Brew City, it's pretty important to me. It seems as though they rotate seasonal selections, too. The first time I went, I think I ordered a burrito (quesadilla? I can't recall). Perhaps given the fact I can't recall it wasn't too memorable. Not bad, just middle of the road. We also ordered the queso and salsa. Ok, the salsa comes in a mini carafe. How cute is that? It's also really good. The queso is awesome too, however it goops up fast as it cools -- meaning you have to get it down fast. I've also tried one of their wraps -- a SW chicken one and it was spot on what I wanted. My husband and I shared it with a pitcher of Brooklyn Lager and the queso, just the right amount of food. :) Service is dece, nothing extraordinary though.", "Date": "2013-07-24", "Author_Location": "Atlanta, GA"}, {"Author": "Frank Z.", "ReviewID": "HL-egvwcmJ2uBPs0p86swg", "Overall": "3.0", "Content": "Chose to eat here prior to attending the Chick-fil-A Bowl on New Year's Eve and, as expected, it was mobbed.  I wouldn't call it enjoyable because the focus was on getting in and out - and they just wanted to turn tables.  But the burger I had was very good, the sals was exceptional, our server was as attentive as she could be, and the energy was palpable due to the pregame buzz.  My only real \"complaint\" was that the hostesses were deliberately giving out unachievable short wait times to get folks to stay.  We were told 45-50 minutes and waited 80 minutes; those coming in after us were being told 35-45 minutes, which I found unconscionable.  I will return if going to the Dome again because the food was worth it, but I found that behavior disturbing.", "Date": "2014-01-01", "Author_Location": "Covington, GA"}, {"Author": "Louann C.", "ReviewID": "zMUpeiggCB_4EogxdXxsoA", "Overall": "1.0", "Content": "Arrived on a Friday night around 11:30; service was atrocious.  Most of the empty tables (about half of the restaurant) had not been bussed.  My friend and I ordered beers; one beer was delivered; the second after the first one was consumed.  We ordered our meals and seriously the second was delivered after the first meal was consumed.  There were several waitresses but they couldn't seem to get it together.  My hummus wrap had about 25% hummus, the remainder cucumber, lettuce, tomatoes, olives & feta cheese. It was a very disappointing experience ... the worst in a VERY long time!", "Date": "2014-04-24", "Author_Location": "Allen, TX"}, {"Author": "Teresa L.", "ReviewID": "i3hTv6qeVTvo7iYeshDxFQ", "Overall": "2.0", "Content": "We waited for service for about 10 minutes.  I went to the bathroom during the time we were waiting.  It was disgusting.  What's going on in Virginia Highlands???  The bathrooms are so gross.  The toilet paper holder was attached with scotch tape.  They didn't even use duct tape!!  When I pulled the toilet paper out, the holder came off the wall.  Toilet paper was everywhere and the bathroom was dirty.  No one acknowledged our presence until we were leaving.", "Date": "2013-11-04", "Author_Location": "Atlanta, GA"}, {"Author": "Scott K.", "ReviewID": "U2uwHIOhLmMZ3gwOhmT_8w", "Overall": "2.0", "Content": "You simply must try the Taco with Macaroni and Cheese in it! It is a delight! A pure delight! Wait... what's that you say? The only macaroni and cheese Taco Mac has is on the children's menu? Whats' up with your stupid name then? Oooooh I see... you meant... like \"Mac\" Daddy! I wonder if the owners knew that the word \"Mac\" in \"Mac Daddy\" was derived from the French word \"Maqereau\"...  later used in Louisiana Creole \"Maqereau\" means \"pimp\"!Essentially they named their place \"Taco Pimp\".Which consequently... would have been a better name.", "Date": "2009-04-25", "Author_Location": "Honolulu, HI"}, {"Author": "Loren S.", "ReviewID": "tHrl235fR9YkQPqAixPlFQ", "Overall": "5.0", "Content": "Taco Mac at Metropolis has opened!  As packed and fun as the 'Mac in Virginia Highlands, but roomy with the same swanky style as the 'Mac in Lindbergh Station.Prepare yourself for great people watching, tons of high-definition TVs in every direction, a beer list that includes 140 bottled and draft varieties, and friendly, eager-to-please wait staff.  This place is a non-stop party.  Taco Mac at Metropolis is a GREAT non-smoking environment, but the manager assured me that outdoor seating will be going in for all you Marlboro fans out there.For any nay-sayers worried about new restaurant jitters, there is no need for concern about a shaky start for an untested kitchen crew.  They have the full menu going from the start, and the food is just as finger-licking good as other locations.This addition to the Taco Mac franchise builds on the can't lose reputation of the southern chain, and the midtown location (with INCREDIBLE hours!) immediately vaults this restaurant to the top of area places to be - and be seen!", "Date": "2008-04-16", "Author_Location": "Atlanta, GA"}, {"Author": "Paige N.", "ReviewID": "1pwwbQBNcHchYv08ojKC1Q", "Overall": "3.0", "Content": "Even though I've been to Taco Mac quite a few times, I'd never been to this one smack dab in the middle of Midtown / Downtown until last week.I met one of my work buddies there for a quick bite before we had a client meeting downtown a little later that afternoon.  Although I didn't have time to eat at this particular location (traffic was worse than expected), I grabbed a drink and sat with him at the bar as my friend scarfed down a chicken sandwich with avocado, secret sauce and fries.And I've eaten at other Taco Macs around the Atlanta area, so I know what the menu looks and tastes like.The Midtown location is a cool setup inside.  It's tiered to accommodate the rolling hills of Atlanta with the bar at the back and the very top and regular tables on the lower two tiers.  We were sitting at the bar (which is enormous and spans the entire back half of the restaurant) with at least 4 TVs showing various games and sports channels.  This would definitely be a sports fan's place of choice to be to watch every game at once.The bartender on duty was friendly and courteous and brought out the food and then the bill quickly (much appreciated on our part).  And off we went to our next meeting.  Thanks for being quick and convenient Taco Mac!  Nice location.Note: Parking for Taco Mac (and other stores alongside it) is located around the back of the building on 10th Street.  And if you ask at the hostess stand as you're leaving, they'll give you a parking validation ticket good for up to 2 hours.", "Date": "2012-11-01", "Author_Location": "Atlanta, GA"}, {"Author": "Rick F.", "ReviewID": "AjsO2sxGIaVtpE_c9EVE_g", "Overall": "3.0", "Content": "Cool Sports Bar with over 30 Flat Screens everywhere, you get a great view from every seat!Really good Buffalo Wings from mild to smokin hot!Over 200 Beers on Tap! plus just as many in the bottle. Amazing selection.Of course not all beers are available all the time.Roast Beef sandwich is excellent, Fiesta Black Beans not so good.I don't understand the Name, does not serve Mexican food?", "Date": "2009-08-29", "Author_Location": "Chicago, IL"}, {"Author": "L S.", "ReviewID": "Hbq8fxufmfWeqW7NaFAobg", "Overall": "4.0", "Content": "I agree with everything said - it is so nice to have a true, non skeezy sports bar in Midtown. It's a nice young crowd, good mix of people that either live in Metropolis or anywhere else up and down the main Midtown roads, or work in the area. You can find your shirt and tie boys getting off work, your group of girls grabbing a drink before a night out, or sports fans watching a game.First I have to give major props to the wonderful server, Meg. She took care of our Yelp happy hour group last night. Not only did she do it with efficiency, she did it with an almost awe inducing level of peppiness and humor. She had no problem splitting the checks of the 20 or so people that showed up. And might I mention, she somehow managed to keep track of everything we all had even though we basically switched around seats all night long. No one stayed in the same place the whole night. Yet at the end, she managed to get everything right. Kudos to YOU Meg! I hope you read this since we left you a \"You've Been Yelped\" card!This Taco Mac is a bit more modern and shiny than the other Taco Macs - the beer taps are all on one looooong wall with stainless steel behind them. So lovely and pretty. And boy does this place have the tvs - I bet they spent half their budget on high definition plasmas. Most support posts in there have a tv on every single side - that's four tvs in less than two square feet people!The food here is actually a little bit better than the other Taco Macs as well. Between our group we ordered a little bit of everything - nothing came out wrong. It's decent bar food. If you're going to a bar, get the bar food people!And my favorite, favorite thing of all: NOOOOO SMOKING!Two thumbs up for Taco Mac Midtown, I see myself coming back regularly.", "Date": "2008-05-09", "Author_Location": "San Francisco, CA"}, {"Author": "Katie W.", "ReviewID": "RYg3sDClVvJuan0Szk3Wng", "Overall": "4.0", "Content": "This is a very good sports bar.  I will definitely go here to watch sports, particularly if I am watching with a group.  It is big and spacious and shiny and new on the inside, and they offer the typical Taco Mac fabulous beer selection.  The service seems to be very friendly - I have been here twice and found our table server as well as the bartenders to be extremely pleasant.  The food is what we have all come to know and accept at Taco Mac: it's decent if you stick to basics like chips and queso dip, nachos and wings, but disappointing if you stray much further.  They also do have Photo Hunt, which is fabulous.On a Friday night, they seemed to have a big crowd most of whom were not watching a game of any sort.  I don't think I would make this my normal hangout destination (I do live much closer to Cypress Street ;) but I would happily go here to watch a sporting event on TV.  Welcome to the neighborhood, Taco Mac!", "Date": "2008-05-11", "Author_Location": "Atlanta, GA"}, {"Author": "Todd P.", "ReviewID": "na9_ccRKctdnn_4eW30NaA", "Overall": "3.0", "Content": "I had friends in town last week from Virginia and when their plane landed, I got a text: \"Virginia Tech game tonight, any great sports bars?\" The first place that came to mind was this Taco Mac location in midtown, for several reasons: 1) it's huge with flat panel TVs mounted in every direction; 2) BEER! I love the wall of beer taps they have, dozens and dozens of brews available on tap, and hundreds more in bottles or cans; 3) it's perty and shows well to out of towners. While they gawked at the VT game, sans sound since the World Series was also on and got priority (naturally), I perused the beer list as well as the food menu and settled on a Belgian white ale and an order of buffalo wings. The wings were just okay. The medium spice level was whimpy -- I need to go hot next time for sure.Random anecdote: Despite what I was recently told by an apparently misinformed Atlantan, my friends from Virginia assured me that VT's mascot the Hokie is NOT a neutered turkey. Here's the reference, for all you curious types: vt.edu/about/hokie.html", "Date": "2009-11-03", "Author_Location": "Atlanta, GA"}, {"Author": "Cheryl B.", "ReviewID": "ZhXzxZhj5WCQn7xnNiodpQ", "Overall": "4.0", "Content": "100+ beers to choose from....need I say more my friends?Probably not, but I will.  We got into ATL Thursday afternoon and after arriving at our friends home to see the Great Wall of Chamblee, do a little shopping and picking up the last ingredient needed for homemade margaritas we decided Taco Mac would be the place to watch the VT Game.As soon as we arrived we were presented with the pamphlet of beer selection....holy freak'n moly folks, what a range of offerings.  The traditional to the \"what the heck\" and beyond were included in this listing.  We decided on Butternuts Porkslap Ale - yes, that's the REAL name, as our first round.  It was a Pale Ale, very mild in flavor with not a lot of aftertaste...yummy, but tame.  We got into the smoked beer, pumpkin ale and others ... to round out our evening.Food - typical bar type - wings, burgers, burritos...it was good, just not extroadinary, which is ok since they were focused on the beer, and so were we!Unfortunately our team was losing to UNC, shame shame shame, but we drowned our sorrows in yet another unique tap and bottle offering from our server.  Customer service was good - even those that weren't working our table were attentive to our needs...nice touch Taco Mac.", "Date": "2009-10-30", "Author_Location": "Round Hill, VA"}, {"Author": "Daniel B.", "ReviewID": "WD4anv80THkWCTPwvy15Iw", "Overall": "3.0", "Content": "The good thing about this Taco Mac is its location on Peachtree St. in Midtown.  It's convenient to many shops and restaurants.  The bad thing about this Taco Mac is the parking.  There's a parking deck behind the restaurant that charges $2 per hour.  It tops off at $8 (four hours).  The restaurant validates only one hour.  So, if you come here to watch a game and decide to park in the deck, expect to shell out some cash.Like most sports bars, Taco Mac is not so much of a food destination as it is a place to gather with friends to eat, drink, unwind, and watch sports.  Like the other locations, Midtown Taco Mac has plenty of TVs so you never miss any of the action.  They use the same menu across all Taco Mac locations and it's typical bar fare -- salads, wings, tacos, burritos, burgers, and sandwiches.Their chips and salsa are no better than ones you can buy at the grocery store or get for free with your meal at Mexican restaurants.  I tried their \"signature\" Kenmore burger, which consists of sauteed onions, mushrooms, and applewood smoked bacon.  The burger was flat, the meat overcooked, and it was loaded with way too much sauce.  Needless to say, I wasn't impressed with the food, but then again, it's Taco Mac.  They do have a large beer selection, though, with over 100 on tap.The primary reason I go to Taco Mac is to watch sports and this location delivers in that department.  Unfortunately for them, Hudson Grille is located right across the street.  This is convenient for customers because if there's a wait at one sports bar, you can just walk across the street to the other.  Comparing the two directly, I think Hudson Grille has the edge because: (1) they have complimentary valet parking, (2) they carry more channels (e.g. NBA League Pass), and (3) in my experience, they have better service.", "Date": "2011-06-02", "Author_Location": "Atlanta, GA"}, {"Author": "Mike K.", "ReviewID": "rZ5_v98nRkkUyY6hB31D5Q", "Overall": "4.0", "Content": "I got my first official Atlanta Joe-juh Peach \"y'all\" in here.  We just were randomly looking for a place to eat on various streets that all seemed to be named \"Peachtree Street\" when we finally decided to eat here.  (You guys, er, y'all need to do something about the multiple Peachtree Streets thing).  We were starved after a long drive and an abortive attempt to eat at the Varsity because it had been invaded by Falcons fans post-game a la Sherman going through Georgia a few years back.  I digress.Anyway, I got a burrito and fries and really liked it.  Is it Americanized?  Of course!  But it was still good.  And I was starving.  The main attraction here would be the beer list.  It must contain about 150 beers.  I had one of the local brews (a 420 something), which was very tasty.  I'd sit in here sampling beers all day if I could.  And you have plenty of sports on the tube to entertain you.  I wonder if they show the EPL here.  Anyway, I enjoyed my visit to Taco Mac and kept talking about it the whole time I was in Hot-lanta.  Thanks y'all.", "Date": "2010-01-07", "Author_Location": "Chicago, IL"}, {"Author": "Scott M.", "ReviewID": "vGS28Yo6u9-a1dpxObYe3g", "Overall": "3.0", "Content": "So i had been meaning to hit this spot up for the last 6-8 months...and I really dont know why I had been so pressed, reading the reviews, it appears as if the food pretty much sucks...but that this actual location is nice.A midnight hunger rush got my azz out in the cold last week to check it out.  I have to admit the space is pretty nice.  Right off Peachtree, its in a pretty inconvenient spot if your not walking, you ideally have to pay for parking right in the back of the restaurant....that costs $5...$4.99 too much for me to spend, so I found parking on the street, and took a lil hike.I hit the place a lil after midnight on like a Monday.  There were probably 10 ppl in the damn restaurant, and it looked like it had gone through one hell of a Monday Night Football night...so I guess i was supposed to excuse the bar looking like crap...The bartender seemed a bit frazzled/impatient...and I know its the culture at places like these, but I tossing a menu at me, might get one tossed back at you.Anyways..i started with the Fiesta Chicken Nachos for the app, and also ordered 10 Wings Hot, wet, and extra well done as an entree.For someone that was starving, the nachos STILL sucked.  I hate when restaurants use that cheap azz dark meat in place of good white chicken breast when they think that you cant tell if its under mountain of messy cheese, refried beans, and wilted lettuce.The NACHOS WERE HORRIBLE.The wings on the other hand were quite the delight, and i have to admit some of the best wings that I have had in Atlanta...(they rank in the top 5 for sure).A tad bit expensive, but definitely, this place should be known for their wings...Ill admit to that.Service improved, as I think the bartender understood, that they were one more \"toss\" from getting a back hand...Go for the wings...seems like a great place to watch the game!", "Date": "2008-11-24", "Author_Location": "New York, NY"}, {"Author": "Frank G.", "ReviewID": "mOwphjGWetAeUyv6DFDFOQ", "Overall": "4.0", "Content": "Taco Mac is a great product.  And no, it's not Mexican!  But it is one hell of a cool sports bar.  TVs everywhere, sports bar grub, hundreds of beers and a very decently stocked bar (Crown XR?!? Shazam!) should get you in the mood for some sports watchin'.  Seats disappear fast around game time, though, so get there early.Oh wait, I guess you want specifics for this location.  We've sat at the bar a few times and the bartenders are always very patient (despite the never-ending barrage of people yelling drink orders and wanting the television changed) and take good care of everyone.  I haven't sat at a table, but the servers seem to be doing a good job and no one looked like they needed anything.YayTacoMacMidtown.", "Date": "2012-09-16", "Author_Location": "Destin, FL"}, {"Author": "Alexa g.", "ReviewID": "seA-WDdbiXOXn6eMbmkQ0A", "Overall": "4.0", "Content": "So, with 40+ reviews on Taco Mac there isn't much to say. Tons of Televisions to watch your favorite game, in every angle imaginable. *Note to self: Do not bring finacee here unless I want to sit starring blankly at the side of his head during dinner, because in fact he will be watching the game and not listening to a word I say. End note* 3 stars for the restaurant itself an extra just for our wonderful sever Josh. S, who was just so friendly an attentive!! Definitely hit up Taco Mac if you are a Beer aficionado as they have an extensive list of brews!", "Date": "2009-04-19", "Author_Location": "Atlanta, GA"}, {"Author": "Suzy D.", "ReviewID": "ynoTxLbraOytMx0NpQTmTw", "Overall": "4.0", "Content": "Taco Mac: where chicken is chicken.Yeah, I don't get it either.  Isn't chicken chicken elsewhere, too?  Maybe I don't want to know the answer to that question.A question I do know the answer to for sure: what sports bar has 140 beers on tap?  This Taco Mac does.Yes this is a chain with restaurants in Georgia, North Carolina and Tennessee.  And as such, the food is very chain-y, and they have a pretty small and generic menu.  But with dozens of TVs and 140 beers on tap, food is likely an afterthought.  It's a large restaurant with a large bar, is clean and has friendly servers.  A nice option if you're looking to drink Weihenstephaner Hefeweissbier Dunkel while simultaneously watching hockey, baseball, and women's softball.", "Date": "2012-04-12", "Author_Location": "Washington, DC"}, {"Author": "Angela M.", "ReviewID": "Yzk9vKYX0i_mab1DYDIvsw", "Overall": "4.0", "Content": "Yay for Taco Mac in my friend's building and within walking distance of Tech!  I'm so glad this place finally opened, particularly since the signs went up months ago, and I was starting to think it would never actually open.    It's all bright and shiny, which is somewhat contrary to my vision of Taco Mac, but it fits the Metropolis setting and still pours all the amazing beers.  We were there around 11 on a Friday night, and it wasn't too crowded, but my Metropolis-resident friends, who'd been there every night since it opened, said that it was the least crowded they'd seen it yet.Haven't tried the food, but it's the same menu, which I've always thought of as just average bar food.", "Date": "2008-04-29", "Author_Location": "Atlanta, GA"}, {"Author": "Erin D.", "ReviewID": "7-2hAuzf_hADl-ODUBfgiw", "Overall": "2.0", "Content": "For ambiance, this Taco Mac gets 5 stars - it's my favorite location and layout of all of the Taco Macs I've been to.Food and service was another story, though. I went with two friends of mine for dinner and our waiter was the most awkward, bumbling person I have ever met. He came to our table every .5 seconds, wringing his hands, beads of sweat dripping into my Diet Coke, sputtering: \"Um, I-I-I-I'm sorry to intrude, I just wanted to check on everything?\" I ordered the grilled salmon with veggies (I know, I know - who does that at Taco Mac), and the waiter brings out a colossal heap of cheese fries topped by a dried out square of salmon. I pointed out that the menu says the salmon comes with \"sauteed seasonal vegetables\", but the waiter said that Taco Mac is \"known for the cheese fries! Everyone likes them!\", so he substitued the veggies for no extra charge. What a sweetheart!I told him that I had wanted the veggies, and he came back with a small cup of veggies and a side plate \"to put the fish on\". I put the dried cube of salmon, which had 3 or 4 soggy cheese fries dangling from the bottom, on the plate. I managed to eat everything by drawing attention to the diverse crowd. The place is always packed, especially weekends or days where there's an event in Piedmont Park. I live in Metropolis so parking isn't an issue for me, and I was really looking forward to having a place downstairs to grab a bite now and then. I still have Vortex, Little Azio, and f20, though, and will stick with Taco Mac for the bar scene or to catch a good sports game on one of their 438526356 screens.", "Date": "2008-09-22", "Author_Location": "New York, NY"}, {"Author": "Maurice D.", "ReviewID": "4wSDubaVtarf99X2nB2tmg", "Overall": "2.0", "Content": "Taco Mac is just plain mediocre, at best! Every time I come here I leave disappointed, wishing I had gone somewhere else to spend my money. Well I won't be repeating the mistake again because I will NEVER return to a Taco Mac (not on my dime anyway).This place has crappy service and the mixed drinks and margaritas are horrid. I know this place is known for their beer selection and I do not drink beer, but they should at least be able to make a basic frozen Margarita I would think.One of their specialty summer drinks is an alcoholic raspberry lemonade and it tastes like PERFUME! Do not order it. I sent my margarita back and I almost sent the disgusting lemonade back, but I didn't want to push it.When I got the bill and saw that the server put the margarita that I did not drink on the receipt I asked her why was it not removed and she said she would have to ask her manager. The manager came to my table and asked about the Margarita drink and I told him it was nothing but foam and that I am not paying for it. So he went ahead and removed it from the bill. I do not understand why an explanation was needed in the first place though. I did not like the drink and I did not drink it so.... TAKE IT OFF MY TAB!!BAD CUSTOMER SERVICE!The wings were okay, the huge nacho platter was decent, and the cheesecake tasted like they had put too much sour cream in it. NOT GOOD!There are many better options in Atlanta folks!", "Date": "2012-06-17", "Author_Location": "Atlanta, GA"}, {"Author": "Karen R.", "ReviewID": "AmHwdWU3I73JbezmcdZTDg", "Overall": "3.0", "Content": "Great beer selection but the wait staff leaves something to be desired.  Still, it does have a great sports bar atmosphere, with TVs hanging every few feet, all with different stations.  Just find a seat near the game you want to watch and you are all set!", "Date": "2013-09-10", "Author_Location": "Charleston, SC"}, {"Author": "Taylor A.", "ReviewID": "9MAuBO6xu3o2_oA7xKS3dw", "Overall": "4.0", "Content": "I'm writing this review because of this Taco Mac's awesome new event.Tuesday Night $2.50 Mystery Beer Night!For $2.50 you get a random bottle of beer. It's that simple. And it's not just crappy beers either. This saves you about %50 off the normal price of bottles.Here's a short list of the beers we've had in the two times we've done this event.22oz Fat TireSam Adams Hefeweizen Some Scotch Ale that was awesomeBreckenridge Vanilla PorterFlying Dog IPAThe event starts at 5pm and goes to 7pm OR until they run out.It seems like every time I go here on a regular night I blow lots of money on beer while watching games. This night makes it much more affordable!Check it out!", "Date": "2010-01-25", "Author_Location": "Atlanta, GA"}, {"Author": "Laura N.", "ReviewID": "7qB6x-zhyfkjQEsaxS-24Q", "Overall": "3.0", "Content": "I feel like the quality of Taco Mac's wings are starting to go downhill.  They used to be awesome.  Today my buffalo wings were overcooked, hard, and very tough, although the seasoning was perfect and very spicy.You also have to pay to park at the Metropolis parking deck if you stay at Taco Mac for over an hour.  Taco Mac merely validates one hour of parking.", "Date": "2011-03-02", "Author_Location": "Atlanta, GA"}, {"Author": "Drew A.", "ReviewID": "qc_DNCsxwHRnERRrgRMsNQ", "Overall": "4.0", "Content": "Over 100 Beers available. Great food and Sports on big TVs.It's like a man's dream lair in a restaurant. A+", "Date": "2013-04-24", "Author_Location": "Hiram, GA"}, {"Author": "Angela Y.", "ReviewID": "ROUrIAMLTkQB7oUZl5mlAg", "Overall": "3.0", "Content": "As I sat at the bar and struck up a conversation with a new \"bar friend\" He asked a very simple question.....\"Why is Taco Mac called Taco Mac, when they mostly sell Chicken Wings?\"Anyhoo, I've never been impressed by Taco Mac. I ordered a Newcastle beer and a Steak Salad, I wanted my dressing on the side BUT got a salad dripping in dressing --- I sent it back and waited patiently another 30mins for another salad.  The waiter/bartender offered me a free beer (another Newcastle) for my trouble (that was nice of him) But the salad was so unsatisfying. When I got my bill all I can think about was the fact that the salads at Wendy's are much better (and cheaper). Does anyone know why they call TACO MAC, TACO MAC??", "Date": "2008-05-05", "Author_Location": "Moreno Valley, CA"}, {"Author": "Bill S.", "ReviewID": "_JcF7D8G06-x6L7QXSnHGw", "Overall": "3.0", "Content": "I really like Taco Mac. This one is really nice inside, and easy to get to. My standard Taco Mac rating is 4 stars, and since the food and drink is the same here as at the other Taco Macs I've been to, I will keep that the same. However, this one loses a star because you have to pay $5 to park there or find street parking (not easy in that part of town)I got around that however by parking in the building with Marlows Tavern and walking a couple blocks over. Shhh. :)", "Date": "2008-05-09", "Author_Location": "Atlanta, GA"}, {"Author": "Kara G.", "ReviewID": "21Iwg7WTjEdbq8Q-4_T0UA", "Overall": "2.0", "Content": "More like Taco Yuck.  I went here for a holiday lunch with those gorgeous admissions reps from Morehouse College and everyone thought the food was horrible.  The servers were nice and the place wasn't crowded even at 12:30 PM.  I can see how this would be  a great place to watch a game or chill at night, but really the food was very bad.  I had the taco salad which was basically a stale taco bowl, lettuce and Hormel chili with a little bit of cheese.  It wasn't nasty, but it wasn't good.  Even my little coworker Alexis, who is an 85 pound princess said that her Chicken Caesar Salad was bad and she actually needed some candy after lunch to fill her up.  PS who are these people talking about how good the food is here?  Have you ever eaten before?  No, no, no, you can most certainly get better food at KFC or McDonald's.  I blame Kory Hawkins at Morehouse College for this selection, great job Kory, if we would have just gone to CPK like everyone else wanted I wouldn't be yelping about this.", "Date": "2008-12-19", "Author_Location": "East Point, GA"}, {"Author": "Addy C.", "ReviewID": "7hzu53dPPv9XX3NNQ9T5mQ", "Overall": "2.0", "Content": "This is not the place to take a large group for lunch. We had a party of 20, and the entire lunch experience took over 2 hrs. Most of the time was spent waiting - waiting for our drinks to arrive, waiting for someone to come and take our orders, and waiting for our food to arrive. Frustrating too when you can see other tables who arrived after us (granted they were smaller parties) getting their food before ours. Parking sucks too. Only the 1st hr is free with validation - and if you forget to validate your ticket, you're SOL. Parking is $2/hr - our lunch took over 2 hrs so parking was $6 :( It'd be nice if the hostess at the front desk offered to validate tickets as customers are leaving the restaurant.Food was just ok - typical bar food, very reasonable prices. I got the Hollywood chicken breast sandwich w/ fries - chicken was dry, and they forgot to bring a side of honey mustard dressing. At least the fries were good. Definitely not coming back.", "Date": "2011-08-06", "Author_Location": "Atlanta, GA"}, {"Author": "Mona T.", "ReviewID": "90i97t0b3ds-KoZgbSoEcA", "Overall": "4.0", "Content": "yummy food, t.v's everywhere. fun place to go with friends when its late and everything else is closed, service is sub-par but what can you expect from a sports bar pub like place.", "Date": "2014-03-08", "Author_Location": "Chino Hills, CA"}, {"Author": "Alayne H.", "ReviewID": "QuqGEjAU2IL8oEbD5Ds9Yg", "Overall": "4.0", "Content": "Came to watch college football (Go Beavers shout out to Randy G.!) here and was impressed with the contemporary atmosphere and abundance of TV's - every size; everywhere - compared to other Taco Macs I have been to. Of course, it was wall-to-wall people, but when one game ended and people left, the tables were quickly turned for the customers watching the next game. We had a table of 5 and the service was good. I didn't have anything to eat so can't comment on that, but my experience with Taco Mac food is that it is consistently okay. One interesting observation I made is the layout of the restrooms. When approaching the restrooms, the men's room is straight ahead and the ladies room is to the left. When I first went to the ladies room someone happened to be coming out of the men's room and the door was wide open with several guys standing there. I immediately turned my head thinking holy sh*t that's embarrassing. The next time the same thing happened only this time I thought, I guess it's meant to be - so I didn't turn my head away. I was relieved to see men washing their hands rather than what I first thought. Will definitely come here to watch more sports and guys washing their hands!", "Date": "2008-11-21", "Author_Location": "Decatur, GA"}, {"Author": "Cynthia N.", "ReviewID": "ofRrmpc2FWJjKvcQbGH7BA", "Overall": "3.0", "Content": "I've been to this location a few times when I've wanted an evening snack as Taco Mac's are a solid choice for good bar food without the added smoky atmosphere.  I really love the buffalo chicken tacos.  This Taco Mac is different in that it's the only location I've seen that looks downtown shiny (Maybe because it is downtown? Hmmm...)  I could see a sushi place or a French-Brazilian fusion restaurant taking up residence among its dark wood booths and feng shui dividers.  The bar is also long, curved and lovely.  Service here has been pretty good.  Only once has a server done something I didn't like, not returning my change.  Not returning my change is a pet peeve of mine, especially now that I have to pay Park Atlanta. I did mention it to the manager when he stopped by my table.  He was a nice guy, but didn't seem too concerned.Please note: you get an hour of free parking in the retail parking garage located behind the building.  Yay for free parking!  This Taco Mac is on par with the other locations I've visited - good bar food for a reasonable price in a smoke-free environment.  That's A-OK.", "Date": "2010-12-28", "Author_Location": "Atlanta, GA"}, {"Author": "Steve V.", "ReviewID": "qn-l2QOkBTKcPe55Didl5Q", "Overall": "3.0", "Content": "There are a lot of Taco Macs around Atlanta.  All of them are decent, but the Midtown location is probably one of the best of the bunch.  It is very spacious with many tables/booths and a long bar with plenty of seats.  There is probably more than 20 flat screen televisions around the place displaying every possible sports game you can think off.  It is an excellent place for Saturday college football.  They even broadcast in the bathrooms!  Probably what it is best known for is its extensive beer menu on draught - probably more than 50 different types.  You can become a member of the Passport Club and earn prizes for trying different beers at the various Taco Mac locations.  I think what causes Taco Mac to loose a star or two is the food.  It is average - not bad, but nothing special either.  Standard pub fare with a mexican twist.  Burgers, nachos, quesadillas and then some more expensive dinner entrees.  Good for a bite to eat if you are in the area, but I wouldn't go out of your way for it.  Parking is challenging in midtown but you can usually find some spots on side streets.This is a great place to go for a Saturday lunch to drink some new beers you haven't tried before (and maybe grab a quick, simple lunch).  Definitely a good place for gathering in groups to watch some football.", "Date": "2010-09-25", "Author_Location": "Seattle, WA"}, {"Author": "Queenie D.", "ReviewID": "iXZAo8q2azcIkQSjZhpThQ", "Overall": "4.0", "Content": "The waiting period is .. well.. still LONG AS HELL... we came there on a Sunday evening... we actually came in right before a huge rush and we still waited a while... but then again, it was slightly our fault...When we got in, it only took one minute to get us a seat, but it was you know, that one lone table in the middle of everyone that no one wants to sit because you will get elbows and asses as you take a bite ...So, we requested for a booth... it was about 25 minutes to wait for one.. that is cool ... then the waiter that we got was clearly overwhelmed of the crowd.. he was young and novice... and my heart goes out for him, but damn... 20 minutes to get a draft beer? *sigh*HOWEVER: all the wait was worth it when our food arrived. The Elm Wood burger was cooked to perfection that I did not want to let go of it... I was like \"damn girl, let go of the burger!!\" I asked for medium well and that is exactly what I got... I dont know what they did to that burger but it was ah-mazing! Now I had plenty of burgers at this joint but today.. something special may have been added!We also had hot wings with the Three Mile Island sauce... it was one of the best hot wing sauces ever!! I will request for them to tone down the salt just a notch though, and that one of the two serving of fries we received was clearly old... it wasnt just cold fries.. it was cold AND old fries! ... me and my bf had to fight over the batch of fresh fries ... but its nothing to cry about ...They have, as always, an array of beer. My BF tried the September Beer, Sierra Nevada Tumbler Brown Ale at 5.8% Alc and $4.75 a glass. Im not a fan of these kinds of beers, but he said it was a good beer and it was worth the price...The crowd is young and hip... however, i did notice the crowd is highly consisted of black guys that swing to the tune of Lady Gaga, you dig daddy-o? side story:4 guys in one table next to us... they were fussy and even complained to our waiter that there was just too much mayonnaise on his burger.. the waiter then told him that he orderd extra mayonnaise so that is why there is extra mayo on his burger ... lol! anyways, later on, when the check came, the guys quietly got up and left... come to find out, only three of them paid and the 4th guy tried to skip the bill (it is really busy in here) ... luckily the waiter was able to grab his manager quickly and the perps had to pay for their food!! lol...AND OH:Parking suck suck sucks!! Validation is only for an hour at the Metropolis... and the waiting time alone just to be seated and to order in taco mac takes a good hour ... TACO MAC PLS VALIDATE FOR TWO HOURS!!! We had to pay 6 bucks because we parked for one hour and THREE MINUTES... damn...", "Date": "2011-09-04", "Author_Location": "Atlanta, GA"}, {"Author": "Daniel P.", "ReviewID": "aAEX-5_mQxp3lO_Ku9DPnw", "Overall": "1.0", "Content": "Yuck, yuck. I stumbled upon this place late on a Saturday night, seeking a place for dinner after a late arrival into ATL. It was one of few (if the only) option in the area still serving food at this hour.If you're a beer person, there might be some redeeming qualities about this place. But I'm not.Three things are particularly important to me in a restaurant: quality of food, service and overall atmosphere. This place struck out in all three. Service was painfully slow -- took nearly 10 minutes sitting at the bar before anyone bothered to take my order. Meanwhile, I was practically deafened by the countless TV screens blaring college fooball games at painfully high decibels. I never even knew who was my actual server, I think ultimately the manager served my food because most of the waitstaff were gathered around chatting in a corner.Not much for atmosphere either, even for a late Saturday night, the place was enormous, but nearly empty. Should have been a warning sign, but I was starving and needed a drink (stat) after a 4-hr flight from the West Coast. So I braved it.I ordered the fish tacos after being reassured by the bartender they were a good option. Super bland and served with *cold* fries(!?!). Fail.Ewww... that's all.", "Date": "2009-12-22", "Author_Location": "San Francisco, CA"}, {"Author": "Pratik S.", "ReviewID": "0zzcxV6lCY05eVTAySzCcQ", "Overall": "4.0", "Content": "I love Taco Mac! This location is one of the largest ones I have been to. I have been countless times as I live in the neighborhood and there isn't a better place to watch a game, drink a few beers, and eat some wings. They have over 140 beers on draft and 200 in the bottle, and they are constantly rotating their taps. The 'Brewniveristy' program is a great loyalty program if you like to try different beers. Once you get to 125 different beers you get a 20oz mug for the price of a 16oz pint, which I think is a great perk. Some of the draft beers do get a little pricy, but craft beers cost a lot anywhere you go. They also have a full bar but I normally get beer.The service is always great.  Even when they have large crowds for various sporting events, the servers are attentive and fast.  On very rare occasions has the service been sub-par. One thing to remember is if there is a popular sporting event going on, you should get a little early as this place fills up and then there can be long waits to get a table. The space is set up well and has several tables, booths, and the bar area is huge. They have several large HD TV's all over so viewing your game is never a problem.  I almost always order the wings here and they are great. I get them hot with a side of hot sauce. The wings are pretty big and meaty, and I love their hot sauce.  I wish they still sold it for $5 a bottle, but they stopped selling it a year or so ago. On occasion I order the burgers and they are pretty solid too. The wedge is really good as well. I would highly recommend checking this location out. It is one of my favorite sports bars in Atlanta.", "Date": "2012-07-12", "Author_Location": "Atlanta, GA"}, {"Author": "Michelle A.", "ReviewID": "Q4dMxi647sx1y44RgyLAVA", "Overall": "3.0", "Content": "I've been to this location a few times, but never was I happier to see the glowing neon sign for lunch when everywhere else was shut down due to all the ice. They were running on a limited menu, but no matter. They had every beer on tap still up for grabs and isn't that all a gal needs in her life?Server was super friendly and attentive. Brownie points for suggesting a nice stout that was cheaper than the ales yet packed a hefty punch (by Georgia standards, anyway). The food was still per its usual - wings, tenders, burgers, fries - and didn't stand out as the best I'd ever had, but you know you're not coming here to eat your weight in wings, son. You come here to drink your weight in beer, and drink I did for lunch. It was 5 o'clock somewhere and you know it.", "Date": "2011-01-14", "Author_Location": "Atlanta, GA"}, {"Author": "Joseph D.", "ReviewID": "SEb6m0jHXmluUAbGY-5H_w", "Overall": "2.0", "Content": "Well, isn't the new Taco Mac all shiny and pretty?I went here the first night.  I walked in and walked out.  Too crowded.  I came back a couple of days later and ordered a buffalo chicken sandwich with a Lagunitas Kill Ugly Radio.  Bad mistake.  I must learn to properly pair beer with food.  The combination of the two made the beer taste like beechnut tobacco juice and the blue cheese taste like...well...shit.  It was the worst thing I've eaten since 'shrooms.  Yes, the kind of shrooms that grow on cow crap.  I don't really want to lay the blame on TM because I think my ignorance of flavor combinations was at fault but I doubt I'll order anything with blue cheese there again.There's a plethora of tvs so you can watch the guy do that thing with the ball and say to all your brahs \"Hey, did you see that guy do that thing with the ball?\"  Pink polo, shell necklace, and backward Cocks hat are optional but encouraged.This place does have ALOT of beer and that may be it's saving grace with me.  There are something like 200 taps and a couple hundred more bottled beers.  I like the atmosphere of the Va-Hi TM much better though.  The service is more personable, perhaps due to the much, much smaller scale.  This new location seems to be all glitz and flash which can be expected with it being in Midtown.  I'd much rather walk another block to the Vortex which is more my speed.", "Date": "2008-04-21", "Author_Location": "Atlanta, GA"}, {"Author": "Ashley M.", "ReviewID": "R7GilImr5KONy5v_q0HaUw", "Overall": "4.0", "Content": "I don't know what all the Taco Mac haters are bitching about. It doesn't get any better than this for beer and bar food.Cons first: No patio. The music and/or sports REALLY loud, had to yell at my friends across the table at times to have a conversation. I had to deduct a star for this.Pros: Cold, delicious beer, good food selection!We went during the Midtown Festival of the Arts and arrived at Taco Mac at about 1:30 p.m. We waited maybe 5 minutes for a table. College football was on every TV.Our server (can't remember her name) was seriously on point! She took all 4 of our orders without writing them down and everything came out perfect.  I had the flautas, a friend had the burrito, other friend had the burger, and Hubs had wings/fries. You know the food is good when nobody says a word for a good 10 minutes. This is likely our new watering hole. As much as I liked Hudson Grille, Taco Mac has much more extensive food and drink menus and has a more fun atmosphere.Important for the chicks: bathrooms were clean and fully stocked - uncommon in a lot of sports bars!", "Date": "2010-09-26", "Author_Location": "Atlanta, GA"}, {"Author": "Janene H.", "ReviewID": "Tj9SprAVKBMDTJq4Y6dPSA", "Overall": "3.0", "Content": "3.5 stars for Taco Mac Being from Orlando I had never even heard of Taco Mac. After this visit though I'd say the reason to go is for the beer. The food is your typical bar type food, nothing special. I was excited to see shrimp po' boys on the menu but was disappointed in mine. The menu said it came with a Cajun sauce but I couldn't find anything even remotely Cajun. In fact, the whole thing was dry and heavy on bread. The fries we had were tasty with great seasoning. My companions commented that the hot wings weren't that hot at all. The beer selection is great and my friend who lives in the area had a passport card which is a neat way to keep track of how many beers you have tried. It is also a great way for Taco Mac to sell more beers. The multilevel restaurant has a balcony overlooking the arena. We sat upstairs where you get a great view of the street. Service was indifferent. It seemed to take a long time for our server to get downstairs, get our beer and return. Maybe things would have been faster downstairs...", "Date": "2009-03-08", "Author_Location": "Apopka, FL"}, {"Author": "Jennie K.", "ReviewID": "605gAVaLmR8RzH0uX9T_xg", "Overall": "3.0", "Content": "So I'm slowly falling out of love with this place.  I've had numerous problems ranging from not being credited on my \"brewniversity\" card (until e-mailed), sampling beers, staff that doesn't know their beer (not all, just a select few,) and over cooked food.  It's really been hit or miss lately.  All these things are adding up to beer selection not being worth the pricey drafts.They are good about getting your game on a closeby TV, and I appreciate that.  But I'm doing all I can do minimize my food consumption there, and pick good beers the first time around.", "Date": "2009-11-01", "Author_Location": "Austin, TX"}, {"Author": "Andy M.", "ReviewID": "qMgksxNjDl7hYWfILHOZ0A", "Overall": "4.0", "Content": "This Taco Mac is the franchised version. Which until recently I didn't know there was a difference. Basically this is like a chillies but with a HUGE beer selection. The food is good..typical chilis type food. Which I like but lacks character to me. The atmosphere is VERY franchise bar setting. Tons of tv's and just a big place with alot of tables and booths. (which is GREAT to watch games)I keep saying franchise..but its not really a negative thing. I mean this is a great place. I'm all about Taco Mac..but I am used to the one up near Lawrenceville (non-franchise)..COMPLETELY different place entirely. Personally I like the one up by Lawrenceville WAY better because its much more homey and like a bar. Plus the wings are WAY better. Like probably my favorite wings in ATL.Overall you cant go wrong. Good food..and an ammmmmazing beer list. And the wait staff is pretty good.. they make a point to make sure your beer glass never bottoms out :)19/365#Yelp365", "Date": "2011-01-19", "Author_Location": "Atlanta, GA"}, {"Author": "Scott L.", "ReviewID": "ztgftTO8yK6YDqpYOyZHGw", "Overall": "4.0", "Content": "The ultimate beer bar.Over 100 beers on tap, this place is awesome for beer geeks like me. I don't care much for the food, but that is not why I am there. I love the bar area....It reminds me of what people in the 60s thought futuristic bars would look like.....They got it right!I really like the special cask events as well.........What I can't fathom is seeing people drinking Bud Light out of bottles when there is over 100 beers on tap.....Why?", "Date": "2009-09-23", "Author_Location": "Stone Mountain, GA"}, {"Author": "Carla D.", "ReviewID": "ROPMJWrMOBDnbSfC_fYXwQ", "Overall": "3.0", "Content": "It met the standards of Taco Mac which are good.  Lots of bar food,tex mex and beer.  I'm not a sports fan so I felt out of place since it was football Sunday.  Server seemed to be tired of her job, she took our order and got the food out right.  Only checked on on us once while we ate. But when it came time to bring the check she was all smiles and helpful.  I prefer when they earn a big tip through out the meal and not just try to recover in the 4th qtr. The Ranch dressing is AWESOME!  It doesn't really taste like typical ranch, but its fantastic.  Strong!  I got the boneless wings and they were overcooked and dry, that's not typical though.", "Date": "2012-10-23", "Author_Location": "Decatur, GA"}, {"Author": "Beth B.", "ReviewID": "K8NRXXxGuQBltZYcJ9BxMw", "Overall": "4.0", "Content": "This Taco Mac is a step nicer than your average Taco Mac.  The chicken wings are fab, they have tons of beer for you to choose from.. It's good times.", "Date": "2008-06-20", "Author_Location": "Atlanta, GA"}, {"Author": "Travis M.", "ReviewID": "ZsEdQDqySpiIoY5ECm7xww", "Overall": "3.0", "Content": "First off - how about you guys quit making 100 different entries for each taco mac?? The search results are f'ed.Its no secret that taco mac's food pretty much sucks. The wings are good as is the queso, but the rest of the menu is pretty much garbage. Dont dare order anything with blue cheese on it - your food will be so overpowered you'll be tasting it for years to come. The real reason to go here - the 100s of different beers. Prices are decent and you get fun little \"rewards\" for trying new beers. I'm about 10 away from getting some special mug (i'm sure its valued at about $5, that coupled with the $10 gift certificate i received previously puts me in the red by about a cool $485). Great place for happy hours.Though they call it a \"sports bar\" dont expect to see anything other than football, baseball or golf (occasionally basketball). That aspect of it is pretty lame.", "Date": "2009-05-14", "Author_Location": "Atlanta, GA"}, {"Author": "Joel D.", "ReviewID": "SH-w0LqDv-FyLcZoL2PgTQ", "Overall": "4.0", "Content": "Taco Mac has average to below average food, but they have an extensive beer list and tons of TVs. Its a great place to watch a game and have a brew.This particular Taco Mac is the nicest I have seen - they really did a great job of improving the atmosphere from when it was Stool Pigeons.I'm sure I'll be back.", "Date": "2008-07-03", "Author_Location": "Atlanta, GA"}, {"Author": "Patrick D.", "ReviewID": "DPGZOsNGG-2tFu97ft7NhQ", "Overall": "5.0", "Content": "Park in the Metropolis Visitor parking deck. Very reasonable rates! 2 dollars is the most I've paid after a Taco Mac visit. Take the elevator down to the bottom floor, step out onto the sidewalk, turn right, and walk down to the corner. This is the main Taco Mac entrance. Taco Mac has decent bar food. The reason I love THIS Taco Mac is the barbeque habanero wings. You won't find it on the main menu, but if you ask a server they'll set you up. If you enjoy beers, this location has over 140 on tap and close to 300 in the bottle.", "Date": "2008-07-23", "Author_Location": "Atlanta, GA"}, {"Author": "Max S.", "ReviewID": "0bSj9JB99xBf9GithIUIEQ", "Overall": "5.0", "Content": "Normally, Taco Mac is a 3 star kindof place... borderline 4 stars. This location, however, is simply off the hizzy. If you want to watch sports, this is *the* venue in midtown, possibly in all of ITP to get it done.The servers are friendly, know their beer and are usually very attentive.I've never been a huge fan of the food... it's just ok to me. By far my favorite place to go drink beer, carouse with friends and catch the game, though.", "Date": "2008-10-03", "Author_Location": "Atlanta, GA"}, {"Author": "The S.", "ReviewID": "h9eNW86RRa_kf6qYBf328g", "Overall": "3.0", "Content": "I am an unapologetic fan of Taco Mac.  I root for them.  I want them to win.  I eagerly seek out and patronize new locations.  That said, this is my first visit to the Midtown (pardon me, \"Metropolis\") Taco Mac, and, overall, it was good. (heavy sigh)Parking, of course, might be a problem, but let's assume you've conquered that challenge.  Let's also assume that you're familiar with Taco Mac, and have been in one of their 28 locations.  That way I do not have to mention the huge attraction, notably the 140 beers on draft, or the selection of over 200 bottles.  Or the great wings.  That way, this review is much shorter, and I do not have to type as much.Good!  I like that.As you enter you see that the designers have made (almost) the most of the available small space, and crafted a functional layout of three levels.  Each level boasts a wait station, which simplifies wait traffic.  (As opposed to some locations, where the wait staff looks like the Keystone Kops as they try to maneuver around each other whilst laden with food and beverages.)The top level sports a large comfy bar seating 32 -- although pillar placement hampers seating on the (patron's view) right hand side of the bar, -- augmented with eight high-tops and three booths.  The bar's jetty breaks up the usual rectilinear monotony, and creates multiple options as you seek just the right combinatorial view of their 1.439 gazillion HDTV's.(Aside: Speaking of pillar placement, why are there so many architectural blunders in modern pubs? Remember the Fado Fiasco?  This close proximity to Ga Tech should encourage a new Bar Design Architecture specialty.  I would be more than glad to teach such a course.)There are also two long tables, which at first I assumed to be Captain's Tables (a great feature that encourages small groups of people to talk and socialize more freely with each other), but are actually reserved for large parties.  Small groups are promptly hustled away should they attempt to alight there.The ambiance is spare.  A friend complained about the lack of wall decorations, but that criticism falls flat to my ear. Those same tacky decorations are the Go-To's of chain pubs, which may add some prepackaged atmosphere, but offer no utility. Besides, with the aforementioned 1.439 gazillion HDTV's, three is no wall space left!  The zeitgeist here is simply a lot of TV's with relatively loud audio from a selected game. Like it or move on.The largest drawback here, aside from certain undersized TV's and the lack of purse hooks under the bar, is the service - seemingly the worst in the Taco Mac chain.  Even though it was a relatively slow Sunday night, I had to wait about five minutes upon arriving while the bar maid chatted up some hunky dude she was flirting with.  Sadly, there was no improvement once he left, as my wife later also lamented once she joined me.  Of course, the poor service may have been limited to just my bar maid, something I shall fathom upon a return visit.", "Date": "2010-11-22", "Author_Location": "Atlanta, GA"}, {"Author": "Giancarlo G.", "ReviewID": "8lZgEmAxLe8aqr2nu3OEwg", "Overall": "4.0", "Content": "It's amazing what they did to the space if anyone ever remember Stool Pidgeons (which sucked).  Well, it's Taco Mac beer and wings in a midtown modern setting and there's not a bad view in the restaurant for watching your favorite team. The service has been okay each time I've sat down.  I keep getting this one server who I swear is stoned each time I go in.  But hey, he's just working to earn a dollar like the rest of us.  They've been really good about changing stations as well if you want to see a particular game.  When I roll to the bar, the service is prompt, attentive and my order is up quick.  I've also been happy with the take out service.Don't kid yourself though about the food and atmosphere.  It's still the same old Taco Mac menu.  When I get my wings, I roll hot and extra-crispy and they've been perfect every time.  Perfect wings and cold beer makes me happy.", "Date": "2008-08-05", "Author_Location": "Atlanta, GA"}, {"Author": "Loren B.", "ReviewID": "bH8KTvKOCVKkLk59tSkMIg", "Overall": "3.0", "Content": "Taco Mac deserves 3 stars....anyone who gives it above 4 stars enjoys their supply of 500 beers a lil too much if you ask me. It's a sports bar, but it's very open and bright when you walk in. If you were kind of tired, you will definitely wake up when you walk in.  Big tv screens, Lots of alcohol to partake in, they serve wings. The chili wasn't that great, but what was I expecting at a sports bar? I enjoy their blue cheese buffalo sauce burger, but it's not the best or even top 5 of the burgers I love.  I have gone to Taco Mac more times that I can count and it's always a good time. Sometimes the mixed drinks are watered down. The service is a hit or miss depends on who's working,. The only valet for an hour for parking so be prepared to pay!The atmosphere to watch the game and hang out with friends overrides the quality of food..but sometimes that's all you want :)", "Date": "2012-06-19", "Author_Location": "Atlanta, GA"}, {"Author": "Kevin W.", "ReviewID": "X_E07VHalL0zmxlRjumE9Q", "Overall": "3.0", "Content": "I am a fan of Taco Mac.THe wings are the main attraction here but the tacos are delicious too. The service was fast and the food was great. Go here. The have a long list of draft beers that are nice to try. This place has TVs and games everywhere. This is a nice place to go.", "Date": "2012-05-16", "Author_Location": "Nashville, TN"}, {"Author": "Avery B.", "ReviewID": "AXOHF89JiW_0Zdmt47Aasg", "Overall": "1.0", "Content": "One of the worst services I have had....it took forever to get food and drinks. And the street taco taste just like the street. Will not be going back at all", "Date": "2013-10-27", "Author_Location": "Atlanta, GA"}, {"Author": "Jane M.", "ReviewID": "6_efxsZvWaIEZLRvM9pcPw", "Overall": "4.0", "Content": "Got the wings here, I only got hot. Not the burn my insides for days. It had been a while since I've been to a quality sports bar. It was nice. This place I think is an LSU bar, so beware.", "Date": "2011-11-17", "Author_Location": "Los Alamitos, CA"}, {"Author": "George A.", "ReviewID": "NZfEzzRg8U88rQaSRQTPUA", "Overall": "3.0", "Content": "Arrived Sunday to drink with friends and Watch Falcons game.  Was only at the bar,  nice layout, good bartender. Place was crowded, but we had room to stand comfortably .  Did not try the food, last few times at a Taco Mac  the food has not been up to par", "Date": "2013-11-10", "Author_Location": "Atlanta, GA"}, {"Author": "Justin R.", "ReviewID": "VnnqMvxebMoZRg8LlayE_w", "Overall": "4.0", "Content": "I hate sports. With a passion. And I don't drink beer. The fact that I'll still go to this Taco Mac to eat speaks volumes.The food is pretty solid, it's nothing special. It's basically a step up from Applebee's. But sometimes that's exactly what you want. Some decent, trashy, bad for you food.Mostly I just like the restaurant I think. It's very airy and spacious. And it's about a 5 minute walk away. If we didn't live so close, we probably wouldn't ever go.", "Date": "2009-12-22", "Author_Location": "Atlanta, GA"}, {"Author": "Joe B.", "ReviewID": "qmsRxYU2p7s6T4V-OMBEHA", "Overall": "4.0", "Content": "The place is nice and spacious. Lots of flat screen tvs. And a lot of beers on tap. The location is a few yards away from the Hyatt.", "Date": "2013-09-26", "Author_Location": "Santa Clarita, CA"}, {"Author": "Eric G.", "ReviewID": "E5zv85F-6zAPem_WjsCVoQ", "Overall": "5.0", "Content": "TACO MAC!  I live extremely close to this place, so when I do not want to cook, it is a taco mac night.  There are so many HD tv's your head will spin, the place is always extremely clean and the service is friendly.  Oh yea andddddd they have about 500 different types of beers.  They also have a club(Brewniversity) that you can join where you get a point for every new beer you try.  It is a great way for them to take all of your money, but make you into a beer snob.The food is very good.  I have never been disappointed with a meal and all of my friends I have brought agree.  The bar area is a great place to hang out and watch a game with friends.  The one negative is the beers are typically pretty pricey.  Sit at the bar and drink 3 beers and you'll be dropping 20+ dollars.  I don't think they really have any great drink specials, but I still love this place and will continue to go there time and time again.  Plus, once you drink 125 beers you get a TM mug to drink out of(20oz rather than the standard pint glass).", "Date": "2010-04-19", "Author_Location": "Atlanta, GA"}, {"Author": "Helena W.", "ReviewID": "BgW3HeN4qemeW72tM_YH1g", "Overall": "2.0", "Content": "What can I say... I met my Other here so it will always have a special place in my heart.  Neepa was the bartender sorta helped it along(providing the alcohol), I dont know if she still works there but she is great!  In the past we would come several times a week seeing as we live in the same building. But over time the customer service of particular bartenders and serving staff just made it harder and harder to justify going and paying to get treated badly.  The food is hit or miss from okay to just down right bad.  We never go down on our own initiative anymore, we end up there when meeting friends or family who may be hanging in Midtown.  Usually we look in the window to see if certain staff is working before we choose to go in. We've tried to order on-line and that seems to be unreliable, it completely leaves off orders as if you never selected it.Yeah, its an alright time.", "Date": "2011-10-30", "Author_Location": "Atlanta, GA"}, {"Author": "Obadiah S.", "ReviewID": "nq61e23Pu0HOWWF-9uVIFA", "Overall": "2.0", "Content": "I will give it to them, the beer selection is fantastic, and the Passport program makes alcoholism fun!Otherwise, Taco Mac leaves MUCH to be desired. Yes, they do have a good beer selection, but I'm not sure they really maintain their equipment as much as they should. I occasionally get a tap that tastes a little off. It's great to have dozens of beers on draught, but you gotta keep your equipment clean. Now the food: ho-hum, and I think that's being generous. It just isn't very good. It isn't very bad either, but it's not great. I suspect that much of what comes out of their kitchen arrived to the location frozen and in a bag. The tacos aren't particularly inspiring, and the wings are always a soggy mess. I like my wings crispy. Should I fault them on a preference? Perhaps not, but I will.Why bother to visit? Well, it is located in Midtown, so it's easy to walk to if you live in the neighborhood (as I do). They have many televisions and it's a pretty good place to watch sports. I may even head up that way to catch some of March Madness. I'll be sure to eat before I arrive though.", "Date": "2012-03-12", "Author_Location": "Atlanta, GA"}, {"Author": "Jen H.", "ReviewID": "uludyJ-xzNcOrH6Aewrs3g", "Overall": "2.0", "Content": "Although the venue is pretty good looking, the food is not so good at all. Buffalo wings were not very tasty at all. I learned that although you can get mild to very spicy, they just add more or less of the same spicy sauce. So if you get mild, your buffalo wings come out pretty dry. Also, service was not great or friendly.Tip: I sat at one of the tables lining the glass wall on Peachtree. Throughout our whole meal, random people and several homeless people, stood directly on the other side of the glass and stared in at us or the tv for a few minutes. And I don't mean glanced as they walked by. I mean, one homeless guy stood outside and STARED at us and the tv above us for about 5-7 minutes straight.Don't forget parking validation is only for one hour.", "Date": "2011-04-20", "Author_Location": "Atlanta, GA"}, {"Author": "Billy P.", "ReviewID": "g9DB7FrqyVfvO3TP5CoXew", "Overall": "3.0", "Content": "Tv's everywhere, large seating and bar area, great place to watch a game or have a casual brew. And no... It's not MEXICAN food!!!! I know, fooled me...Extensive beer selection, and their specialty, WINGS! We did lemon pepper, which is nothing new to me. They were decent. My favorite were the habanero BBQ wings! Spicy with a sweet flavor. Don't worry, they were unbearably spicy. I think we also did medium spicy wings (I don't have a great recollection, I was a few drinks deep at this point). Just remembered they were nutty spices either. Service was decent, clean, fun joint.", "Date": "2012-10-07", "Author_Location": "Anaheim, CA"}, {"Author": "Sarah W.", "ReviewID": "lUgh_wCXKQ4wZxu0Sq9Gog", "Overall": "5.0", "Content": "I've been here numerous times but this is my first review. This is my favorite Taco Mac simply because it has seating for a huge number of people, the bar seating is ridiculously huge, and they carry all of the soccer games (which pleases the boyfriend). If we can go to TM and the right soccer game is on then we are both happy. In regards to anything else it's pretty much the same as you would get at any Taco Mac. Good bar food, a fair selection of beers, and all of the sports games you could want. If you're a girl I would recommend the Shrimp and Avocado salad. If you are a boy then eat what you want unless you're watching your girlish figure.", "Date": "2012-12-28", "Author_Location": "Atlanta, GA"}, {"Author": "Christopher W.", "ReviewID": "HUI07gSXHEkh1O69QXoUkw", "Overall": "5.0", "Content": "Late night sports bars are few in ATL but this is one of the best. I am a big fan of the 100 plus draught beer selection. They specialize in texmex and the best items are the street tacos which was much better than expected. The salsa is too watery though the chips are great. Not a bad place to hang out and eat before, during or after a game.", "Date": "2013-05-20", "Author_Location": "New Orleans, LA"}, {"Author": "John S.", "ReviewID": "c5b1OaYaXMGHcwmpWHH6qg", "Overall": "3.0", "Content": "Hmmm, I keep coming here because my friends seem to have a thing for Taco Mac. So we came and I think they seated us pretty fast since our friends already had a table by the time I'd parked. The waiter was pretty nice and always talked to us with a smile, and kept our respective drinks refilled.Anyways, this time I actually had the Elmwood burger instead of something more Mexican styled, since I figured I better try their American food as well. I asked for it medium, and am glad to say it actually was medium on the inside. The onion rings in it were also crunchy and suited the burger well, and the blue cheese added the kick it should. So basically the burger was pretty great, but getting to my side, it wasn't the same story. I asked for the Southwestern rice instead of fries for my side, and the portion of rice was less than 1/6th the amount of fries my friend got with the same burger. Besides that, it was incredibly bland, as if its only color was from food coloring and not any kind of flavoring ingredient.Overall, this is still not a bad place, but it' a bit pricey for the quality/quantity of the food. If all the food was like 1 or 2 dollars cheaper, it'd be pretty legit, especially with the beer selection and all the huge LCD TVs.", "Date": "2010-04-29", "Author_Location": "Dallas, TX"}, {"Author": "Ee Vonn Y.", "ReviewID": "xnEFW_3merJpA_GF8tNRgQ", "Overall": "4.0", "Content": "The T'Mac chicken tenders with ranch and blue cheese sauce and the loaded sweet potato fries are guilty pleasures that will ruin any attempted diet. They are everything a young and fun sports bar should be. It gets more than crowded on game days so avoid this place unless you can hold hunger for a long time. Their wait time is far underestimated but worth it. The wait time to ordering drinks here on a game day was unacceptable. It took the cashier literally more than 30 minutes to bring four drinks to the 4 girls in front of us. He looked confused the whole time. Nonetheless, the beer options are a delight to read through.", "Date": "2011-11-01", "Author_Location": "San Jose, CA"}, {"Author": "Rob P.", "ReviewID": "En4POGudtyu370VuQv1wEg", "Overall": "4.0", "Content": "I know, I know, it's Taco Mac.  But I'm a sucker for the 500 beers and my favorite wings/fries in town. (Not counting Fox Brothers smoked wings, those are so good they shouldn't count)    Always a new restaurant to try in town, but this is one of the few I regularly come back to.", "Date": "2011-11-24", "Author_Location": "Atlanta, GA"}, {"Author": "Sarah R.", "ReviewID": "_pu-FdLRvWjJCgriCHMNrA", "Overall": "4.0", "Content": "This is my favorite Taco Mac.  It's really close to our house, so we can walk to it whenever we want.  I also love the layout of this particular Taco Mac because it is open and the great bar allows you to see TVs from any direction when you want to watch a game.  I really like Taco Mac for the beer selection, their nachos, and the wings (medium with a side of TMI or Three Mile Island as its called).  They added this new thing called \"Angry Shrimp\".  I love it.  I have ordered it 2 or 3 times after first trying my BFs.  It's like having wings made out of shrimp! Can't wait for football season to really get going and to hang out here.", "Date": "2013-09-08", "Author_Location": "Norcross, GA"}, {"Author": "Joe L.", "ReviewID": "JNTDHvIkD6nOHY8yNd9HQA", "Overall": "2.0", "Content": "So i can here hopeful that i would come on a good night for the wings, since apparently this place is what its known for. Ok the wings suck. I think wingnuts is better. My friend and I got the death wings thinking that it would be like an epic man vs food episode, except georgia tech style. WRONGthe wings werent even spicy. AT ALL. they were sweet. WTF? So when we asked / complained to the waiter that they werent hot AT ALL, he offered to get us the death sauce. Thinking that they just put the wrong sauce on, we gladly accepted. we poured the entire small sauce cup onto our 6 pack of wings, and hey, it WASNT the wrong. sauce. I guess the deadly wings just arent deadly. VERY VERY disappointed. AND THEY CHARGED US for the sauce. WTF!OK well its about the food right. So the appetizer was pretty decent. we got the queso chips and split it. can't really mess that up unless they give us stale chips, which they didnt. Onto the main courses.  I tried the cajun chicken pasta. Can get the same in a bigger portion size at Applebees or Fridays. Wasnt anything stand out. Also tried out the bacon cheeseburger. ordered medium, came out well done, and subsequently was dry. not really standout either. now this I HAVE DEFINITELY HAD BETTER AT APPLEBEES OR FRIDAYS(sports bars like taco mex), not to mention other burger joints around atlanta. My entree was the carne asada burrito. So if you read my previous review on willy's, youll know thta the tortilla is very integral in my estimation of a grade for the burrito. And here Taco Mex crashed and never got up. the burrito was dry on top, soaked through on the bottom, and hard to cut through. The ingrediants in it did not fair much better. DEFINITELY had WAYYYY to much cilantro. In fact, there was a bite i had where it was almost all cilantro and crust. WHere the heck was the meat? they definitely skimped on it. and the rice was dry as well. Overall disappointed in this place. Food wasnt terrible. Just wasnt as good as its competition. Sorry if I ever want to watch the game, ill take my money to applebees or fridays. 2 stars. Ive gotten better before at other chain sports bars. and Ive gotten A LOT better at one sports bar (in cincinnati, ill try to find it and review that one too, i cant remember what it was called)", "Date": "2009-09-13", "Author_Location": "Atlanta, GA"}, {"Author": "Trip B.", "ReviewID": "QF9N5RE9QnCQKeIku8Qu3w", "Overall": "3.0", "Content": "I come here for wings and beer during a sporting event. Other than that, it is not a great place. The beer is about quantity and not necessarily quality which always puts me off. But it's a money maker so it ain't going anywhere. The true beer experiences in ATL are East of the city in the likes of the Porter, Brick store, Midway and even the new Wrecking Bar.I know I'll be back but there will have to be a good game on the tube.", "Date": "2011-10-07", "Author_Location": "Atlanta, GA"}, {"Author": "Mark B.", "ReviewID": "djt8BzNSrEp_BLbNt5tR2w", "Overall": "2.0", "Content": "Once upon a time music came from a single source, so that the volume varied with distance from that source. (usually a speaker) Wanted a quieter table? No problem. Now, clever restaurant designers have placed speakers all over the walls, ceilings, and columns every couple of feet so that you are never far from the source of music. Gee thanks. The result is that we go into Taco Mac where the music is absolutely blasting our ears and we cannot get away from it. We sat ourselves at the bar anyway and ordered a couple of beers, but the music was just so LOUD and insistent that I was soon dreaming of that cold six pack of beer in my fridge. And so we got up and went home to eat and drink.Restauranteers: Most of us have beer and food in our fridges. DO NOT chase us out of your place!!!!!", "Date": "2010-03-13", "Author_Location": "Atlanta, GA"}, {"Author": "Courtney D.", "ReviewID": "SPP1YMU3aojsnTSbe8FLZA", "Overall": "5.0", "Content": "This is my favorite Taco Mac in the Atlanta area!! I love the staff and just the overall location - it's conveniently located to everything in downtown/midtown! With tons of TVs, lots of seating, a very spacious bar with extremely attentive bartenders, and a management staff that aims to please - this TMac is a success!I love going here and vegging out on the wings (single/hot/swimming/all flats/fries/extra ranch, please) while adding new beers to my Passport Club list - they have 140 draft selections and over 280 bottled beers!! With as many televisions as they have, you won't be dissapointed that \"your game\" isn't being shown...trust me, they will accommodate you!", "Date": "2009-02-05", "Author_Location": "Miami Beach, FL"}, {"Author": "Kevin F.", "ReviewID": "IpsH94IAtGAo3StT613L6Q", "Overall": "3.0", "Content": "If you've been to pretty much any other Taco Mac you've basically been here too.  The food is decent and the service can be hit or miss.  They have a HUGE draft beer list and a good selection of bottles.  Depending on what beer you order, prices range from good to astronomical.  Don't bother ordering any Belgian beer here, it's WAY over priced.  Hit up The Porter or Brick Store if you're into Belgian beers.  Their micro selection is good though.The food is pretty consistent, but it's not going to rock your socks off or anything.  I've been here about 4-5 times and have always had a good time.", "Date": "2009-02-06", "Author_Location": "Atlanta, GA"}, {"Author": "Lindsay M.", "ReviewID": "MN7U7mQ5OZwfFlrI2zYqsQ", "Overall": "3.0", "Content": "Lets be honest- you don't come to Taco Mac for high quality food- it is bar food, and I like that the restaurant embraces this instead of pretending to be something they aren't.  That being said, generally everytime I have eaten at Taco Mac my food has been good.  My favorite thing here is the variety of beer.  If you can't find a beer you want here- I find it hard to believe you would anywhere. I came to the Midtown location last night to enjoy some of March Madness.  Not only was I happy to see Uconn win, but I was also impressed with our server.  She was on top of everything- beers were refilled and when we had more people show up they swapped our table, no problem.  Not to mention it was PACKED in there.  They had their act together.  I wouldn't mind coming back to enjoy more games at this location.", "Date": "2009-03-27", "Author_Location": "Atlanta, GA"}, {"Author": "J Kyle O.", "ReviewID": "CLBP7Q_4IP83jZUsPdcgkw", "Overall": "5.0", "Content": "Absolutely love Taco Mac! Great beer selection great food! just stay away from the burger they're average at best.  Everything else is amazing!", "Date": "2010-10-14", "Author_Location": "Atlanta, GA"}, {"Author": "R P.", "ReviewID": "PChN9jzgR_enJg5hezYlog", "Overall": "3.0", "Content": "holy mother of god - the holy grail of frigging beers!I love bars/restaurants that take their beer seriously!  Love the extra flyer with what's coming and going as well as the descriptions.Wait staff was super pleasant and very easy place to watch a game from.   Food wise - its average - which for places like this is a plus actually :-)I have no idea why this place is called 'taco mac'....  I'd come back in a second to kill some beers and maybe have a appetizer.  But unfortunately I wouldn't go back there for the food.", "Date": "2012-03-09", "Author_Location": "Sunnyvale, CA"}, {"Author": "Christina E.", "ReviewID": "B98OmEAV9QtOk1Gu0uk6iw", "Overall": "4.0", "Content": "Typical sports bar, but awesome beer selection. Bartender wasn't great though.", "Date": "2013-08-26", "Author_Location": "Charleston, SC"}, {"Author": "Erik K.", "ReviewID": "EDBeKZ9HBjUIcXGOzVEBiw", "Overall": "5.0", "Content": "We ate here on a friend's recommendation, at first I didn't want to go because I wasn't in the mood for Mexican but then was told that the Buffalo Wings are really good.I'm glad we decided to eat here, we ordered the Nachos which turned out to be too large for my wife and myself but it was very good, we both ordered the wings one plain so we could add sauce to it later and one with a medium hot sauce, I preferred the plain wings which were surpprisingly crunchy and just the right amount of salt, I have to admit that our friends were right, the wings were great.The huge selection of beers was an eye opener, I was like a kid in a candy store, I was also amazed at the amount of big screen TV's, you could see several events from anywhere you sat in the restaurant and our waitress was very friendly which made our first time experience here even better.I would definitely recommend coming here for wings and beer.", "Date": "2012-11-21", "Author_Location": "Honolulu, HI"}, {"Author": "Phong T.", "ReviewID": "TCSnIC0OOd3d9mYwaAVdJA", "Overall": "2.0", "Content": "This Taco Mac is smacked in Midtown. Love the atmosphere around just because it's in the city with nice buildings around and so many people using the side walks! SERVICE: It started off great and then it plummeted. Definitely hurt my view on this particular location. It was probably due to communication between employees and attitude being shown towards customers. It just takes one person to bring the team down. Story below. I came with a fairly large group (8 people) and were seated within 5 minutes by the hostess. Our waiter showed up promptly after we all sat down and was very friendly and happy. We started off with water as everyone reviewed the menu to decide on what to order. Our order was taken and the food came out. THIS IS WHERE IT GETS WEIRD. Two other servers brought it out; a guy and a gal. They were looking around frustrated to see where our waiter was to pass out the food since she knew who ordered what. I spoke up and let one of the two waiters (the guy) know what I ordered just to help out, but he responded with a smart tone, \"it's okay, we will call it out.\" Kind of like a thanks-for-helping-but-no-thanks-sit-tight- attitude. Well he ended up picking up my plate first and handed it to me. Fast forward, all the entrees were passed out. I asked the same guy waiter if I could have two extra plates since I was sharing my Cobb Salad and 10 piece boneless wings with a friend. He told me he was busy and to wait for my waiter as she will be around shortly with a diva tone. Yeah, she didn't come around until 10 minutes after we gotten our food. I don't blame her. He probably didn't even tell her that her table needed her. Who knows. FOOD: Everything was fine. My Cobb Salad was delicious. Fries are always amazing with the ranch dressing. The boneless wings were very salty. Probably the batter sucking in all the hot sauce.", "Date": "2013-06-27", "Author_Location": "Stone Mountain, GA"}, {"Author": "Niharika A.", "ReviewID": "FCL0nXoR9zKddQf-TVthuQ", "Overall": "4.0", "Content": "Awesome Wings, Beer Bread Bites, Fajitas and Beer.. Excellent service and great ambiance.", "Date": "2013-09-03", "Author_Location": "Norwalk, CT"}, {"Author": "Daniel R.", "ReviewID": "pvjW7miioxQRdI-dv5wsew", "Overall": "3.0", "Content": "Massive beer selection with okay food. The dips seem to keep me full enough to fight off dinner. The wings will pass, but could use a little more time in the fryer IMO. They've always got your game on. This is extremely helpful in the days of the enigmatic ESPNU. Grab a pint and have some fun.", "Date": "2010-09-30", "Author_Location": "Los Angeles, CA"}, {"Author": "Mariana D.", "ReviewID": "sP2hnXpPsK5Wtl6L-3bI6Q", "Overall": "3.0", "Content": "I would give more stars but... wings were not that great and beer is a little pricey. Aside from that the waiters and waitresses are VERY efficient and constantly check up on you in a healthy way :)Our waitress Crystal was a 5 star waitress, very helpful, very friendly, and very nice :)", "Date": "2010-09-30", "Author_Location": "Honolulu, HI"}, {"Author": "Cynthia S.", "ReviewID": "GCDLYBIVIUxOZVPmUKnbEA", "Overall": "3.0", "Content": "Not a big fan of other taco macs but this place is not like all others.  Its set up makes it a wonderful place to catch your team play.I also typically don't care much for Taco Mac wings but this place has a good touch.  Extra crispy really come out extra crispy with lots of sauce and flavor.  The tacos and taco salad are also tasty- for bar food. ;)The service has been pretty spot on- no complaints there. It can get crowded so give yourself some time and patience.Parking deck can be pricey- its about $6-$8 for the time it takes to watch a football game.", "Date": "2011-01-19", "Author_Location": "Atlanta, GA"}, {"Author": "Liz H.", "ReviewID": "gtuh65eVCvMe6yU9sU_MHA", "Overall": "4.0", "Content": "4 stars for the service I've received here in the past. Servers are knowledgeable of the menu and beer selection. I used to frequent this one as it was close to Tech (just take the Trolley to Midtown Marta and walk down the street!), then I got a car and would park at the meters in the street. There's a parking garage next to the place, but it's paid. This place is a great sports type bar, but it's not dimly lit or rowdy like your typical sports bar. While they have tvs everywhere, I've only watched them out of curiosity. I come here for the wings and beer. Swiss mushroom burger has been a favorite. Evenings get busy, with a 10-15minute wait, and sometimes they ran out of the pint glasses before 6pm =/ When it gets busy, the servers may forget you. FYI. At daytime though, its a different experience - I've had extremely attentive servers. My favorite thing about this location would be the bar - it juts out in a semi circle, so the seating is pretty cool. Their beeper system is interesting as well - it goes off when it's time for your group to be seated.Food: Swiss Mushroom Burger, and Wings - any level of Hot. Drink: Any beer you want/like/want to try out. I love their little coasters. So cute. Service: pretty good except when it's super busy. Food comes out 15-25min wait, depending on crowd. Place gets busy on big football game days. I joined the Beer Club, but you have to get something like 20 beers to reach a level - I've gotten maybe 4 or 5 xD", "Date": "2011-03-18", "Author_Location": "Duluth, GA"}, {"Author": "Gabriel S.", "ReviewID": "yh-ZKwpEQZEqYXgBLC9DuA", "Overall": "4.0", "Content": "This Taco Mac is always packed NO MATTER what day of the week it is. They have plenty of TV's within view everything are GREAT prices food is fresh they are similar to Applebee's but cheaper and better4Stars for WACK parking have to pay for PARKING deck", "Date": "2011-06-29", "Author_Location": "Norcross, GA"}, {"Author": "Dave P.", "ReviewID": "ZP3zKHOmaXKBGdWx83KRzQ", "Overall": "3.0", "Content": "IF you are getting a taco here... just know that its about 1.5X larger than your standard taco. Pretty decent taco tho, but foodwise three stars is the most I can post.They have about 5 billion beers to choose from, which is really nice but I don't think that alone will make up for the sub par bar fare.  Service was decent, seem's like a really big college crowd. Probably some better places to eat drink and be merry on these crowded streets.", "Date": "2012-06-25", "Author_Location": "Rahway, NJ"}, {"Author": "Kurt N.", "ReviewID": "IACVetD1zkvyPQG-U0aPdQ", "Overall": "2.0", "Content": "I never want to go here, I always end up getting dragged along. Yes, they have a large tap selection, but so does other places. The only food that is ever any good is their chicken, and somehow they manage to have the same dishes as other places but with an extra 30% calories.I have never had good service. And many times, it is barely acceptable. I know you have a bunch of stuff on tap, but the waitstaff should at least have a slight clue of what is still available and not have to come back 2 additional times to find a beer that you want that they actually have. Even when they have gone around the table and named what everyone ordered before they brought out the checks, they still manage to switch things around.If you order something hot, you better have a mouth of steel, as getting and keeping a glass of water on your table can be quite a challenge.Basically, avoid Taco Mac. There are far more deserving midtown locations of your business. Yes, they might not have quite the selection that Taco Mac does, but most are par on prices and are at least competent at serving you. Check out Cypress St Pint and Plate as close alternative, or Brick Store in Decator if you care about selection and price.", "Date": "2013-01-18", "Author_Location": "Atlanta, GA"}, {"Author": "Tom V.", "ReviewID": "XAaGaaSmQR0e893gHyHnAg", "Overall": "4.0", "Content": "Recently moved to Atlanta, so here's an outsider's take on Taco Mac:Amazing beer selection, good wings, all the sports you could want. If that's what you're looking for then this is a good spot to find it. The menu is exactly the type of bar food you'd expect to find (burgers, sandwiches, soup&salad, ect...) The TVs are plentiful and the service seems pretty good when I went. There are plenty of other places that have a similar formula, but for the beer selection, I would put Taco Mac towards the top of any sports bar list. If you want great food, perhaps you should look elsewhere.Recommended.", "Date": "2010-12-10", "Author_Location": "Atlanta, GA"}, {"Author": "Nick K.", "ReviewID": "wy15aiK7Sr6ic44-57e2qw", "Overall": "3.0", "Content": "I've only ever been to this location.  The food is OK.  Probably slightly better than average, as far as bar food goes.  The beer selection is certainly impressive.  The service is OK: not terrible, not great.  There's always something that annoys me, though.  This past time it was the music being turned up WAY too loud.  If you like sports bar food and love having hundreds of beers from which to choose, you'll probably like this place.  It's pretty big, but it can get crowded, especially during gametime.", "Date": "2011-01-19", "Author_Location": "Westerville, OH"}, {"Author": "Happy J.", "ReviewID": "L8oniKL_Ayn-gESec0uC8g", "Overall": "1.0", "Content": "Waited and waited and waited...Couldn't even get anyone's attention to order a drink while waiting.One chance to make a first impression...", "Date": "2011-11-14", "Author_Location": "Glendale, AZ"}, {"Author": "Bobby S.", "ReviewID": "vH418eg2jdX92vwKPRSSQw", "Overall": "3.0", "Content": "It's Taco Mac, what's not to like?This particular location is pretty consistent if your party is under about 8 or so, at least during lunch.  Any more than that and it seems they freeze the kitchen until an entire order is out, so parts of it might be particularly cold, and may take over an hour and a half to deliver.The beer selection at this location is top notch.  They regularly rotate some great microbreweries and, after being a Master's, I still get a beer education every time I go.Beer prices are reasonable -- and it's Taco Mac, so it's all about the beer.  Food is pretty typical, slightly more upscaled than a dive joint bar food.  Stick to the wings and the queso (I know, carb/fat bombs) -- you really can't miss.On this particular visit, I dined with co-workers during lunch.  I had a Dogfish Head 90 minute on draft (my favorite of beers at the moment), a six pack of hot wings with celery, and a water.  Service was consistent, food was what I expected.  Yes, that means it's A-OK.Parking is validated for I believe the first hour -- after that, it runs about 3 bucks an hour.   If you're smart and it's during certain hours (read: not during morning and evening rush hour), there's top secret parking along Juniper that's free.", "Date": "2012-07-17", "Author_Location": "Atlanta, GA"}, {"Author": "Joanne B.", "ReviewID": "MFbQfR7oR7jO4K9WYFG-Lg", "Overall": "3.0", "Content": "Ok so the food in this place doesn't blow me away but after multiple good beers it tastes pretty a-ok. This location is set up nicely and one of the few locations in midtown that seems to always stay busy which I love to see!! The beer club is something to consider if you like your beers and the new flavors they bring in which constantly rotate.", "Date": "2013-03-30", "Author_Location": "Atlanta, GA"}, {"Author": "JJ N.", "ReviewID": "2N6Bh_1zmGib98qzOzW_rA", "Overall": "3.0", "Content": "Huge Sports Bar with tons of TV's to watch the game and a great/large beer list!  It's bar food but pretty good but at the same time nothing exciting.   If i lived in the area I'm sure I'd be here occasionally to have a drink and some wings.", "Date": "2013-03-27", "Author_Location": "Denver, CO"}, {"Author": "Pete S.", "ReviewID": "RqfCzH5hwEaPSv6yIIEn7A", "Overall": "4.0", "Content": "Food was great.  Had a ton of wings.  Loved that you could get the hotter (not that hot) on the side to dip medium wings.  Service was painfully slow to start.  Salad came before the water/cokes. But after the initial slowness our waitress came alive and was checking on us constantly.  bonus points.  Lots of tvs/games.  awesome spot for sunday football.  Recommend", "Date": "2010-12-13", "Author_Location": "Atlanta, GA"}, {"Author": "Michael H.", "ReviewID": "WcoQX9VyQ5tq0KImaIoqmQ", "Overall": "2.0", "Content": "Ahhhhh, Taco Mac.  They list the most beers on their menu out of anybody......I just wish they actually carried everything they list.  I haven't been able to go there without having to alter my order to suit their current inventory", "Date": "2013-04-11", "Author_Location": "Atlanta, GA"}, {"Author": "Sheena V.", "ReviewID": "YvhWGXFAEJY8dEWIH-YK1Q", "Overall": "3.0", "Content": "Even if food is decent, and the place has a good vibe, you gotta dock stars for a restaurant assuring that they can seat 15 together within 45 minutes, and then taking 1.5 hours to seat 15 people at 3 separate tables.", "Date": "2013-03-21", "Author_Location": "Chicago, IL"}, {"Author": "David B.", "ReviewID": "FvP7snxmkiApsSpsvV298g", "Overall": "1.0", "Content": "This place is great for catching a game over drinks or grabbing an inexpensive dinner/drinks before heading out to a party or event.But I was there on a Saturday afternoon about 3:00 PM for a late lunch with my partner and my two kids.  There was no one in the place (3 tables in all) but despite that we received lousy service.  We had to ask for menus, ask for our orders to be taken, ask for silverware, ask where our waiter was, ask for refills, ask, ask, ask.  I thought I was the waiter for my table when I had to get up and go the wait stand to get extra napkins for us.I know it was an off-time of the day, but wait staff was there just not out in the dining room checking on the customers.  I don't know if they were in the back getting ready for the upcoming dinner rush or just taking a rest after a busy lunch rush.  Either way, I don't see that as my issue; I felt that they didn't care if I was there or not.  So I'll take my business elsewhere.", "Date": "2009-02-02", "Author_Location": "Atlanta, GA"}, {"Author": "Erik P.", "ReviewID": "uOrmZyMRvVV_S0lyqx8dqw", "Overall": "3.0", "Content": "For some reason, it seems like every time I go to Taco Mac it is because of the beer. They have by far the biggest draft beer selection I've ever seen. Tons of great craft brews that are hard to find anywhere else- always something new to try.They also excel at seating large tables. When going to lunch with my coworkers, we're usually in groups of about 10, and Taco Mac never has a problem seating us quickly.The food is \"meh\"- nothing I've had was unpalatable but nothing was great. The philly is not particularly good- it is served at roughly 200 degrees and is wrapped in tin foil to ensure that you'll be burning your mouth throughout the whole meal. The fish tacos are pretty OK. The burgers are fairly good. The fajitas are decent but don't come with enough tortillas.", "Date": "2011-09-16", "Author_Location": "Stone Mountain, GA"}, {"Author": "Josh L.", "ReviewID": "57Uo3Sat-73_AaoXTwy5BQ", "Overall": "3.0", "Content": "This place is great for beer drinkers and wing fans.  However my only complaint is that the DEATH wings, which are higher on the list than Habenero BBQ, were just plain old sweet and sour, mildly spicy.  So, go order them, and impress your friends while you chow down on mildly spicy and they think its DEATH.", "Date": "2013-07-09", "Author_Location": "Los Angeles, CA"}, {"Author": "Joel C.", "ReviewID": "6L19yuM1xWu3Dhsw6UF37Q", "Overall": "2.0", "Content": "USA...USA...USA!!!  This is definitely a great place to watch the Olympics!  I stopped by here last Saturday to catch up with my friends Michael and Caleb and to finally give Michael his overdue birthday gift.  I'm not much of a fan of the food, but the beer selection is pretty excellent...especially since they have Hoegaarden on draft.  The place was pretty pumped up with people screaming at the TV screens for Michael Phelps to win another gold.  I actually felt like I was watching the game live when he had won and everyone was jumping up and down and clapping...this is why I love the Olympics!  Even through all the commotion, I was still able to have good conversation with my friends.Surprise, surprise when Tulie L, Leslie E, and Lauren S walk in and join us for a few drinks!  From what was suppose to be maybe an hour or two visit...I didn't leave Taco Mac until almost 2:00AM!  It was a great time but my only gripe was the service.  It was a busy night and there were times I felt it took longer than normal to get a drink.  When the girls arrived, our waitress never showed so they ordered a drink at the bar.  Well, I guess that's a big NO-NO since they were told once the guys paid their tab that they could not sit at the table.  When Michael and Caleb left, I stayed with the girls and we moved to a table next to the bar.  Another server asked if he could get us drinks but everyone was still drinking their first beer.  Well the server never showed up so the girls again got their beer from the bar and when they came back, the server told them that they have to sit at the bar if they got their beer from the bar!  At this point, it was just ridiculous...we were practically at the bar!?!?  To say the least, it was a bit confusing and we would have not had this problem if the servers just checked in once in awhile!Per Gretchen...I should give 2 stars for service like this..she's right!  Oh, the peer pressure!", "Date": "2008-08-20", "Author_Location": "San Francisco, CA"}, {"Author": "John P.", "ReviewID": "dPC46NQ2sIKy1ixU6TWt3Q", "Overall": "4.0", "Content": "Best place around for beer and bar-type food.  TV's everywhere which is great.  Some food perfect for the bar, some not so much.  The wait staff and bartenders are super.", "Date": "2013-05-19", "Author_Location": "Atlanta, GA"}, {"Author": "Ashley P.", "ReviewID": "oLmK3KVbQsz5FFZFwYs53A", "Overall": "5.0", "Content": "Since my first review, my love of Taco Mac has jumped a notch from \"big fan\" status to \"I'm totally a regular\" status.  Aside from the addictive nature of the Passport Club and my ever-growing love of beer, there are several things that have kept me coming back to this Taco Mac.  1) I've had several beyond friendly, super cool servers.  Like the kind of server that talks beer with you, then recognizes you next time you come in and stops by to say Hi.  That's always really nice.2) One of the aforementioned awesome servers brought to my attention the new tradition of the \"Firkin Cask.\" On the first Wednesday of every month, a cask (not a keg) from some microbrewery is tapped right there at Taco Mac.  This means that the beer is as fresh as it will ever be.  That's pretty much awesome.3) The food is better than I thought.  Yeah, it's still greasy bar food, but the Habanero BBQ boneless wings and the Chicken Nachos are actually pretty tasty.  I mean I wouldn't want to eat them too often for fear of imminent cardiac arrest, but I do enjoy them.Lastly, a few updates to my list of beer recommendations:*Rogue Hazelnut Brown*  Go into this thinking \"brown ale,\" not thinking \"flavored beer.\"  The experience will be much better.*Dogfish Head 90 minute IPA*  Not your typical IPA!  High gravity too.                 Compare it to the 60 minute if you want to have some fun!*Magic Hat No. 9*  Apricot APA!  Never seen anything like it before.", "Date": "2008-08-04", "Author_Location": "Phoenix, AZ"}, {"Author": "Kim S.", "ReviewID": "p5sKOpdQRL3k2zeD5t4aEA", "Overall": "5.0", "Content": "Taco Mac is my favorite new Sports bar! Their food is awesome and drinks....It is great for a date or to hang out with a group of friends. I say thumbs up to the one in midtown!:)", "Date": "2008-12-15", "Author_Location": "Amsterdam, The Netherlands"}, {"Author": "Laura R.", "ReviewID": "llbedFFikaicTOyuPaL5Bw", "Overall": "4.0", "Content": "I feel like this taco mac deserves more stars (for what it is), so I'm weighing in.  The decor is modern, TVs are plentiful, and for a sports bar, there are a ton of healthier-end tasty options to eat.  Parking is indoors and validated for at least part of your stay.  I'd take it over Hudson Grill across the street any day, and you can't really compare it to Cypress since they're totally different things.  If you want to watch a sports show in this area, I think Taco Mac is your best bet...as long as you get there early enough to beat the crowds", "Date": "2013-03-09", "Author_Location": "Atlanta, GA"}, {"Author": "Ben T.", "ReviewID": "4Qur8l3_ucsVgK632rVjPw", "Overall": "4.0", "Content": "I love beer and therefore I love this place. One of the better beer selection around. And after you have developed an appetite the chili con queso is fantastic", "Date": "2013-02-24", "Author_Location": "Tacoma, WA"}, {"Author": "Peter C.", "ReviewID": "NSObbxRYlnZKzFvE4BhF8g", "Overall": "3.0", "Content": "Came here for dinner with about 20 guests after a conference. The service was slow because there was only one waiter that was assigned to our massive group. It must've taken over a half hour just to get drinks on the table. Then it was another 15-30 minutes before they started to take our orders. Overall, the food itself wasn't bad, but I wished the service would've been better or at least assign two waiters to the giant group of 20.", "Date": "2012-10-13", "Author_Location": "Brooklyn, NY"}, {"Author": "Kenneth N.", "ReviewID": "pyl0oqQJqr72Pwe1-6iWcQ", "Overall": "3.0", "Content": "This is probably my least favorite TMAC that I've been to. Uninterest staff, cold atmosphere. The food is respectable, especially the wings. Good variety of beer.", "Date": "2012-11-16", "Author_Location": "Sandy Springs, GA"}, {"Author": "Shannon K.", "ReviewID": "3PWVOWqSuTfH84kOr8ZbwA", "Overall": "3.0", "Content": "Ate here on our way to Dogwood Festival and the server was good overall service was so slow. Everything took a long time and it was not even that busy. Could not seem to figure out why they were so slow. Would leave a lower rating but waiter was very nice.", "Date": "2013-04-22", "Author_Location": "Union City, GA"}, {"Author": "Matt T.", "ReviewID": "vJshRZY9SXEzHCE_6u1bpA", "Overall": "4.0", "Content": "This one is a pretty nice Taco Mac, and the ambience fits perfectly for the local. And it helped out cause I came here with Cnythia N and Harrison H after a night of drinking and got some sober-me-up food. It kind of worked. But wings were on point, and the beers were good, so what's there to complain about?", "Date": "2010-11-25", "Author_Location": "Alpharetta, GA"}, {"Author": "Christopher H.", "ReviewID": "UtftS-AYcPDHv0U168GKRw", "Overall": "1.0", "Content": "So I've now been to this Taco Mac about a zillion times, since I live within walking distance now.  I'm convinced they just don't want me as a customer.The past FOUR times I've been there, there has been a problem.  First, they mixed up my friend's passport with mine, so I now have credit for beers I haven't had but WANT to drink, and he ended up losing credit on 2 or 3.  The next time, I didn't get credit at all for 5 beers.  All of that was squared away after having an email conversation with someone at corporate.The third time (this past Sunday), I ordered a Kenmore burger no mayo, and it came out drenched in mayo.  I sent it back. 45 minutes later, as I was literally about to walk up to the Vortex to get something to eat, the bartender told me someone else had taken my burger from the kitchen, and they were making me another one.  In all, I finally got my food an HOUR after I ordered it (but at least they were smart enough to comp it).This evening, I tried again, and failed.  I spent most of the afternoon there, drinking a good amount of beer.  At 7:00, I asked them to put the Islanders/Rangers game on (which started at 7), even telling the barkeep what channel it was on.   The manager, Justin, apparently couldn't find it, so he put it back on ESPN (which had been showing the same hour of programming over and over for the past 5 hours).  At about 7:15, I asked for them to just put the Thrashers game on.  The bartender came back and advised me Justin said the game didn't start until 8:00.  Oddly enough, I had just checked the NHL's website and it said 7:30.  There were no other games on at the time, so I didn't know what the issue was with going ahead and putting one of their 50 TVs on a different sports channel 15 minutes early, but apparently Justin had an issue with it.  Since I wasn't going to get to watch hockey at Taco Mac, I just paid my tab and left.  I got home a little before 8 and turned on the Thrashers.  What do you know... they were fifteen minutes into the game already.  So much for starting at 8!Taco Mac is a great football bar, but it's certainly not a sports bar.  And having a problem four visits in a row is too much for me.  I won't be back to the Metropolis location, and since none of their other locations are close to me, I won't make an effort to go to any of the other locations, either.", "Date": "2008-12-26", "Author_Location": "Atlanta, GA"}, {"Author": "Chris B.", "ReviewID": "SCrU9n6JzUouXR15HDR-Gg", "Overall": "4.0", "Content": "The usual Taco Mac - tons of beers on tap and in bottles, american and mexican food - except that this one is huge! HUGE! Plus the location is great on Peachtree St. I can see it getting packed and exciting for big city sports events. Now if only we could get Atlanta's sports teams to be good...", "Date": "2008-06-25", "Author_Location": "Atlanta, GA"}, {"Author": "Annie R.", "ReviewID": "-Prmc2OwrolIHCS7ZlUtAw", "Overall": "2.0", "Content": "The food is terrible. If you are going for the beer list I get it, it is the only reason it is not a one star. Otherwise it is waste of time/money.", "Date": "2009-11-01", "Author_Location": "New York, NY"}, {"Author": "smacksmackgulp K.", "ReviewID": "wuZ9WGeoE-_tvYaO-vflig", "Overall": "3.0", "Content": "What can I say about Taco Mac.  I work pretty much next door, so it's always the path of least resistance for our happy hours.  Everything is just ok, the food, the space.  Specifically, the wings are meh, but not terrible.  For some reason, they serve their celery stalks thinned length-wise.  So what should be a thick, straight, 2-3 inch celery stalk ends up being curly slivers.  Annoying.  Cypress' wings are tastier, I think (and no celery curls!), and definitely a different (better) vibe at Cypress...but unfortunately, a farther walk for my lazy co-workers, so we usually end up here.  The servers are hit or miss.  But everything is pretty much predictable.  It's a McSports-Bar!  Convenient place for me to watch a game, but nothing really special.We have gotten food from here for pick-up during marathon work sessions, and gotta say, they've been prompt, and have been good about getting our multiple orders correct.", "Date": "2009-10-06", "Author_Location": "Atlanta, GA"}, {"Author": "Chuan S.", "ReviewID": "XTISdWvpuiWsl8uYVAi6Bw", "Overall": "2.0", "Content": "Death level Taco Mac Wings is a walk in the park.  Don't expect more than a tingly sensation.", "Date": "2009-07-22", "Author_Location": "Atlanta, GA"}, {"Author": "Leon B.", "ReviewID": "_8Ly4Wg7oTD51IqahO8kPg", "Overall": "4.0", "Content": "Food and Service is as good as it gets @any Taco Mac but the bartenders are the BEST!!!...I can \"ONLY\" vouch for Saturdays though...$5 for a shot of \"LIQUID COCAINE\"...TRY IT OUT!!! if you come this Taco Mac...if all else fails there's a \"VORTEX\" about 2 blocks away...", "Date": "2013-03-26", "Author_Location": "Atlanta, GA"}, {"Author": "Ryan W.", "ReviewID": "RUE04xvuMqTOSN8SPzDNAA", "Overall": "4.0", "Content": "This is the best taco mac I've ever been to. they have so many TV's that some just face the outside. It was a great palce to watch the olympics. They ahve good queso. It also has the best beer selection of any taco mac I've seen, all of which have incredible beer selections.", "Date": "2008-08-19", "Author_Location": "New Orleans, LA"}, {"Author": "Kristin F.", "ReviewID": "X1xoK6qRmAvXfxTAyxcTvQ", "Overall": "5.0", "Content": "Love this place. I come here once in a while for happy hour after work with coworkers or for dinner with friends. Their food is excellent from the salads to the burgers.  Servers are attentive and friendly. As a non-beer-drinker I love that they carry Smirnoff Ice and Mike's Hard Lemonade! I think they're prices are reasonable on both the malt beverages and liquor cocktails.", "Date": "2009-01-17", "Author_Location": "Atlanta, GA"}, {"Author": "Juichia C.", "ReviewID": "zdMDRwC3NnD-0w8xawHabQ", "Overall": "2.0", "Content": "Nothing special, wings were pretty average, service was good but that's expected. chips were above average.", "Date": "2011-04-03", "Author_Location": "Atlanta, GA"}, {"Author": "Brad C.", "ReviewID": "A6N8rXujqA8Y9YSuR-Fmxg", "Overall": "5.0", "Content": "Craft beer fans listen up this spot is a must visit! The only thing they have more of then televisions is beer. A wall of tap lines that will make your jaw drop! If for some reason you can't find something on tap to drink they have a huge bottle list with some rare gems. I stopped in here on my most recent trip to Atlanta for a drink, and that one drink quickly turned into ten. I didn't have any of the food but I heard good things and just about everything coming out the kitchen looked great. Besides having some killer beers that night I had a excellent time talking to the staff, who were some of the friendliest people I've ever meet. Next time I'm in Atlanta which I hope isn't too far away, I'll be visiting this Taco Mac again.", "Date": "2010-03-21", "Author_Location": "Chicago, IL"}, {"Author": "Liz D.", "ReviewID": "cQOeEkKLlm9N9XY8s7fRTA", "Overall": "3.0", "Content": "This sports bar has a nice atmosphere- lots of TVs and a decent selection of wings, tacos, burritos, burgers and wraps. And a huge beer list. Oh, and a Coke freestyle machine. The food isn't the best quality- you can definitely get better for cheaper elsewhere in Atlanta. I had the tacos, which were huge, but quite bland. The cilantro sour cream had no flavor. But the ranch for the wings is good and strong. Altogether, food isn't impressive. But for a good place to get together with friends and watch a game or two, this is a decent place.", "Date": "2012-04-02", "Author_Location": "Nashville, TN"}, {"Author": "Doug C.", "ReviewID": "RWoVX6E759QRQIbp1B3PDQ", "Overall": "4.0", "Content": "This is probably the nicest Taco Mac that I have ever been to.  Same good wings and burgers but the atmosphere is much better at this location.  Very Very Nice!", "Date": "2008-08-24", "Author_Location": "Lawrenceville, GA"}, {"Author": "Ronnie E.", "ReviewID": "G_ErZmWiZ-Fph7Co1s828g", "Overall": "2.0", "Content": "Labor day was probably the worst experience I have ever had at a Taco Mac. It was around 10pm and it felt like they had the backup servers squad working. Service was slow and just hard to order with a server who didn't know the menu to well. I'll still go back, but on a regular night and probably sit at the bar instead (bartenders are solid).", "Date": "2012-09-08", "Author_Location": "Atlanta, GA"}, {"Author": "Michelle R.", "ReviewID": "5R2W6rjbtFvBuD9F2lvpag", "Overall": "4.0", "Content": "Good food, lots of beer.  There's a $5 parking lot behind the Taco Mac or pay by the hour parking in the Metropolis building.", "Date": "2008-05-02", "Author_Location": "Atlanta, GA"}, {"Author": "Laila S.", "ReviewID": "sJycQsNvJ8my9oZdPPdl8A", "Overall": "5.0", "Content": "I love this Taco Mac in particular. the waitresses are very friendly, especially Rita. she made sure my drinks were strong and the food was amazing =) i recommend this location over any other one =)", "Date": "2012-01-16", "Author_Location": "Roswell, GA"}, {"Author": "Steven B.", "ReviewID": "rz9sZadIhs2Wmah5FX3Q9A", "Overall": "4.0", "Content": "Great place for sports. A HUGE selection of beers and really good burgers. Burritos are just ok.", "Date": "2010-07-08", "Author_Location": "Atlanta, GA"}, {"Author": "Dan B.", "ReviewID": "WG-hwY9XSX4oEPZ_OYH_bg", "Overall": "1.0", "Content": "It's a chain restaurant. Made us move twice. They don't care about the customer. Left before we could order. How do you spell S-E-R-V-I-C-E. Never be back.", "Date": "2012-05-03", "Author_Location": "Overland Park, KS"}, {"Author": "Ching H.", "ReviewID": "6x3d3zKWqwKudKoO3chw6g", "Overall": "3.0", "Content": "The only thing I come to Taco Mac to eat is the Habanero wings... it's sweet, like a bbq sauce with hot spiciness. As for other entrees, i think it's just ok same as every other american restaurants.", "Date": "2009-04-24", "Author_Location": "Lawrenceville, GA"}, {"Author": "Phoebe T.", "ReviewID": "Whu7U-PH4PVioASDyKnWig", "Overall": "3.0", "Content": "Came here with some co-workers. I was surprised at how easily they could sit 14 of us. The waiter was fine although not always there when we needed him. I got the Fish Tacos with a side of vegetables (trying to be healthy here). The fish tacos were yummy, the side of vegetables were okay. As a work event the TVs were a little distracting but as a happy hour place to watch games, I can see this place being a hit. Plus, I hear they have like 140 beers on tap or something ridiculous like that. I'd come here again with friends but I wish there were more healthy options on the menu!", "Date": "2010-03-23", "Author_Location": "Atlanta, GA"}, {"Author": "Michael O.", "ReviewID": "lOOm9S8rFmAlay14gzvVTg", "Overall": "5.0", "Content": "I'll just say, this is one of my favorite Sports Bars! The TV's are nice and well placed, the prices are reasonable, the alcoholic beverages are real alcoholic beverages and aren't watered down! It's a good place to hang out! But, be prepared to pay to park!", "Date": "2010-05-15", "Author_Location": "Acworth, GA"}, {"Author": "Allison R.", "ReviewID": "_84sUsxLupY18oUHMAQ9LA", "Overall": "5.0", "Content": "The best place to watch the Olympics. No joke.  My husband and I went here to eat dinner and watch the US go for glory!  The food was great and they had several different types of beer on tap from all over.  I only wish we had a place like this in New Orleans.  I need to start planning somewhere to watch the 2012 Olympics.", "Date": "2010-08-17", "Author_Location": "New Orleans, LA"}, {"Author": "Sheri C.", "ReviewID": "LRZuZCWpYSXQmmx4aTzYKg", "Overall": "3.0", "Content": "fun sports bar. quick enough for lunch, if you let the server know that you are on lunch. wings are OK. made me sick after, but i think it is bc i am not used to that much grease. fries reallllllllllly salty. servers were great tho. definitely will return to watch sports.", "Date": "2010-12-10", "Author_Location": "New Orleans, LA"}, {"Author": "Jason D.", "ReviewID": "bBWKyIMgRQbQlSvZkexeUg", "Overall": "4.0", "Content": "This place, although now a local chain, is consistently good. This one was great. Service was good. Food was out in an acceptable time, and good.", "Date": "2011-05-29", "Author_Location": "Smyrna, GA"}, {"Author": "Sarah K.", "ReviewID": "aqhSwQ_0mDksxsMuKFKVNw", "Overall": "5.0", "Content": "I'm here all the time. I'm fond of some of the regular staff here, great people, which is a big reason why I continue to come back. I love trying new beer and this is a regular spot for my friends and me. I'm here most Thursdays for Pint Night and often again some other time of the week. I don't eat meat or dairy so my experience with the menu is limited, but everything veggie is tasty. I always get chips and salsa and will either get a bean taco without cheese, a salad, the black bean burger wrap, or just some steamed broccoli. They're very accommodating, especially if you make friends! I love this place :)", "Date": "2011-10-24", "Author_Location": "Atlanta, GA"}, {"Author": "Jessica D.", "ReviewID": "Vlq--MB_6OS6QviNJpqSNg", "Overall": "4.0", "Content": "This place is like tradition for my friends and I. Wings and several rounds of Irish Car Bombs? Yes, please! Although, I heard they changed their lemon pepper wing recipe to a dry rub, which is a bummer. I've never had bad service at this location and parking isn't a problem. There are a couple of parking garages behind the restaurant, or free street parking one block down.", "Date": "2012-03-10", "Author_Location": "Atlanta, GA"}, {"Author": "Greg R.", "ReviewID": "3D5dKN27uNazmhZm2RViUw", "Overall": "4.0", "Content": "The food is consistent no matter which location you go too.  There was a 20 minute wait but they were packed.  Even though there were super busy the server was quick and attentive.", "Date": "2012-03-30", "Author_Location": "Atlanta, GA"}, {"Author": "Wesley M.", "ReviewID": "9U6ynUuRox1iO6KU5ruZbg", "Overall": "5.0", "Content": "Awesome service and food. This is a massive bar with tons of TVs. It's the perfect atmosphere to watch a game. We ordered 20 wings and were able to mix up the sauces. our server Alex was super attentive and was helpful with recommendations on things to do in Atlanta. Check this place out.", "Date": "2012-06-07", "Author_Location": "Jersey City, NJ"}, {"Author": "Thomas S.", "ReviewID": "uOWzb9YAoYcwhPmbcbOFbQ", "Overall": "1.0", "Content": "Went to watch a packer game.   We're set far away which was fine because the area was busy.   Then asked the hostess if we could move to another open table.  She refused and said the had a waiting list and needed the table.  I explained that they could have mine, but she said she couldn't do that.  Customer no service at its best.", "Date": "2013-09-15", "Author_Location": "Pewaukee, WI"}, {"Author": "Evan J.", "ReviewID": "j2oXOBQA3P-naR_QHy6o4w", "Overall": "3.0", "Content": "This is an energetic restaurant with a sports bar vibe.  The tortilla soup was excellent.  \"Best hot wings in the Southwest?\"  I don't think so.  I definitely had better wings in Austin, for example. The wings were meaty but I think this place does itself a disservice by not putting more hot sauce on them.  You can order extra (for 50 cents more!) but the wings are not particularly special without the sauce.  I did find the hot sauce interesting as it's not the usual Red Hot flavor.  It's got some jalapeno in there, I suspect.  I will give this place kudos for low prices!  I'm not much of a beer drinker, but they serve like 500 different varieties.  Geez!", "Date": "2009-02-08", "Author_Location": "Woodland Hills, CA"}, {"Author": "Diana S.", "ReviewID": "di978xUH6DDl-RpgNsx2Kg", "Overall": "4.0", "Content": "For what it is, it's pretty good. It's a big space. There's plenty of seating. There are a lot of tvs all around. The beer list is huge and the food is pretty solid. This is a great place to hang out and grab a bite to eat. I had the chicken nachos and they were pretty good. I've had some nasty bar nachos before. For bar food I'm impressed.", "Date": "2009-02-13", "Author_Location": "San Mateo, CA"}, {"Author": "Belle S.", "ReviewID": "jGPe7TFyTz4CGlz0IDAmVQ", "Overall": "2.0", "Content": "I have no idea why this place is called Taco Mac, but I've seen this chain everywhere. I went here with a big group of friends and decided to try the wings. They were ok, but I'm not from the South and I've definitely had better elsewhere. They for sure were not spicy and I had ordered them extra spicy. But, its convenient if you're looking for quick service and a standard clean place. Mostly was filled with an older male crowd. Parking can be difficult to find around here.", "Date": "2012-03-03", "Author_Location": "Davis, CA"}, {"Author": "Kan B.", "ReviewID": "zZ75FyEzhWDEfgi3JBBDEg", "Overall": "3.0", "Content": "Taco mac is okay. I love the hot house wings ( ranch sauce with buffalo sauce) . They don't make them at All Taco wings, and some (Alpharetta) claim it's against corporate policy to mix the wings for u? WTH?? what ever.  Grease food. Good wings.", "Date": "2008-07-09", "Author_Location": "Atlanta, GA"}, {"Author": "Steve P.", "ReviewID": "mIS-1x4oRjXKO8EPJz9Dpg", "Overall": "3.0", "Content": "The Good: The food is good! My favorites are the \"changas\" and the habanero bbq wings!The-Not-So-Good: I order for pick-up about once a weekend, and only about 15% of the time is the order done as I had asked. I get fries when I requested celery. I get bleu cheese when I requested ranch. I get drums & flaps when I request all drums. Again, the food is good, but they just can't seem to get the order right... Don't think I ask for much, just attention to detail.", "Date": "2012-11-17", "Author_Location": "Atlanta, GA"}, {"Author": "Valarie C.", "ReviewID": "qowqANe5EQJ_Nszg1l8SrA", "Overall": "4.0", "Content": "Fun sports bar with a ton of beers and all the games on.  Greg was an awesome server, although I wish we didn't go with his recommendation to make the mozzarella sticks buffalo style.  The wings were good and great atmosphere.", "Date": "2010-12-19", "Author_Location": "Washington, DC"}, {"Author": "JT W.", "ReviewID": "wKoACxxdh3i7ezxawQ3dew", "Overall": "4.0", "Content": "Bartender was Adam. Great guy, made recommendations based on beer preferences but kept it local (hate doing that to people). Turkey Que is a solid sandwich. Nothing to write home about reasonable price and worth a try. Atmosphere is good for a game. Huge draught selection which is awesome. If I'm back in the ATL during a sporting event this place is on the list.", "Date": "2012-10-26", "Author_Location": "Saratoga Springs, NY"}, {"Author": "Nicolas H.", "ReviewID": "_TDdKDNw0dtpGbdf1JKd_w", "Overall": "4.0", "Content": "Taco Mac is an Atlanta tradition, kind of. What is the tradition? Sports and Good Beer. Taco Mac capitalize on this. With about two dozen flat panel TVs and 300 beers, this is the preeminent Sports bar in Atlanta, in that aspect it holds 4 stars. The Chips con Queso is addictive, the Passport Beer club rewards your alcoholism, and the size makes seats easy to come by on even the weekend. However, if I were to rate it as a restaurant, it would be closer to a 2.5. The location is loud, like a sports bar, food is dry and over seasoned (salt and little food quality), but if you want good beer and food together, go to Brick Store, if you want a bar with sports and maybe chips, go to Taco Mac Atlanta.   This location is well lit and polished due to it's recent opening, but has similar problems to the other Taco Macs, predictable food quality, most of the good beer stay around to long, so they are flat by the time they are gotten to, and the staff is not beer trained, I have recieved the wrong beer more then once.", "Date": "2008-07-21", "Author_Location": "Marietta, GA"}, {"Author": "Shane E.", "ReviewID": "OtJGE5nbcmwxyx3qIkB4Bw", "Overall": "4.0", "Content": "GREAT WINGS and FRIES!!! This place has a beer list that's more pumped up than a baseball player. But keep in mind that if you order an obscure nordic beer no one has ever heard of you will pay an obscure nordic beer price. This is a great place to watch a big game.", "Date": "2009-03-03", "Author_Location": "Los Angeles, CA"}, {"Author": "Leslie A.", "ReviewID": "xA-J0_0u_aYrdh3_GgsLyw", "Overall": "3.0", "Content": "This place has damn good wings, with that being said they don't come close to wing stop.  I used to go here all the time with my boyfriend before I moved. I really like the one on Roswell Rd, but he got banned from that one for throwing a drink in the waitresses face one night, lol. So... we started going to this one. Usually we just get our food to go because most of the time the crowd gets a bit rowdy.. a bunch drunks!!", "Date": "2009-12-10", "Author_Location": "San Francisco, CA"}, {"Author": "Mary L.", "ReviewID": "iMm_Nee_T8EEn4k878JIZg", "Overall": "3.0", "Content": "The Midtown Taco Mac is probably my favorite of the franchise.  It has a pretty cool bar lay-out and the bartenders are very good/helpful. Food is basically bar food, but the beer selection (draft) in unbelievable. I almost don't like it b/c it's so extnesive and I get beer anxiety! Good spot to watch a game, grab some wings, and try a new beer or two.", "Date": "2011-02-18", "Author_Location": "Atlanta, GA"}, {"Author": "Brian F.", "ReviewID": "MGsCYnQrFYfGCRxtLbivbA", "Overall": "4.0", "Content": "Very cool looking bar when you walk into the restaurant.   Its unique colors and stacked taps on the wall make the bar a very cool place to drink.   Food was really good and the queso and chips were better than most places.   Bartenders seem very knowledgable of the beers on tap and they had some decent specials.   Overall I think this is a great place for good Taco's and good beer and perfect for the business man to sit at the bar and watch sports.", "Date": "2011-06-15", "Author_Location": "Queen Creek, AZ"}, {"Author": "Mark J.", "ReviewID": "SiGAKuWgJfsnzjhoTy7AdA", "Overall": "5.0", "Content": "The General manager is a stand-up guy and makes visiting Taco Mac a great experience.  Great place to catch any game with about 60 flat screen TVs and over 100 beers on draft and another 300 in the bottle.  Part of Atlanta.", "Date": "2012-04-04", "Author_Location": "Mableton, GA"}, {"Author": "Tracy L.", "ReviewID": "UZMRfeZFSLHpgAjIUVAfwQ", "Overall": "5.0", "Content": "over 400 types of beer?  What more could you ask for!! ... that is all...oh and the wings are great too.", "Date": "2009-02-08", "Author_Location": "Toronto, Canada"}, {"Author": "Lo S.", "ReviewID": "n8U4UJD5m1Q7WF1YLfoEPQ", "Overall": "3.0", "Content": "They need a better name!  This place was nice and crowded. It was down the street from The Georgian Terrace and we walked there.  The drinks are good and the food was average.  There are much better places to eat!", "Date": "2009-03-24", "Author_Location": "Tampa, FL"}, {"Author": "Scott U.", "ReviewID": "WrkTmKb10NI9DiTEH0-tkg", "Overall": "4.0", "Content": "Great selection of 140 draft and 216 bottled beers. If you want spicy wings, the death wings are not as spicy as the three mile island.", "Date": "2010-10-21", "Author_Location": "Bremerton, WA"}, {"Author": "Dean S.", "ReviewID": "3lYFbZGbccc0etBdbaxkRA", "Overall": "5.0", "Content": "This is the Atlanta standard when it comes to sport's bars. Chips and queso, half lb boneless, and beer of the month on Thursdays.", "Date": "2011-11-20", "Author_Location": "Santa Monica, CA"}, {"Author": "Dayana R.", "ReviewID": "Tio1lQfwAfO5JLLK2X9HrQ", "Overall": "4.0", "Content": "One of our favorite sports bars in town.  Spent almost every night here during the ice storm that shut down Atlanta for a week. Try the shrimp avocado salad. It's pretty good for a bar salad.", "Date": "2012-07-01", "Author_Location": "Atlanta, GA"}, {"Author": "Joseph L.", "ReviewID": "1QQ3s_tTMxAzXwGHJmwd-g", "Overall": "3.0", "Content": "Soooo many beers. Then you realize way too many of them are different types of Shock tops. Still some gems in there. Waitresses seem like part of the product, which is awkward.", "Date": "2012-07-16", "Author_Location": "Sunnyside, NY"}, {"Author": "Arthur D.", "ReviewID": "lsBdCrCPVatORQaBatpjkg", "Overall": "5.0", "Content": "Wow.  204 beers.  104 of them on draught.  This is impressive.", "Date": "2012-02-17", "Author_Location": "Simi Valley, CA"}, {"Author": "Matt J.", "ReviewID": "2oOFuErlCKJE2Z8sNHH_8g", "Overall": "2.0", "Content": "This one can't handle a Friday night crowd at 8pm.  Was sitting with party for a long time before we got to order.  An ordinary corporate sports bar.  Lots of TVs and beers.  Many beers.  If you really want to try 100s of beers this place is one that you can go to, but there are plenty of other beer bars around ATL.", "Date": "2012-07-06", "Author_Location": "Atlanta, GA"}, {"Author": "Marques G.", "ReviewID": "AsloycPBXRHqNMYe2DjeDw", "Overall": "3.0", "Content": "Went here after a terrible club experience for the gf's bday. Food was good. I had a philly cheesesteak and fries which was pretty on point. The wings and Nachos are a must try as well. The beer selection is exstensive and there are more than enough tv's . Overall good place to catch the game or just hang out and have a good meal.", "Date": "2011-01-10", "Author_Location": "Jonesboro, GA"}, {"Author": "Alex C.", "ReviewID": "PX1Fh_JcqP6IK7Jg4bCkUA", "Overall": "3.0", "Content": "The one thing that stood out to me was the number of high def televisions.The food was mediocre but the service was exceptional. Our waiter was not only there any time we needed anything but he also was exceptionally helpful in providing recommendations. Nothing stands out on the menu, even the wings the so-called specialty didn't scream \"amazing\" to me.", "Date": "2011-01-19", "Author_Location": "Temple City, CA"}, {"Author": "Tina W.", "ReviewID": "0xVc985zoAm9NY2_Tz0Kig", "Overall": "4.0", "Content": "One of my first choices for watching sports events with a party of 5 or more; they have tv's galor and wide open spaces.  The food is better than bar food and the bartender makes just decent drinks.  The location is central to Midtown and you can usually find parking on Juniper instead of paying at the deck.", "Date": "2011-03-17", "Author_Location": "Atlanta, GA"}, {"Author": "Joey Y.", "ReviewID": "y0lXxLI_BI9jM7kULDoT1A", "Overall": "5.0", "Content": "My personal favorite sports bar in Atlanta.  Best wings in town. Over 50 TVs.  Best part, over 100 beers on tap and over 200 others in bottles.", "Date": "2011-09-16", "Author_Location": "Edgewater, Chicago, IL"}, {"Author": "John B.", "ReviewID": "nZyhddD47jtnLC1wIhcy0g", "Overall": "2.0", "Content": "Great place for beer and sports!  The food was not worth the 1.5 hours in traffic; 7 eleven was closer.", "Date": "2013-06-06", "Author_Location": "McDonough, GA"}, {"Author": "Susie H.", "ReviewID": "N_FjyjaSVQ72Mi8Hy6LfBg", "Overall": "3.0", "Content": "Really slow to get drinks and to have our order taken.  Food was good but average nothing special.", "Date": "2013-07-05", "Author_Location": "Newnan, GA"}, {"Author": "Michael R.", "ReviewID": "hTPkQV9p3ZHRD27ImyzxSg", "Overall": "1.0", "Content": "If I could give this place 0 stars I would. We ordered steak fajitas, and a bowl of soup. When the steak fajitas came there were only a few pieces of steak on the plate. Server told us that more steak would be coming in a few minutes. When it did come, it was a small plate very tiny cut pieces of steak. Not acceptable for the $13.95 that it cost. Furthermore when the bowl of soup came my wife ordered, and it was handed to her, it was so hot that she almost dropped it. When she indicated this and flinched, the waitress didn't apologize, or even respond. It wasn't until I mentioned it to the manager, that he  took notice, and the waitress muttered an  inauthentic apology. She indicated that she hadn't noticed. This was unbelievable. To top it off, the manager said I know you're not trying to get anything, but I will take the soup off of your check! Obviously, neither the waitress, nor the manager truly understood proper customer service etiquette. The waitress came and just about threw the check at us and in the end, came and gave us a couple of dessert items, with no explanation. This is a place I would absolutely avoid.", "Date": "2013-12-15", "Author_Location": "Los Angeles, CA"}, {"Author": "Yolanda M.", "ReviewID": "AqHmhR3aOh6v4RcFu5-O8Q", "Overall": "3.0", "Content": "Once my go to place, it has turned into somewhere that may not get anymore of my money because I remember how good it used to be. This location used to be the best... They changed the seasoning for the fries and Im sure our baskets sat for a while... Fries were luke warm when they arrived to the table. Long gone are the days where you could get half pound or full pound for boneless wings. Now you get 6 small boneless wings and fries for 6 dollars and some change. My bf got a 10 piece that came to us as an eight piece. Even the house ranch dressing didnt tickle my fancy as it once did. I hate to say it but it looks like the more business they got, the greedier they got and the taste of the food suffered. Don't you hate when you rant and rave about a place to someone and you take them there and the look at you like, wtf? Thanks for embarrassing me T Mac and making my taste buds sad..... I'll always remember the days where I would get excited to hear your name..... Deuces", "Date": "2012-11-24", "Author_Location": "Atlanta, GA"}, {"Author": "Joshua W.", "ReviewID": "q68iItLS2oC9x426AqTVYQ", "Overall": "5.0", "Content": "Unreal Draught Selection on beer.  You should be shot if you are drinking any Bud light Miller etc.  Went there for NBA finals- this place was bumping people actually cheering at a sports bar, and not just watchin.  Great Service and great wings.  Ask for my boy travis the bar tender, tip him well and he will treat you real well.  Sports bar with amazing atmosphere and amazing beer selection and good food no other bar in the area compares.  Sweetwater Georgia Brown is the best beer I have ever tasted.  I loved it so much that I bought a case to bring back to NY.", "Date": "2008-06-21", "Author_Location": "Huntington Station, NY"}, {"Author": "Ankur J.", "ReviewID": "IskY2Q2P5doa0Z8a9US4bw", "Overall": "4.0", "Content": "Good and affordable sports bar. Love the wings and their extensive beer selection. Convenient location and free parking validation.", "Date": "2013-03-27", "Author_Location": "Atlanta, GA"}, {"Author": "Thomas W.", "ReviewID": "LNgrCbZfpU86kp2xUQygnw", "Overall": "4.0", "Content": "Well, let's see, I am a regular long before Yelp. I have been coming here over the last few years one because the wings are great and it satisfies my need to see a good game that may be on. I get a rush from all of the noise so that doesnt bother me. This place stays open til a fairly late hour and allows me to hang out and still get grub and drinks at a decent price with a pretty friendly staff. Only once in my two years of going to this location have I had a bad serving experience and it was minimal... I just ordered another Long Island and kept it moving. Speaking of my last server Deon was absolutely amazing. He kept our regular drinks up, got the orders just right as we can be picky and he had a GREAT attitude. I will ask for him upon my return.", "Date": "2012-08-24", "Author_Location": "Atlanta, GA"}, {"Author": "Mulltea C.", "ReviewID": "00-ekrfwQqNKOcQJVCzu8Q", "Overall": "1.0", "Content": "The more I think about it, the more I have to say something about my experience in Taco Mac.  I have frequented this place several times for a beer or two and on occasion I will have a bite to eat.  On this particular visit I sat at the bar and asked for a menu.  I understand that the way the bar is shaped and its large size makes it difficult for one person to manage everyone when there is a crowd so I have no problem being exceptionally patient with the service.  In order to expedite the process I managed to have my order ready when my server arrived.  I ordered the Shrimp and Avocado salad without cheese and a Weyerbacher Merry Monks Draft.  I was quickly informed that my beer selection was out of stock, which is understandable so I took a moment to pick another selection and waited for my food and my second ordering opportunity.  When I decided on a beer it was due to the fact that I saw the tap handle behind the bar as it was not on the menu.  I ordered the Terrapin Hop Karma IPA and asked the server a few questions about the beer, which she struggled to answer. That made me a little unsettled about my choice and she quipped that it was 'very hoppy' and also a stronger ale.  When I got the beer I found it to have very few characteristics of an IPA.  It was brown in color and I could not detect any hop character at all.  I asked how long it had been there and she assured me 'about one year'.  I decided the beer must have gone off and let it go.  This, however, was not the worst part of my visit.  When my salad arrived it looked amazing, except for the fact that it was covered in feta cheese which I had asked politely to please remove, as I cannot eat it.  The staff member who delivered the food, quickly and politely agreed to have the salad remade.  My server stopped by and apologized for the mistake taking full responsibility and assured me that my new salad would return quickly.  I told the server, ' accidents happen' and I proceeded to wait for my remade salad.  When the second salad arrived it did not look very good at all.  I could tell something was wrong with it so I started to pick at it slowly.  Very quickly I discovered a large lump of rotten cilantro, an ingredient not included in the menu description, underneath the top portion of lettuce.  I then began to notice scattered bits of shredded cheddar cheese at the bottom of the plate.  Also not included in the menu description and also a food item that I cannot eat.  I stopped eating and asked my server for the menu.  I looked at the description and noticed that they had also left off the jalapenos, which had made the first salad look very nice.  My appetite was completely ruined.  Immediately I remembered, with shock, something that I had read recently. I will post it here for anyone interested in reading it as well. fda.gov/RegulatoryInform…I no longer felt safe eating food from this kitchen, and although I was offered by the kind manager to pay for my food and beer I thanked him and drank my beer and left.  I will not eat there again.  I am not even sure if I care to drink beer there again.  I have seen movies like Waiting and other evil comedies, but I surely hope that type of behavior does not occur in this industry.  Especially in an organization such as Taco Mac.  They have several locations, serve several thousand guests daily and have several human staff members.  Many mistakes are bound to happen, but there is no reason to tamper with a customers food.", "Date": "2011-02-01", "Author_Location": "Forsyth, NC"}, {"Author": "D.L H.", "ReviewID": "Ha4--o7a2BHAEZabFT4Ddw", "Overall": "3.0", "Content": "Taco Mac is the same as Chili's/TGI Fridays except that they have a truckload of beer.  Reason to go here, most defintely the beer selection and the vast number of tv's to watch sporting events. Pretty simple.", "Date": "2010-07-22", "Author_Location": "Atlanta, GA"}, {"Author": "Jennifer K.", "ReviewID": "yTnH2Ciu_HErL7HujGl0JA", "Overall": "1.0", "Content": "I find Taco Mac to be one of the more over-hyped restaurants/bars in Atlanta.  This particular location is exceptionally disappointing.  Yes this place has hundreds of beers, so it's not the worst place to be dragged to by friends.  However, I think a place that prides themselves in their beer selection would also try to have a staff that has even a vague knowledge of different types of beers.  The staff here is completely clueless.  If you know exactly what you're looking for, this isn't too bad of a place to go; however, if you want to try something new, do NOT come here looking for a recommendation.  Not only are the servers clueless when it comes to beer, they are also quite slow when it comes to bringing that beer that you ordered 20 minutes ago.  Also, Taco Mac's beers of the month are apparently comprised of just the worst beers they can get in a keg for that particular month.  To sum up, I extremely dislike Taco Mac.", "Date": "2009-03-03", "Author_Location": "Somerville, MA"}, {"Author": "Liz L.", "ReviewID": "ma6hGWUn6HB3moSHnot6dg", "Overall": "4.0", "Content": "Great sports bar.  a million tvs, a million beers, a huge bar.  service wasn't great but i let that go because i met some cool people.", "Date": "2012-11-07", "Author_Location": "Manhattan, NY"}, {"Author": "Eleanor G.", "ReviewID": "wJSEWLdkultOG2rBB-BYXQ", "Overall": "3.0", "Content": "TM Lindeburg parking?", "Date": "2012-11-05", "Author_Location": "Grayson, GA"}, {"Author": "Charisma H.", "ReviewID": "fAGumfUjs8fXycPzahjwFw", "Overall": "1.0", "Content": "they get a one star they took all the pasta items off the menu i was stuck ordering a cheese steak if i wanted that i could have went to the coner store,.", "Date": "2013-08-17", "Author_Location": "Newark, NJ"}, {"Author": "Catlady F.", "ReviewID": "CoqAismG_Lw3AyLLCgG4wg", "Overall": "4.0", "Content": "Wings, Fries, and Ranch Sauce..need I saw more? Those are the only 3 reasons I go to Taco Mac", "Date": "2010-08-21", "Author_Location": "Atlanta, GA"}, {"Author": "Tennille C.", "ReviewID": "r03xmW2Ds8SVLfvTZTll0w", "Overall": "5.0", "Content": "service was great. food tastey", "Date": "2011-02-06", "Author_Location": "Lithonia, GA"}, {"Author": "K S.", "ReviewID": "Fa3e5zjmRM3xF21_fefAhA", "Overall": "4.0", "Content": "Don't expect 5 star food from a sports bar. You're here for the games, the atmosphere, wings, and beer.  There are several dozen flat panel TVs in different sizes.  Usually the audio of the biggest game of the day is on, whatever that may be.  With regards to viewing college sports, it's close to Georgia Tech so they'll usually play Tech game audio over the others... this is a big plus for an alum like me since Tech games are often put on the back burner at other locations. Incidently, today there's Tech-Wake Forest and Bama(1)-UF(7) on at the same time. I wonder which game they'll choose. Hmm.... Anyway did I mention the awesome beer selection? This place is a true gem in midtown since a real sports bar in this part of town is scarce.  It's only a few short blocks away from where I live. If I need to catch a game that I can't get at home, I'm here! It's clean, spacious, and the service is very good. The manager always makes his rounds and asks how everything is going while I'm there.  Awesome beer selection and frankly I've not eaten anything there but wings and nachos of the dozens of times I've been there.  The wings are generally good but it's a hit or a miss. Sometimes I get really large, juicy wings dipped in plenty of sauce and (unfortunately) most other times I get smaller, tougher, drier ones which have been sitting there too long before refrying (most places will pre-cook wings halfway b/c it takes too long to cook from scratch - not sure about taco mac) or overcooked - I should know, I used to have a restaurant that sold wings.  Sauce flavor is very good.  I usually get 10 pieces with fries, add an order of celery (it's cheaper that way than to get celery with wings with an order of fries) and order of extra sauce in a cup (50 cents) so I could dip my wings. If you want wings swimming in sauce, it costs another dollar... c'mon, that's just nickel and diming now.  But whatever... Yum Yum.Food aside, I just think it's great that there's a watering hole like Taco Mac smack in the middle of Peachtree in Midtown where everywhere you look are filled with more expensive, fusion restaurants.", "Date": "2010-10-02", "Author_Location": "Atlanta, GA"}, {"Author": "Eric E.", "ReviewID": "3codAbkXuBXB5Fzy5e5RjA", "Overall": "4.0", "Content": "Friendly staff & one of the more outstanding beers selections I've encountered.  I wouldn't go there to value-shop or for the food specifically, but I was very satisfied with my check relative to the total experience.", "Date": "2011-04-18", "Author_Location": "San Diego, CA"}, {"Author": "Stan S.", "ReviewID": "A-3L3WeXVS30lbx4rVwwSg", "Overall": "3.0", "Content": "good wings", "Date": "2012-03-25", "Author_Location": "Atlanta, GA"}, {"Author": "E M.", "ReviewID": "YI_tAmQW25QVgDTV9Id-YA", "Overall": "3.0", "Content": "I give it a 3 because it's one of my local haunts, especially on gamedays, but it could use some improving. I feel like I'm being nickeled and dimed there, little charges for things that cost them nothing, like splitting an order of wings. A cool server -- and there are plenty there, attentive and laid-back -- will usually overlook those things. But there are other issues, like how the pint glasses seem to weigh in at about 15 ounces and how they serve mixed drinks out of a glass some bars would serve you a shot in. I've had the occasional bout with a short, bespectacled manager, one time over two members of our party being late, another time over a can of La Croix I walked in with. Both kind of eye-rolling moments. As you can see, I've been there a few times and have had some offputting experiences... but I go back. Went there yesterday for the Jets game. There are a ton of TVs, it's clean, the beer menu borders on a tome and its food -- for bar food -- is a shade above mediocre. And like I said, the servers are usually on time. As for as sports bars go, that's saying a helluva lot.", "Date": "2011-01-17", "Author_Location": "Atlanta, GA"}], "RestaurantInfo": {"RestaurantID": "_NgZDsG1xkS9877NcfEMjQ", "Name": "Taco Mac", "Price": "$$", "RestaurantURL": "/biz/taco-mac-atlanta-6", "Longitude": " -84.38391392546799", "Address": "933 Peachtree St NEAtlanta, GA 30309", "Latitude": " 33.780560215434996", "ImgURL": "//s3-media2.fl.yelpcdn.com/bphoto/Ehv_DxuzOrpsnzW6hltlzQ/90s.jpg"}}