{"Reviews": [{"Author": "Jacinta W.", "ReviewID": "j8sMXb_HBa18oVeqmxQq-w", "Overall": "5.0", "Content": "So, I have now been here three times for lunch, and lets just say...I could come everyday. Well, if they offered some cash incentive. LOLI was promptly greeted by wait staff when i walked up outside. And since the weather was awesome we sat outside. I ordered the 1/2 sandwich, soup, and salad. I absolutely love their baby spinach salad, the nuts, fruit and dressing blend very well together. Then the lobster bisque. I have to say I was expecting a little bit more with this. The soup was smooth, but I was hoping for much more lobster in the soup. And I did a BLT for the sandwich not much more excitement there. In the past I have had the grilled portabella sandwich. This sandwich is all you can hope for and MUCH more. The basil pesto is delicious and mouthwatering. Now I was told the pastry chef here was awesome so I tried a the carmel bread pudding. Talk about AWESOME SAUCE!  I thought I had died and gone to heaven. The carmel was warm and smooth, there was a nice touch of cinnamon and layered perfectly. Hands down this is one of the best bread puddings I have ever had. I can not wait to go back. I need to try them for dinner and brunch!If you are on the fence about going here...just GO! you won't be disappointed.", "Date": "2014-07-10", "Author_Location": "Saint Louis, MO"}, {"Author": "David A.", "ReviewID": "JBSMWeDGEKUPvYTSRg7-Dg", "Overall": "3.0", "Content": "My wife and I went for Sunday brunch.  I had the Country Eggs Benedict with a Spicy Mary (Bloody Mary) and a Doppio Espresso.  She ate the Chicken  Quesadillas along with Sangria.  Everything tasted great except my wife didn't like her drink.  The setting is very nice, clean, and elegant.  We ate inside, but the outdoor seating is great for a summer morning.Our problem was that the service was very slow and for no apparent reason.  Our waitress wasn't friendly, served large tables that came after us before us, and didn't apologize for slow service.  Moreover, while the outdoor patio was full, the indoor dining room was maybe half full.  Slow service isn't warranted when a restaurant is busy and is even less so when it isn't busy.  Nevertheless, we would eat here again, however, as the food and menu were good enough that Wild Flower deserves a second chance.", "Date": "2014-06-29", "Author_Location": "Chicago, IL"}, {"Author": "Jordan G.", "ReviewID": "i4p6zL8q2Id95eFYTVgmtg", "Overall": "5.0", "Content": "I recently moved to the Saint Louis area, specifically the Central West End, and have already eaten here three times! A great patio and atmosphere outside with amazing food. Wild Flower is a farm-to-table restaurant with naturally raised (organic) meat options and a yummy drink selection. A must have/eat in the the CWE!", "Date": "2014-06-19", "Author_Location": "Saint Louis, MO"}, {"Author": "Barbara A.", "ReviewID": "IRdib7wLrI2s8ETG3ZhV2w", "Overall": "4.0", "Content": "Great place! We had Sunday chicken dinners and risotto specials, the special wild orchid cocktail, tons of apps and not one word of complaint. The service was attentive and generous. I'll be back often.", "Date": "2014-07-13", "Author_Location": "Downtown, Saint Louis, MO"}, {"Author": "Jaime Y.", "ReviewID": "yTn51r-PVpYSPYfeK9iM1Q", "Overall": "4.0", "Content": "Really great food! Highly recommend the wild thing pizza and the brussel sprouts. The only reason this didn't get the fifth star is the service is extremely slow.", "Date": "2014-07-12", "Author_Location": "Saint Louis, MO"}, {"Author": "Lisa C.", "ReviewID": "jmBcCOwUDz8mtQ6EyNReTA", "Overall": "5.0", "Content": "I have been to wild flower three times now. Twice for lunch and once for dinner. Lunch was good but nothing to out of the ordinary but the dinner here is unbelievable. It was my friends 30th.  Our server was very attentive. We always had full drink. We were not rushed at all. Every single person loved their food. We all tried each other's. The garlic stuffed chicken was the best chicken dish I have ever had. It was so flavorful. I can't wait to go back!!!", "Date": "2014-07-10", "Author_Location": "Saint Louis, MO"}, {"Author": "Courtney G.", "ReviewID": "lxBtMJXbCtq7QuptuZnMjQ", "Overall": "3.0", "Content": "I wasn't sure what to expect coming here for brunch based on fellow yelpers reviews, but here's my two cents....for what it's worth. -beautiful patio space outside with shade so you are comfortable, even on STL hot and humid days-the Bellini and spiced Mary drinks were very good. The grand mimosa was so-so and way overpriced for the small glass. -go with the Maryland Benedict (crab cakes and eggs Benedict). Thanks to the other yelpers who suggested it. -salmon scramble was good-service was very slow and pretty much non existent for most of our visit. We were expecting this based on previous reviews so no surprise thereIn summary, I'm glad we tried this place for brunch. We stuck with yelpers suggestions so we weren't disappointed with the food. However I would suggest that you come here on a day when you aren't in a hurry because the service is definitely slow.", "Date": "2014-06-01", "Author_Location": "Eureka, MO"}, {"Author": "Brian P.", "ReviewID": "SQ6JMjNChYd7zxPIM7Lx1g", "Overall": "5.0", "Content": "As a St Louis native and local foodie, I've decided I should start yelping. I honestly can't tell you how many time I've been to Wildflower as this is easily my favorite establishment in St. Louis. I've only been here once for brunch; (and while I have eaten many quesadillas during the late hours) I advise this review accounts for mostly the social drinking aspect. I've gotten to know a few bartenders here but Sam comes across as one of the most friendly I've met. Equally as important, he is exceptional at his trade and I have yet to hand an empty glass to Sam and ask for his latest creation and not get an exceptional concoction. I won't soon forget that fat Will is the best bar back I've ever encountered and his drinks are excellent as well. In the end, I always go to Wildflower for the experience but I end up with the best drinks in St Louis and it's no surprise and I keep coming back for them.", "Date": "2014-07-03", "Author_Location": "West Lafayette, IN"}, {"Author": "Mike D.", "ReviewID": "bO3djy1eVIq2fzuvmM2iyg", "Overall": "2.0", "Content": "Wild Flower quite possibly has the worst service I've experienced in a local eatery.  During crowded times, e.g. Saturday night, Sunday brunch, etc the bar is under-staffed to the point you can expect a 15+ min wait before someone even acknowledges you, and that's even if you're sitting at the bar!  The wait staff is not much better and I'm not really sure if it's the actual people working there or more that they completely understaff.  Bottom line as a customer I could care less the cause for poor service when I'm waiting 20-30 mins for someone to come by my table and refill my drink.The food at Wild Flower is actually really good & they have a great patio out front which is perfect for CWE people watching while you eat/drink.  Unfortunately the bad far outweighs the good & I'd not recommend anyone go here unless you have unbelievable patience for poor service.", "Date": "2014-05-26", "Author_Location": "Saint Louis, MO"}, {"Author": "Alan D.", "ReviewID": "j1k97MZEVC33LTEORCu8ww", "Overall": "3.0", "Content": "I've been to wildflower twice now but haven't given a review so this review's going to cover both experiences. I give them three stars. Two for lunch and four for breakfast.  If you go for lunch you have to sit outside. Sitting inside will not be a good experience because of the noise level. The acoustics inside are absolutely terrible. You won't be a able hear a person yelling at you from across your table. The food however is pretty good and service is usually pretty decent.I did sit outside for breakfast so this was a much better experience. I give them four stars. Service was fantastic and I had the steak and egg special for $10.49 which came with hashbrowns and a bagel. I asked for the steak be medium rare but they brought it out medium well. Other than this I can't complain. Our server was prompt with constant coffee refills which is always a plus for breakfast service. Great food, great ambience, great service, decent prices. Would definitely recommend them for breakfast or brunch.", "Date": "2014-06-07", "Author_Location": "Saint Louis, MO"}, {"Author": "Daniel B.", "ReviewID": "cpI1LjXPu6Abh_jaqiym4Q", "Overall": "4.0", "Content": "This is my first time out exploring the CWE. I went here with my wife for a date night.  I thought the food was amazing. We started off with the Golden Chèvre salad, which was delicious. For the main course we had the Wild Mushroom Fettuccini with Salmom. Both the pasta and salmon were great. I saved room for dessert and had the which chocolate cannoli ....yum! The only thing that I didn't like was that they did not split the plates since I was sharing with my wife.", "Date": "2014-07-08", "Author_Location": "Houston, TX"}, {"Author": "Liz E.", "ReviewID": "J1notodtLLVKvYO-hrsl6A", "Overall": "2.0", "Content": "Went here for breakfast. Ordered something simple, eggs, bacon and hash browns. Came with english muffin. Hash browns were from a bag. No butter, no cream for coffee, no water. Had to go inside to request these items. By the time I got them, english muffin and coffee were cold. No refills on coffee or water. Not a relaxing breakfast. Not going back. I think they are getting by on the good location.", "Date": "2014-06-16", "Author_Location": "Central West End, Saint Louis, MO"}, {"Author": "Tiffani G.", "ReviewID": "5MsHtD96C1skJWdx6tcncQ", "Overall": "2.0", "Content": "I am still trying to figure out the hype about this place... The reviews on this place were amazing, and it being our first time in St Louis, we wanted to try something that was highly recommended!  The service here was AWFUL! Waited 10 minutes to place our drink order, and another 15 before our waitress ever came back to take our order. The coffee was nothing special, especially considering I had to wait long amounts of time in between refills! I had a trip sampler with a crabcake benidict, strawberry pancakes and fruit... Might have been nice to have the fruit on a separate place so it didn't get warm, but I survived with my warm fruit. Overall, the food was decent, but the service made the experience not so great!", "Date": "2014-06-27", "Author_Location": "Carrollton, TX"}, {"Author": "Margaret F.", "ReviewID": "zhU-5G95_oIs-NWvzxb2oA", "Overall": "3.0", "Content": "The food at this establishment is good, but the SERVICE is pathetically slow.  I have dined here many times, as I work at the medical center down the street, and it has always been slow.", "Date": "2014-07-08", "Author_Location": "Saint Louis, MO"}, {"Author": "Mallory T.", "ReviewID": "6jcXBMi9WPd-GFltuqDmEw", "Overall": "5.0", "Content": "Had lunch here a earlier in the week. I had the lentil burger and my husband had the chicken Cobb. Both were very good. I had the fruit on the side and he had the Caesar salad. We had great service say outside which I love. Our food was excellent! We will be back here for sure!", "Date": "2014-06-15", "Author_Location": "Champaign, IL"}, {"Author": "Krystal H.", "ReviewID": "L_oGHD0ahcbryB3XbW4s9g", "Overall": "1.0", "Content": "I came to town for a wedding and brought my boyfriend with. Two other friends were in town from Chicago and joined us.  It was a first and last time visit for all 4 of us.  There was no parking anywhere and we ended up walking quite awhile.  Even though I had a reservation, when we arrived our table wasn't ready.  The hostess was confused and explained that a manager would come explain the problem.  Someone came over and we were asked if we'd like to sit outside. We were short on time and decided that because it was fairly nice we could, but we were a tad chilly during brunch and it probably wouldn't have been our preference to do so.  We had one server for awhile but she just kind of stopped coming back.  Someone else eventually came over and asked if she could help us.  The place seemed really disorganized.   Our drinks took a VERY long time to be made, and service was exceptionally slow.  The place wasn't even that busy, which was part of why I was surprised that we were asked to sit outside.  The strawberry mojito was horrible. My boyfriend has never sent a drink back but this was undrinkable. It tasted like dirty water, as if the basil hadn't been cleaned.  Also the mint/basil wasn't muddled, just big hunks of leaves floating in the drink with some non ripe strawberries chopped up in there.  He ordered a regular mojito in its place but that just tasted like fizzy lime water.  Couldn't taste any alcohol and again, the mint was dirty and not muddled.    Of the 4 entrees, the best was the crabcake benedict. The gravy covered benedict was also very good. The Wild Thing scramble was so bland I had to use some gravy from someone elses plate to make it enjoyable.  The pancakes with apples and walnuts were fine, but could have easily been made at home for a fraction of the price.   I used to live in the central west end and have always heard great things about this place but it was the opposite for the four of us.  When you're only in town for so long you want each restaurant to be good since you have limited time and this was a total disappointment.", "Date": "2014-04-09", "Author_Location": "Philadelphia, PA"}, {"Author": "Doug B.", "ReviewID": "JAfhEqJyPPKmQpcAsBXHrg", "Overall": "4.0", "Content": "Wonderful Sunday brunch. Really liked the gluten-free pancakes.  Great ambiance with outdoor sidewalk seating. Wife compared the feel to a Paris cafe.  Very attentive and friendly staff.", "Date": "2014-06-29", "Author_Location": "Las Vegas, NV"}, {"Author": "Marie E.", "ReviewID": "d0l3H9YEMsAq9THtCVTKUw", "Overall": "2.0", "Content": "Our waiter was great and I love the atmosphere. The problem was the food. We ordered the pizza and the ahi. The ahi was just ok (the hummus and pesto that came with it was a little strange, and the greens were VERY salty) I expected more for the $28 price tag.The pizza was even more disappointing. It was very greasy with a soft crust that reminded me of frozen pizza (or DiGiorno). Again, not what I would expect from a restaurant that advertises local and organic food.", "Date": "2014-04-21", "Author_Location": "Oakland, CA"}, {"Author": "Jmm R.", "ReviewID": "imz98SeFulJ6uEELzFU9aA", "Overall": "1.0", "Content": "I'd love to describe the quality of food here but the service is so bad I had to leave an hour after placing my order with no food in sight.  No attempt to apologize or inform us about the delay.  Not the first time, unfortunately I didn't learn the first time.", "Date": "2014-05-09", "Author_Location": "Saint Louis, MO"}, {"Author": "Tracey O.", "ReviewID": "1aJvwymDFYjob8MWf8GhOw", "Overall": "5.0", "Content": "We stopped here for breakfast today.  It was a nice morning to be outside with all the hustle & bustle of the outside world.  The patio area was shaded, comfortable & the food was really good.  Not just your usual eggs & pancakes place, but they add their own twist to things.  Highly suggest for breakfast when you want something a tish different.", "Date": "2014-05-28", "Author_Location": "Saint Louis, MO"}, {"Author": "Holly H.", "ReviewID": "eGkVgvJYGSEl-KCSjBTCnA", "Overall": "4.0", "Content": "I found this place a few years ago through the Foodie STL cards, and have been enjoying it ever since. I love the atmosphere at Wild Flower. It's very quaint and romantic. Small candlelit tables, large windows, tin roof ceiling... all so charming! They also have a large patio that's great for weekend brunch in the warmer months.I've enjoyed many items off the three menus (brunch, lunch, and dinner) over the years. Cheese penne with crumbled pancetta, wild mushroom fettuccine, herbed cream cheese stuffed chicken breast, and bacon pancakes... just to name a few! The focaccia bread served with olive oil and grated cheese is excellent as well.I came for with my husband this weekend for my birthday dinner and decided on the wild mushroom fettuccine. There were mushrooms in every single bite and the light sauce really allowed their mild flavor to come through. My husband went with his favorite, the ribs. It's a very large portion served with green beans and macaroni and cheese. He has ordered these many times in the past, and though the meat usually just falls right off the bone, they were a little tough this time around. Hopefully that won't be the case again next time though. I was able to choose a birthday dessert and went with the chocolate cake. Good choice! It was drizzled with chocolate sauce and coated in a rich chocolate icing. This is a perfect spot to enjoy a nice day on the patio or come for a romantic date night. The food will be great at either time of day!", "Date": "2014-01-12", "Author_Location": "Imperial, MO"}, {"Author": "Matteo G.", "ReviewID": "NDCcODlpKVOeGWClmvClxA", "Overall": "2.0", "Content": "Food was great, waiting time unacceptable even for a Friday evening, one order got mixed up causing even more delay. We had a table inside and with three tables around being similar to hen houses it was impossible to enjoy or even talk. Server kept saying GOTCHA every other word (?!). It's unfortunate cause food is pretty good.", "Date": "2014-04-18", "Author_Location": "Thionville, France"}, {"Author": "Wella A.", "ReviewID": "-u5iIbyIHgrnjrrz_B1MeQ", "Overall": "2.0", "Content": "Breakfast consisted of bacon and scrambled eggs with spinach, and potatoes. But I might as well have had my poor continental breakfast from the hotel. Where did the taste go? And it didn't look pretty.  Scrambled eggs should not be runny. The potatoes looked dry and really tasted as if it came from the desert. The bacon was limp and very sad to look at.", "Date": "2014-04-16", "Author_Location": "Eugene, OR"}, {"Author": "William D.", "ReviewID": "hbMgpWrkmwvm-Uj2Iad4Pw", "Overall": "5.0", "Content": "I love this place. I have been coming here for 10 years now. Never a dissapointment.", "Date": "2014-04-24", "Author_Location": "O'Fallon, MO"}, {"Author": "Marilynn P.", "ReviewID": "JQPUMNaDuBrq-LZVgA2oAw", "Overall": "2.0", "Content": "Meh. Went here for breakfast this morning with a group of 8 and everyone felt this place was just average. The food was okay (nothing to really yelp about). I just had some eggs and toast (which was standard)... but everyone else in my group seemed to be really underwhelmed by there food. Most of the group enjoyed the potato sides, though. I think there are far better breakfast/brunch places to go to in STL, so I probably will not be back. Service was SUPER slow! we waited probably 15 minutes before someone came to get our drinks, 10 more minutes after that to order, 35-40 minutes to get our food, and 20 minutes to pay. Super slow, and no one really came around to ask us how we were doing. I just didn't feel very welcomed. And when we asked for various items (after our food was brought out), our server looked annoyed. Wasnt getting great vibes. Overall it was just an average experience and I won't be returning.", "Date": "2013-09-22", "Author_Location": "Chicago, IL"}, {"Author": "Remi F.", "ReviewID": "oYcBCqTOsmXiM6bYp62Wrw", "Overall": "4.0", "Content": "So we were told to go check out this restaurant during our trip to St Louis, It's late Wednesday night and the place is very busy ( good indication that it's popular ! ). My wife and I had a great diner. The only thing she got a little frustrated with her dessert taking too long so I got up and started walking to the kitchen to find out what's going on ? This big ( meaning lots of muscles ) guy sitting near by gets up and ask if everything was all right. I asked him about our dessert and if I needed to bake it myself...( joke ). Well it turns out that he is the owner/chef. Problem got resolved in a matter of seconds. And the owner ( Phil ) came to talk to us at our table and gave us a couple of places to go check out during our trip, What a nice guy ! Will definitely go back and recommend this great restaurant / bar.", "Date": "2014-04-16", "Author_Location": "Ventura, CA"}, {"Author": "Angela S.", "ReviewID": "0fUy4FuA-4Ru3d-wcgLcDg", "Overall": "2.0", "Content": "Brunch review.Not impressed. This is one of those forgettable spots because, well, nothing about it is memorable. Except the jelly packet I opened that revealed a layer of mold on top of the strawberry preserves. Gross, fuzzy mold. Jelly packet #2 was not much better. I know this is no one's fault, but seriously. Change out the jelly every once and awhile.Service was slow. Food was decent. That's all I got. I don't really want to put much energy into this review, since I know it's not a place I'd visit again.", "Date": "2013-08-12", "Author_Location": "Saint Louis, MO"}, {"Author": "Lizzy L.", "ReviewID": "NHQ5V5m2SfOSa7vfZfM1HA", "Overall": "4.0", "Content": "My husband brought me here for my birthday dinner and we enjoyed the whole experience! It was my first time there because it seems like Yelp reviews have mentioned that the wait/service isn't the greatest. But I was pleasantly surprised by our service--our waitress was attentive and they refilled our water often and were very accommodating.We were seated inside, and it seemed like the restaurant was a bit empty besides us and a few other tables. I ordered the Capelli Pescatore, angel hair pasta with pesto sauce, shrimp, scallops, and mussels and my husband ordered the Grass Fed Organic Hanger Steak. We munched on some delicious bread dipped in balsamic vinegar and olive oil as we waited for the food. I LOVED my husband's steak. WildFlower does steak wonderfully. It was tender, juicy, and super flavorful. I pretty much ate off of my poor husband's plate most of the night! My pasta was ok---the shrimp and mussels were delicious, but the scallops were mediocre. I love scallops when they're done perfectly and super tender, but the scallops in the pasta were a bit chewy and lacked flavor. The pesto sauce was good but not amazing/flavorful. The portions were big so we had a bit of leftovers.The best part of the meal, besides the hanger steak, was that they have a dessert tray that you can choose from!! Since it was my birthday that night, the waitress said I could choose one dessert for free. It was hard because there were several different cheesecakes, caramel bread pudding, a cream-filled pastry puff thingy, and more choices. I ended up choosing the strawberry cheesecake and it was phenomenal. I liked that I could taste the strawberry within the cheesecake itself, and it came with fresh strawberries too. I ate that cheesecake way too fast because it was so good. Next time I'm coming back for the truffle mac n cheese, which we we really wanted to order but restrained ourselves from doing so because we knew our entrees would be more than enough. Overall a delicious meal! A bit pricey so I won't be coming here often...but we decided to splurge a little on a nice meal for my birthday.", "Date": "2013-09-17", "Author_Location": "Durham, NC"}, {"Author": "Jenny P.", "ReviewID": "PiCltucUZlStihRY6rkO_A", "Overall": "3.0", "Content": "Unfortunately our service at Wildflower was pretty poor, but my food and cocktail enjoyment luckily bumped this review up from a 2 to a 3 star. I will start with the positives. Don't hesitate ordering the espresso martini or the bellini. They were so good that I had to stop myself from drinking them too fast! Their Signature Maryland Benedict was well worth the wait. The crab cakes were perfection and the dish was the best benedict I have had to date.Despite the great food and cocktails, I was surprised by the terrible service. We waited over 15 minutes for our drinks, a hour for our food once ordered (which is shocking for a brunch wait), and were stressed over finding someone to get us a coffee or drink refill. Spending 2 hours at brunch is ridiculous and we received no apology for our wait. Maybe they were short staffed or there was a problem in the kitchen, but I hope if I visit Wildflower again we have better service. Overall a great patio (be prepared to wait or make a reservation), excellent cocktail selections, and delicious brunch menu options. Just work on the service and I'll be a happy customer.", "Date": "2013-08-04", "Author_Location": "Brentwood, MO"}, {"Author": "David H.", "ReviewID": "5KN6q7iBOT7114HF_fYR1g", "Overall": "5.0", "Content": "This was a great find. We put enough money in the parking meter for 1 hr, but ended up running over by 44 minutes and therefore got a parking ticket. I would say it was worth it, though. We just happened to stumble upon the restaurant and realize now we made a great choice.  My colleagues and I started out with the Wild Thing Pizza. They use a truffle oil on it as well which brings out a phenomenal savory note. For lunch I had the grilled portabello sandwich. My colleague had the inside out lentil burger which was quite unique. Instead of a roll, they used 2 lentil burger patties to hold the avacado and mixed greens in the center. Another colleague had the salad with steak which contained large pieces of steak. I had a coupon for a free dessert. The waitress Alix was excellent and allowed us to choose a dessert which wasn't originally included. They use lots of local farm fresh items and are vegetarian friendly as well as gluten free. Would love to return for dinner.", "Date": "2014-05-17", "Author_Location": "Trenton, NJ"}, {"Author": "Derek H.", "ReviewID": "SJ73njT4pJxqrd81qxWZLQ", "Overall": "5.0", "Content": "I ate here for lunch last Friday.  I've always been a big fan of this place, and haven't taken enough advantage of the fact that it's so close to my work.  I sat at the bar, as the restaurant side was fairly full.  I got great service the entire time I was here.  Quick refills, and they even gave me some home made bread to start off with.  They usually don't provide that at lunch time, so it was a nice touch.  For my meal, I ordered the Ultimate Bacon Melt.  Holy cheese and bacon goodness.  It's a blend of gorgonzola, mozzarella, cheddar and provolone with a roasted garlic puree on bread, with applewood smoked bacon.  Hello!  It comes with fries, and it's a huge portion for lunch.  If you come here for lunch, be sure to order this.  Trust me, you'll be happy you did.  Minus the 900 calories you consumed. :)  I'm a big fan of this place, and will continue to give it my business.", "Date": "2013-06-24", "Author_Location": "Imperial, MO"}, {"Author": "Chad H.", "ReviewID": "39nNiG9b8kf5-xJpFE-KAQ", "Overall": "4.0", "Content": "As a kitchen worker myself I have pretty high standards but nothing ridiculous. I haven't had a dinner as good as this in a very long time. Service was excellent and the food exceptional. The cocktails needed work but was still a good drink. I will continue to come back and tell everyone I know about Wildflower.", "Date": "2014-02-27", "Author_Location": "Nashville, TN"}, {"Author": "Scott C.", "ReviewID": "X2_5SokMAbKU_W9iKxdP9g", "Overall": "4.0", "Content": "First time Ive been here and gotta say it was good.  Had an amzing bacon and cheese sandwich and loved it.  NIce place all in all and Id go back for sure. Waitress was great and mega friendly.  Ill keep this place on my radar", "Date": "2014-03-12", "Author_Location": "St Louis, MO"}, {"Author": "Brian B.", "ReviewID": "8U3nDJNKIeB0UhVgt18_lg", "Overall": "2.0", "Content": "I have been to Wildflower dozens of times over the past few years, and if there's one thing I've noticed, it's that the service is getting worse every day.  While I'm willing to deal with the occasional order mix-up for the sake of dining at a convenient location with decent food, the service of late has become downright rude.  My visit last week is a shining example.A friend and I went to their bar on a Wednesday evening recently, figuring we could grab a drink to enjoy the fine weather.  The bar was fairly busy, but not overwhelmingly so.  We stood at the bar for about 10 minutes before the bartender approached us (keep in mind, this bar is barely 20 feet long).  An acquaintance of mine who was near us had been waiting for about as long, and so we moved to include her on our order.  He took her order, but did not take ours.We waited another 5 minutes before he finally came back to us.  My friend gave his order, and it had been so long since we got there that I had to glance back down at the menu for a brief second to refresh my memory.  This was literally a 1-second process.  Yet, he impatiently and rudely blurted out \"Figure out what you want,\" over me actually giving him my order.  He then turned and went to the other side of the bar, ignoring our order, and proceeding to take another round of orders from a group of guys who he had obviously already overserved up to that point.My friend and I were so incensed that we left and went elsewhere.  Here's the bigger issue, though: Wildflower has a decent menu.  Nothing on the menu is particularly stunning, but it's all pretty passable and the variety is enough to please a group of diners with differing palates.  The ambience is better outside than inside, but it's a noisy corner with a lot of foot traffic.  All told, there's nothing particularly overwhelming about the product or location.  For a place like this, repeat patronage hinges upon the quality of the service.  This is why the management should be concerned about our recent experience.  The bartender's rudeness was so profound that it manages to cast a pall over all of the things that Wildflower does passably.  I honestly have reservations about giving Wildflower my business again.", "Date": "2013-05-20", "Author_Location": "Saint Louis, MO"}, {"Author": "Shreya N.", "ReviewID": "WRhrS1ipUp_HIJ-V-9e91g", "Overall": "4.0", "Content": "I've only been here once for one of my close friend's birthday. We sat outside on a cool, breezy september night and it was delightful. The inside had great decor, but sitting outside with the heat lamps and good friends was too nice to pass up.  We started off by ordering drinks. I ordered the French 75 which was delicious. I think my other friends ordered various beers and cocktails. They were all well made.  For dinner I ordered the Wild Mushroom Fettuccini and it was a decent sized portion. The sauce was creamy, the truffle oil was in perfect proportion and the mushrooms were delectable. I wasn't able to finish the whole plate as it was a heavy dish but my tastebuds thoroughly enjoyed the meal. I don't remember what everyone else ordered, but I do know they all seemed to enjoy their dishes.  Service was great as well. Parking was eh, but what else do you expect from CWE? Conclusion: I need to go back to this lovely place!", "Date": "2013-05-23", "Author_Location": "Orange, CA"}, {"Author": "Richa T.", "ReviewID": "6ANqzGuyCsqTFHcH3qQ0hw", "Overall": "4.0", "Content": "I actually ordered take-out from here the other night and absolutely loved it.  I will make sure my next visit will be one where I can sit down for a meal with friends.  The service as super friendly and extremely quick.  They had my order ready in less than ten minutes.  When I came into pick it up, the food was ready to go along with my check!  Extra points for making my life easier.Sure finding a parking spot took longer than it did to walk the two blocks over to a wildflower pick up the food and get back, but it was definitely worth the trouble. I was afraid my food would get cold on the way home, but it was piping hot even after sitting in my cold car for twenty minutes.  The did a great job of wrapping it up in aluminum foil so my food tasted like it just came out of the oven.  I ordered the ruffle Mac and cheese since I just wanted a light meal. But oh my gosh, this is so filling and definitely a full meal by itself. Opening the box I could really smell the truffle oil filling my entire apartment.  It smelt great and tasted pretty good too.  The only thing I could see that might improve the dish would be just a little less oil because it is a really really strong fragrance. But other than that I really enjoyed it! Another great thing about this is that if you check in on yelp, you get a free dessert. So more incentive to be extra yelps.", "Date": "2014-01-30", "Author_Location": "Dallas, TX"}, {"Author": "Lina H.", "ReviewID": "buyajjCpkntJOJb0tsbhaw", "Overall": "2.0", "Content": "I keep trying to give this place second chances but I think I need to finally stop. The only reason this review isn't 1 star is because the bartenders on the bar side were very nice. On the restaurant side, our waiter could barely remember what the specials were and what dishes had what ingredients. So let's see, where to start...I guess the my very first impression here was their mojito. I just got a plain old regular mojito but it didn't taste that great - lots and lots of syrup it seemed. Next, I got some sort of mushroom pasta....meh. It was exactly what the name said and nothing more, only mushrooms tossed with some plain pasta. It was very bland and I got tired of it after a few bites. The bf ordered the garlic chicken, except I hardly consider that to be chicken meat.  The texture of the \"chicken\" was way off, it was chewy and crunchy and tasteless. It wasn't dry like it was overcooked and the wrong texture for undercooked so I have no idea what it was or how it was prepped but it definitely wasn't anything resembling normal chicken. Plus the cream inside the \"chicken\" was in an overwhelming proportion. Plus I think most of the items on the menu are overpriced - especially for what they're serving.", "Date": "2013-11-28", "Author_Location": "Sacramento, CA"}, {"Author": "Stephen R.", "ReviewID": "O3L95bepSHyD141W8DFBdQ", "Overall": "4.0", "Content": "We had an awesome dinner.  Attentive wait staff.  It started sprinkling while we were stting outside and they moved us to a covered outside seat upon our request.I had the salmon special of the day which was unreal.  Also as an appetizer i had the truffled fries.  They were solid.  We also tried the hummus and breads appetizer which was worth every cent.  Definitely deserves more respect than it has gotten on Yelp.", "Date": "2013-06-12", "Author_Location": "Syracuse, NY"}, {"Author": "Heather K.", "ReviewID": "h-sAjGF9RJ_9qnKGDwfRcA", "Overall": "2.0", "Content": "So I was really excited about dining here after hearing amazing reviews from friends and eyeing the menu online. (The menu and atmosphere are the only reason this review has two stars)We arrived around 830 and were sat almost immediately after ordering a drink at the bar. I will say that it's a small and very difficult area to maneuver through but that's neither here nor there. Our server came to our table promptly and explained the specials to which I ordered the salmon. Which was not cooked thoroughly and \"thrown back on the grill\" which left the out side of my fish completely burnt. My date ordered a pasta with shrimp. The skin was not completely peeled off either. (My biggest pet peeve) and because the tails were removed, we were left assuming it was ok to eat the entire thing! At this point you can imagine us trying to spit our food out discreetly... Our server was neither apologetic or present for most of our dinner, it took almost 10 minutes for me to get her attention about my undercooked fish! Nor was I offered another glass of wine after I finished my first. All in all, the menu has potential, everything looked and smelled amazing. It's just too bad that it's not prepared correctly and that the service is abysmal.", "Date": "2013-11-02", "Author_Location": "O'Fallon, MO"}, {"Author": "Vaish P.", "ReviewID": "P5uhDGNhfFThuycq-6zS-Q", "Overall": "5.0", "Content": "HIMYM fans will appreciate this reference: Wild Flower is my MacLaren's. Though not under my apartment (oh how I wish!), Wild Flower is an institution that has grown to become an integral part of my life in St. Louis. I probably shouldn't say that about a bar huh?Well anyways, service here is impeccable. The bartenders are the friendliest. And the late night happy hour definitely doesn't hurt their cause. I began going to wildflower regularly starting around the beginning of this year, mainly for their late night happy hour. Now I keep going back just for the people. The staff here immediately befriended me and looked out to ensure that I always had a great time!Although the bar has become an integral part of my social life here, I have only actually eaten at wild flower a few times. Everything I've tried has been delicious. If you haven't had their truffle mac and cheese yet, you need to! Also be sure to order their signature wild orchid. And if you stick around long enough, the bartenders just might name a drink after you!", "Date": "2013-05-14", "Author_Location": "Saint Louis, MO"}, {"Author": "Erin G.", "ReviewID": "xkFeBgWZW_YR7Dip5hfBmQ", "Overall": "3.0", "Content": "Their brunch is delicious - I LOVED that they have crab cakes benedict, which is one of my favorite meals. The only downside was the service - it was pretty slow.", "Date": "2013-07-13", "Author_Location": "Saint Louis, MO"}, {"Author": "Kevin P.", "ReviewID": "OWmu3URkK-dZRKmwQw9pCA", "Overall": "5.0", "Content": "Half the reason why I set up a Yelp account was to give Wild Flower 5 stars.I've been living in the CWE for 5 years now and this is my go-to bar. Several years ago, when I was new to the area, I visited several times and quickly became friends with the staff and owners. They are all very personable and friendly. I will say that I pretty much only go for drinks and late night munchies. The drink prices are as reasonable as they come and the late night menu is full of delicious goodies that won't break the bank. Two must-try items are the chicken nachos (aka \"crack nachos\") and the mac'n'cheese (made with truffle oil and baked to perfection). Lately they have been showcasing many of the local microbrews on tap (Urban Chestnut, Civil Life, 4 Hands). They are all awesome. So gather your friends, get thirsty, and come for a drink! or two, or three, or ...If you're new to the area and don't know too many people yet, there are plenty of people to drink with there so just come, preferably with an interesting story...or at least a joke.", "Date": "2013-11-15", "Author_Location": "Saint Louis, MO"}, {"Author": "Justin D.", "ReviewID": "ssyrub5Ix34HG3cj78K01w", "Overall": "5.0", "Content": "This place never disappoints.  A creative drink menu, excellently prepared dishes, and al fresco dining.  What more can you ask for?Brunch is affordable with many tempting options to choose from, just ask your server!Dinner is a bit pricier, but since the food is so good and well prepared it's worth every cent.", "Date": "2013-06-26", "Author_Location": "Saint Louis, MO"}, {"Author": "Steven K.", "ReviewID": "AM20UedjWmUm8HG51ZN_Kw", "Overall": "5.0", "Content": "Went for brunch before leaving town. Had the breakfast wrap which was tasty! Perfectly cooked eggs and bacon wrapped up and covered in cheese. You can't go wrong with that. Have been multiple times and the service is always great, food always above average and ambiance is great. Sitting out on the patio during the nice months is a plus as well. If you are feeling very hungry (or in my case, hung over) then get the country style benedict. 2 biscuits, eggs, sausage, bacon, all covered in sausage gravy. Its a excellent if not extremely filling meal that will leave you very satisfied.", "Date": "2013-07-13", "Author_Location": "Austin, TX"}, {"Author": "Drena L.", "ReviewID": "6w2_G77gPr_JzuurLZBUlQ", "Overall": "5.0", "Content": "Salads were tasty-wild thing pizza app was fantastic and bread pudding was to die for!!  Service was outstanding!!  We will be back!", "Date": "2014-01-18", "Author_Location": "Saint Louis, MO"}, {"Author": "Travis F.", "ReviewID": "xfYDq5FQVC4h2ayZIwX7Gg", "Overall": "5.0", "Content": "You know, I thought this place was excellent. I had the 4 cheese penne which was off the chain. My wife had a filet which was outstanding, that being said, I think a filet from Stuckey's would score a 5 so... Take that with a grain of salt. I would definitely recommend stopping here.", "Date": "2013-05-08", "Author_Location": "Panama, NE"}, {"Author": "Al A.", "ReviewID": "UgHt9Rxx324eXcivzCj3Jg", "Overall": "4.0", "Content": "I have eaten here any number of times while working in the area. Food is always really good and the service is as well. The food is a bit upscale in it's style and pricing, but not crazy. Maybe not the place to go for a typical steak-and-fries type meal, but not so fancy that you feel out of place in jeans and a sweatshirt. Have never been disappointed here.", "Date": "2014-04-04", "Author_Location": "Dracut, MA"}, {"Author": "Dr SexTalk", "ReviewID": "FJ0RRyrNn-yqUJnrY0Wr2A", "Overall": "4.0", "Content": "I enjoyed this restaurant for brunch and found most reviews to be accurate.  I was especially happy they were open to 3. The location is ideal and patio is perfect for good weather.  Quaint, fun, and relaxing.  Menu appears to be more exotic than it really is, but all the food was good and fresh.  I had great service!I had crab cake Benedict, apple walnut pancakes and fresh fruit.  Sounds more exotic than it was - crab cake good (nothing like Bristol's), pre made mix of hollandaise sauce and the apple pancakes were pancakes with some walnuts and slivers of apple.  Presentation was great, sizes were perfect and quality was good.It's just for the location, great ambiance, vibe and menu descriptions you'd expect a meal from a scratch kitchen.  I would go back and recommend to others, just don't go for the food alone.", "Date": "2013-04-28", "Author_Location": "Phoenix, AZ"}, {"Author": "Aimee K.", "ReviewID": "8IRP2xJMll78f_yxngFbYw", "Overall": "4.0", "Content": "As my mother describes this place, it's \"a place to go if you want to feel like you're cool.\" I'm definitely a fan of feeling as cool as possible, so to Wild Flower I went.Every time I go I'm reminded of how incredible the food is... I wish St. Louis wasn't so flippin' humid or we would have sat outside on the patio to watch the action in the CWE, but we grabbed a seat inside instead. Oh the woes of having naturally curly hair.Our dinner started out kind of rough because we sat there for a good ten minutes without a server coming over to take our drink over, but Curtis came over when I told him no one had stopped by yet. I ordered the wild berry margarita, and can we take a moment to talk about how good that thing is? Fruity but not too sweet, a little sour, with a ton of great flavor. Wish I could have had more, I'm actually kind of regretting stopping at one. To start we had the goat cheese & herb roasted beets, and wow. Wow wow wow. It's an assortment of roasted beets, toasted pistachios, golden raisins and goat cheese, drizzled with a horseradish vinaigrette. The beats were so thick and hearty, and I was so sad when they were gone. Definitely order them if you're a beet fan. For my entree I had the sea bass... it comes pan roasted and drizzled with a red pepper coulis, served on a bed of creamy parsnip puree with fresh seasonal vegetables (which tonight was asparagus.) Everything about it was five star. As someone who doesn't eat fish often and can only eat fish that's pretty mild, this was a great choice. The food was amazing from the bread & olive oil at the beginning, all the way to the end. Our server offered to bring us free dessert for my friend's birthday, but she's dieting for her wedding and declined. Sadface.I really, really like this place. I'll be back soon!", "Date": "2012-05-26", "Author_Location": "Saint Louis, MO"}, {"Author": "Joe B.", "ReviewID": "qmmkTtM68HP_iIGpxcJM9Q", "Overall": "5.0", "Content": "I have a huge backlog of bookmarks, so I thought that choosing a locale for my 200th review would be a long, drawn out affair as I internally debated the merits and weaknesses of each candidate.  My search ended quickly when I came across Wild Flower.  I used to live two blocks away, and I've visited Wild Flower on many occasions.  Day or night, weekday or weekend, inside or outside, Wild Flower has never failed to impress me and my guest(s).Outside: The sidewalk cafe has plenty of seats and is ideal for people-watching.  Service is prompt, the tables sport some funky art, and the staff fires up the heaters during the chillier nights.Inside: As proof of the versatility of Wild Flower, the inside dining area is pure class complete with white tablecloths and candlelight.Interior Bar: My favorite part of Wild Flower is made of a trinity of (1) excellent happy hour prices, (2) superb food and drink, and (3) some of the most personal service I've ever experienced anywhere.  I use the term \"friendly\" to describe good bartenders at 3-star establishments, but at Wild Flower, the bartenders truly act like your good friends.  This sort of service has to be experienced, not simply read about, I therefore urge you to have a similar 5-star experience at Wild Flower.", "Date": "2010-10-24", "Author_Location": "Springfield, IL"}, {"Author": "Anuradha G.", "ReviewID": "dveA00hxfiiIksPqGU97dA", "Overall": "3.0", "Content": "Wildflower has a cute ambiance, with plenty outdoor seating. We were there for a birthday brunch, with a party of around 10 people. The menu has a fair amount of both breakfast and lunch options. Unfortunately, this aspect was undermined by the poor service. The servers were friendly but inattentive. It took us 15 minutes to order and significantly longer to get our food even though the restaurant wasn't packed. I totally understand it's hard navigating a big party but it was a challenge to get anyone's attention to ask for more water, an extra plate, or even the check. The food we ordered was good however so it's not a bad place to go if time isn't a constraint.", "Date": "2013-10-19", "Author_Location": "Central West End, Saint Louis, MO"}, {"Author": "Patt C.", "ReviewID": "HdATY2ZQinGdNjZSLPhTqg", "Overall": "2.0", "Content": "Went today at 1 p.m. Breakfast/brunch/lunch . . . whatever. Had a reservation, so seated right away.I'm a big water drinker, and our server couldn't get that, so my glass was always empty. Just bring me a pitcher.I got eggs benedict. Friend got crab cakes. Friend's Mom got waffle. My serving was huge with lots of cubed (and crusty) potatoes and a double on the benedict. Friend got two rather small crab cakes with a piece of arugula and a schmear of a remolade sauce on a huge plate. Friend's Mom got waffle with strawberries. Strawberry pieces were small and sparse. Syrup was the standard maple.Server disappeared for quite some time during the meal.It was clear when they wanted us to leave . . . no more water refills, no more coffee refills, no more \"do you want another wine?\". And I noticed the hostess looking askance at us when large parties came in.Well, we actually would have left earlier, but the server didn't come to take my plate. I needed a box. WHEN server finally came to take the plate away, she was GOING TO TAKE IT AWAY. I had to ask for a box. HELLO!! I ate less than half of it. Put that together into, \"Would you like a box?\" We ate al fresco, and there was LOTS of moving of tables and chairs by staff to accommodate parties. So much so that it was distracting. I get the concept, but it was A LOT!!The food was: eggs benedict -- great; crab cakes -- OK; waffle -- fine.To clarify the two stars -- nonexistent service (we were really crampin' her style to have even been there!), mediocre at best crab cakes and waffle, and ridiculously disparate serving sizes.", "Date": "2010-10-10", "Author_Location": "Chesterfield, MO"}, {"Author": "Steven B.", "ReviewID": "4oBTHqdIE0URk_IVHMaENw", "Overall": "4.0", "Content": "I have gotta tell you, our service was over the top and the food was very good.We started our night out at the bar with cocktails. The bartender Jason was very personable and charming. He always checked in with us to make sure a good time was being had by all.  He remembered our drinks and I love it when a mixologist remembers my drink. It shows an extra effort in customer serviceAfter a couple rounds of drinks, we were ready for dinner. We informed the hostess who was cute as a button (I never did understand that expression, are buttons really cute?), that were ready to be seated. We wanted a table up on the raised platform, but it was all reserved for a large private party and had to settle on a table by the windows. Which ended up being the better choice. Our waiter was attentive, knew his menu and how to sell each featured entree. In  fact he sold two of them so well, that we only experienced two of their entrees. If I had to choose between the two, I'd have to go with the one that Jillian and I enjoyed; Grilled Salmon served with Grilled Asparagus and Couscous. They grilled it to a perfect medium-rare and the asparagus was grilled to the right tenderness. I am always amazed how I can eat salmon medium-rare, but don't you dare offer me sushi. Brad and Brent had the Bison Hanger Steak which was served with Mashed Potatoes and Green Beans. Their Bison was so tender, it could be sliced with your fork and you could tell the mashed potatoes were whipped with whole milk. Let's not forget green beans that were prepared with the right snapPortions were huge, so huge that we had to ask for a take-me-home box. To my surprise, they offer a totally eco-friendly container. Good liquor, good food, good service and eco-friendly containers for carryout will bring me back for another visit.", "Date": "2011-11-28", "Author_Location": "St Louis, MO"}, {"Author": "Stephanie S.", "ReviewID": "zs0QLVXzld_s8-Y6yN5fAw", "Overall": "4.0", "Content": "After the Greek Festival, me and Joselyn H. hit up Wildflower for some drinks! I can't speak for the inside (who would want to sit indoors on such a beautiful day?!), but the outside was quite amazing. I love outdoor patios! Lots of seating, and we were on a prime corner of Euclid; great for CWE people watching. I had the Tailgate Party Punch: Myers and Malibu rums, banana liqueur, orange and pineapple juice, and a grenadine floater. SO good. This was like a tropical vacation in a glass! Actually, it reminded me of my 21st birthday in Vegas, where I was slurping down Malibu and pineapples like it was my JOB. Delicious, either way. I had a tummy full of gyro, but somehow, I was still interested in dessert. I made a promise to myself that I would only order dessert if they had bread pudding...and what do you know?! THEY HAD BREAD PUDDING! Creme brulee bread pudding, to be exact. It was quite delicious, and had a crispy top, yielding to a sweet and soft middle. It tasted just like french toast. Yum. This was a solid dish for sure. Not my FAVORITE bread pudding, but certainly not the worst. It landed somewhere right in the middle. Service was abysmal. Perhaps it was the Labor Day crowd, but I swear our waitress only came out once every 20 minutes. It was ridiculous. She was nice, but was invisible for most of the time. I would definitely come back to Wildflower to sample more of their cocktail list, which is why I'm giving it 4 stars. Good stuff!", "Date": "2011-09-05", "Author_Location": "Saint Louis, MO"}, {"Author": "Abby S.", "ReviewID": "5NPh8-gQY-fKk9OG-TpeTw", "Overall": "3.0", "Content": "Wild Flower is in the heart of the CWE and I often see SLU and Wash U kids there late night. It's a great place to stop by on your way to Tom's or the Loading Zone.The espresso martinis at Wild Flower will most definitely go down easy, but they will leave you lying awake at night with major heart palpitations. Or maybe that was just me :)Parking in this area is kind of a pain, and be sure to pay your meter until 7 pm, except on Sundays! If I do come here late night, I definitely need someone to walk me to my car...not that it's terribly scary, but it is dark and there are some unsavory characters lurking around. Overall, a cool CWE joint.", "Date": "2009-12-09", "Author_Location": "San Francisco, CA"}, {"Author": "mike l.", "ReviewID": "Anou-BJP_BqrXYAUjTB6Zw", "Overall": "2.0", "Content": "I'm with christy l, I really wanted to like this place. Twice, I really wanted to like this place. we took a stroll over for lunch a few weeks ago. The wif enjoyed it a lot more than I did. I didn't hate it, but she really liked it. So, I was willing to try it again. Went for dinner last night and everything just tasted blah. Nothing was seasoned at all. Everything tasted a like raw protein substance you'd see in some post-apocalyptic movie where the survivors of the robot attack had to eat grey, slop fungus just to stay alive. While I was in the midst of a killer attack of the hiccups, the waitress / bus girl came by to clear our plates. I didn't touch any of my veggies or potatoes but she decided I didn't want them. I couldn't say \"Hey Wang, wrap my shit up\" because my esophagus kept closing up. Stupid futuristic robot overlords stole my limp zucchini....", "Date": "2008-06-22", "Author_Location": "Brooklyn, NY"}, {"Author": "Joselyn H.", "ReviewID": "2_FsJyMgOhbp-jzINk4NDw", "Overall": "4.0", "Content": "This is one of my favorite places to get dinner in STL.  I live right near, so the convenience factor is nice.  I love their patio during the warm months.  Each time i eat here, my food has been great.  I like to take out of towners here.  I took my mom here and they had a special that night.  It was considered an appetizer, but could have been an entree cause it was HUGE.  It was a potato pacake covered in seafood and some kind of white sauce.  It was sooo good.  The best part was the amount of seafood (lobster, scallops and shrimp).  The lobster claw had the meat removed and this was placed on top, which made for an elegant presentation.  We ate that, plus salads as our entrees and left very FULL!  They also have amazing margaritas!  They are not traditional margs. as they are pink, but man are they tasty!!  Like most places the drinks are way overpriced.  I actually won't order wine here cause I know how much they mark up the bottles.", "Date": "2008-04-23", "Author_Location": "Saint Louis, MO"}, {"Author": "Cherie O.", "ReviewID": "GHANOfAtjj_m64YEvPAlFw", "Overall": "2.0", "Content": "So I'm going to still give Wild Flower two stars, but it just might be a little on the 2.5 star side. The reason why is that I've only been back twice, but both times were in huge catered groups. I haven't come back with only one or two dining companions, and that may make a difference.So both times I've been back, I've been upstairs in what they call \"The Loft\". The first was for a wedding reception last year, and honestly, I wouldn't have changed my rating at that time. It was super crowded during the mingling, the dinner, and the dancing afterwards, almost to the point of claustrophobia. I had the Cognac Chicken, which is still on the menu nowadays, and I really wasn't that impressed. Good serving size, but it was on the dry side. It was even worse because the bar was closed during dinner, and so all you had was either water or the rest of the drink that you had ordered before dinner (not sure if this is Wild Flower's policy or was decreed by bride and groom). Lesson learned? You cannot fit 100 people upstairs!Last month I went for a recruiting dinner. I was not looking forward to it, secondary to these past experiences, but the recruiter had been super sweet to me, and who knows who'll you meet while networking, right? I was pleasantly surprised. They had sort of a happy hour prior to dinner with an open bar and cheese, fruit, and crackers. Your usual stuff. It was very comfortable seating...there were about fifty seats available. I had the Citrus Glazed Salmon (which is seared with a orange beurre blanc sauce). It was...perfect. The sad part is that it's not even on the regular menu! My neighbor had the vegetarian option, and it pretty much looked like my pasta from my first experience: limp and watery. So I'm really not sure what to think. I think Wild Flower has a lot of potential, but where is that potential every other time??", "Date": "2011-11-04", "Author_Location": "Saint Louis, MO"}, {"Author": "Susan S.", "ReviewID": "iYmVCBQ_7Z3IQVScKWEzfg", "Overall": "1.0", "Content": "Ewwww.  \"Lunch\" at Wild Flower made me very cranky today.Working nearby, I've had lunch quite often  at Wild Flower.  I tend to order the same few things, including the grilled salmon sandwich with spinach salad.The meal was completely disappointing this time around.  The spinach salad had almost no dressing on it---85% of the leaves were completely dry, the other 15% slightly damp, and there was no liquid at the bottom of the bowl.  My friend's salad was the same.  I wanted to ask the server for some additional dressing, but we only saw him when he came to the table to serve up some disappointment, I mean, the entree.  My grilled salmon sandwich looked a little dry on the outside, as if it had been sitting on the line for awhile.  The ramekin of aioli had that crusty film on top, suggesting that it had hangin around, too. Biting into the sandwich game me a shock---instead of dry and overdone, the darn thing was completely raw and slimy inside.  Bad surprise!  Sushi would luv to be so raw!  I flagged the server who said he'd have the kitchen cook it some more (really?!)  I just knew it was gonna come back overdone.  Fish cooked twice? I was wrong, though.  The kitchen simply seared the part I had bitten into---the inside was still raw.  (I imagine the chef saying \"psych!\") I walked through the restaurant, in search of a manager.  Instead, the bartender took my plate.  The server came over and asked if I'd like something else.  Too bad for me---lunch hour was over!The really annoying part is that they charged me full side salad price---since my dry salad was no longer part of the sandwich menu add on.  Really, I should not have been charged anything.There are many, many restaurant options in the CWE---and that's where I'm taking my wallet.", "Date": "2012-04-11", "Author_Location": "Saint Louis, MO"}, {"Author": "Kate B.", "ReviewID": "WfM_GEgHbWd29p3UsI6fbQ", "Overall": "4.0", "Content": "This is my review for their lunch... it's an update to my review for their breakfast.Decided to come here on Thursday around 2:30pm or so after picking up my parents from the airport. They had flown in for my graduation ceremony later that night. We were all really starved so fellow Yelper Mary Kate A. suggested we hit up Wildflower because they have some great lunch options.We didn't need to make a reservation which was awesome. We just walked on in! It took a little while for them to take our order but it gave us enough time to decide which we actually needed since I'd never been here for lunch before and I couldn't really make recommendations. I know I had to try the lobster bisque though!My mom ordered the goat cheese salad with salmon on top, my boyfriend got the club sandwich thing with fries, and my dad ordered the tomato bisque (bowl.) I had the mushroom ravioli and the lobster bisque. I tried a little of each dish except for my bf's sandwich so I can't comment on it. He said he really liked the fries even though they had some kind of herb seasoning on them and my mom agreed. His sandwich was \"okay.\"The lobster bisque was really light! I was so shocked! Usually lobster bisque is really heavy and leaves you feeling guilty the rest of the day but this stuff was nice and light and still flavorful. A+The mushroom fettuccine, on the other hand, wasn't as great. It actually was kind of bland and I had to keep forcing salt and pepper all over it because of that. I also had no clue it came with chicken. I didn't recall reading that on the menu. But it's not veg-friendly, if you're a vegetarian, but maybe they can make it veg if you ask. Not a problem for me. The chicken had an odd texture to it which resembled the mushrooms. Maybe that was intentional to make all of the textures blend together on the dish, but I'm not sure. It was only 3/5 stars in my book.My dad's soup was delicious too. Not creamy like I pictured when I heard the word \"bisque\" but rather nice and light. It tasted like they used fresh tomatoes just picked from a garden. Soooo good! I was worried when my dad said \"it tastes like pasta sauce\" but little did I know it would be awesome pasta sauce! He also had a beer.My mom's salad was also quite tasty. They went light on the dressing, thankfully, and the candied pecans were to die for. The goat cheese was nice and sharp too. The salmon was cooked a little too well done for my tastes but she seemed to enjoy it, so all was well.I would probably come back here for lunch because they're one of the few places that still serve between the hours of 2pm and 5pm which to me, is (was?!) a huge deal because I'd have classes all through out the \"normal\" lunch hour thus causing me to miss a lot of places open for lunch. But now that I am entering the professional world, this is probably less of a problem for me now. I'd still go back to Wildflower. I'd give it about 3.5/5 stars.", "Date": "2012-05-20", "Author_Location": "St Charles, MO"}, {"Author": "Ben M.", "ReviewID": "6Sqn6ZT2aRJLVsaDgtUbIg", "Overall": "1.0", "Content": "My point system: 50 points available for food, 25 available for service 25 and 25 available for atmosphere = 100 Total possible points. 1-30 = 1 star, 31-60 = 2 stars, 61-80 = 3 stars, 81-95 = 4 stars & 96-100 = 5 stars.A sad brunch in the CWE. Food: 5 out of 50My friend & I went here for brunch this past weekend while strolling in the CWE. I had never been here before and was excited to try it out. That is where my excitement stopped. SAD. We ordered the Wild Thing Scramble, a side of fruit and a mojito to split. The mojito came out after the food, I think the bartender was still sleeping, and it tasted like 7up or Sprite. It only had 3 mint leaves in it and they were quite sad looking. Over all the drink was horrible. The Scramble was equally as bad. The scramble was under seasoned if seasoned at all and the brie was in one giant clump of terror in the center. The English muffin and potatoes were ok but not enough so to save the dish. The fresh fruit was just a bowl of fresh fruit. I'm glad I ordered something that could not get messed up. Over all a very SAD brunch. Service: 5 out of 25The service was slow and inattentive. I did not see my waiter often and when I did see him he seemed like he had too much going on to pay attention to my table. I believe he was the only one working the patio so it was not his fault. The manager should have recognized the issue and assigned some help. The only saving grace for the service was the fact that he took the mojito off of my bill without asking any questions. Atmosphere: 20 out of 25The atmosphere was beautiful. I love sitting on the little side streets of the CWE. Their patio has amazing trees to sit under and the tables are of colorful in design. Unfortunately sometimes the service and food have the ability to affect the atmosphere of the table. Ours was not happy and brought everything down. Total Points: 30 out of 100Total Stars: 1 out of 5***This is my first 1 out of 5*** I feel kind of bad about it so I would like to try out their dinner menu to see if anything improves and revisit my review at a later date***", "Date": "2012-08-08", "Author_Location": "Kansas City, MO"}, {"Author": "Morgan H.", "ReviewID": "1tc3YTz-yyHqLkkdQtJqDA", "Overall": "3.0", "Content": "I ate here for the first time recently.  The atmosphere is very pleasant and the food was definitely good.  The Goat Buster appetizer is quite tasty (though inspired the men at the table to sing Goatbusters to the tune of Ghostbusters).  I enjoyed my Golden Chevre salad and polenta side (the mushroom ragu rocked).  The portion sizes are large, so be warned.I did have two chief complaints.  First, our waitress did not do a good job.  She was mildly combative and very inattentive.  Another member of our party had a vantage point from which to watch her chat with others and kiss the bartender.  Meantime, we needed help.  We were going to get dessert, but the dessert tray took so long we thought better of it.  Then the check took forever ... a really downer after a good meal.Second, there were no Risotto or Salmon specials because they had a special BBQ thing going on for Memorial Day.  Ok, fine.  The waitress was very assertive about it.  This was of no comfort to me because it removed two main options for me (I only eat seafood, otherwise am vegetarian).  Not the end of the world, but definitely a bummer.Update: we went to Wild Flower again and the service was much better though still a bit on the slow side.  I had the Salmon/Risotto special and the lemon beet risotto had a very nice flavor.  The salmon was more done that I usually like but still quite good.  We had the chocolate/chile custard and it was amazing!Second update: So, we go to Wild Flower whenever the memory of how slow the service was fades.  The food is good.  If the service was faster, it would be a fantastic place.  After repeated experience, I have to take away a star because it is such a systemic problem.  Also, be warned: eating outside is hazard to your health.  The smokers are coming with cigars and cigarettes.  Yuck!", "Date": "2009-05-27", "Author_Location": "Saint Louis, MO"}, {"Author": "Thirza S.", "ReviewID": "_wRxiobAdSbBDxiyaW_pYQ", "Overall": "5.0", "Content": "Great service-super personable and great recommendations. Salmon with grits was the best salmon I've ever had. The wild thing pizza app was a great savory treat to share. Bread pudding was a sweet finale.", "Date": "2013-10-28", "Author_Location": "St Louis, MO"}, {"Author": "Katherine B.", "ReviewID": "MPx8jV3wUWABncix7Ofyyw", "Overall": "2.0", "Content": "Well, the food was 3.5 stars and the service was 2 stars.So, I ordered the strawberry infused waffle, which was the daily waffle special. Yum! It came also with strawberry syrup. Sweet, with strawberry sliced on top. It was meal in itself. I had a couple of my mom's breakfast potatoes, which were crispy, a little light on the seasoning, but I just added pepper. Well, service, it wasn't that busy, and I give the waitress credit, my mom and I were deep in conversation, but she checked on us plenty the first half of our meal, but after that she just disappeared for a good 20 minutes. My coffee was empty, and I wanted to get the check. Well, she came back and paid with cash, and had some change due, and she NEVER came back. I think I saw across the room with another table, but she just never came back with the change. We used the Foodie stl coupon, and we had left some of her tip on the table and were waiting on the change and then we were going to add some more to her tip. I don't know if she saw part of her tip on the table and decided to keep the change because she thought we weren't going to give her anymore money for her tip. I don't know.... So the last half of the experience was a little meh, but the food was good.I guess while I'm at it I should mention the lunch experience I had here. I ordered a sandwich and sadly disappointed by the size, it was tiny for the price, but delicious.So I guess I should \"stay in my lane\", I'm cheap and I know I'm cheap, so I should stay at cheap people places. As a combination of these experiences, probably will just go to one of the million other CWE food choices.", "Date": "2012-07-15", "Author_Location": "Saint Louis, MO"}, {"Author": "Andres J.", "ReviewID": "RfBxFBctYzxvlrFe7JBxpQ", "Overall": "1.0", "Content": "I was excited to have brunch in one of the first days of spring at Wild Flower's patio. Service was average, weather was amazing. Unfortunately, our party of three agreed that the food was way below average. We ordered \"wild something pizza\", a chicken wrap with pasta on the side and a typical brunch with eggs, sausage, etc. I will definitely look elsewhere for a good brunch next time. Such a waste of good location!", "Date": "2013-04-11", "Author_Location": "Saint Louis, MO"}, {"Author": "Sarah S.", "ReviewID": "5v5LsbfVrVtYQTexV48K5g", "Overall": "3.0", "Content": "My husband and I went for Sunday brunch.  Gotta support places that serve brunch until 3pm!  I ordered the orchid margarita.  The raspberry syrup (or liquor?) in the drink was delightful.  I ordered the strawberry waffle special.  I was expecting strawberries on top (and there were a few slices) but it's actually made with strawberry syrup IN the waffle, which is pink and slightly sweet.  I wouldn't recommend it.  I WOULD recommend the crab cake Eggs Benedict my husband ordered.  The potatoes at Wild Flower are also really good with just the right among of crispiness.  We enjoyed sitting on the patio, too.If you're trying to decide between two similar places in the same vicinity, however, I'd opt for Brasserie right next door.", "Date": "2012-07-30", "Author_Location": "Great Falls, MT"}, {"Author": "Jean S.", "ReviewID": "7UpkkxzMpksCPNUPSXoBQg", "Overall": "5.0", "Content": "Don't think i've been to a restaurant in st. louis where I have felt more welcome. The service and food are equally amazing! There are several areas of praise that i'll address within this review:Food: the food is great. I have yet to try something that I don't like on the menu. Some of the must try items on the menu (in my opinion) are:-goat buster-truffled mac & cheese-mushroom fettucini (add blackened chicken and substitute the noodles for soba)-garlic chicken (delicious cream cheese filling)-golden chevre salad (super famous)-fried chicken (sunday nights only... some of the juiciest that i've tried... and i've tried them all from nyc to sea to la to sf)-prime rib fridays (i've made my own prime rib but it's just so much easier to come in on fridays to have them cut it up for you, cook it to your liking, and then add a bottle of wine....perfect way to start the weekend)-my favorite brunch item has to be the country style benedict. It is by far the best hangover cure that God has provided to man... it is genius, especially with a blood orange mimosa or their delicious bloody mary, extra spicy, of course.the bar at night is always an exciting time. I think since i've been home, this has been my go to drinking spot. The bartenders are always friendly and know what they're doing! the happy hour specials from 4-6 and 10-close are way worth checking out... for the ambiance, crowd and beer selection... it's worth the trip out there! :) I also particularly like the sangria, selection of wine by the glass is phenomenal, as is the wild flower margarita and bloody mary....Service: it's great. The service is great, always on point and you can tell that they're doing the best that they can to ensure a great dining experience...All in all, it's always a great time at the Wild Flower and I'd have to say that i will probably continue coming here and bringing more friends here as time goes on. i have to say, i'm particularly excited about this new thing that they are trying: Beer Pong Wednesdays on the patio.... it brings back a little bit of college, which is never a bad thing when you hit my age! :Dyay!", "Date": "2012-10-03", "Author_Location": "Saint Louis, MO"}, {"Author": "Sarah M.", "ReviewID": "cpprRv5_OmThyn9YtWD5xQ", "Overall": "4.0", "Content": "An outdoor Saturday brunch on the first Saturday in June couldn't have been more perfect. And our waitress thought Kate and I were sisters. Priceless moment, because, well, we're not. Originally Kate picked Wild Flower because they had a BLT on the menu that incredibly enticing. Although, we didn't bother to check that the weekend lunch menu was different from the week day and as it turned out, they were serving brunch. No worries, we took our patio seats and dined in the June air, that I acidentally called May.Kate had the chicken quesidillas, as she was more in the mood for lunch fair. I on the other hand, usually opt for breakfast when give the option. French toast special? Come again? Um, french toast with fresh berries and a vanilla cream-cheese filling? I think so. And, it was really good. A little heavy on the quantity of filling, which wasn't filling, but spooned in between the pieces of toast on the plate, but the french toast was perfectly season with cinnamon (as it should be), the berries were fresh and sweet, just like the accompanying compote.Good time and good price. Our bill came just under $20 total before tip.", "Date": "2010-06-05", "Author_Location": "East Windsor, CT"}, {"Author": "Patrick W.", "ReviewID": "uGnJ821KxSS01fpcNS6yKw", "Overall": "2.0", "Content": "We've tried wildflower twice now, and it feels like they could be a lot better if they just took care of the small details.  Our tables both times wobble from the uneven floors, the water glasses still had lip marks on them and the food could be better prepared.  My poached eggs have been over-cooked twice and there were shells mixed in.  Mind you, this was also during Sunday brunch when you would expect everything to be at its best.  The recipes seem good, but there is an obvious lack of execution.  Plus, what restaurant doesn't have hot sauce?!?", "Date": "2011-03-13", "Author_Location": "San Francisco, CA"}, {"Author": "Josh S.", "ReviewID": "uIvoLjhWhxN-v7xs36tT2A", "Overall": "4.0", "Content": "Wild Flower is conveniently located in the CWE and it's corner location is great.  The inside is a bit of a minimalist theme, but in my opinion it works.  We stopped in last night in part because we were both too lazy to go to the store and cook.Don't go in the door that is on the corner of the building, go in the door that is to the left of the corner.  That was about my only gripe from our visit, and as you can imagine that was pretty small.  We both started off with a cocktail as we looked over the menu.  I went with an Old Fashion make with Makers Mark.  I really like this drink but the 4 or 5 times I've had it, it's never quite tasted the same.  Regardless it was a good drink and helped the decision making when it came time to food selections.For food we did something a bit different, instead of ordering entrees, we went with several apps/small plates.  We started off with the calamari with verdi sauce.  The verdi sauce was very citrus, not that it was a bad thing, it was different than your typical marinara sauce and better in my opinion.  The calamari was nice and fresh, was not rubbery at all.  Next out came the goat buster, which my better half could not get enough of.  I think she could have ordered another for herself and been quite happy.  it is a goat cheese fondue that comes out with apples, carrots and bread.  I wasn't the biggest fan of it on the carrots, but the apples and bread went very well with it.   Next were the Italian Artichokes, crisped with Parmesan and topped with garlic aioli.  These were very good as well, and the strong flavor of the artichoke was subdued in this dish which to me was a good thing.Next was a meatball with tomato salsa.  This was probably my least favorite dish of the night, but it was still good.  The meatballs were a bit dry, and needed a good dose of the tomato salsa to make them go down easily.Lastly we tried the bison hangers.  I'm not really sure what a hanger is supposed to be, but it was bison medallions and bordelaise.  The bison was cooked perfectly and the meat was wonderful.  The bordelaise complimented the bison well but I think the meat could have stood on it's own with just salt and cracked pepper and been just as good.We passed on the dessert even though several looked tempting.  We could have easily ordered one less dish and been satisfied but there were so many things that looked good we just had to try several of them.  I'd definitely go back and try some more of their menu.", "Date": "2011-11-15", "Author_Location": "St Louis, MO"}, {"Author": "Sean M.", "ReviewID": "ki5r6NzrVM4bGBT8QbbN9A", "Overall": "2.0", "Content": "Had a very subpar experience here with my partner.  We ate on the patio, and since I was in the mood for pasta, I asked the waiter what he would recommend.  He said that the seafood pasta (which, incidentally, was by far the most expensive pasta dish on the menu) was exceptional, so I heeded his advice.  What a disappointment; it was a soupy mess, with limp ramen-like noodles and a few inferior pieces of soggy shrimp and tiny scallops.  My partner ordered the steak medium rare, and it would have been fabulous had it not come out medium to medium well.I followed up with a letter to them stating that, for $120 with a tip (we ordered a bottle of wine), it was a terrible value.  Never received a response.  They won't see us again!", "Date": "2010-05-01", "Author_Location": "Saint Louis, MO"}, {"Author": "Jen M.", "ReviewID": "Fzh5ySirUMRtfUgeKj1Cmg", "Overall": "4.0", "Content": "Had brunch here yesterday. I was hesitant to come back because the last time I was here the service was HORRIBLE. There was absolutely no excuse for it and my friend and I left extremely pissed. This time was much, much better. The waitress was attentive and the food I ordered was good. I don't remember the name but it was smoked salmon on a bagel with a poached egg and hollandaise. The mimosa I had was pretty good, a little on the sweet side but better then most I've had. Since this experience was much better I would consider coming back again.", "Date": "2013-09-29", "Author_Location": "Richmond Heights, Saint Louis, MO"}, {"Author": "Brian B.", "ReviewID": "ulSQhMETHor3PkQ0YOAUFQ", "Overall": "4.0", "Content": "Attention craft beer lovers: Best happy hour in the Central West End.DISCLAIMER: I have yet to order food here. This review is strictly based on drinks, although I've tried the occasional hors d' oeuvres that are available complimentary on some nights and they were excellent.Why do I think that this is the best happy hour in the Central West End? Simple mathematics really. $3.00 pints of the best craft beers from 4-6 and 10-1 everyday except Tuesday (they're closed). Given the times, it should be called \"happy hours\".Now it does get busy after 10:00pm so don't be surprised if you can't find a table in the bar area, but the staff is great when it's busy so you won't have to muscle your way to the bar to order. There is usually someone serving cocktail tables and also the tables in the front. The bar staff is very pleasant and accommodating. They always remember faces which is always welcoming. Overall if you're just getting off work in the Central West End this is the perfect place to grab a drink afterward, whether you work the AM or PM shift.", "Date": "2012-02-22", "Author_Location": "Saint Louis, MO"}, {"Author": "Linh D.", "ReviewID": "paOPi9LdOYG8ix-OQHLS7w", "Overall": "2.0", "Content": "Blannnnnd. Nice menu, friendly staff but lacklustre brunch. I got something brunch typical, and it was just bland. It lacked flavour and just, sad times.", "Date": "2013-08-06", "Author_Location": "Melbourne, Melbourne, Australia"}, {"Author": "Stephen H.", "ReviewID": "8_sXYarXDv-Go5N-EH3m0A", "Overall": "4.0", "Content": "I've been to Wild Flower before, but tonight was for Yelping :-)We were teased by the late-night menu.  It was around 1am when my date and I rolled in, and the kitchen had just shut down a little while before. Great atmosphere, fun crowd, easy drinks.  Two Blue Moons for $6??  Either the drink prices are great or the bartender really liked my date.  Either way, I'll take it :-)", "Date": "2011-05-13", "Author_Location": "Paris, France"}, {"Author": "Lauren L.", "ReviewID": "6zZEFUV1PcY9jKimOc7OvQ", "Overall": "4.0", "Content": "Not a place I normally would've gone when I lived in St. Louis, but a friend recommended it since we were in the area and she needed an outdoor dining area that would allow her English Mastiff to dine with us!I wasn't super hungry so I had the Heirloom and Feta caprese salad which was AWESOME. A little pricy for what it was (hence the 3 stars) but rather tasty. A little salty. Still tasty. I polished it off.Then I had the cannoli for dessert, which was also very good. One of the better cannolis I've had, surprisingly. The filling was amazing.I would rate the food at a 3 because of the price, but the service was stellar. Our waiter was friendly, personable and patient even at a table of picky eaters and the owner even came out and talked to us. It was a lovely experience.", "Date": "2010-08-26", "Author_Location": "South Richmond Hill, NY"}, {"Author": "Jae-Woo K.", "ReviewID": "nA-rSajT0remjVVzo32OGw", "Overall": "5.0", "Content": "\"Crab cakes and football.  That's what Maryland DOES!\"One of my favorite Sunday brunch places.  They have a dish called the \"Signature Maryland Benedict.\"  Absolutely delicious.  The poached egg over a crab cake just melts.  Pretty good coffee too and the orange slices are a good finisher.  Service is excellent.I even like the interior of the restaurant a lot.  It feels like a European cafe.  Even the old glass windows have that century-old, amorphous look.  I probably could have enjoyed the ambiance more if I didn't have to leave in a hurry due to my self-diagnosed IBS.  GD GI motility.Anyway, the only downside is that the restaurant still smells like smoke due to no true partition between the smoking and non-smoking side.  This being the only drawback, I still love this restaurant for Sunday brunches.", "Date": "2010-11-07", "Author_Location": "Minneapolis, MN"}, {"Author": "Shawn R.", "ReviewID": "VfeIlXBNbibKCcbhxNfhdg", "Overall": "1.0", "Content": "Exceptionally Poor Management!  Overall, this was one of the worst dining experiences I've ever had.  The poorly structured service philosophy trickled down from owner to manager to staff.   Dining took 2.5 hours while we watched 3-4 other tables be seated, eat, and leave in half the time.  Even though they indicated they were just too busy to keep up, there were always tables available and no line waiting to be seated (in fact a few people waited by the front door and eventually left because no one came to help them after waiting for 10 minutes).  This restaurant would benefit from some formal service training and a review of their customer service models!Read on if you'd like to hear more about this horrible service experience:While visiting St. Louis for a business trip we decided to try Wild Flower at the recommendation  the best ribs in St. Louis.  While I cannot dispute that the ribs were good, the entire dining experience was one of the worst displays of hospitality and/or customer service I've ever experienced.  We arrived to a moderately busy, Monday night crowd. We were seated without a wait and having a server arrive at our table quickly to ask if we needed to order drinks.  That is the last positive experience we had.There was a 10 minute wait for our drinks to arrive after placing the initial order.  When he delivered the drinks the server indicated he would bring bread right out for the table.  After 10 minutes elapsed and our server proceeded to bring bread for 2 other tables, we asked another server if we could get bread.  The second server said, of course and went inside.  5 minutes later our server finally brought bread followed shortly by salads.  90 minutes after being seated, watching 3 other tables seated, served, and finished eating we asked another server if there was a manager available to talk to.  She said, sure and then proceeded to walk to another table to clear that table, taking 5 minutes before even going in search of a manager.  The owner passed up our table to talk with another table, whom had also complained about the poor service, then upon seeing our food being delivered, he arrived at our table.  He asked if everything looked okay and we complained about the 90 minute wait for our food.  His reply was a mere \"oh, but it's such a nice evening out to enjoy the weather...that's why we're so busy and things are just slow tonight.\" After discovering the our orders weren't 100% correct, there was no worth in complaining due to the slow response (although it ended up being charged for things on the bill that didn't show up).  We finished eating and had to ask our server twice for our checks.  After waiting for 10 minutes for our checks to be delivered, we asked again for a manager since it had now been 2 hours and 15 minutes since sitting down.  The service manager arrived and asked if there what was the problem.  Explaining our poor service, he too just shrugged and indicated that they were just too busy - only after pushing the issue and explaining that giving us excuses weren't helpful, did he decide to actually utter the words \"I'm Sorry.\"    The decided to take our beverages off the bill (although not everyone had a beverage)...and it ended up taking another 15 minutes in order for them to process our bills. Had I not been dining with a colleague who opposed it, I would have likely walked out somewhere around the 2 hour mark!", "Date": "2012-03-14", "Author_Location": "Glendale, CA"}, {"Author": "Jess T.", "ReviewID": "S5mzqXrMa4MdWeeYHP9w0w", "Overall": "5.0", "Content": "I absolutely loved it!  Had the signature garlic chicken and thought it was fantastic.  My bf had the bbq ribs and he thought it was wonderful also.  We would have liked to try a desert, but were too full to even think about it.  If we are ever in St. Louis again, it will def be a place to come back to.I liked the neighborhood it was in- parking wasn't fun, but it was quaint and different than what I'm used to.I didn't think the service was slow- but we weren't in a hurry.  Our only plans for the night were a good dinner and some drinks, so we were willing to hang out and chat while waiting for our food.", "Date": "2010-04-12", "Author_Location": "Davenport, IA"}, {"Author": "Jen J.", "ReviewID": "SpehK1xia4JghMZGvrVqsA", "Overall": "4.0", "Content": "We were originally planning on grabbing drinks at Taste, but it was packed (surprise!) at 9 PM so we moseyed over to Wild Flower for some beverages to start the night. The patio was packed to the brim (and looked lovely. I agree with everyone else that this is a great place to eat outside in the warmer months)! We sat inside at the bar. I LOVE Jamie the bartender. He was awesome, friendly without being intrusive, and always ready to bust out big smiles. I will come back to Wild Flower again just because he was so cool. I had an Eden martini that was tasty. Jamie made me another drink and a shot based on my requirements (fruity that's not overly sweet). I liked them as well. We did not grab food here but I'm putting it on my list of places to return to after the great experience we had here.", "Date": "2011-09-12", "Author_Location": "Saint Louis, MO"}, {"Author": "Jennifer C.", "ReviewID": "zKjHD4-nCjZj-FyZpyaKzQ", "Overall": "3.0", "Content": "1st time visit early afternoon and was happy to see no wait.  I ordered the Breakfast Wrap; very good and loved the breakfast potatoes.  One friend had the Monte Cristo and after adding syrup, she thought it was great.  Another friend had the basic breakfast platter, no complaints.We all shared the apple and walnut pancakes.  There were only 2, but they are huge, definitely more than 1 person can handle.  I was surprised to find that the apples were juliene sliced and on top of the pancake vs. inside the pancake, but it was still very good.", "Date": "2011-09-11", "Author_Location": "Saint Louis, MO"}, {"Author": "Charles P.", "ReviewID": "JdK_VRIMspCvT3UVtlfMhg", "Overall": "4.0", "Content": "For all of the times I have been in the CWE, I always ignored Wildflower. It would always be a place that I would just pass by without even giving it a second glance. This was never intentional or out of malice. Considering that Majestic, Tom's Bar and Grill and Coffee Oasis it sometimes gets overshadowed.Wild Flower's Mother's Day 2011 brunch changed that completely for me. My beautiful wife and wonderful mother in law decided to check this place out and I have to say, it was one of the best dinning experiences I have had this calendar year.First off, I love the look of this place. It was a bit smaller than I thought it would be but I like bar on one side and the restaurant on the other. And the outdoor area looks very lovely.Also the service here was on point. Considering it was a buffet style brunch, the servers and bus boys/girls were extremely helpful explaining the menu and our options.Now the best part of the experience for me was the food. This had to be one of the best meals I've had in a while. We had an option between an actually lunch food and breakfast food. I ended up stick with breakfast just because it was so good. French toast, breakfast potatoes, and the bacon was all cooked to perfection. They even had a crab with eggs item that I didn't eat (not a seafood fan) but looked good.After two helpings of breakfast, I had one of there coffee shooters. It was a coffee mousse that had just the right amount of coffee in it. Add a little chocolate syrup in there and you pretty much have a meal that put me over the top.The most important thing for this meal was the overall experience for my mother in law, who recently lost her mother within the past year. She thought it was perfect and couldn't have asked for anything else. I couldn't have agreed moreBased on the service I received and the quality of food, I give Wildflower a very high recommendation. I hope to come back during the evening or even for lunch to get a full experience. Needless to say I will not be ignoring Wildflower when I walk by in the CWE anymore.", "Date": "2011-05-13", "Author_Location": "Saint Louis, MO"}, {"Author": "Tor B.", "ReviewID": "gfAsNUaSOhU2OdIki1RGSg", "Overall": "3.0", "Content": "Wild flower...the atmosphere (during the summer) is fantastic. Great wine and cocktails, and outdoor dining; all very \"Euro.\" It's always so much fun spending an evening dining out in the Central West End.So we started well, with good wine and good appetizers (Seafood Bruschetta and Calamari)....then came the entrees...what a bummer...Everything was cold and mostly tasteless. WildFlower may have wilted over time...not sure if I would try WF again.Shazzbot!", "Date": "2008-07-05", "Author_Location": "Charlotte, NC"}, {"Author": "Andrea F.", "ReviewID": "0uR59B72aW75aOgPpbbssQ", "Overall": "4.0", "Content": "I ate at this restaurant randomly--I hadn't heard anything about it, but was just walking around looking for a spot to eat dinner and landed here.I thought it was good, but maybe not great. It was a little pricey, but not ridiculously so. The person I was with had the roasted pork tenderloin. Yum! It was wrapped in bacon and filled with flavor. His mashed potatoes, however, were blah. I could have done much better at home. I had the seafood linguine. The sauce was scrumptious and had just the right amount of thickness--not watery, but not goopy either. I just wished there was more actual seafood in it, considering the price. I would try this restaurant again. I especially liked the feel. There was a local artist's pieces throughout the place, and I love that look. And, the sangria was delish, which is always a good thing!", "Date": "2008-07-17", "Author_Location": "Chesterfield, MO"}, {"Author": "Abby I.", "ReviewID": "ecktxBe3mzhv6ERMh9mcfg", "Overall": "1.0", "Content": "Service is way too slow, we waited 20 mins for two salads on a Sunday late afternoon. Food is boring and over-priced.", "Date": "2013-09-29", "Author_Location": "Chicago, IL"}, {"Author": "christy l.", "ReviewID": "D7Mwv76to1zvOsr5jfGY7w", "Overall": "2.0", "Content": "I really wanted to like this place.  They have a nice sidewalk patio (with funny painted tables), which is a nice place to hang out on a beautiful warm day.  However, I've  gone twice for dinner and twice my entrees have been extremely salty. The first time I thought the saltiness was just a fluke.  I got the St. Louis Style BBQ Ribs while the husband got the Bison Hanger Steak.  My ribs were covered in the saltiest sauce, making them inedible in my book.  On the other hand, my husband's dish was deliciously prepared.  So good that we've been wanting to go back to Wild Flower ever since... and we finally went today.  This time around, we both ordered the Bison Hanger Steak so we didn't have to share.  We were SO disappointed.  It was way too salty... think hydrated beef jerkey, only saltier.  (Is that even possible?!)  I should note that the Greek Salad and Calamari appetizer were good.  (We've ordered the calamari both times, and we enjoyed it both times.)  Also, our server was really nice and when she learned we were unhappy with our entrees, she asked if we wanted to get something else off the menu, and ended up taking the entrees off the bill.  All in all, that's strike two for Wild Flower... and given my limited time in St. Louis, I don't think I want to chance it again.  I really can't take that much sodium in my diet.", "Date": "2008-05-16", "Author_Location": "San Jose, CA"}, {"Author": "Tricia R.", "ReviewID": "Pk5SYBwQsxz88iyi08JwHw", "Overall": "3.0", "Content": "Mixed feelings about this one - went to a holiday party a couple yrs ago that was catered by Wild Flower and thought the food was delicious.  I finally had the opportunity to come here for dinner and left disappointed.Specialty drinks here are good, although a lil pricey.  We started with the potstickers for an appetizer - these were actually really good.  I had the Signature Garlic Chicken - for a signature dish, it was very disappointing.  The chicken was dry, and the breading was so hard that I felt like I was sawing thru it.  The fettuccini alfredo served with it was lacking in flavor.  Friday night is prime rib night, so the bf got that - the dish was def huge.  The prime rib was cooked perfectly (could've been seasoned more), the mashed potatoes were decent, but the green beans were stringy and gross.  We also had a side of mac & cheese which was bland.I guess overall the food was only decent and apparently the chefs are not big on seasoning.  The service was excellent - our waitress was attentive and always available.  After seeing some reviews for Country Club Fried Chicken Night on Sundays, I'm tempted to go back and try that, but I think I'll go elsewhere for dinner otherwise.", "Date": "2009-08-25", "Author_Location": "Saint Louis, MO"}, {"Author": "Jenna L.", "ReviewID": "0EkC0nN_FNvH02RaEYH3DQ", "Overall": "3.0", "Content": "Greeted by the owner as we walked in, I had a good feeling about this place. While the reviews aren't that great, my experience proved to be better than what I expected. First off, my mom had a headache and the owner was sweet enough to grab her some Advil. Second, our bread came out which came with a really awesome olive-oil spread. Next, we had the flatbread pizza which was great, although you must really like mushrooms. Lastly, the food was awesome. I had the stuffed chicken, others had the pork loin (really spicy) and macaroni and cheese. Everyone was happy with their dish and we left pretty impressed by the ambiance and service.P.S. I liked this restaurant way better than Taste next door.", "Date": "2011-10-31", "Author_Location": "Saint Louis, MO"}, {"Author": "Aaron J.", "ReviewID": "-Fu7zC8X8PIuBdZT92-0Qw", "Overall": "4.0", "Content": "The Wildflower, oh the Wildflower Restaurant is a wonderful place for brunch, lunch, just a great little restaurant to sit back and relax and watch the people go by. Located in the Central West End, Wildflower offers a great brunch, as I've obviously stated already.  I honestly have never been there any other time of the day than just for brunch, but I can safely assume that the food the, is just as satisfying.Their brunch offers a nice variety of breakfast and lunch food.  You have your standard eggs, which are quite nice and fluffy, to your traditional lunch foods, sandwiches and so on. I have, not matter the place, always enjoyed eggs benedict, so those will always be highly recommended.The Wildflower Restaurant is a wonderful place to gather with a small intimate group to enjoy a nice little meat.  The outdoor seating is great.  Airy, and bright, if the weather is nice, the patio is the best place to sit.  You can watch people stroll by as you indulge yourself with a cup of coffee after you have finished your meal.", "Date": "2008-04-01", "Author_Location": "Saint Louis, MO"}, {"Author": "Sarah J.", "ReviewID": "u7X374X7JFFOOEhDpbi1jA", "Overall": "5.0", "Content": "The Wild Flower Restaurant was the very first restaurant my husband and I had the privilege of eating at before we moved to St. Louis and it immediately became our all time favorite place (and where we take all visitors for lunch!).  The atmosphere is my favorite-- we love watching watching the hospital residents, locals and students walking the busy side walk. The servers are always incredibly helpful and can get you out in a hurry if needed. I usually order the most amazing fruit and goat cheese salad with pumpkin soup--but have tried the salmon, portabello mushroom sandwich and the lobster bisque. Everything is always so fresh.", "Date": "2012-09-01", "Author_Location": "Saint Louis, MO"}, {"Author": "April B.", "ReviewID": "xxpLy_8vjgyCwH2eM7LLqA", "Overall": "3.0", "Content": "First time will go again. Service slow but food delish.  Never got a water refill or offered another cocktail. Great BBQ and atmosphere. Peppered Mary with a splash of Guinness and the brisket ordered.", "Date": "2013-09-02", "Author_Location": "Central West End, Saint Louis, MO"}, {"Author": "Suzanne M.", "ReviewID": "u5yyfREBrEhpK928PJ6Z3w", "Overall": "3.0", "Content": "We dined here last week with some friends. After our first pick, Taste, was packed (1.5 hour wait...), we strolled on down to Wild Flower. The ambiance is great! We ate inside as it was a bit chilly, but the outside patio looked lovely as well! We were pleasantly surprised to learn it would only be a 15 minute wait, so we enjoyed a drink at the bar.My husband and I typically share dishes(that way we can sample more things!) We shared the Seafood Bruschetta. Not what I was expecting, but it was very delicious!For our entree we shared the Pork Tenderloin. It was my husband's pick, so maybe that's why I was underwhelmed by the dish, as I'm not a huge pork fan. Nothing stood out about the dish, but my husband seemed to enjoy it. I wish we had room for dessert. We caught a glimpse of the dessert tray and I almost wanted to tackle it down(thankfully, I restrained myself!!)Now, on to the not so good part- the service. Right off the bat, our server made a bad impression, making a very rude comment to my husband. The rest of the meal, I guess he was attentive. But maybe that's because we were afraid to even make eye contact again, fear of another rude comment!Overall, we had a fairly good meal at Wild Flower, too bad our immature server had to kill the mood! Good food with good value, but we will continue to try other restaurants in the area before (if) we come back!", "Date": "2012-04-15", "Author_Location": "O'Fallon, MO"}, {"Author": "Sarah W.", "ReviewID": "PnIegTISUqbPS2P1sPTLSw", "Overall": "5.0", "Content": "Here's what I've been there for: Brunch: Excellent, I recommend the Maryland Eggs Benedict.  Really though, you can't go wrong, I've liked everything I've every ordered.  Late night happy hour: Affordable drinks in a classy place, you can't beat that!  The bartender, Dan, is awesome and makes lots of tasty drinks.  If you're undecided about what you want, just ask for a recommendation.  It's nice to sit on the patio on a warm summer evening and enjoy the CWE.", "Date": "2012-05-19", "Author_Location": "Saint Louis, MO"}, {"Author": "Mary Kate A.", "ReviewID": "v9Xgqvk1SwMZJpMyy0dZ4Q", "Overall": "4.0", "Content": "Wild Flower is one of my favorite spots to roll over on a casual day to enjoy lunch. I was in the area today, so why not! It had been a few months since I had been here. They serve lunch from 11am-4pm, and I showed up around 2pm. No wait, I told the server promptly what I wanted as my usual, and sat outside before the rain started.I kind of have this fetish for their lobster bisque. It is AMAAAAAZING and delish. This is probably the sole purpose of me coming here just so I can savor it. With that for $9, they give you a side Caesar or spinach salad, half of a wrap which is chicken salad or something else which I can't remember, and a hearty helping of the soup or bisque of your choice. All filling, not al a carte sizing. I appreciate this place for that. You get what you pay for in my opinion.They do have really good pizzas, but I tend to stay away from them because they are thin and not really the kind of combination I would prefer for pizza. I know what I like, and I know what I am going to stick with.I have every intention of coming here some time for dinner... just have not gotten to it yet! I will update my review once that happens. Hopefully sometime in the near future. ;)", "Date": "2011-09-09", "Author_Location": "Washington, DC"}, {"Author": "Grace C.", "ReviewID": "o063rkxSa9WDq2MVt6--GQ", "Overall": "5.0", "Content": "Brought my visiting parents and sister here for their first dinner in St. Louis. We loved everything that we had. Our waiter Steve recommended just the right dishes, so we weren't all too stuffed, but got to enjoy our dinner, appetizer, and dessert. Truffle fries, pear salad, and caramel bread pudding were all favorites! Great food, great atmosphere, great dinner!", "Date": "2013-08-22", "Author_Location": "Scottsdale, AZ"}, {"Author": "Tim L.", "ReviewID": "WvNCiyseu-Cz7u7DKAPrNA", "Overall": "4.0", "Content": "Nice place.I don't eat here often (as I don't live in the CWE and it's a bit high of my price range) but when I'm looking for someplace classy and comfortable, Wildflower is on the list. It reminds me of nice neighborhood-y bistros in New York or Boston, with a good menu, well-done. Last time I was here I had the bison hangar steak, which was excellent. The server was a bit much on the attitude front, but he meant well. Wildflower may not get a lot of buzz, but overall, a nice place to get a nice dinner.", "Date": "2010-01-11", "Author_Location": "Saint Louis, MO"}, {"Author": "Jasmine W.", "ReviewID": "bhjqW7ZyJxLRAqTj0VzmtQ", "Overall": "3.0", "Content": "Waking distance to our hotel. Has happy hour $3 drafts at the bar, outdoor seating, and traditional dining room. Service was not memorable, air conditioner needed to be turned up. Skip the seafood bruschetta and hummus small plates, enjoyed the mushroom puff pastry app, brie/mushroom/spinach pizza (although a little oily), pear salad (surprisingly large, nicely plated), St Louis ribs (won 2007 best ribs). Would recommend if hungry and close by but wouldn't make an effort to hunt this place out.", "Date": "2011-07-22", "Author_Location": "Culver City, CA"}, {"Author": "Tricia C.", "ReviewID": "Y8xYoFRnyH1wbrfuvVKh3A", "Overall": "4.0", "Content": "I was here for a catered function so I don't know how similar the food is to their regular menu--it was Asian food: noodles, stir fry, rangoons.  It was nothing special.  The stir fry was doused with sauce.  But overall, I think they did an excellent job handling the very large party.  The upstairs space was perfectly sized and had tons of warm charm.  The christmas lights that twinkled everywhere certainly made the experience even more special (but I'd probably find a port-a-potty decorated with lights romantic).  The bartenders were quick and the drinks were good.  All the service staff was EXTREMELY friendly.I guess I'm a little wary of the food based on the other reviews, but I had such a good time at this event that I'd probably give it another shot sometime if I found myself in the area.", "Date": "2008-12-10", "Author_Location": "Dallas, TX"}, {"Author": "Ingrid C.", "ReviewID": "jlUB8VeOOYBxkCM-OoyWvQ", "Overall": "2.0", "Content": "My most positive experiences with Wild Flower deal with their catering. It's like, if their service isn't involved, then I can focus on how good the food is. Service dining outside has always been better for me than inside. Weekday lunch service was best. This is usually where I come when I can't really go anywhere else. In all honesty, I'd rather be at Taste. Always.", "Date": "2011-09-13", "Author_Location": "San Mateo, CA"}, {"Author": "Raya K.", "ReviewID": "Qi89W1njNn-ubMnTPDAHQw", "Overall": "4.0", "Content": "Oh yes, the brunch is what it is all about at Wild Flower! While my previous review is a testament to my mediocre dinner experience, I have to say that I owe this place a star for their amazing brunch. I have been here twice for brunch, and both times I ordered the smoked salmon scramble subbed with egg whites. The egg whites are super fluffy, the smoked salmon is cut up into small pieces so that it doesn't overpower the flavor of the entire scramble. They also throw in some red onions, capers and cream cheese for a little indulgence. The potatoes that come on the side of most of the breakfast brunch items are amazing. They are perfectly crispy, but not greasy like most potatoes at standard fare breakfast joints. They also offer lunch type foods if breakfast is not your thing. They all look pretty good, and at some point I would like to go back and try something from that half of the menu. My only major critique is that the service can be inconsistent. On my first brunch visit, we were never offered any coffee refills. On the second visit, the waitress forgot my coffee entirely. She did eventually remember, and did not charge me for it.", "Date": "2011-05-29", "Author_Location": "Saint Louis, MO"}, {"Author": "Kimberly B.", "ReviewID": "MfxXjuKNpN9JcnZ6eYCEYA", "Overall": "5.0", "Content": "Went with a group of 8 and everyone enjoyed their meal. Service was GREAT! We arrived separately and each person was greeted with a warm welcome at the door. No lapse in time before our server was asking for our drink order. Plenty of vegetarian options and the gluten free bread was so good nobody knew it was gluten free. I had Brussel sprouts and Mac and cheese. They gladly omitted the pancetta and the Mac and cheese was great. Others had small plate options and steaks and all were very happy. The bread pudding was moist, and warm with a to die for caramel sauce. I will definitely be back.", "Date": "2013-03-07", "Author_Location": "Saint Louis, MO"}, {"Author": "Jessica E.", "ReviewID": "5baw0Zn1u6Bzq9EB4fu4aA", "Overall": "4.0", "Content": "the BEST Chicken Salad Sandwich Wrap in all of St. Louis....trust me!   I love the relaxing, clean, posh atmosphere.  Great place to bring a friend to play catch-up, relatives visiting, or great after church. Did I mention the Chicken Salad Sandwich Wrap??", "Date": "2008-07-22", "Author_Location": "Saint Louis, MO"}, {"Author": "Kristy O.", "ReviewID": "XF__d0Sv4ArszcAM7ysOUg", "Overall": "4.0", "Content": "Great atmosphere....the ahi tuna was wonderful! Good service and overall a very positive dining experience.", "Date": "2013-04-09", "Author_Location": "Lenexa, KS"}, {"Author": "MyongHi S.", "ReviewID": "lBpv6_2gS5b3H9MVBsLhVA", "Overall": "4.0", "Content": "Fantastic food and bartenders.  This is one of my favorite spots to catch up with friends in a comfortable, cozy setting.  It's really nice at night when you're sitting at a candlelit table OR when the weather is phenomenal and you can enjoy the fantastic patio.  Jamie, who used to work there, remains to this day, one of my favorite bartenders ever.  He was a charismatic guy, quick to make a drink, and always remembered his guests' names. The bartenders who took over are not quite the same, but are fair in comparison.  Food is consistently great.  Table service could use some work.  I've had brunch here on a handful of occasions, and the service then (by this same female server) has never been super friendly or timely.  Nevertheless, one of my favorite spots in one of my favorite areas in St. Louis.", "Date": "2013-02-28", "Author_Location": "Saint Louis, MO"}, {"Author": "Tiffany S.", "ReviewID": "LeUVKA9l5Y3-oZkvo-0sGQ", "Overall": "4.0", "Content": "Creme Brule French toast :)Outdoor seating available, plenty of choices on the menu....BUT the portion size seems small. I guess that's okay for those not wishing to get full, but for the price, I'd expect a little more (I paid $5 for two eggs to be added to my french toast which didn't come with even a side of fruit).The drinks have always been tasty (only been twice).", "Date": "2012-06-25", "Author_Location": "Saint Louis, MO"}, {"Author": "Sue J.", "ReviewID": "gm7Ncx6aAVJ4eSIXZmQpBA", "Overall": "2.0", "Content": "What happen to this place?  I use to come here all the time over the years.  It's definitely not what it once was.  The ceasar salad was very bland with hardly any dressing.  My pasta dish was also bland and gloppy.  My frozen Bertolli pasta tasted better than this.  In past trips, I've gotten the Best Filet.  Hopefully, that still lives up to its name.  While my meal was disappointing, this is one of the best places in town for outdoor dining.  I say come here to drink outside and people watch but go elsewhere for food.", "Date": "2011-06-26", "Author_Location": "Saint Louis, MO"}, {"Author": "Justina S.", "ReviewID": "QYeYW1GTcRWeo4wSlMT_CQ", "Overall": "2.0", "Content": "I agree with Angela S. nothing memorable about the brunch food and it was VERY slow service...", "Date": "2013-09-01", "Author_Location": "Bloomington, IN"}, {"Author": "Sujata G.", "ReviewID": "NsCvH63vmQx8ne5cpJRQHQ", "Overall": "5.0", "Content": "After being treated terribly at another restaurant (Rasoi in CWE), we came here hoping for something a little better. Boy, were we in for a treat! I ordered the cognac chicken, while my boyfriend ordered the special salmon dish for the day. We were very happy with our food, our drinks (Orange and Mango Mojito??? AMAZING!), was everything superb! The flavoring, the service, and atmosphere was perfect for our date night. The manager visited our table twice to see if we were okay and and was very welcoming. Needless to say, I am impressed.", "Date": "2011-11-13", "Author_Location": "Saint Louis, MO"}, {"Author": "Gabe H.", "ReviewID": "5pFtvzN5Tti6EFhiawbqVw", "Overall": "4.0", "Content": "Tucked away in a unique little area, my wife and I dined at Wild Flower the other day. We ordered a pretty good salad and the Calamari to start with. It came out in an alright time and actually beat our drinks to the table but it was a little busy. As we were finishing out appetizers the food came out. We had a smaller table and it was almost completely covered with all of our stuff. The wait staff didn't take anything away. the waitress seemed extremely busy so I understand.Overall: food was fantastic, service was okay. will definitely go back", "Date": "2013-08-18", "Author_Location": "Saint Louis, MO"}, {"Author": "Jeremy M.", "ReviewID": "EFg677Gv8RL4YXiVWSRaBg", "Overall": "2.0", "Content": "Service was alright, it was a busy night, so slow and not extremely personable since we just had drinks. I got the wrong drink. Didn't seem worth telling our server as they were quite busy with more important customers.", "Date": "2013-07-31", "Author_Location": "Saint Louis, MO"}, {"Author": "Rrr V.", "ReviewID": "f1gIMbXnxWWiY4_K6N2WXw", "Overall": "3.0", "Content": "Hostess:  2.5Waiter:  2.0Food-taste, presentation:  3.0Property-style, decor, ambiance: 3.0", "Date": "2012-05-07", "Author_Location": "Seattle, WA"}, {"Author": "Charlotte S.", "ReviewID": "7gvwDDZY8RfVGhzP8x-LkA", "Overall": "5.0", "Content": "Bison Hanger Steak and Ahi Tuna - My husband and I ate here a few weeks ago. We sat out on the patio which I loved! The retro look of the outside is great! Wild Orchid Margarita???? Try this if you can. It was a delightful, unique treat. My husband had the Bison Hanger and I had the Ahi Tuna with mango & avocado salsa! This may qualify as the most delicious meal that I have had in St. Louis. The atmosphere along with the delicious food made this an all around great first experience for us. We plan a trip back there soon. The waiter was great but service a little slow. If my husband has to wait long for that second beer, he becomes cranky. :-)", "Date": "2012-07-16", "Author_Location": "Central West End, Saint Louis, MO"}, {"Author": "Anderson M.", "ReviewID": "HwpMDIDt2TeWAXnV7hvGhw", "Overall": "5.0", "Content": "My wife and I enjoyed an evening out with dinner and a show (we saw The Book of Mormon - awesome!). I searched for a restaurant near the Fox Theater in Saint Louis that had gluten-free options, as my wife must eat gluten-free. We found this restaurant in a Google proximity as the second highest rated restaurant offering gluten-free food. The menu had a wide variety, so we gave it a try. We're both glad we did, because it was a wonderful meal that we both enjoyed immensely.  Prior to our dinners being served, the staff brought out a small loaf of freshly baked, gluten-free bread. We've had many types of gluten-free bread, but this one left the rest in the dust. You could hardly tell at all that it was gluten-free. Usually, gluten-free bread is very grainy and dry and you can tell it doesn't have wheat, but it was definitely hard to tell that this was not a wheat-flour based bread.   Prior to our arrival, my wife had chosen the pork tenderloin dinner from reading the online menu. We were disappointed to learn that it was recently removed from the menu, and had been replaced by a pork chop plate. She decided to stick with that instead and was not disappointed. It was served with fresh mashed potatoes and a side of asparagus. The bone-in pork chop was tender, cooked to perfection and quite large.    I decided on the salmon filet dinner. Being born and raised in Alaska, I tend to keep my bar set pretty low for seafood in the Midwest, but I have to say that this salmon was up there on my scale.  The filet was prepared well and had just the right amount of spices and butter to compliment it. It was served on top of a bed of orzo with capers. Delicious.   The staff was very friendly and courteous. I have nothing bad to say about the experience.", "Date": "2013-03-04", "Author_Location": "Millstadt, IL"}, {"Author": "Toni R.", "ReviewID": "UEdjeTKD8ErOuMxBFflFug", "Overall": "4.0", "Content": "I took my friends here to celebrate an engagement and it was the perfect place. It is welcoming and intimate. Our server was attentive at the same time giving us our time to talk like my friends always do. We had a pitcher of sangria which was delicious! I had the Steak sandwich. It was tender and juicy, a little underdone but I think that was what they were going for and I actually liked it. My two friends had the grilled cheese with applewood smoked bacon and both really enjoyed them. I will definitely be back for dinner. It is a great place for family, friends, parties and dates. You really can't go wrong with this place!", "Date": "2013-01-22", "Author_Location": "Saint Louis, MO"}, {"Author": "Jeana B.", "ReviewID": "nJ4AsRxGd_Rf21Q5wFSJfg", "Overall": "5.0", "Content": "The Wildflower is one of those places that, if you live in the Central West End, can become \"your\" bar. People around the neighborhood hang out here often until late at night and the bartenders are always friendly and remember you each time you come back. The food is great, the location is great and the atmostphere is great. What's not to love?", "Date": "2013-07-11", "Author_Location": "Saint Louis, MO"}, {"Author": "Richard W.", "ReviewID": "hZXf9smvQApP3MxSWNLvFw", "Overall": "5.0", "Content": "Brunch on a Saturday with no wait and Great Food!  We've often eaten at Wildflower for dinner, never knowing that they serve brunch on the weekends.  We had a group of 9 for breakfast on Saturday, and normally would have to wait 45 minutes plus at any good place in Clayton.  I was able to make a reservation at Wildflower, and was utterly surprised by the great breakfast choices they had.  One in our group eats Gluten free, and was delighted to have buckwheat pancakes as a choice.  Great option for breakfast on the weekend and this is our new favorite place.", "Date": "2013-12-28", "Author_Location": "Saint Louis, MO"}, {"Author": "Lesley S.", "ReviewID": "HU-NNLkrJ8k_s3orOYScvQ", "Overall": "4.0", "Content": "Ultimate bacon melt was D-Licious. The actual restaurant itself I wasn't floored with. It wasn't good, wasn't bad, just exsistent. I had decent service, good company, and the food was exactly what I ordered. Will I come back? Yep. If he's paying.", "Date": "2010-02-23", "Author_Location": "Honolulu, HI"}, {"Author": "Megan A.", "ReviewID": "Z_hrFh6XcvF-FnOSTEAeag", "Overall": "1.0", "Content": "A friend of mine wanted to try this place for something other than brunch, but I steered her elsewhere, reading such horrible reviews of their service on yelp.  However, I was in a situation where I had no choice but to go here (my mom's friend is verrry outspoken and not someone you want to mess with), and I learned a valuable lesson: to trust fellow yelpers, even if it means taking down your mom's 70 year old bff.That's right.  Right off the bat, the service was HORRIBLE.  I mean, embarrassingly so.  As soon as the host bused a table for us and showed us to our seats, the experience went downhill.  We waited about 5 minutes before the waiter came over and put empty water glasses down on our table, then left.  5 minutes later, he came back, sans water, but with silverware.  Then he left again.  No introduction, no explanation of the specials, no drink orders...nada.  As we continue sitting there, I see our waiter opening a bottle of wine a few tables away.  But wait...those ladies were waiting to be seated BEHIND us!  What?  My mom's friend was livid, and flagged him down, followed by a stern talking to (we don't have water, don't know about the specials yet, and have been waiting for at least 15 minutes, when those women down the way were seated AFTER us).  I would never have said it, but she was right.  Did he acknowledge that?  Of course not.  No apology, no nothing.Eventually he took our orders (around the time that we noticed the glasses were seriously dirty, as I see in some previous reviews), but then proceeded to come back at least 5 minutes later to \"clarify\" them.  As in, he never wrote them down, didn't put them in right away, and then totally mixed them up.  Wow.  I'm freakin starving at this point, dude, and you haven't even put the order in the computer yet?  Now you're seriously pissing me off too.I will say that the food came pretty quickly, but that's probably because it doesn't take very long to plate some bagged lettuce and jarred dressing, or to bake keebler elf sized portions.  The caesar salad was fine, but not a 5 dollar salad (especially since my mom's had bread and mine didn't!).  And while my mushroom fettuccine was yummy, it was not a 12 dollar plate of food either.  When it came out, there was so much oil floating on top that even I was kind of turned off (and I'm not a grease-blotting kinda gal), and to put it nicely, it was a lunch portion at a dinner price.  And my mom's friend's crab cakes were pathetic looking- tiny, with a few withered greens underneath, and apparently not even as \"crab-heavy\" as the ones at Ruby Tuesday's.  Now that's just sad.While my mom's friend wanted to tip under 15%, he got 15%, which is the lowest tip I've left in forever (my mom and I always tip over 20%).  The beauty of a free market system is that we can make our point another way-by never returning.", "Date": "2011-10-21", "Author_Location": "St Louis, MO"}, {"Author": "Kim K.", "ReviewID": "7gtU05Ve3hR7Nq6XNTVXoA", "Overall": "2.0", "Content": "I want to like Wild Flower really I do.  I was just really bummed out the last couple of times we went there.  It's a damn shame when you drop over $100 at a restaurant and the most memorable (good memorable) thing about the meal was the steamed carrots.  Chicken-dry, filet-overcooked, tomato basil soup-ketchup, cocktails-subpar.  And don't even get me started on the parking!  I'm used to CWE parking but this is ridiculous.  I might, MIGHT, give their brunch a chance.  If that doesn't live up to expectations then I'm done.", "Date": "2010-01-26", "Author_Location": "Saint Louis, MO"}, {"Author": "R G.", "ReviewID": "btIb_3HrsODjZj0_azmKag", "Overall": "5.0", "Content": "My wife and I went to Wild Flower for Brunch this past Saturday. My wife had the BBQ Pulled Pork Eggs Benedict and I had the Smoked Salmon Scramble. Both dishes were excellent! I would highly recommend this restaurant.", "Date": "2013-12-16", "Author_Location": "Lovettsville, VA"}, {"Author": "David B.", "ReviewID": "Pn_9VWmKrhmlavQx5U0sVQ", "Overall": "2.0", "Content": "Simply Put - I was underwhelmed.The service is fantastic; the staff is so friendly. But....on the day that we went  for lunch (05/06/13), they must've just had the exterminator in because the smell of bug spray was very noticable. In spite of the smell (we could've sat outside), we stayed and I had the lobster bisque and the pastrami wrap; they both were lukewarm. The bisque was nothing more than lukewarm \"cream\" in a bowl. Completley tasteless. The pastrami wrap sandwich was one of the daily specials, but it was not impressive at all. This surprised me because it seemed like it would rather simple to prepare. The main complaint was that the meat was inconsistent with temperature: some of it was warm, the other parts no so warm. The \"famous\" breadpudding....it would have been the redeeming point of the meal, but it was burned (actually blackened) on the bottom and was as hard as a rock to cut through. To be thorough, the center was just fine (after cutting through the other pieces like a surgeon).  This was my first time dining here and the reputation is what led us here to start. We'll come back and we'll be open-minded. However, this time out the Wild Flower wasn't exactly in bloom.", "Date": "2013-05-06", "Author_Location": "Chicago, IL"}, {"Author": "Jen D.", "ReviewID": "4akescYdCC6Md3lwCdSSaA", "Overall": "3.0", "Content": "Love the staff. Fun place to hang out and have a drink after work.", "Date": "2013-01-19", "Author_Location": "Seattle, WA"}, {"Author": "flyinglimegreen T.", "ReviewID": "xrk0CBQYFAQlUqsnpXXm3Q", "Overall": "4.0", "Content": "Pretty great place.  Went there for lunch on a Thursday.  The service was friendly and the food was definitely delicious.  Plus the prices weren't as upscale as the decor (white table cloths and napkins) seemed to suggest.  Reminded me a lot of a place I'd find in Paris.  Definitely worth checking out.  Much more worth it than Bar Italia, in my humble opinion.  The food was prepared with a lot more thought and care than a lot of the more expensive places I've been to in St. Louis, even though this place isn't super pricey.  I was very happy with the whole experience.  It's a great low key (but nice) place for a good meal...when you want the comfort of knowing you're going to be fed well without having to dress up for those other shi-shi places in the Central West End.", "Date": "2008-03-22", "Author_Location": "Brooklyn, NY"}, {"Author": "John S.", "ReviewID": "uHV6-jJWUkJUm_T7XQeTlg", "Overall": "5.0", "Content": "Brunch on the patio is always amazing. Keep the mimosa's flowing. Dog friendly!I've seen many weddings here in the loft and all of them have been special. There are have also been an array of other events that were hosted very well. Mother's Day and Easter Brunch.Open late and always popular on weekends and you can't beat it just hanging out on the patio in the summertime. Best Ribs in St. Louis. I try to go there at least a few times a month.", "Date": "2013-04-23", "Author_Location": "Saint Louis, MO"}, {"Author": "John B.", "ReviewID": "xXvWDYu_pjOxqjS0WBfr0Q", "Overall": "2.0", "Content": "Easily accommodated a party of 6 , service was very good, waiter recommended the fall off the bone ribs, 4 of us ordered them, only about half of the ribs did indeed fall off bone, portions were plentiful. Overall it was just ok", "Date": "2011-01-30", "Author_Location": "Crofton, MD"}, {"Author": "Jenna C.", "ReviewID": "GPMHR9Xo9lsnYnrt6keqYQ", "Overall": "5.0", "Content": "went here for mother's day----- HOLY BRUNCH-tasticness!!!!! we were thrilled with the ambiance, the decor, the service, and the quality of the food. Creme Brulee french toast???? seriously????? our party of 7 was absolutely thrilled.  what a perfect mother's day!! You will NOT be disappointed!", "Date": "2008-05-15", "Author_Location": "Glendale, CA"}, {"Author": "Jon T.", "ReviewID": "nUV1NWcIlTwYEOdSzXhgZg", "Overall": "3.0", "Content": "We joined our friends the D's for dinner at Wild Flower on a Saturday evening.  We were certainly welcomed very well by what appeared to be the owner.  He spent a fair amount of time explain some of the offerings.  We felt very welcomed.  We may have had a little too much to eat and drink at the D's prior to coming and did not order appetizers.  The owner made such a pitch for the ribs that three of us ordered them so that limited the variety of our sampling.  Ms T ordered the seafood cappellini.  We shared one small plate of Brussels sprouts and one of fried artichoke hearts.We were brought bread that the waiter said was freshly baked and wonderful.  It may have been freshly baked, but was not wonderful.  Bear in mind that we had just eaten Ms T's freshly made baguettes before coming.  The bread they served us was more like a quick bread, sort of like a biscuit.  It was also cold.Ms T really liked her cappellini.  It was a large serving with plenty of seafood and a good garlic pesto sauce.  She allowed that it was pretty heavy on the garlic, but she liked it very much.The D's liked the ribs better than I did.  They are advertised as BBQ ribs, marinated, rubbed and slow cooked.  They also bragged that they won some local competition.  This may all be true, but my impression was of oven cooked ribs.  They were served separated for ease of eating and heavily covered with a sweet sauce.   I maintain that this heavy sauce treatment is a substitute for actually barbecuing or smoking the ribs.  The rub, if there, was lost under the sauce and they were not smoky.  They were moist and very tender, even over done.  They tasted like good roast pork, not barbecued ribs.  I reviewed the menu on line before we went and had not intended to order these.  But they sold me and I wished afterwards I would have tried something else, since I normally would not order ribs at a place that is not a barbecue joint.  I should have stuck with my gut and ordered the grilled pork tenderloin or bison hangar steak.The ribs were served with very crisp green beans and truffle mac 'n cheese.  The beans were fine, plain, not particularly well dressed.  The mac n' cheese was also pretty good, very garlicky.  The truffle was not obvious to me although Ms D said she could taste it.  I thought it needed a little more depth of flavor, maybe a better cheese mixture.  The small plates of Brussels sprouts and fried artichoke hearts were also fine.  The sprouts were halved, sautéed with pancetta and dressed with a balsamic sauce.  Ms T is the sprouts officiando and these were more steamed and over done by her standards.  They tasted fine and the pancetta was nice and earthy.  The artichoke hearts were lightly battered and deep fried with a good horseradish sauce.  They were good, but then deep fried stuff with sauces usually are.All that said, Wild Flower has a solid and creative dinner menu and I would return.  I like the small plate offerings so you can mix things up a bit.  The main dinner servings are very generous and prices are reasonable for the kind of place.  The menu is not 100% static, so check on -line before you go.  Some things remain and some things change.  Our service was solid throughout and the attention of the owner made us feel very welcome.I am going with three stars for this first review but it is a strong three and with a broader sampling of the menu would probably be a four.  I guess I just have to hold back due to the naiveté of the ribs.", "Date": "2011-04-03", "Author_Location": "Chesterfield, MO"}, {"Author": "amy c.", "ReviewID": "opVC_82LKH-3hW7u5Fv2pg", "Overall": "1.0", "Content": "after being seated, the waiter brought our waters and slammed them down, never to be seen again. we waited for 15 minutes for someone to take our order and then gave up. WTF? This is the kind of horrible service that made me stop coming here several years ago... i guess it'll be another few years,, if we ever come back at all.", "Date": "2011-04-17", "Author_Location": "St Louis, MO"}, {"Author": "Kylah F.", "ReviewID": "aqtKgCx4Ft0YPzSHIKwxyg", "Overall": "2.0", "Content": "Brunch here was a little underwhelming this past weekend.  I ordered the Wild Thing with egg whites and the eggs were so runny there was just a pile of water which really grossed me out.  I didn't complain but you would think that since they were barely touched they would have realized.", "Date": "2011-07-05", "Author_Location": "Saint Louis, MO"}, {"Author": "Ellen B.", "ReviewID": "wc3bmm_HdHgQEYHMHLNqig", "Overall": "2.0", "Content": "Great location.  Comfy interior and nice patio.  The food was okay. Beautiful presentation. The service was not.  We waited a while for a waitress to even come to the table.  Then we had to wait for our drink refills. Then we had to wait about 15 minutes for our check.  The food was good, but a bit pricey for what you get. I will probably go back......but only if a friend wanted to. Not on my own.", "Date": "2010-07-13", "Author_Location": "Saint Louis, MO"}, {"Author": "Rob C.", "ReviewID": "OEAkGS8gKF3DeQETbJiIOQ", "Overall": "3.0", "Content": "Went for dinner before.  Liked Liluma better.  Known as a brunch place, but haven't gone.", "Date": "2007-09-14", "Author_Location": "Palo Alto, CA"}, {"Author": "Tim V.", "ReviewID": "KLg5CxezT3h5XS-x-i82OQ", "Overall": "4.0", "Content": "Good food and very friendly and efficient staff.", "Date": "2013-01-21", "Author_Location": "Saint Louis, MO"}, {"Author": "Jeremy B.", "ReviewID": "egUyAb6ZxYH8t4bG7eTL8w", "Overall": "5.0", "Content": "This is my fiancées favorite restaurant and they never disappoint!!! We came in tonight and I had the salmon and it was AMAZING!!!! The staff will go above and beyond to give you what you want. We will always come back here.", "Date": "2013-10-03", "Author_Location": "Fenton, MO"}, {"Author": "Brent J.", "ReviewID": "-ij0-hCm5dFXd-V-hADdbg", "Overall": "2.0", "Content": "I haven't eaten there, but I've visited the bar multiple times.  Good cocktails, but be prepared for attitude and dismissal from the bartender, even when the place is slow.", "Date": "2009-12-02", "Author_Location": "Saint Louis, MO"}, {"Author": "Paul L.", "ReviewID": "RQMYpK54BoT1P4RpIQy1WA", "Overall": "3.0", "Content": "Used to love this place, looking forward to a new menu for Spring.  Garlic chicken and golden chevre salad are great, fried chicken is not (over priced, just ok flavor).  Really hoping they bring back the prosciutto wrapped figs. Also, they are not known for it, but their brunch on Saturday and Sundays is amazing, try out the Maryland Benedict or the Country Style Benedict.  Also great patio for margaritas and sangria.", "Date": "2011-03-27", "Author_Location": "Santa Clara, CA"}, {"Author": "T G.", "ReviewID": "BERDet1HI6F1WLXWHQmcsw", "Overall": "4.0", "Content": "Went for dinner. Got a table on patio at 7 pm with no wait. Food was delicious, patio seating great, service a bit slow but acceptable.  I had cognac chicken which was delicious but my gf had the bison hanger steak which was even better. I'm getting that steak next time.  I noticed on the menu that it says free refills only on regular coffee and iced tea which I thought was really weird. May want to ask about that if you order soft drinks which I didn't.  So I can't verify that they charge you for each glass, but that's the way it reads on the menu.  I love this block in the cwe; it always seems more relaxing and less crowded than Maryland plaza.", "Date": "2011-06-10", "Author_Location": "Saint Louis, MO"}, {"Author": "Alexander C.", "ReviewID": "QoTdUvf6YtdCyAE6e8XboA", "Overall": "3.0", "Content": "The ambiance is very nice.  We arrived at 10am Sunday for brunch and were greeted friendly.  The service was polite.  We ordered the pancakes for the kids while my wife ordered the day's special pancakes.  I ordered the Eggs Benedict.  We all agreed the food was better than good, not spectacular.  By the time we finished, the place was packed.  I would return during my next visit to St. Louis.", "Date": "2012-04-01", "Author_Location": "Wheaton, IL"}, {"Author": "Heather M.", "ReviewID": "EnFYpoQZVMXUv-0lPtfQAg", "Overall": "5.0", "Content": "Food was great - in love with the Mac N Cheese. Staff is very friendly and make amazing drinks.", "Date": "2012-11-03", "Author_Location": "Soulard, Saint Louis, MO"}, {"Author": "Seth C.", "ReviewID": "kygQfeSC2YjDUlaVhLNdCQ", "Overall": "4.0", "Content": "I've been going to Wild Flower for years.  It's a nice quiet place to have meetings.  It's very near WashU.  It has lovely outdoor seating. The food is consistently good.  The wines are carefully and well chosen.  The reason we avoid it  on occasion (and it doesn't get 5-stars) is there is no wi-fi.  I've mentioned it to the manger, and I never got the sense they really understand what wi-fi is or what its role is with the university population.", "Date": "2011-04-11", "Author_Location": "Saint Charles, MO"}, {"Author": "Shannon M.", "ReviewID": "588nWAnivKMv_HpR87DEOg", "Overall": "4.0", "Content": "Only been there once but I really liked Wildflower. First of all, they are open on Sundays after church. It was a great place to go with girlfriends to chat over mimosas. Our meals were very good, and they had healthy options. The service and drinks were good. It is pricey but I found it to be deserving of its reputation for being pretty good, unlike many other places I have tried. Excellent for date nights, or getting together with girlfriends or bringing guests from out of town.", "Date": "2012-04-29", "Author_Location": "Saint Louis, MO"}, {"Author": "Sarah D.", "ReviewID": "WK93CrTyT17r1aR_yPao6g", "Overall": "4.0", "Content": "I'm always on the hunt for a great brunch spot with outdoor seating.  I think Wild Flower lands at the top of the list.  They have a great patio where you can soak up the sun and watch the CWE foot traffic.  The inside of the restaurant appeared to be on the small side, but it has an elegant \"antique\" vibe.  The service was fair.  Nothing above and beyond, but definitely not lacking.  I had the Maryland Benedict, which was excellent.  Crab cakes, poached egg, hollandaise sauce...how can it not be delicious when you have all that going on?  Once these 'swamp ass' summer days pass, I will be back to try more of their menu.", "Date": "2012-08-23", "Author_Location": "St Louis, MO"}, {"Author": "Matt T.", "ReviewID": "TZKWggDnjZgD8nfPcp8-ng", "Overall": "3.0", "Content": "Maybe I just didn't want to be here, not sure. Service was pleasant, food was just okay. What really bummed me out was the fact that it was so loud, that I heard less than half of the conversation coming from across the table. This is what you get when you have no carpet or drapes in your restaurant folks. No ambient music either. Really took away from my overall experience to be honest.  My tuna was cooked nicely, but the plate lacked any memorable flavor. My wife had a pasta dish that was forgettable as well. Too many untried places in this great city to go back to a \"meh\" one.", "Date": "2012-07-02", "Author_Location": "Des Peres, MO"}, {"Author": "Skye H.", "ReviewID": "9GRuZdMTC-hADhclzCQOQw", "Overall": "5.0", "Content": "What an amazing dinner! I've always visited Wild Flower to have a drink or two but this time, a group of 20 of us came for dinner to celebrate one of our friend's birthday. Our server Sammy was awesome! Greeted us with his kind smiles and described the specials so well it made our mouths water. Even though we came in a BIG group, our food came out in perfect timing. We didn't wait long at all. Maybe it seemed that way because we were enjoying their delicious bottles of wine & drinks. The shrimp and grits were AMAZING!!! Great flavors and the shrimps were super juicy! I got the rib eye and it came perfectly cooked at medium rare and was perfectly seasoned. You know when a restaurant serves amazing food when you are sitting in a group of 20 and no one is talking because everyone is shoving food in their face. Everyone was also bragging about how good their dish was and shared bites with each other telling each other that they HAVE to try their dish. Every dish that I had tasted were phenomenal! Everyone's plate was taken away with nothing on them besides a lemon wedge or a bone. I would recommend this place to everyone and anyone. The menu is a little pricey but for all the amazing drinks, service & food... it was TOTALLY WORTH IT!!! :)", "Date": "2013-08-14", "Author_Location": "Chesterfield, MO"}, {"Author": "Raleigh Y.", "ReviewID": "JBuyLpkgERHnMKbN60TYkA", "Overall": "2.0", "Content": "Seriously over rated. Our dinner was not at all good. The vegetables were over cooked, the pasta under seasoned, and the salmon left me feeling sick. Beware.", "Date": "2013-08-25", "Author_Location": "Saint Louis, MO"}, {"Author": "Richard H.", "ReviewID": "r7zmzHug67_qqasLoCARMg", "Overall": "4.0", "Content": "We went to lunch there last week 9/25/12 and ordered the Phil Burger, the Golden Chevre salad and the one of the cheese pizzas (can't remember the name).  Overall, the bordelaise sauce on the Phil Burger is delicious.  A savory complex sauce to compliment the mushrooms and the perfectly cooked burger.  The charring about the edges of the burger gives a nice flavor.  The Golden Chevre with it's Strawberry Poppyseed dressing is light and refreshing.  A fresh and tasty salad.  We sat outside so we got to watch the \"wild life\" walking and/or driving by.   Overall, I would come back here.  There are many many good eateries in the CWE so the competition would have to be fierce.  This is a competitor", "Date": "2012-10-01", "Author_Location": "Saint Louis, MO"}, {"Author": "John C.", "ReviewID": "B2mIyHLHFdWGuPzWkbCNrA", "Overall": "2.0", "Content": "There are better options for Sunday Brunch!", "Date": "2012-01-29", "Author_Location": "Saint Louis, MO"}, {"Author": "Oscar V.", "ReviewID": "cxJqNrDN1JuUkv4xY3g0Bw", "Overall": "2.0", "Content": "While on business in STL I decided to try this place for Sunday brunch. I should say I wasn't too impressed. Food was decent, but the overall experience was not good. Other reviews comment on this issue stating that service is \"slow\". I believe this is an understatement. It took them 35 minutes to bring an order of two (regular) pancakes and an additional 15 to bring the check. They might have a very small kitchen or they were just having a bad day. I'm not sure. But given that they have a limited assortment of dished they offer, this should not be an issue. Definitely would not repeat.", "Date": "2013-07-29", "Author_Location": "Los Angeles, CA"}, {"Author": "Elizabeth C.", "ReviewID": "HpLj-7KUyivU5Gummd76Og", "Overall": "3.0", "Content": "I love the patio and ambiance, and I really want to like Wild Flower, but every experience has been just ok. We stopped in this weekend for Sunday brunch. In general, the food was pretty good - I had the country pancakes, which are pancakes with sausage and bacon baked in and topped with bacon. A terrific idea! Unfortunately, the pancakes are just not good. They seem to have been made by an amateur - dense, rather dry, strangely-colored. Another in our party ordered a single pancake, and it never should have left the kitchen. The rest of the food (biscuits and gravy and breakfast wrap) was good, and overall made experience passable, but it was not good enough to warrant a return visit.", "Date": "2012-01-10", "Author_Location": "Saint Louis, MO"}, {"Author": "Rachita B.", "ReviewID": "_IgRMpcADqLayly-5V87DA", "Overall": "3.0", "Content": "I liked the chocolate cake and my friend liked her poached pear dessert too. The Greek salad was small and definitely a starter - not a meal. I was still hungry! The vegetables were marinated so kind of soggy. It was a little gross! It tasted okay, but I know I can make something better on my own. I liked the atmosphere and the service was pleasant too. I just wish they'd improve the food quality and presentation a bit. Also, the restaurant smelled of Lysol. Nice to know its clean but not the best smell when you're eating!", "Date": "2013-04-27", "Author_Location": "Edison, NJ"}, {"Author": "Andrew K.", "ReviewID": "5jLzU1X9sRWOUhdBfJFuvQ", "Overall": "2.0", "Content": "Located in the Central West End, and charging the prices they do because of that, one would expect more. We sat outside for lunch and the tables which were one vibrant and colorful, looked woefully overdue for fresh paint. The menu looked good, but the dish I ordered, a capellini with spinach and capers in a parmesan and romano cream sauce for about $10 was a bit of a let down. The serving was small, even for lunch portions, (especially in relation to the price) and I know that it's not easy to cook thin noodles, but they were pretty mushy. Although tasty, it just wasn't up to St. Louis standards for Italian foods, plus the spinach and capers did an excellent job of hiding from my probing fork, when, for the money, they should have been out and about, mingling with the pasta. Unfortunately, the service was equally as shy, exhibiting a sluggish indifference. I was definitely disappointed as I recall enjoying this place several years ago. The beer selection was decent, but the server had to be prodded to provide specifics. For instance he said they had an IPA on tap and I had to inquire as to the brewery, which he was able to name.", "Date": "2010-11-15", "Author_Location": "St Louis, MO"}, {"Author": "Deanna C.", "ReviewID": "EvWaH5wL4ROGzjm123_LzA", "Overall": "5.0", "Content": "We got the grass fed organic beef special of the night and it was FANTASTIC. Great food and great service. What else can you ask for?", "Date": "2013-03-03", "Author_Location": "Dardenne Prairie, MO"}, {"Author": "Christina O.", "ReviewID": "-EzP0Wa6aHOXrRvJ1yoIMw", "Overall": "4.0", "Content": "wow i can't believe the negative reviews! i've only had positive experiences here. it's such a charming restaurant by day and fun hang out spot by night. i had brunch here on sunday with a friend from out of town-no need for reservations. the wild thing scramble was delicious and the bloody mary has a perfect amount of punch/spice to get your day going. on a separate occasion, i had the wild orchid margarita. it was a must-try for me being the orchid fanatic that i am. i loved it, but my friend did not. it boils down to whether you like a unique more sour/sweet-tasting drink as opposed to the same old same old cranberry vodkas. try something different!", "Date": "2012-10-16", "Author_Location": "Saint Louis, MO"}, {"Author": "Whit N.", "ReviewID": "iQ-wuPSg7igbWBbeoMMR6A", "Overall": "1.0", "Content": "Not great service, hard to get your waiters attention. Our toast came out stale and just not a great experience overall.", "Date": "2012-06-03", "Author_Location": "Chicago, IL"}, {"Author": "Jonathan D.", "ReviewID": "78zWJka0Jd6PBLNQDaQkCg", "Overall": "3.0", "Content": "This restaurant certainly fills a role in the CWE.  It has a lively patio, an active bar scene, and a diverse menu with not horribly unreasonable prices given the quality.  Unfortunately, the service could always be better.  Even if you are with friends, a routine wait of 45 minutes for the first course gets tiring.", "Date": "2011-09-07", "Author_Location": "Saint Louis, MO"}, {"Author": "Erin P.", "ReviewID": "E5DKquVReJGvCbeknFfCtw", "Overall": "2.0", "Content": "I ate here with my bf last Sunday for an early dinner after a day spent in Forest Park. We stumbled across Wild Flower and decided to give it a chance. The patio seating was nice, with the exception of a loud group of 15 sitting next to us smoking. I guess it comes with the territory. We ordered the Goat Cheese Fondue for $11. Not worth the price. The cheese was mediocre and it was paired with raw celery sticks, carrot sticks, and a couple of pieces of bread. Up next: the main course. I wasn't too hungry so I figured I would order a fresh salad - the Antipasto salad with mozarella cheese, tomatoes and olives (I think). The salad was enough to feed a small rabbit for $7 and some change. My bf was famished and ordered some sort of roasted chicken dish with mashed potatoes in a pastry. Keeping with the trend, this was not enough to even make a dent in his hunger for $17. The salad and the chicken were good, but not worth the money. I spent about $50 and had to go get ice cream afterwards. I'm all about making our portions in America smaller, but that also means the price should come down!", "Date": "2010-04-16", "Author_Location": "Denver, CO"}, {"Author": "Jake H.", "ReviewID": "YBPBk7IiPkLje4c0HtuNdA", "Overall": "3.0", "Content": "Great for a summer meal on the patio. I would avoid spending much time inside and think the brunch is only so-so.", "Date": "2009-12-03", "Author_Location": "Saint Louis, MO"}, {"Author": "Madonna M.", "ReviewID": "t_9R2TOyt55alvp_AgVRVg", "Overall": "4.0", "Content": "This is such a great place to come to during the week for a quite date. I've been here with my partner many times, and the weekends are a bit too crazy for my taste. The food is excellent, accompanied by friendly staff. One critique would be that our waitress the passed few times was not that familiar with some of the items on the menu, which is always a strange moment when dining in a restaurant that is somewhat pricy.", "Date": "2010-08-12", "Author_Location": "Saint Louis, MO"}, {"Author": "Danielle W.", "ReviewID": "dzB-UCa6ISk0N_1VwzTt4w", "Overall": "3.0", "Content": "Meh- is really all I can say about Wild Flower's brunch.  I have heard dinner at Wild Flower is to die for, however I was unimpressed with their brunch.  Brunch is probably my favorite weekend meal and a good omelet is really all I ask for to be happy.  I ordered the brie, omelet with mushrooms and asparagus (I believe) in it.  The potatoes that came on the side were delicious, but I wanted my eggs to be divine. They were less then divine.  There was too much brie in my eggs, even though I love  copious amounts of cheese in general, in my eggs in something that needs to be closer to perfection... The coffee was yummy, but I can find coffee anywhere that is decent.  My friend had the pancakes, poached egg a top the crab cake, and fresh fruit special, which looked better then my dish.  She said everything was yummy.  I will feel better about my review after I eat dinner at Wild Flower, which is apparently great. So until then, I feel brunch elsewhere is definitely better :)", "Date": "2010-07-20", "Author_Location": "Saint Louis, MO"}, {"Author": "J M.", "ReviewID": "AxuD9y9jvY3a3DT1grQWrg", "Overall": "5.0", "Content": "Fantastic for brunch!", "Date": "2010-12-28", "Author_Location": "St Louis, MO"}, {"Author": "SillyMango P.", "ReviewID": "BGSlaMsDHP8XXG69J9krmw", "Overall": "4.0", "Content": "Went here for a Friday dinner.  Service was great and friendly.  The goat buster is delicious mainly because that goat cheese is so creamy and flavorful.  it definitely is not overbearing.  My husband usually does not enjoy goat cheese, but he loved this starter.  Another winner is the Golden Chevre salad, which again has this fabulous goat cheese, but this time it is encrusted in delicious panko.  The plays wonderfully with the fresh berries.  My husband had a prime rib which was good, but not great.  It came with green beans and mashed potatoes which seemed a little off.  Difficult to describe why.  I had the \"best filet\" which was cooked perfectly at a medium rare and was so tender and juicy.  My husband and father-in-law loved this dish.  I loved the meat, but something about the black pepper puree turned me off. I think that it might have been an overbearing ginger taste.  This dish came with a great side of au gratin potatoes and asparagus.  My father-in-law had the St. Louis Ribs which I personally thought were great!  Very flavorful and the meat was quiet tender.  The truffled mac&cheese for this was my favorite side, and I would consider ordering this by itself for comfort food some time.  Overall an enjoyable experience.  Would go back, but no burning desire to.", "Date": "2010-07-03", "Author_Location": "Saint Louis, MO"}], "RestaurantInfo": {"RestaurantID": "_NHWb4jNQX_l2rMcnAE12A", "Name": "Wild Flower Restaurant & Catering", "Price": "$$", "RestaurantURL": "/biz/wild-flower-restaurant-and-catering-saint-louis-2", "Longitude": " -90.26151679999999", "Address": "4590 Laclede AveSaint Louis, MO 63108", "Latitude": " 38.640198699999999", "ImgURL": "//s3-media1.fl.yelpcdn.com/bphoto/vydDS-A-P_hZ4Damm3a5AQ/90s.jpg"}}